[
    "[\n  {\n    \"question\": \"What is the name of the conglomerate that has received approvals for a proposed demerger of businesses?\",\n    \"answer\": \"Vedanta Limited\",\n    \"context\": \"Mining conglomerate Vedanta Limited has received approvals from the majority of its creditors for a proposed demerger of businesses marking an important step in the company s plan to split into six independent listed companies.\"\n  },\n  {\n    \"question\": \"What percentage of creditors has approved the demerger of Vedanta Limited?\",\n    \"answer\": \"52 percent\",\n    \"context\": \"I am happy to let all of you know that we have received the 52 per cent plus the additional percentage which is required for us to reach 75 per cent. We have crossed that threshold as well. Most of the lenders have approved it  a senior Vedanta executive said in a recent bondholder conference call.\"\n  },\n  {\n    \"question\": \"Which major creditor has already granted its consent to the demerger of Vedanta Limited?\",\n    \"answer\": \"State Bank of India\",\n    \"context\": \"A major creditor   State Bank of India   had already granted its consent earlier according to a banker aware of the development.\"\n  },\n  {\n    \"question\": \"What is the estimated value of the demerger of Vedanta Limited?\",\n    \"answer\": \"USD 20 billion\",\n    \"context\": \"This crucial approval is seen as the last major compliance requirement for the company which was keenly watched by the market and paves the way for the USD 20 billion demerger.\"\n  },\n  {\n    \"question\": \"What has been the trend in the net debt of Vedanta Limited in recent months?\",\n    \"answer\": \"Decreasing\",\n    \"context\": \"As of March 31 the company s net debt reduced by Rs 6155 crore from December 2023 reaching Rs 56388 crore primarily driven by strong cash flows from operations and working capital release.\"\n  },\n  {\n    \"question\": \"Which credit rating agency has assigned an AA rating to Vedanta Limited's long-term debt instruments?\",\n    \"answer\": \"Crisil\",\n    \"context\": \"Similarly Crisil and India Ratings have assigned longterm ratings of AA and A  and shortterm ratings of A1  and A1 on Vedanta respectively.\"\n  },\n  {\n    \"question\": \"What are some examples of the independent companies that will be created as part of the demerger of Vedanta Limited?\",\n    \"answer\": \"Aluminium, oil and gas, power, steel, ferrous materials, and base metals businesses\",\n    \"context\": \"The demerger will create independent companies housing the aluminium oil   gas power steel and ferrous materials and base metals businesses while the existing zinc and new incubated businesses will remain under Vedanta Limited.\"\n  },\n  {\n    \"question\": \"What are some of the state-owned lenders that are part of Vedanta Limited's consortium of lenders?\",\n    \"answer\": \"State Bank of India, Bank of Baroda, Punjab National Bank, Canara Bank, Indian Overseas Bank, Union Bank of India, and Bank of Maharashtra\",\n    \"context\": \"Vedanta s lenders include stateowned lenders like State Bank of India Bank of Baroda Punjab National Bank Canara Bank Indian Overseas Bank Union Bank of India and Bank of Maharashtra.\"\n  }\n]",
    "[\n  {\n    \"question\": \"What is the strategic colending partnership that Muthoot Microfin has entered into?\",\n    \"answer\": \"Muthoot Microfin has entered into a strategic colending partnership with the State Bank of India (SBI).\",\n    \"context\": \"Muthoot Microfin on Thursday said it has entered into a strategic colending partnership with the State Bank of India (SBI).\"\n  },\n  {\n    \"question\": \"What is the purpose of this colending partnership?\",\n    \"answer\": \"The purpose of this colending partnership is to provide loans to members of Joint Liability Groups (JLGs) who are engaged in agricultural and allied activities as well as other income-generating enterprises.\",\n    \"context\": \"Under the agreement Muthoot Microfin and SBI will colend to members of Joint Liability Groups (JLGs) who are engaged in agricultural and allied activities as well as other incomegenerating enterprises.\"\n  },\n  {\n    \"question\": \"What is the loan amount range under this partnership?\",\n    \"answer\": \"The loan amounts under this partnership will range from a minimum of Rs 10000 to a maximum of Rs 3 lakh.\",\n    \"context\": \"The loan amounts will range from a minimum of Rs 10000 to a maximum of Rs 3 lakh.\"\n  },\n  {\n    \"question\": \"What is Muthoot Microfin's goal with this collaboration?\",\n    \"answer\": \"Muthoot Microfin's goal with this collaboration is to extend its financial services to women entrepreneurs in rural and semi-urban regions across India.\",\n    \"context\": \"With this collaboration Muthoot Microfin Limited aims to extend its financial services to women entrepreneurs in rural and semiurban regions across India the Kochiheadquartered microfinance firm said in a statement.\"\n  },\n  {\n    \"question\": \"How will this partnership benefit Muthoot Microfin's clients?\",\n    \"answer\": \"This partnership will benefit Muthoot Microfin's clients by offering them a wider range of products and services, and by helping them meet the growing demand for their services in a cost-effective manner.\",\n    \"context\": \"With this partnership we will be able to offer wide range of products and services to our clients most importantly it will help us in meeting the growing demand of our women entrepreneur clients in a costeffective manner  Muthoot Microfin CEO Sadaf Sayeed said.\"\n  },\n  {\n    \"question\": \"What is the role of banks under the colending model?\",\n    \"answer\": \"Under the colending model, banks are permitted to colend with all registered NBFCs (including HFCs) on the basis of a prior agreement.\",\n    \"context\": \"Under the colending model banks are permitted to colend with all registered NBFCs (including HFCs) on the basis of a prior agreement.\"\n  },\n  {\n    \"question\": \"What is the difference between HFCs and NBFCs?\",\n    \"answer\": \"HFCs are Housing Finance Companies, which are specialized in providing housing loans, while NBFCs are Non-Banking Financial Companies, which offer a wider range of financial services, including loans, investments, and insurance.\",\n    \"context\": \"Under the colending model banks are permitted to colend with all registered NBFCs (including HFCs) on the basis of a prior agreement.\"\n  },\n  {\n    \"question\": \"What is the significance of this partnership for the financial sector in India?\",\n    \"answer\": \"This partnership is significant because it brings together two major financial institutions to provide financial services to a wider range of borrowers, particularly women entrepreneurs in rural and semi-urban regions, who have traditionally been underserved by the formal financial sector.\",\n    \"context\": \"The partnership between Muthoot Microfin and SBI is significant for the financial sector in India as it brings together two major financial institutions to provide financial services to a wider range of borrowers, particularly women entrepreneurs in rural and semi-urban regions, who have traditionally been underserved by the formal financial sector.\"\n  }\n]",
    "[\n    {\n        \"question\": \"Which Indian listed company has recently surpassed Rs 8 lakh crore market capitalisation?\",\n        \"answer\": \"State Bank of India (SBI)\",\n        \"context\": \"Staterun lender State Bank of India has become the seventh Indian listed company to have surpassed Rs 8 lakh crore market capitalisation.\"\n    },\n    {\n        \"question\": \"What was the record high price of SBI shares on BSE on June 3?\",\n        \"answer\": \"Rs 900.15\",\n        \"context\": \"The shares of SBI hit a fresh record high of Rs 900.15 on BSE on June 3.\"\n    },\n    {\n        \"question\": \"By how much did SBI shares rise on June 3?\",\n        \"answer\": \"8.3 percent\",\n        \"context\": \"... rising as much as 8.3 percent in morning trade...\"\n    },\n    {\n        \"question\": \"What has been the percentage increase in SBI share prices so far this year?\",\n        \"answer\": \"Over 40 percent\",\n        \"context\": \"The share prices have soared over 40 percent so far this year.\"\n    },\n    {\n        \"question\": \"Which other Indian companies have surpassed the Rs 8 Trillion Club milestone?\",\n        \"answer\": \"Reliance Industries, Tata Consultancy Services, HDFC Bank, Bharti Airtel, Infosys, and ICICI Bank\",\n        \"context\": \"The Rs 8 Trillion Club\\nPreviously Reliance Industries Tata Consultancy Services HDFC Bank Bharti Airtel Infosys and ICICI Bank have all attained this milestone.\"\n    },\n    {\n        \"question\": \"What is the predicted RoA and RoE of SBI by FY26?\",\n        \"answer\": \"1.1% and 17%\",\n        \"context\": \"We expect stable NIM at 3% and RoA/RoE of 1.1%/17% by FY26.\",\n    },\n    {\n        \"question\": \"Which sectors are expected to outperform in the near future according to Nomura analysts?\",\n        \"answer\": \"Infrastructure and manufacturing\",\n        \"context\": \"Analysts at Nomura predict that sustained focus on capital expenditure and fiscal consolidation could lead domestic sectors - especially infrastructure and manufacturing - to outperform in the near future.\"\n    },\n    {\n        \"question\": \"What is the key reason behind the rise in SBI shares?\",\n        \"answer\": \"Exit poll cheer and government's growth plans\",\n        \"context\": \"Shares of SBI are rising along with other PSU stocks after exit polls on June 1 indicated a landslide victory for the BJPled NDA. Stocks riding the wave of government s growth plans like those in capital expenditure or public sector units have surged over the past year...\"\n    }\n]",
    "```python\n[\n    {\n        \"question\": \"What restriction has the State Bank of India (SBI) placed on its employees regarding demat and trading accounts?\",\n        \"answer\": \"The State Bank of India (SBI) has instructed its employees to obtain prior permission before opening demat or trading accounts with service providers outside the SBI Group. This directive applies to both the employees and their dependent family members.\",\n        \"context\": \"The country's largest lender, the State Bank of India (SBI), has asked its employees to seek permission before opening demat or trading accounts with service providers outside the group. A breach of the instruction would be treated as gross misconduct and punishable, an internal circular dated May 27 has said.  Mint has reviewed a copy of the circular. 'No officer/award staff shall open their or their wholly dependent family member's demat account and/or trading account outside the State Bank Group without prior permission of his/her controller not below the rank of Chief General Manager,' the circular says.\"\n    },\n    {\n        \"question\": \"What are the consequences for State Bank of India (SBI) employees who violate the directive on opening demat and trading accounts?\",\n        \"answer\": \"State Bank of India (SBI) employees who violate the directive on opening demat and trading accounts without the required permission will face disciplinary action.  The breach is considered gross misconduct and is punishable under SBI's internal rules and regulations, specifically Rule No. 50(1), 50(4), 50(11) read with Rule 66 of SBIOSR for officers.\",\n        \"context\": \"The country's largest lender, the State Bank of India (SBI), has asked its employees to seek permission before opening demat or trading accounts with service providers outside the group. A breach of the instruction would be treated as gross misconduct and punishable, an internal circular dated May 27 has said. 'Breach of these instructions shall be treated as a misconduct punishable amongst others under Rule No. 50(1) 50(4) 50 (11) read with Rule 66 of SBIOSR for officers,' the circular says.\"\n    },\n    {\n        \"question\": \"Which companies are included within the State Bank of India (SBI) Group?\",\n        \"answer\": \"The State Bank of India (SBI) Group encompasses various companies in the financial sector, including SBI Cards, SBI Life, SBI General Insurance, SBI Funds Management, SBI Pension Funds, and SBI Securities (the broking arm of the group).\",\n        \"context\": \"The SBI Group includes companies in the larger financial sector such as SBI Cards, SBI Life, SBI General Insurance, SBI Funds Management, and SBI Pension Funds. SBI Securities is the broking arm of the group.\"\n    },\n    {\n        \"question\": \"What information about demat accounts are State Bank of India (SBI) employees required to provide to their controllers?\",\n        \"answer\": \"The State Bank of India (SBI) mandates its employees to submit their demat account details and those of their dependent family members to their respective controllers for verification.\",\n        \"context\": \"The bank has also asked the employees to submit their details and those of their 'dependent' family members' demat account statements to their controllers for verification.\"\n    },\n    {\n        \"question\": \"What is the deadline given to State Bank of India (SBI) employees to comply with the new demat account regulations?\",\n        \"answer\": \"State Bank of India (SBI) employees have been given a six-month period from the date of the circular's issuance to either obtain de facto permission from their controllers for external demat accounts or close those accounts.\",\n        \"context\": \"The staff must also obtain de-facto permission from their controllers within six months from the date of issue of the instructions or close such accounts during the period.\"\n    },\n    {\n        \"question\": \"What is the legal perspective on the State Bank of India (SBI) imposing restrictions on employees using services outside the SBI Group?\",\n        \"answer\": \"Legal experts argue that while companies like the State Bank of India (SBI) can issue cautions to employees regarding trading during work hours and have policies requiring investment declarations, they cannot outright prohibit employees from utilizing services outside their company or group.\",\n        \"context\": \"And legal experts highlighted that a company cannot impose on its employees to use the services of the employer group. 'Banks and companies may issue caution to employees for trading as it is done during the normal working hours. Since they also have policies under which employees have to make a declaration about their investments, they cannot prohibit using services outside their company or group,' said Mukesh Chand, Senior Legal Counsel - Economic Laws Practice (ELP).\"\n    },\"\n    }\n]\n",
    "[\n    {\n        \"question\": \"Why did FSIB postpone the interview for the SBI Chairman position?\",\n        \"answer\": \"FSIB postponed the interview for the SBI Chairman position just hours before it was scheduled to take place. The exact reason remains unclear, but sources suggest it's linked to the formation of the new government expected after June 4th.\",\n        \"context\": \"The Financial Services Institutions Bureau (FSIB), responsible for selecting directors of state-owned banks and financial institutions, made an unexpected move by deferring the interview for the SBI Chairman position. This postponement occurred mere hours before the scheduled interviews were to begin.  While the specific reasons remain undisclosed, sources indicate that the decision is related to the upcoming formation of a new government anticipated after June 4th.\"\n    },\n    {\n        \"question\": \"When will SBI Chairman Dinesh Khara retire, prompting the need for a replacement?\",\n        \"answer\": \"Dinesh Khara will retire on August 28th upon reaching the age of 63, the upper age limit for the SBI Chairman position.\",\n        \"context\": \"The current SBI Chairman, Dinesh Khara, is set to retire on August 28th when he turns 63. This date marks the upper age limit for holding the position of SBI Chairman, necessitating the search for a suitable replacement.\"\n    },\n    {\n        \"question\": \"Who heads the Financial Services Institutions Bureau (FSIB)?\",\n        \"answer\": \"The FSIB is headed by Bhanu Pratap Sharma, former secretary of the Department of Personnel and Training (DoPT).\",\n        \"context\": \"The Financial Services Institutions Bureau (FSIB) is led by Bhanu Pratap Sharma, who previously served as the secretary of the Department of Personnel and Training (DoPT).\"\n    },\n    {\n        \"question\": \"What role does the Appointments Committee of the Cabinet play in the appointment of the SBI Chairman?\",\n        \"answer\": \"While the FSIB recommends a candidate for the SBI Chairman position, the final decision lies with the Appointments Committee of the Cabinet, headed by Prime Minister Narendra Modi.\",\n        \"context\": \"The process of appointing a new SBI Chairman involves the FSIB recommending a candidate from a pool of serving SBI managing directors. However, the ultimate decision-making power rests with the Appointments Committee of the Cabinet, which is headed by Prime Minister Narendra Modi.\"\n    },\n    {\n        \"question\": \"Besides the FSIB's recommendation, what is the typical selection process for the SBI Chairman?\",\n        \"answer\": \"The SBI Chairman is typically chosen from a pool of serving managing directors within SBI. The FSIB recommends a candidate, and the Appointments Committee of the Cabinet makes the final decision.\",\n        \"context\": \"The selection of the SBI Chairman follows a convention where the candidate pool comprises serving managing directors of SBI. The Financial Services Institutions Bureau (FSIB) then recommends a suitable candidate from this pool. However, the final decision regarding the appointment lies with the Appointments Committee of the Cabinet.\"\n    },\n    {\n        \"question\": \"Who are some of the other members, besides the chairman, on the FSIB panel responsible for selecting the SBI Chairman?\",\n        \"answer\": \"Apart from the chairman, the FSIB panel includes the Financial Services Secretary, Department of Public Enterprises Secretary, an RBI Deputy Governor, Animesh Chauhan (former chairman and MD of Oriental Bank of Commerce), Deepak Singhal (RBI's ex-executive director), and Shailendra Bhandari (former MD of ING Vysya Bank).\",\n        \"context\": \"The FSIB, responsible for recommending the next SBI Chairman, comprises several high-ranking officials. In addition to the chairman, the panel includes key figures like the Financial Services Secretary, Department of Public Enterprises Secretary, and an RBI Deputy Governor.  Furthermore, it boasts experienced individuals from the banking sector: Animesh Chauhan, former chairman and MD of Oriental Bank of Commerce; Deepak Singhal, former executive director of RBI; and Shailendra Bhandari, former MD of ING Vysya Bank.\"\n    },\n    {\n        \"question\": \"When will the new date for the SBI Chairman interview be decided?\",\n        \"answer\": \"The new interview date will be determined after the new government is formed, which is expected after June 4th.\",\n        \"context\": \"Although the FSIB postponed the interview for the SBI Chairman position, they plan to reschedule it. The new date will be fixed after the formation of the new government, an event anticipated to occur after June 4th.\"\n    },\n    {\n        \"question\": \"What is the role of the FSIB in the appointment of the SBI Chairman?\",\n        \"answer\": \"The FSIB is responsible for interviewing candidates and recommending a suitable individual for the position of SBI Chairman.\",\n        \"\"\n    }\n]\n",
    "[\n    {\n        \"question\": \"What is the revised interest rate offered by SBI on retail term deposits of up to Rs 2 crore?\",\n        \"answer\": \"SBI has revised the interest rates on retail term deposits of up to Rs 2 crore to 6.25% for deposits with tenor of 211 days to less than a year and 6.75% for senior citizens, effective from May 15.\",\n        \"context\": \"The Top PSU lender State Bank of India (SBI) has revised the interest rates it offers on retail term deposits of up to Rs 2 crore with effect from May 15. Deposits with tenor of 211 days to less than a year will now offer 6.25 percent interest as against 6 percent earlier while for senior citizens this has been raised higher to 6.75 percent.\"\n    },\n    {\n        \"question\": \"What is the previous interest rate offered by SBI on retail term deposits of up to Rs 2 crore?\",\n        \"answer\": \"The previous interest rate offered by SBI on retail term deposits of up to Rs 2 crore was 6% for deposits with tenor of 211 days to less than a year and 6.5% for senior citizens.\",\n        \"context\": \"The Top PSU lender State Bank of India (SBI) has revised the interest rates it offers on retail term deposits of up to Rs 2 crore with effect from May 15. Deposits with tenor of 211 days to less than a year will now offer 6.25 percent interest as against 6 percent earlier while for senior citizens this has been raised higher to 6.75 percent.\"\n    },\n    {\n        \"question\": \"What is the minimum tenor for retail term deposits covered by the revised interest rates?\",\n        \"answer\": \"The minimum tenor for retail term deposits covered by the revised interest rates is 211 days.\",\n        \"context\": \"Deposits with tenor of 211 days to less than a year will now offer 6.25 percent interest as against 6 percent earlier while for senior citizens this has been raised higher to 6.75 percent.\"\n    },\n    {\n        \"question\": \"What is the maximum tenor for retail term deposits covered by the revised interest rates?\",\n        \"answer\": \"The maximum tenor for retail term deposits covered by the revised interest rates is less than a year.\",\n        \"context\": \"Deposits with tenor of 211 days to less than a year will now offer 6.25 percent interest as against 6 percent earlier while for senior citizens this has been raised higher to 6.75 percent.\"\n    },\n    {\n        \"question\": \"What is the revised interest rate offered by SBI on retail term deposits of up to Rs 2 crore for senior citizens?\",\n        \"answer\": \"The revised interest rate offered by SBI on retail term deposits of up to Rs 2 crore for senior citizens is 6.75%.\",\n        \"context\": \"Deposits with tenor of 211 days to less than a year will now offer 6.25 percent interest as against 6 percent earlier while for senior citizens this has been raised higher to 6.75 percent.\"\n    },\n    {\n        \"question\": \"What is the previous interest rate offered by SBI on retail term deposits of up to Rs 2 crore for senior citizens?\",\n        \"answer\": \"The previous interest rate offered by SBI on retail term deposits of up to Rs 2 crore for senior citizens was 6.5%.\",\n        \"context\": \"The Top PSU lender State Bank of India (SBI) has revised the interest rates it offers on retail term deposits of up to Rs 2 crore with effect from May 15. Deposits with tenor of 211 days to less than a year will now offer 6.25 percent interest as against 6 percent earlier while for senior citizens this has been raised higher to 6.75 percent.\"\n    },\n    {\n        \"question\": \"What is the effective date of the revised interest rates?\",\n        \"answer\": \"The revised interest rates are effective from May 15, 2024.\",\n        \"context\": \"Revision in Interest Rates on Retail Domestic Term Deposits (Below Rs. 2 crore) w.e.f. 15.05.2024 (Source  SBI website)\"\n    },\n    {\n        \"question\": \"Where can I find more information about the revised interest rates?\",\n        \"answer\": \"More information about the revised interest rates can be found on the SBI website.\",\n        \"context\": \"Revision in Interest Rates on Retail Domestic Term Deposits (Below Rs. 2 crore) w.e.f. 15.05.2024 (Source  SBI website)\"\n    }\n]",
    "[\n  {\n    \"question\": \"What do you think about Kotak Institutional Equities' call on State Bank of India?\",\n    \"answer\": \"Kotak Institutional Equities has a 'Buy' call on State Bank of India with a target price of ₹950 per share.\",\n    \"context\": \"Kotak Instl Eq On SBIBuy Call Target Raised To  950 ShReported 25  YoY Earnings Growth Led By Operating Profit Growth   Decline In ProvisionsSteady Loan Growth Stable NIM   Solid Asset Quality Metrics Were Key HighlightsMacro Environment Continues To Be Fairly Stable For LendersShould See Relatively Stable Performance From SBISBI Top Pick Don t See A Sharp Outperformance From Current Levels\"\n  },\n  {\n    \"question\": \"What is the target price set by Citi for State Bank of India?\",\n    \"answer\": \"Citi has set a target price of ₹701 per share for State Bank of India.\",\n    \"context\": \"Citi On SBISell Call Target Raised To  701 ShQ4 PAT Boosted By Few OneoffsQ4 Wage Revision Impact Est   Guided At  54000 Cr Came In Significantly LowerAt Core Level Spike In NonInterest Income   Contained Opex Led To PPoP BeatIT Refund Interest  1300 Cr Supported NII BeatCredit Growth Was Robust At 5  QoQ With Gained Traction In Corp Besides Retail\"\n  },\n  {\n    \"question\": \"What is the key highlight mentioned by Bernstein in their report on State Bank of India?\",\n    \"answer\": \"Bernstein mentioned a multi-quarter high RoA of 1.36% as a key highlight in their report on State Bank of India.\",\n    \"context\": \"Bernstein On SBIMarket Perform Target  780 ShA High RoA   Multiple SurprisesMultiquarter High RoA Of 1.36  As Key Highlight Helping Drive Full Year RoA  1 Rise In NOI Gains   Continuation Of Low Credit Costs Helped Report PAT GrowthNIM Improved Sequentially By 8 bpsIncrease In Yield On Advances Outpacing Rise In Cost Of Deposits\"\n  },\n  {\n    \"question\": \"What is the reason behind HSBC's 'Hold' call on State Bank of India?\",\n    \"answer\": \"HSBC has given a 'Hold' call on State Bank of India due to its premium valuation multiples.\",\n    \"context\": \"HSBC On SBIHold Call Target Raised To  900 ShNIM Improvement Was Led By LDROpex Was Lower Than Guidance Led By Reversals In Pension ProvisionsRevise EPS By 8.1 12.2 8.6  For FY25e 26e 27eUpgrade NIM Outlook   Lower Cost Ratio EstStock Already Trading At Premium Multiples\"\n  },\n  {\n    \"question\": \"What are the key points of Kotak Institutional Equities' downgrade on SRF?\",\n    \"answer\": \"Kotak Institutional Equities has downgraded SRF to 'Add' with a reduced target price of ₹2360 per share due to a significant lag in Q4 performance and a delayed timeline for recovery amid intense China competition.\",\n    \"context\": \"Kotak Instl Eq On SRFDowngrade To Add Target Cut To  2360 ShQ4 Did Improve Significantly QoQ But Lagged ExpectationsTimeline For A Strong Recovery Is Also Pushed Back Amid Intense China CompetitionCut FY202526 EPS By 1418  As Tone Down Expectations Particularly On Margin Front\"\n  },\n  {\n    \"question\": \"What is the target price set by Jefferies for SRF?\",\n    \"answer\": \"Jefferies has set a target price of ₹2085 per share for SRF.\",\n    \"context\": \"Jefferies On SRFUnderperform Call Target  2085 ShMgmt Provided An Optimistic Growth Guidance For Chemicals  Despite A Miss In FY24Refgas Biz Outlook Is Challenged By Lower Exports To The USSee Chinese Competition In RoWMgmt Expects Soft PF Margin In FY25Cut FY24 25 PAT Est By 6  3 Valn Doesn t Adequately Discount The Protracted Downcycle In Key Chemicals Segment\"\n  },\n  {\n    \"question\": \"What is the reason behind Morgan Stanley's 'Overweight' call on SRF?\",\n    \"answer\": \"Morgan Stanley has given an 'Overweight' call on SRF due to the company's efforts to address concerns around demand and margins in its verticals.\",\n    \"context\": \"MS On SRFOverweight Call Target  2555 ShSRF Addressed Concerns Around Demand   Margins In Its VerticalsCo Pointed To A Gradual Improvement Over Course Of FY25Ops Leverage From Previous InvestmentsGradual Greenshoots In Pricing Will Be Key To Support 20  Growth In Its Chem Segment\"\n  },\n  {\n    \"question\": \"What is the expected growth rate for SRF's chemical business as per MOSL?\",\n    \"answer\": \"MOSL expects SRF's chemical business to witness a growth rate of 20% in FY25.\",\n    \"context\": \"MOSL On SRFNeutral Target  2100 ShChemical Business Expected To Witness 20  Growth In FY25Significant Growth Expected In H2FY25Positive Operating Leverage Can Lead To Margin Expansion In FY25Expects Packaging Business Margin To Remain Under PressureManagement Plans To Incur A Total Capex Of 2200 Cr In FY25\"\n  }\n]",
    "[\n  {\n    \"question\": \"How many new employees is the State Bank of India planning to hire?\",\n    \"answer\": \"Approximately 12,000.\",\n    \"context\": \"State Bank of India (SBI) country s largest lender is in the process of hiring around 12000 employees for information technology (IT) and other roles Chairman Dinesh Khara said on May 9.\"\n  },\n  {\n    \"question\": \"What types of roles will the new hires be filling?\",\n    \"answer\": \"Information technology (IT) and other roles.\",\n    \"context\": \"State Bank of India (SBI) country s largest lender is in the process of hiring around 12000 employees for information technology (IT) and other roles Chairman Dinesh Khara said on May 9.\"\n  },\n  {\n    \"question\": \"What percentage of SBI's associate level and officer level employees are engineers?\",\n    \"answer\": \"Approximately 85%.\",\n    \"context\": \"Around 11000 to 12000 employees are in the hiring process. These are general employees but we actually are having a system where at our associate level and officers  level around 85 percent of them are engineers.\"\n  },\n  {\n    \"question\": \"What is SBI's total employee count as of March 2024?\",\n    \"answer\": \"232,296.\",\n    \"context\": \"For the financial year ended March 2024 the bank had a total employee count of 232296 falling from 235858 in FY23.\"\n  },\n  {\n    \"question\": \"What was SBI's net profit growth for the quarter ending March 31, 2024?\",\n    \"answer\": \"24%.\",\n    \"context\": \"The bank on May 9 reported 24 percent rise in net profit at Rs 20698 crore for the quarter ended March 31 2024 aided by strong loan demand.\"\n  },\n  {\n    \"question\": \"What was SBI's interest earned growth for the quarter ending March 31, 2024?\",\n    \"answer\": \"19%.\",\n    \"context\": \"SBI s interest earned grew 19 percent to Rs 1.11 lakh crore in the reported quarter as against Rs 92951 crore a year ago.\"\n  },\n  {\n    \"question\": \"What is SBI's current GNPA?\",\n    \"answer\": \"2.24%.\",\n    \"context\": \"The gross nonperforming asset (GNPA) of SBI came in at 2.24 percent as against 2.78 percent last year.\"\n  },\n  {\n    \"question\": \"What is SBI's current net NPA?\",\n    \"answer\": \"0.57%.\",\n    \"context\": \"The bank s net NPA came in at 0.57 percent compared to 0.67 percent last year.\"\n  }\n]",
    "```python\n[\n    {\n        \"question\": \"How did State Bank of India's (SBI) net profit perform in the March 2024 quarter?\",\n        \"answer\": \"SBI's net profit surged by 24% to reach Rs 20,698 crore in the quarter ended March 31, 2024, compared to the same period last year.\",\n        \"context\": \"State Bank of India (SBI), the country's largest lender, on May 9 reported a 24 percent rise in net profit at Rs 20,698 crore for the quarter ended March 31, 2024, aided by strong loan demand. SBI reported net profit of Rs 16,695 crore in the year-ago period. The profit surpassed estimates of Rs 13,400 crore by analysts.\"\n    },\n    {\n        \"question\": \"What was the driving force behind State Bank of India's (SBI) profit growth in the recent quarter?\",\n        \"answer\": \"The key driver of SBI's profit growth was strong loan demand, which contributed to a 19% increase in interest earned, reaching Rs 1.11 lakh crore in the March 2024 quarter.\",\n        \"context\": \"SBI's interest earned grew 19 percent to Rs 1.11 lakh crore in the reported quarter as against Rs 92,951 crore a year ago.\"\n    },\n    {\n        \"question\": \"Did State Bank of India (SBI) announce any dividend for FY24, and what was the bank's closing share price on May 9?\",\n        \"answer\": \"SBI declared a dividend of Rs 13.70 per share for FY24, and the bank's shares closed at Rs 819.65 on May 9, reflecting a 1.14% increase.\",\n        \"context\": \"The public lender declared a dividend of Rs 13.70 per share for FY24. The share of the bank closed for trading on May 9 at Rs 819.65, up 1.14 percent.\"\n    },\n    {\n        \"question\": \"How did State Bank of India's (SBI) asset quality change in the March 2024 quarter?\",\n        \"answer\": \"SBI witnessed an improvement in asset quality, with gross non-performing assets (GNPA) declining to 2.24% from 2.78% in the previous year, reaching the lowest point in a decade.\",\n        \"context\": \"The bank's asset quality improved in the March quarter. The gross non-performing asset (GNPA) of SBI came in at 2.24 percent as against 2.78 percent last year, while net NPA came in at 0.57 percent compared to 0.67 percent last year. At the post-results press conference, Dinesh Khara, Chairman, SBI, said that the GNPA is the lowest in 10 years at 2.24 percent.\"\n    },\n    {\n        \"question\": \"What was the trend of loan growth for State Bank of India (SBI) in the March quarter, and what are the growth expectations for FY25?\",\n        \"answer\": \"SBI recorded robust loan growth in the March quarter, the best in over eight quarters, and expects to sustain a similar credit growth trajectory of 15-16% in FY25.\",\n        \"context\": \"SBI loan growth remained strong in the March quarter, and it clocked one of the best growth in over eight quarters. Here Khara said,  'Credit growth has been robust across all segments. RAM crossed Rs 20 trillion in FY24. Corporate segment healthy growth at 16 percent year-on-year growth.' In FY25, Khara said that the lender would be able to sustain a similar credit growth. 'We will be able to maintain a credit growth trajectory of 15-16 percent that we had in FY24. Deposit growth would be around 13-14 percent,' said Khara.\"\n    },\n    {\n        \"question\": \"What were the notable highlights of State Bank of India's (SBI) financial performance in Q4 FY24, as per the stock exchange filing?\",\n        \"answer\": \"SBI's stock exchange filing highlighted a 15.24% YoY credit growth, with domestic advances growing by 16.26% YoY. Corporate and agri advances crossed Rs 11 lakh crore and Rs 3 lakh crore, respectively.\",\n        \"context\"\n    }\n]\n",
    "```python\n[\n    {\n        \"question\": \"What is the total amount of funding secured by TCG Real Estate for its World Trade Centre project in Gurugram, and from whom?\",\n        \"answer\": \"TCG Real Estate has secured funding of Rs 714 crore from State Bank of India (SBI) for its World Trade Centre project in Gurugram.\",\n        \"context\": \"Real estate developer TCG Real Estate has secured a funding of Rs 714 crore from State Bank of India (SBI) for its World Trade Centre project in Gurugram according to documents accessed by CRE Matrix a real estate data analytics firm.The company is developing a business park  World Trade Centre  off NH8 Sohna Road in Gurugram.\"\n    },\n    {\n        \"question\": \"What is the purpose of the funding obtained by TCG Real Estate from SBI?\",\n        \"answer\": \"The funds secured by TCG Real Estate from SBI will be utilized towards the development of the World Trade Centre project in Gurugram.\",\n        \"context\": \"The company is developing a business park  World Trade Centre  off NH8 Sohna Road in Gurugram. The project envisages development of 1 million square foot of leasable area. These funds will be utilised towards the development of World Trade Centre in Gurugram.\"\n    },\n    {\n        \"question\": \"What is the loan tenure and interest rate for the funding provided by SBI to TCG Real Estate?\",\n        \"answer\": \"SBI has provided a loan to TCG Real Estate for a tenure of 72 months (6 years) at an annual interest rate of 9.6 percent.\",\n        \"context\": \"According to the documents the funding of Rs 714 crore is secured in the form of a loan from SBI for a tenure of 72 months or six years. The annual rate of interest payable is 9.6 percent.\"\n    },\n    {\n        \"question\": \"Which entity received the loan of Rs 714 crore from SBI for the World Trade Centre project, and what is its connection to TCG Real Estate?\",\n        \"answer\": \"The loan of Rs 714 crore from SBI was secured by Energetic Construction Private Limited. TCG Urban Infrastructure Holding Pvt. Ltd., the promoter of Energetic Construction Pvt. Ltd., is connected to TCG Real Estate.\",\n        \"context\": \"Documents showed that the Energetic Construction Private Limited has secured a loan of Rs 714 crore from SBI for the World Trade Centre project in Gurugram. TCG Urban Infrastructure Holding Pvt. Ltd. is the promoter of Energetic Construction Pvt. Ltd.\"\n    },\n    {\n        \"question\": \"What is the total leasable area of the TCG Real Estate World Trade Centre project, and what is its composition?\",\n        \"answer\": \"The World Trade Centre project by TCG Real Estate encompasses a total leasable area of 1,013,168 square feet, comprising an office block and a retail block spread across four towers.\",\n        \"context\": \"Spreading over a land of 7.94 acres the World Trade Centre in Gurugram comprises of a total leasable area of 1013168 square feet consisting of office block and retail block in the form of four towers.\"\n    },\n    {\n        \"question\": \"What are the leasable areas of the office and retail blocks in the TCG Real Estate World Trade Centre project?\",\n        \"answer\": \"The office block in TCG Real Estate's World Trade Centre project will have a leasable area of 9.4 lakh square feet, while the retail block will offer 72,407 square feet of leasable space.\",\n        \"context\": \"The office block will have a leasable area of 9.4 lakh sqft while the retail block will have 72407 sqft leasable space. The scheduled commercial operation date is October 2027. The estimated cost of the project is Rs 1211.86 crore the documents showed.\"\n    },\n    {\n        \"question\": \"What is the estimated cost of TCG Real Estate's World Trade Centre project, and what is the projected commercial operation date?\",\n        \"answer\": \"The estimated cost of TCG Real Estate's World Trade Centre project is Rs 1211.86 crore, and the scheduled commercial operation date is October 2027.\",\n        \"context\": \"The office block will have a leasable area of 9.4 lakh sqft while the retail block will have 72407 sqft leasable space. The scheduled commercial operation date is October 2027. The estimated cost of the project is Rs 1211.86 crore the documents showed.\"\n    },\n    {\n        \"question\": \"What are the construction and moratorium periods for\"\n    }\n]\n",
    "```\n[\n  {\n    \"question\": \"Which company has partnered with the State Bank of India for digital transformation?\",\n    \"answer\": \"HCLSoftware\",\n    \"context\": \"The country's largest lender, the State Bank of India, on April 26 partnered with HCLSoftware, the software business unit of HCLTech, for the bank's digital transformation.\"\n  },\n  {\n    \"question\": \"What is the duration of the agreement between SBI and HCLSoftware?\",\n    \"answer\": \"Five years\",\n    \"context\": \"As part of the five-year agreement, HCLSoftware will deploy the HCL Unica platform to enable SBI to digitally transform its customer interaction framework and provide hyperpersonalized communication across the bank's diverse digital marketing channels.\"\n  },\n  {\n    \"question\": \"What is the purpose of deploying the HCL Unica platform?\",\n    \"answer\": \"To digitally transform SBI's customer interaction framework and provide hyperpersonalized communication.\",\n    \"context\": \"As part of the five-year agreement, HCLSoftware will deploy the HCL Unica platform to enable SBI to digitally transform its customer interaction framework and provide hyperpersonalized communication across the bank's diverse digital marketing channels.\"\n  },\n  {\n    \"question\": \"What are some of the capabilities of the HCL Unica platform?\",\n    \"answer\": \"Advanced Customer Data Platform AI capabilities and comprehensive campaign management tools.\",\n    \"context\": \"HCL Unica with its advanced Customer Data Platform AI capabilities and comprehensive campaign management tools would leverage real-time data to significantly improve SBI's ability to engage with its customers.\"\n  },\n  {\n    \"question\": \"How will the HCL Unica platform help SBI improve customer engagement?\",\n    \"answer\": \"By leveraging real-time data to provide hyperpersonalized communication and facilitate complex multichannel digital marketing campaigns.\",\n    \"context\": \"HCL Unica with its advanced Customer Data Platform AI capabilities and comprehensive campaign management tools would leverage real-time data to significantly improve SBI's ability to engage with its customers.  It will help facilitate complex multichannel digital marketing campaigns enhancing customer engagement precision and relevance.\"\n  },\n  {\n    \"question\": \"What are some of the key performance indicators for SBI's digital transformation journey?\",\n    \"answer\": \"Number of YONO users, logins per day, and assets under management.\",\n    \"context\": \"Of our 480 million customers, 70 million are on the YONO (platform). We have 10 million logins per day and Rs 1 trillion in assets. Ninety-seven per cent of the bank's transactions are now non-branch.\"\n  },\n  {\n    \"question\": \"What is the target launch date for SBI's YONO 2.0?\",\n    \"answer\": \"Nine months from October 2023.\",\n    \"context\": \"The lender's chairman, Dinesh Khara, in an event in Mumbai in October 2023 said that the lender will launch the You Only Need One (YONO) 2.0 in nine months.\"\n  },\n  {\n    \"question\": \"What is the current percentage of non-branch transactions at SBI?\",\n    \"answer\": \"Ninety-seven percent.\",\n    \"context\": \"Ninety-seven per cent of the bank's transactions are now non-branch.\"\n  }\n]\n```\"\n    }\n]\n",
    "```python\n[\n    {\n        \"question\": \"Who did the Financial Services Institutions Bureau (FSIB) recommend for the Managing Director position at State Bank of India (SBI)?\",\n        \"answer\": \"The FSIB recommended Rana Ashutosh Kumar Singh for the position of Managing Director at State Bank of India (SBI).\",\n        \"context\": \"The Financial Services Institutions Bureau (FSIB) conducted interviews on April 23rd and 24th to fill the Managing Director position at the State Bank of India (SBI). They interviewed a total of 16 candidates.  After evaluating each candidate's performance, experience, and other relevant factors, the FSIB recommended Rana Ashutosh Kumar Singh for the position.\"\n    },\n    {\n        \"question\": \"What position did the FSIB recommend Asheesh Pandey for?\",\n        \"answer\": \"Asheesh Pandey was recommended for the position of MD & CEO of Indian Bank.\",\n        \"context\": \"In addition to recommending a candidate for the Managing Director role at SBI, the FSIB also considered candidates for other leadership positions in the banking sector.  The bureau recommended Asheesh Pandey for the position of MD & CEO of Indian Bank. \"\n    },\n    {\n        \"question\": \"How many candidates were interviewed by the FSIB for the Managing Director position at State Bank of India?\",\n        \"answer\": \"The FSIB interviewed a total of 16 candidates for the Managing Director position at State Bank of India.\",\n        \"context\": \"The selection process for the Managing Director position at State Bank of India (SBI) involved interviews conducted by the Financial Services Institutions Bureau (FSIB).  Over two days, April 23rd and 24th, the FSIB interviewed a total of 16 candidates who were vying for the position. \"\n    },\n    {\n        \"question\": \"When did the FSIB make its recommendations for the Managing Director of State Bank of India and MD & CEO of Indian Bank?\",\n        \"answer\": \"The FSIB announced its recommendations on April 24th.\",\n        \"context\": \"Following the interviews conducted on April 23rd and 24th, the FSIB promptly reviewed the candidates' qualifications and performance.  On April 24th, the bureau publicly announced its recommendations for the Managing Director position at State Bank of India, naming Rana Ashutosh Kumar Singh as their choice, and also recommending Asheesh Pandey for the position of MD & CEO at Indian Bank.\"\n    },\n    {\n        \"question\": \"What factors did the FSIB consider when making their recommendation for the Managing Director position at State Bank of India?\",\n        \"answer\": \"The FSIB considered the candidates' performance during the interview process, their overall experience, and other relevant parameters.\",\n        \"context\": \"To ensure a comprehensive evaluation of the candidates being considered for the Managing Director position at State Bank of India, the FSIB relied on several key factors. These included the candidates' performance during the interview process, which allowed the bureau to assess their skills, knowledge, and suitability for the role. Additionally, the FSIB placed significant emphasis on the overall experience of each candidate, taking into account their professional background and past accomplishments. Finally, the bureau also considered other relevant parameters to ensure a well-rounded assessment.\"\n    },\n    {\n        \"question\": \"Who heads the Appointments Committee of the Cabinet, which will make the final decision on the State Bank of India Managing Director appointment?\",\n        \"answer\": \"The Appointments Committee of the Cabinet, responsible for making the final decision regarding the State Bank of India Managing Director appointment, is headed by Prime Minister Narendra Modi.\",\n        \"context\": \"While the FSIB plays a crucial role in recommending candidates for leadership positions within the Indian banking sector, the ultimate decision-making authority rests with the Appointments Committee of the Cabinet. This committee, led by Prime Minister Narendra Modi, will review the FSIB's recommendation for the State Bank of India Managing Director position and make the final decision on the appointment. \"\n    },\n    {\n        \"question\": \"What was the role of the Financial Services Institutions Bureau (FSIB) in the appointment process for the State Bank of India's Managing Director?\",\n        \"answer\": \"The FSIB was responsible for evaluating candidates and recommending a suitable individual for the Managing Director position at State Bank of India.\",\n        \"context\": \"The Financial Services Institutions Bureau (FSIB) plays a critical role in ensuring that leadership positions within the Indian banking sector are filled with competent and qualified individuals. In the case of the State Bank of India's Managing Director appointment, the FSIB was tasked with evaluating potential candidates and recommending the most suitable individual for the role.  This involved conducting interviews, reviewing qualifications, and assessing overall fit within the organization. \"\n    },\n    {\n        \"question\": \"Is\"\n    }\n]\n",
    "```python\n[\n    {\n        \"question\": \"Did the State Bank of India (SBI) disclose details of electoral bonds under the RTI Act, and if not, why?\",\n        \"answer\": \"No, the SBI refused to disclose the details of electoral bonds under the RTI Act. They claimed the information was personal and held in a fiduciary capacity, exempting it from disclosure under sections 8(1)(e) and 8(1)(j) of the Act.\",\n        \"context\": \"The State Bank of India (SBI) has refused to disclose under the RTI Act the details of the electoral bonds furnished to the Election Commission (EC) claiming that it is personal information held in a fiduciary capacity even though the records are in the public domain on the poll panel's website. RTI activist Commodore (retired) Lokesh Batra approached the SBI on March 13 seeking the complete data of the electoral bonds in the digital form as provided to the EC after the Supreme Court's order. The bank denied the information citing two exemption clauses given under the Right to Information (RTI) Act - section 8(1)(e) that is related to records held in a fiduciary capacity and section 8(1)(j) that allows withholding personal information. 'Information sought by you is containing details of purchasers and political parties and hence cannot be disclosed as it is held in fiduciary capacity disclosure of which is exempted under sections 8(1)(e) and (j) of the RTI Act' the response furnished by the central public information officer and deputy general manager of the SBI said on Wednesday.\"\n    },\n    {\n        \"question\": \"What did the Supreme Court direct the State Bank of India (SBI) to do regarding electoral bonds?\",\n        \"answer\": \"The Supreme Court directed the SBI to furnish complete details of electoral bonds purchased since April 12, 2019, to the Election Commission. The Court deemed the electoral bonds scheme 'unconstitutional and manifestly arbitrary' and ordered the EC to publish the information on its website.\",\n        \"context\": \"Holding that the electoral bonds scheme was 'unconstitutional and manifestly arbitrary' the Supreme Court directed the SBI on February 15 to furnish the complete details of the bonds purchased since April 12, 2019 to the EC which would publish the information on its website by March 13. Holding that the electoral bonds scheme was 'unconstitutional and manifestly arbitrary' the Supreme Court directed the SBI on February 15 to furnish the complete details of the bonds purchased since April 12, 2019 to the EC which would publish the information on its website by March 13.\"\n    },\n    {\n        \"question\": \"What information regarding electoral bonds did the State Bank of India (SBI) provide to the Election Commission?\",\n        \"answer\": \"The SBI provided the EC with data on electoral bonds, including details of donors and political parties that redeemed the bonds. This data was published on the EC's website on March 14.\",\n        \"context\": \"The EC published the data furnished by the SBI on its website on March 14 with the details of the donors and political parties that redeemed the bonds.\"\n    },\n    {\n        \"question\": \"Did the State Bank of India (SBI) disclose the unique numbers of each electoral bond, and what was the Supreme Court's response?\",\n        \"answer\": \"No, the SBI did not initially disclose the unique numbers of each bond. The Supreme Court reprimanded the SBI for this omission, stating that the bank was 'duty-bound' to reveal this information to match donors with recipient political parties.\",\n        \"context\": \"On March 15 the apex court pulled up the SBI for not furnishing the complete information by withholding the numbers unique to each electoral bond that would help match the donors with the recipient political parties saying the bank was 'duty-bound' to reveal the information. A five-judge bench headed by Chief Justice D Y Chandrachud said it had directed the disclosure of all the details of the bonds including the names of the purchasers amounts and dates of purchase. All details have to be furnished by the SBI the CJI observed as the court admonished the bank for furnishing incomplete information a day after the EC put out the entire list of entities that purchased the bonds for making political donations.\"\n    },\n    {\n        \"question\": \"What was the total value of electoral bonds purchased through the State Bank of India (SBI) between April 2019 and February 2023?\",\n        \"answer\": \"The SBI revealed that a total of 22,217 electoral bonds were purchased between April 1, 2019, and February 15, 2023. The specific denominations of these bonds, and therefore the total value, were not mentioned in this context\"\n    }\n]\n",
    "```python\n[\n    {\n        \"question\": \"How does Dinesh Khara believe the Reserve Bank of India's LCR review framework will impact State Bank of India?\",\n        \"answer\": \"Dinesh Khara, chairman of State Bank of India, believes the Reserve Bank of India's liquidity coverage ratio (LCR) review framework will help banks, including SBI, manage liquidity more efficiently.\",\n        \"context\": \"The Reserve Bank of India's liquidity coverage ratio (LCR) review framework would help banks manage liquidity efficiently, State Bank of India chairman Dinesh Khara has said. He stated that banks were keeping large sums, as much as Rs 50000 crore, for extra liquidity. Khara expects the LCR framework to help banks have better and more efficient liquidity management.\"\n    },\n    {\n        \"question\": \"What did State Bank of India chairman Dinesh Khara say about the amount of liquidity banks were holding?\",\n        \"answer\": \"Dinesh Khara noted that banks were holding significant excess liquidity, estimating it to be around Rs 50000 crore.\",\n        \"context\": \"In an interaction with CNBCTV18, Dinesh Khara highlighted that banks were maintaining excessive liquidity, approximately Rs 50000 crore, to ensure they could meet their short-term obligations.\"\n    },\n    {\n        \"question\": \"What action is the Reserve Bank of India planning to take regarding the liquidity coverage ratio for banks?\",\n        \"answer\": \"The Reserve Bank of India's governor, Shaktikanta Das, announced that the central bank would soon issue a draft circular to review the liquidity coverage ratio (LCR) for banks.\",\n        \"context\": \"RBI governor Shaktikanta Das recently announced that the central bank would soon release a draft circular to review the LCR for banks. This review stems from the need for a comprehensive assessment of the LCR framework for banks. The draft circular will be open for stakeholder consultation.\"\n    },\n    {\n        \"question\": \"What is the purpose of the liquidity coverage ratio (LCR) for banks?\",\n        \"answer\": \"The liquidity coverage ratio (LCR) is a crucial metric that ensures banks maintain a sufficient proportion of highly liquid assets to meet their short-term obligations.\",\n        \"context\": \"The liquidity coverage ratio (LCR) is a vital measure for banks as it requires them to hold a specific percentage of highly liquid assets relative to their net cash outflows over a 30-day period. This requirement ensures that banks can meet their short-term financial commitments even during periods of stress.\"\n    },\n    {\n        \"question\": \"What were State Bank of India's expectations for credit growth in FY24?\",\n        \"answer\": \"State Bank of India chairman Dinesh Khara expressed optimism that the bank would surpass its guidance for credit growth in FY24.\",\n        \"context\": \"Dinesh Khara expressed confidence in State Bank of India's ability to exceed the guidance it provided for credit growth in FY24. He attributed this positive outlook to the current economic environment.\"\n    },\n    {\n        \"question\": \"When does State Bank of India anticipate seeing improved credit growth figures?\",\n        \"answer\": \"State Bank of India expects to witness even stronger credit growth numbers in FY25.\",\n        \"context\": \"Looking ahead to FY25, Dinesh Khara anticipates even more favorable credit growth figures for State Bank of India. This projection is based on the bank's assessment of the evolving economic landscape.\"\n    },\n    {\n        \"question\": \"What are State Bank of India's projections regarding its net interest margin?\",\n        \"answer\": \"State Bank of India aims to maintain its net interest margin (NIM) at the current level.\",\n        \"context\": \"Dinesh Khara stated that State Bank of India is focused on sustaining its net interest margin (NIM) at its current rate. The bank believes it can achieve this goal by effectively managing its interest-earning assets and interest-bearing liabilities.\"\n    },\n    {\n        \"question\": \"What was State Bank of India's net interest margin in the December quarter?\",\n        \"answer\": \"State Bank of India reported a net interest margin (NIM) of 3.22 percent in the December quarter.\",\n        \"context\": \"During the December quarter, State Bank of India achieved a net interest margin (NIM) of 3.22 percent. This figure reflects the bank's profitability in terms of its core lending operations.\"\n    }\n]\n```\"\n    }\n]\n",
    "[\n  {\n    \"question\": \"What is the name of the new card launched by SBI Card and Titan Company Limited?\",\n    \"answer\": \"The new card launched by SBI Card and Titan Company Limited is called Titan SBI Card.\",\n    \"context\": \"SBI Card on March 21 has partnered with Titan Company Limited to launch Titan SBI Card.\"\n  },\n  {\n    \"question\": \"What are the benefits offered by the Titan SBI Card?\",\n    \"answer\": \"The Titan SBI Card offers benefits across many lifestyle categories, including cashbacks, Titan gift vouchers, and Reward Points. Cardholders can avail exclusive benefits of over Rs 2 lakh worth per annum.\",\n    \"context\": \"The Card offers benefits across many lifestyle categories. With features that include cashbacks Titan gift vouchers and Reward Points cardholders can avail exclusive benefits of over Rs 2 lakh worth per annum.\"\n  },\n  {\n    \"question\": \"How can one enroll for the Titan SBI Card?\",\n    \"answer\": \"One can enroll for the Titan SBI Card in a completely digital manner via SBI Card SPRINT by visiting the SBI Card website https www.sbicard.com or Titan stores.\",\n    \"context\": \"One can enroll for the card in a completely digital mannervia SBI Card SPRINT by visiting SBI Card website https   www.sbicard.com  or Titan stores  said SBI Card in a stock exchange filing.\"\n  },\n  {\n    \"question\": \"What are the high value spend categories on which the Titan SBI Card offers curated benefits?\",\n    \"answer\": \"The Titan SBI Card offers curated benefits on high value spend categories such as jewellery, watches, and eyewear.\",\n    \"context\": \"The Titan SBI Card offers curated benefits on high value spend categories such as jewellery watches and eyewear.\"\n  },\n  {\n    \"question\": \"What is the cashback percentage offered by the Titan SBI Card on Titan in watches category?\",\n    \"answer\": \"The Titan SBI Card offers 7.5 percent cashback on Titan in watches category.\",\n    \"context\": \"The card offers 7.5 percent cashback on Titan in watches category  Taneira in women ethnic wear category  Titan EyePlus in eyewear category  and other nonjewellery Titan brands.\"\n  },\n  {\n    \"question\": \"What are the additional benefits offered by the Titan SBI Card?\",\n    \"answer\": \"Cardholders will receive 12000 Reward Points upon payment of joining fee. They will also get travel benefits like eight complimentary domestic airport lounge visits in a year and four complimentary international airport lounge visits in a year. Additionally, they will get one percent fuel surcharge waiver.\",\n    \"context\": \"Cardholders will receive 12000 Reward Points upon payment of joining fee.Travel Benefits  Eight complimentary domestic airport lounge visits in a year (Maximum of 2 visits per quarter) and four complimentary international airport lounge visits in a year (Maximum of 2 visits perquarter).Fuel Surcharge  One percent fuel surcharge waiver (Valid for transactions of amount ranging from Rs 500 to Rs 3000   maximum surcharge waiver amount of Rs 100 per billing statement month per credit card account.)\"\n  },\n  {\n    \"question\": \"What was the net profit reported by SBI Card and Payment Services in the December quarter of FY 24?\",\n    \"answer\": \"SBI Card and Payment Services reported an eight percent rise in its net profit at Rs 549 crore in the December quarter of FY 24.\",\n    \"context\": \"SBI Card and Payment Services reported an eight percent rise in its net profit at Rs 549 crore in the December quarter of FY 24 from Rs 509 crore recorded in the yearago period.\"\n  },\n  {\n    \"question\": \"What was the standalone net profit reported by Titan Company for the December quarter of FY24?\",\n    \"answer\": \"Titan Company reported standalone net profit of Rs 1040 crore for the December quarter of FY24.\",\n    \"context\": \"Titan Company reported standalone net profit of Rs 1040 crore for the December quarter of FY24 up 9.5 percent from the same quarter of the previous financial year.\"\n  }\n]",
    "[\n  {\n    \"question\": \"Who is the owner of Future Gaming and Hotel Services?\",\n    \"answer\": \"Santiago Martin is the owner of Future Gaming and Hotel Services.\",\n    \"context\": \"Future Gaming and Hotel Services the company owned by Santiago Martin has emerged as the top donor to political parties via electoral bonds according to the published on the Election Commission website on March 14.\"\n  },\n  {\n    \"question\": \"How much money did Future Gaming and Hotel Services buy in electoral bonds?\",\n    \"answer\": \"Future Gaming and Hotel Services bought electoral bonds worth Rs 1300 crore between 2019 and 2024.\",\n    \"context\": \"The company bought electoral bonds worth Rs 1300 crore approximately between 2019 and 2024.\"\n  },\n  {\n    \"question\": \"What is the name of the company that uploaded the data on electoral bonds?\",\n    \"answer\": \"State Bank of India (SBI) uploaded the data on its website as received from the State Bank of India (SBI).\",\n    \"context\": \"The poll panel uploaded the data on its website as received from the State Bank of India (SBI) after the Supreme Court s directions.\"\n  },\n  {\n    \"question\": \"What is Santiago Martin's background?\",\n    \"answer\": \"Santiago Martin's background is not extensively documented in public, but he was born into a modest family and began dabbling in the lottery business at the age of 13.\",\n    \"context\": \"Who is Santiago Martin From his humble beginnings to his current stature as a lottery king Martin s journey has been a rollercoaster ride. Born in a modest family Martin began dabbling in the lottery business at the age of 13 according to his LinkedIn profile laying the foundation for what would later become his empire.\"\n  },\n  {\n    \"question\": \"What is the name of the group of companies that Santiago Martin is the founder and chairman of?\",\n    \"answer\": \"Santiago Martin is the founder and chairman of the Martin Group of Companies.\",\n    \"context\": \"As founder and chairman of the Martin Group of Companies Santiago Martin and his companies have faced legal scrutiny and controversies over the years for allegations of irregularities.\"\n  },\n  {\n    \"question\": \"What are some of the key businesses of the Martin Group?\",\n    \"answer\": \"The Martin Group's key businesses include lottery operations, real estate development, hospitality, entertainment, and gaming.\",\n    \"context\": \"Key businesses of Martin GroupLottery Operations  His company Martin Lottery Agencies Ltd operated various lottery schemes across different states in India. The lottery business faced regulatory challenges and controversies over the years including legal battles and allegations of irregularities. According to his LinkedIn profile the marketing network of buyers and sellers of lotteries spans across India   with a presence largely in the South the North East West Bengal Punjab and Maharashtra. Real Estate Development  The Martin Group is involved in real estate development including residential commercial and mixeduse projects.Hospitality  Martin s diversified portfolio encompasses real estate hospitality and entertainment from luxury resorts to stateoftheart multiplexesEntertainment and Gaming  Future Gaming and Hotel Services within the Martin Group is involved in entertainment and gaming ventures.\"\n  },\n  {\n    \"question\": \"What is the name of the landmark ruling that scrapped the electoral bonds scheme?\",\n    \"answer\": \"The landmark ruling that scrapped the electoral bonds scheme is called the Constitution bench ruling on February 15, 2024.\",\n    \"context\": \"In a landmark ruling on February 15 2024 a fivejudge Constitution bench had scrapped the Centre s electoral bonds scheme that allowed anonymous political funding calling it  unconstitutional  and ordered disclosure of donors the amount donated by them and the recipients.\"\n  },\n  {\n    \"question\": \"What was the reason for the Supreme Court scrapping the electoral bonds scheme?\",\n    \"answer\": \"The Supreme Court scrapped the electoral bonds scheme because it allowed anonymous political funding, which was deemed unconstitutional.\",\n    \"context\": \"In a landmark ruling on February 15 2024 a fivejudge Constitution bench had scrapped the Centre s electoral bonds scheme that allowed anonymous political funding calling it  unconstitutional  and ordered disclosure of donors the amount donated by them and the recipients.\"\n  }\n]",
    "```python\n[\n    {\n        \"question\": \"How much debt did PC Jeweller owe to lenders, leading to the One-Time Settlement (OTS) with State Bank of India (SBI)?\",\n        \"answer\": \"PC Jeweller owed over Rs 3400 crores to a group of lenders, with SBI being the largest lender.\",\n        \"context\": \"The article discusses the financial troubles of PC Jeweller and its efforts to reach a settlement with its lenders. It states that PC Jeweller owed over Rs 3400 crores to a clutch of lenders, leading to the One-Time Settlement (OTS) with State Bank of India (SBI).\"\n    },\n    {\n        \"question\": \"What were the key components of the One-Time Settlement (OTS) offered by PC Jeweller to State Bank of India (SBI)?\",\n        \"answer\": \"The OTS proposal included a combination of cash payment, equity stake in PC Jeweller, and the release of securities and mortgaged properties.\",\n        \"context\": \"The article mentions that PC Jeweller's OTS proposal, which was accepted by SBI, involved a cash and equity component, along with the release of securities and mortgaged properties.  This indicates that the company aimed to settle its debt through a multifaceted approach.\"\n    },\n    {\n        \"question\": \"When did PC Jeweller's financial troubles become public, prompting banks like State Bank of India (SBI) to initiate loan recall?\",\n        \"answer\": \"PC Jeweller's financial troubles surfaced in February 2023 when it was revealed that the company had defaulted on loans worth Rs 3466 crore, leading banks to recall their loans.\",\n        \"context\": \"The article highlights that PC Jeweller's financial struggles came to light in February 2023 when it was revealed that the company had defaulted on loans worth Rs 3466 crore from banks and financial institutions. This revelation prompted banks, including SBI, to initiate loan recall, a process where lenders request the borrower to return the borrowed funds.\"\n    },\n    {\n        \"question\": \"What action did State Bank of India (SBI) take against PC Jeweller in June 2023 regarding the loan default?\",\n        \"answer\": \"In June 2023, SBI, being the largest lender to PC Jeweller, filed an insolvency plea against the company at the National Company Law Tribunal (NCLT).\",\n        \"context\": \"The article explains that in June 2023, SBI, as the largest lender to PC Jeweller, filed an insolvency plea against the company at the National Company Law Tribunal (NCLT) in response to the loan default. This legal action by SBI underscored the seriousness of PC Jeweller's financial situation.\"\n    },\n    {\n        \"question\": \"How did PC Jeweller initially respond to the insolvency plea filed by State Bank of India (SBI)?\",\n        \"answer\": \"PC Jeweller responded to SBI's insolvency plea by submitting a 26-volume response to the court.\",\n        \"context\": \"The article details the legal battle between SBI and PC Jeweller, stating that PC Jeweller filed a 26-volume response to SBI's 19-volume insolvency plea at the NCLT. This extensive response suggests that PC Jeweller was prepared to fight the insolvency plea and present its case.\"\n    },\n    {\n        \"question\": \"What was the outcome of the settlement discussions between State Bank of India (SBI) and PC Jeweller in the NCLT proceedings?\",\n        \"answer\": \"During the NCLT proceedings, SBI and PC Jeweller engaged in settlement talks.  The court granted adjournments to allow these talks to progress, indicating a willingness from both sides to find a resolution outside of court.\",\n        \"context\": \"The article highlights that during the NCLT proceedings, there were developments in settlement talks between SBI and PC Jeweller over the loan repayment. The court acknowledged these developments and adjourned the case multiple times to allow for further discussions, demonstrating a willingness from both parties to reach an amicable resolution.\"\n    },\n    {\n        \"question\": \"What was the primary element of PC Jeweller's repayment proposal during the settlement talks with State Bank of India (SBI)?\",\n        \"answer\": \"PC Jeweller proposed to repay a significant portion of its debt to SBI over a three-year period, including an upfront payment.\",\n        \"context\": \"The article states that as part of the settlement discussions, PC Jeweller offered to pay a sizeable chunk of its outstanding dues to SBI over a span of three years. This proposal also included an upfront payment, suggesting a commitment from PC Jeweller to resolve the debt issue.\"\n    },\n    {\n        \"question\": \"What action did State Bank\"\n    }\n]\n",
    "[\n    {\n        \"question\": \"What is Bernstein's stock rating for State Bank of India?\",\n        \"answer\": \"Marketperform\",\n        \"context\": \"Bernstein downgraded shares of the State Bank of India to  market perform  citing limited upside...\"\n    },\n    {\n        \"question\": \"What is Bernstein's target price for State Bank of India?\",\n        \"answer\": \"Rs 780\",\n        \"context\": \"Bernstein downgraded shares of the State Bank of India to  market perform  citing limited upside and raised its target price for the stock to Rs 780 from Rs 710...\"\n    },\n    {\n        \"question\": \"Why did Bernstein downgrade State Bank of India?\",\n        \"answer\": \"Limited upside and a willingness to improve its capital levels.\",\n        \"context\": \"Bernstein downgraded shares of the State Bank of India to  market perform  citing limited upside and raised its target price for the stock to Rs 780 from Rs 710 on the bank s willingness to improve its capital levels.\"\n    },\n    {\n        \"question\": \"What factors will drive underperformance in public sector banks compared to their private peers?\",\n        \"answer\": \"Weaker deposit growth and lower liquidity buffers.\",\n        \"context\": \"The broking firm also highlighted factors that would drive underperformance in public sector banks compared to their private peers. At 10.34am shares of SBI traded 0.1 percent higher at Rs 788.95. The stock has gained over 33 percent in the past six months. Bernstein said that although public sector banks have outshone private lenders in the past three years going ahead investors should switch to private sector banks...\"\n    },\n    {\n        \"question\": \"Why is the liquidity headroom lower than the loan-to-deposit ratio?\",\n        \"answer\": \"Higher investments for public banks are a result of higher deposits and cannot be reduced to be on par with private banks.\",\n        \"context\": \"Bernstein said that the liquidity headroom is a lot lower than what the loantodeposit ratio might suggest given the higher investments for public banks are a result of higher deposits and cannot be reduced to be on par with private banks.\"\n    },\n    {\n        \"question\": \"What is the consequence of aggressive pricing in loans and deposits by public banks?\",\n        \"answer\": \"A growth-margin tradeoff that will result in muted earnings growth.\",\n        \"context\": \"Aggressive pricing in loans and deposits by public banks is forcing a growthmargin tradeoff that will result in muted earnings growth. So even if public sector banks squeeze out the remaining liquidity buffers to match growth the higher loan growth will not translate into earnings growth said Bernstein.\"\n    },\n    {\n        \"question\": \"How does the market cap to pre-provision operating profit (PPOP) ratio compare between public and private banks?\",\n        \"answer\": \"Public banks have a higher PPOP ratio despite lower deposit growth rates.\",\n        \"context\": \"The brokerage firm said that with the recent rally the market cap to preprovision operating profit (PPOP) ratio for public banks is more than 0.6X that of private banks despite their deposit growth rates remaining less than 0.6X of private banks.\"\n    },\n    {\n        \"question\": \"What is Bernstein's recommendation for investors?\",\n        \"answer\": \"Switch to private sector banks.\",\n        \"context\": \"Bernstein said that although public sector banks have outshone private lenders in the past three years going ahead investors should switch to private sector banks. The broking firm sees a less promising trajectory for state run banks as they struggle with weaker deposit growth and much lower liquidity buffers resulting in a weaker earnings growth compared to private banks.\"\n    }\n]"
]