[
    "```python\n[\n    {\n        \"question\": \"How has ICICI Bank's share price performed compared to the Nifty and Bank Nifty in the last year?\",\n        \"answer\": \"ICICI Bank's share price has risen nearly 29 percent in the last year, outperforming both the NSE Nifty 50, which gained 27 percent, and the Bank Nifty, which rose by 20 percent.\",\n        \"context\": \"Over the last one year, ICICI Bank's share price has risen nearly 29 percent, beating the 27 percent gains made by the NSE Nifty 50 and the 20 percent gain in Bank Nifty.\"\n    },\n    {\n        \"question\": \"What is the current market capitalization of ICICI Bank?\",\n        \"answer\": \"ICICI Bank achieved a market capitalization of Rs 100 billion (Rs 8.4 lakh crore) on June 25th, making it the sixth Indian company to do so.\",\n        \"context\": \"ICICI Bank Ltd on June 25 became only the sixth Indian firm to hit a market capitalisation of 100 billion (Rs 8.4 lakh crore) as the private sector bank's share price gained over 2 percent intraday.\"\n    },\n    {\n        \"question\": \"Which other Indian companies have reached a market capitalization of Rs 100 billion?\",\n        \"answer\": \"Besides ICICI Bank, Reliance Industries Ltd, Tata Consultancy Services, HDFC Bank, and Bharti Airtel have crossed the Rs 100 billion market capitalization mark. Infosys also reached this milestone in January 2022 but hasn't maintained it.\",\n        \"context\": \"The other Indian companies to have crossed 100 billion in market capitalisation are Reliance Industries Ltd, Tata Consultancy Services, HDFC Bank and Bharti Airtel. IT bellwether Infosys too hit 100 billion in market capitalisation in January 2022 but hasn't sustained at the level.\"\n    },\n    {\n        \"question\": \"What were ICICI Bank's net profit and net interest income in the January-March quarter?\",\n        \"answer\": \"In the quarter ending March 31st, ICICI Bank reported a standalone net profit of Rs 10707.5 crore, a 17.4 percent increase year-on-year. Their net interest income for the same period grew to Rs 19092.8 crore from Rs 17666.8 crore a year earlier.\",\n        \"context\": \"In the previous quarter that ended March 31, ICICI Bank reported standalone net profit to 10707.5 crore, up 17.4 percent from Rs 9121.9 crore in the corresponding period previous year. Its net interest income in the January-March quarter grew to Rs 19092.8 crore from Rs 17666.8 crore a year ago.\"\n    },\n    {\n        \"question\": \"What dividend did ICICI Bank declare recently?\",\n        \"answer\": \"ICICI Bank declared a dividend of Rs 10 per equity share, with each share having a face value of Rs 2.\",\n        \"context\": \"The lender also declared a dividend of Rs 10 per equity share of face value of Rs 2 each.\"\n    },\n    {\n        \"question\": \"How has ICICI Bank's loan growth been in recent times?\",\n        \"answer\": \"ICICI Bank experienced moderate growth in its wholesale loans. However, its retail and SME lending business has been robust, allowing the bank to surpass the system credit growth.\",\n        \"context\": \"ICICI Bank has seen a modest growth in its wholesale loans business, but a robust retail and SME lending business has helped it outperform the system credit growth.\"\n    },\n    {\n        \"question\": \"What is Motilal Oswal's rating and target price for ICICI Bank's stock?\",\n        \"answer\": \"Motilal Oswal issued a 'buy' rating on ICICI Bank stock with a target price of Rs 1350 per share. This target price suggests a potential 15 percent increase from the previous close.\",\n        \"context\": \"This week Motilal Oswal issued a 'buy' rating on ICICI Bank stock on the back of a strong loan growth, robust fee income, strong asset quality and other factors. The brokerage's target price of Rs 1350 per share implies a 15 percent upside from the previous close.\"\n    },\n    {\n        \"question\": \"What are Motilal Oswal's expectations for ICICI Bank's NIMs and asset quality?\",\n        \"answer\"\n    }\n]\n",
    "```\n[\n  {\n    \"question\": \"What is the name of the new safety measure launched by ICICI Bank?\",\n    \"answer\": \"SmartLock\",\n    \"context\": \"ICICI Bank on June 24 launched  SmartLock  a new safety measure that will enable customers to lock unlock multiple banking services without any help from a customer care executive through phone or email the private lender said.\"\n  },\n  {\n    \"question\": \"What is the unique aspect of SmartLock in the banking sector?\",\n    \"answer\": \"It is the first-of-its-kind measure in the country's banking sector.\",\n    \"context\": \"The  firstofitskind  measure in the country s banking sector will be available of iMobile Pay.\"\n  },\n  {\n    \"question\": \"Where will SmartLock be available?\",\n    \"answer\": \"It will be available on ICICI Bank's iMobile Pay app.\",\n    \"context\": \"It will empower customers to lock unlock access to internet banking UPI (including payments from other UPI apps linked to the bank account) credit and debit cards simply by clicking a button the bank s statement said.\"\n  },\n  {\n    \"question\": \"What banking services can be locked or unlocked using SmartLock?\",\n    \"answer\": \"Customers can lock or unlock access to internet banking, UPI, credit cards, debit cards, and the entire iMobile Pay account.\",\n    \"context\": \"It will empower customers to lock unlock access to internet banking UPI (including payments from other UPI apps linked to the bank account) credit and debit cards simply by clicking a button the bank s statement said.\\nThe new feature also permits account holders to lock or unlock the entire iMobile Pay the statement added.\"\n  },\n  {\n    \"question\": \"What is the purpose of the SmartLock feature?\",\n    \"answer\": \"It allows customers to deactivate a particular banking service in case of a possible fraudulent transaction.\",\n    \"context\": \"The feature can be used to deactivate a particular banking service and in case of a possible fraudulent transaction.\"\n  },\n  {\n    \"question\": \"Will scheduled standing instructions (SIs) and E-mandates be affected when a banking service is locked using SmartLock?\",\n    \"answer\": \"No, scheduled standing instructions (SIs) and E-mandates will continue to go through even when a banking service is locked by the customer.\",\n    \"context\": \"The  SmartLock  feature allows scheduled standing instructions (SI) and Emandates to go through even when a banking service is locked by the customer the lender said.\"\n  },\n  {\n    \"question\": \"Who is the head of digital channels and partnerships at ICICI Bank?\",\n    \"answer\": \"Sidharatha Mishra\",\n    \"context\": \"Sidharatha Mishra head   digital channels and partnerships ICICI Bank said  Safety of our customers  accounts is of utmost importance to us.\"\n  },\n  {\n    \"question\": \"What is the main advantage of the SmartLock feature?\",\n    \"answer\": \"It provides customers with enhanced security and convenience by allowing them to manage the security of their banking services in one place.\",\n    \"context\": \"This DoItYourself (DIY) feature provides customers the convenience of enhanced security for banking services in their own hands in one place.\"\n  }\n]\n```\"\n    }\n]\n",
    "[\n  {\n    \"question\": \"What recommendation has Motilal Oswal Securities Ltd (MOSL) issued for ICICI Bank?\",\n    \"answer\": \"Motilal Oswal Securities Ltd (MOSL) has issued a Buy recommendation for ICICI Bank.\",\n    \"context\": \"Motilal Oswal Securities Ltd (MOSL) has issued a Buy recommendation for ICICI Bank setting a target price of Rs 1350 per share.\"\n  },\n  {\n    \"question\": \"What is the target price set by Motilal Oswal for ICICI Bank?\",\n    \"answer\": \"Motilal Oswal has set a target price of Rs 1350 per share for ICICI Bank.\",\n    \"context\": \"Motilal Oswal Securities Ltd (MOSL) has issued a Buy recommendation for ICICI Bank setting a target price of Rs 1350 per share.\"\n  },\n  {\n    \"question\": \"What factors are driving Motilal Oswal's positive outlook on ICICI Bank?\",\n    \"answer\": \"Motilal Oswal's positive outlook on ICICI Bank is driven by its strong loan and fee growth, robust asset quality, and other factors.\",\n    \"context\": \"Motilal Oswal's positive outlook on the bank is driven by its strong loan and fee growth robust asset quality among other factors.\"\n  },\n  {\n    \"question\": \"How has ICICI Bank's stock performed in recent months?\",\n    \"answer\": \"ICICI Bank's stock has gained 16 percent in the past six months, outperforming Nifty 50 which gained nearly 10 percent during the same period.\",\n    \"context\": \"The stock has gained 16 percent in the past six months outperforming Nifty 50 which gained nearly 10 percent during the same period.\"\n  },\n  {\n    \"question\": \"What is the expected outlook for ICICI Bank's loan growth?\",\n    \"answer\": \"ICICI Bank's loan growth is expected to continue to be robust, according to Motilal Oswal.\",\n    \"context\": \"ICICI Bank's loan growth is expected to continue to be robust Motilal Oswal said.\"\n  },\n  {\n    \"question\": \"What is Motilal Oswal's view on ICICI Bank's asset quality?\",\n    \"answer\": \"Motilal Oswal believes that ICICI Bank's asset quality remains robust with credit costs expected to normalise gradually.\",\n    \"context\": \"The bank's asset quality remains robust with credit costs expected to normalise gradually according to Motilal Oswal.\"\n  },\n  {\n    \"question\": \"What drove ICICI Bank's net profit growth in Q4 FY24?\",\n    \"answer\": \"ICICI Bank's net profit grew by 17 percent in Q4 FY24, driven by strong loan and fee growth.\",\n    \"context\": \"On April 27 ICICI Bank reported a net profit of Rs 10707 crore for Q4 FY24 a 17 percent increase from Rs 9122 crore in the same period last year.\"\n  },\n  {\n    \"question\": \"What is the key lever for ICICI Bank according to Motilal Oswal?\",\n    \"answer\": \"Motilal Oswal believes that operating leverage is emerging as a key lever for ICICI Bank with a focus on Return on Effort.\",\n    \"context\": \"Additionally operating leverage is emerging as a key lever for the bank with a focus on  Return on Effort  said Motilal Oswal.\"\n  }\n]",
    "[\n  {\n    \"question\": \"How has India's market evolved in attracting global funds?\",\n    \"answer\": \"India's market has grown substantially, attracting truly global funds with the ability to invest anywhere in the world.\",\n    \"context\": \"India s market has grown substantially attracting truly global funds with the ability to invest anywhere in the world.\"\n  },\n  {\n    \"question\": \"How have global investors' preferences shifted regarding Indian stocks?\",\n    \"answer\": \"Global investors now favor one, two, or three megacap Indian stocks in their portfolios, rather than the previous trend of holding two or three China ecommerce internet stocks.\",\n    \"context\": \"However this trend has largely changed with global investors now favouring one two or three megacap Indian stocks according to Jonathan Garner Chief Equity Strategist for Asia and Emerging Markets at Morgan Stanley.\"\n  },\n  {\n    \"question\": \"What other trends are occurring alongside the shift towards megacap Indian stocks?\",\n    \"answer\": \"India is experiencing a retail-driven boom in small and medium stocks, along with a surge in options trading.\",\n    \"context\": \"Simultaneously India is experiencing a retaildriven boom in small and medium stocks alongside a surge in options trading.This reflects a broader trend of wealth creation among India s young and dynamic population he added.\"\n  },\n  {\n    \"question\": \"What factors have led to India's growing significance for global investors?\",\n    \"answer\": \"India is now positioned as the second-largest market in emerging markets and poised to become the largest, making it too significant to disregard.\",\n    \"context\": \"Global investors now prioritise liquidity and substantial market exposure relative to their benchmark index. Previously when India constituted a smaller segment it was often overlooked.However with India now positioned as the secondlargest market in emerging markets and poised to become the largest global investors cannot afford to disregard its significance emphasised Garner.\"\n  },\n  {\n    \"question\": \"Which sectors within the Indian market are particularly attractive to investors?\",\n    \"answer\": \"Domestic demand plays, including sectors like consumer discretionary, industrials, financials, and real estate, are particularly attractive.\",\n    \"context\": \" What we like particularly is domestic demand plays  he explained. This includes sectors like consumer discretionary industrials financials and real estate.\"\n  },\n  {\n    \"question\": \"Which stocks does Morgan Stanley have a bullish outlook on?\",\n    \"answer\": \"ICICI Bank, Maruti Suzuki, GAIL, and Godrej Properties in real estate.\",\n    \"context\": \"Garner expressed bullishness on specific stocks including ICICI Bank Maruti Suzuki GAIL and Godrej Properties in real estate.\"\n  },\n  {\n    \"question\": \"What is Morgan Stanley's stance on externally earning sectors in India?\",\n    \"answer\": \"Morgan Stanley is more cautious on externally earning sectors such as IT services, outsourcing names, pharmaceuticals, and defensive stocks.\",\n    \"context\": \"In contrast Morgan Stanley is more cautious on externally earning sectors such as IT services outsourcing names pharmaceuticals and defensive stocks though they are not in a defensive posture on India overall.\"\n  },\n  {\n    \"question\": \"How does Morgan Stanley anticipate the focus of India's market development shifting in the future?\",\n    \"answer\": \"The focus is expected to gradually shift towards consumer-driven sectors.\",\n    \"context\": \"With a significant CapEx cycle in recent years Garner anticipates a continued emphasis on infrastructure but expects the focus to gradually shift towards consumerdriven sectors which offer a robust environment and a wide range of investment opportunities.\"\n  }\n]",
    "[\n  {\n    \"question\": \"What is the name of the company that has been admitted into insolvency resolution process by NCLT?\",\n    \"answer\": \"Jaiprakash Associates Limited\",\n    \"context\": \"The National Company Law Appellate Tribunal (NCLAT) has refused to stay an NCLT order admitting infrastructure firm Jaiprakash Associates Limited into insolvency resolution process.\"\n  },\n  {\n    \"question\": \"What is the reason for the insolvency resolution process of Jaiprakash Associates Limited?\",\n    \"answer\": \"The company owes more than Rs 30000 crore to various banks and Rs 1200 crore to ICICI Bank.\",\n    \"context\": \"The company owed more than Rs 30000 crore to various banks and Rs 1200 crore to ICICI Sen said. It would set a wrong example if the proceedings were stayed.\"\n  },\n  {\n    \"question\": \"Who sought a stay on the insolvency resolution process of Jaiprakash Associates Limited?\",\n    \"answer\": \"Sunil Kumar Sharma, a suspended company director\",\n    \"context\": \"Sunil Kumar Sharma a suspended company director sought the stay.\"\n  },\n  {\n    \"question\": \"What is the date on which NCLAT refused to stay the NCLT order?\",\n    \"answer\": \"June 10\",\n    \"context\": \"The NCLAT said on June 10 that the Interim Resolution Professional submitted that neither the company s 25000 employees nor ongoing projects would be affected as IRP intended to run the company as a going concern.\"\n  },\n  {\n    \"question\": \"What is the amount of outstanding dues that Jaiprakash Associates Limited owes to ICICI Bank?\",\n    \"answer\": \"Rs 1200 crore\",\n    \"context\": \"The company had already deposited Rs 200 crore of the outstanding Rs 1200 crore it owed to ICICI Bank he said.\"\n  },\n  {\n    \"question\": \"What is the amount of debt that Jaiprakash Associates Limited has?\",\n    \"answer\": \"Rs 29361 crore\",\n    \"context\": \"Jaiprakash Associates has a debt of Rs 29361 crore including interest. In all 22 lenders have exposure to JP Associates  debt.\"\n  },\n  {\n    \"question\": \"What is the name of the bank that has submitted a binding offer to acquire JAL's debt?\",\n    \"answer\": \"National Asset Reconstruction Company of India (NARCL)\",\n    \"context\": \"The National Asset Reconstruction Company of India (NARCL) in MarchApril submitted an Rs 10000crore binding offer to acquire JAL s debt but the lenders sought a better offer reports said.\"\n  },\n  {\n    \"question\": \"What is the amount of the binding offer submitted by NARCL?\",\n    \"answer\": \"Rs 10000 crore\",\n    \"context\": \"The National Asset Reconstruction Company of India (NARCL) in MarchApril submitted an Rs 10000crore binding offer to acquire JAL s debt but the lenders sought a better offer reports said.\"\n  }\n]",
    "```\n[\n  {\n    \"question\": \"What prompted SEBI to issue an administrative warning to ICICI Bank?\",\n    \"answer\": \"SEBI took action in response to complaints from ICICI Securities shareholders about the bank's aggressive outreach efforts during the delisting vote.\",\n    \"context\": \"Acting on several complaints by shareholders of ICICI Securities some of who received calls by ICICI Bank seeking favourable vote for the delisting scheme market regulator SEBI has issued an administrative warning on the outreach.\"\n  },\n  {\n    \"question\": \"What was the nature of the outreach program conducted by ICICI Bank?\",\n    \"answer\": \"ICICI Bank's outreach program aimed to explain the delisting scheme of ICICI Securities and increase shareholder participation.\",\n    \"context\": \"An exchange filing by ICICI Bank on June 6 cited regulator s observation that said  The heightened outreach programme on the last day of voting citing holidays weekend appears inappropriate .\"\n  },\n  {\n    \"question\": \"Did ICICI Bank's outreach program overstep its boundaries?\",\n    \"answer\": \"Yes, some ICICI Bank officials exceeded the scope of the outreach program by making repeated calls, seeking screenshots of voting, and suggesting that opting for the scheme would be beneficial.\",\n    \"context\": \"ICICI Bank s exchange filing cited Sebi s circular which said the outreach programme was undertaken to explain the scheme of delisting of ICICI Securities and to maximize shareholders  participation. However investor complaints revealed that some officials had  gone beyond the outreach programme  and made repeated calls and even sought screenshots of voting.\"\n  },\n  {\n    \"question\": \"What did SEBI find inappropriate about ICICI Bank's outreach program?\",\n    \"answer\": \"SEBI deemed ICICI Bank's outreach program inappropriate because it occurred on the last day of voting and appeared to be designed to influence the outcome of the vote.\",\n    \"context\": \"An exchange filing by ICICI Bank on June 6 cited regulator s observation that said  The heightened outreach programme on the last day of voting citing holidays weekend appears inappropriate .\"\n  },\n  {\n    \"question\": \"Why did SEBI express concern about ICICI Bank providing its perspective on the delisting transaction?\",\n    \"answer\": \"SEBI raised concerns because ICICI Bank is the promoter of ICICI Securities and therefore has an inherent conflict of interest in the delisting transaction.\",\n    \"context\": \"Sebi s letter said  ... bank being a promoter  interested party providing its perspective on the proposed transaction to shareholders of ISec cannot be said to be providing a balanced factual position. There was a clear conflict of interest.\"\n  },\n  {\n    \"question\": \"What percentage of ICICI Bank's public institutional shareholders voted in favor of the delisting?\",\n    \"answer\": \"83.8 percent of ICICI Bank's public institutional shareholders voted in favor of the delisting.\",\n    \"context\": \"As many as 83.8 percent of the public institutional shareholders and 32 percent noninstitutional shareholders of ICICI Bank had voted in favour of ICICI Securities  delisting the bank had said a regulatory filing on March 27.\"\n  },\n  {\n    \"question\": \"What did SEBI expect ICICI Bank to do to prevent similar incidents in the future?\",\n    \"answer\": \"SEBI expected ICICI Bank to improve its compliance standards and report on the actions taken to the regulator within 10 days of its next board meeting.\",\n    \"context\": \"The regulator warned ICICI Bank to be careful and expected it to improve the compliance standards to avoid such instances failing which Sebi saidaction may be initiated. The bank has been advised to place the actions taken in this regard before the next meeting and forward SEBI a brief on the discussions within 10 days of the Board meeting.\"\n  },\n  {\n    \"question\": \"What was the potential consequence for ICICI Bank if it failed to improve its compliance standards?\",\n    \"answer\": \"SEBI indicated that it may initiate action against ICICI Bank if it failed to improve its compliance standards and prevent similar incidents in the future.\",\n    \"context\": \"The regulator warned ICICI Bank to be careful and expected it to improve the compliance standards to avoid such instances failing which Sebi saidaction may be initiated.\"\n  }\n]\n```\"\n    }\n]\n",
    "```\n[\n  {\n    \"question\": \"Which private banks saw a surge in their share prices after the postelection verdict uncertainty?\",\n    \"answer\": \"HDFC Bank, ICICI Bank, Axis Bank, IndusInd Bank, and Federal Bank\",\n    \"context\": \"Shares of HDFC Bank ICICI Bank Axis Bank IndusInd Bank and Federal Bank surged up to 8 percent in 2 days on June 6 as against 4 percent rise in the benchmark Nifty 50 index during the same period.\"\n  },\n  {\n    \"question\": \"What was the percentage of credit growth for private banks in Q4FY24?\",\n    \"answer\": \"30 percent year-on-year (YoY)\",\n    \"context\": \"Additionally credit growth stayed healthy for private banks at 30 percent yearonyear (YoY) in Q4FY24.\"\n  },\n  {\n    \"question\": \"What did Goldman Sachs analysts say about the steep correction in private bank stocks?\",\n    \"answer\": \"They believe it offered opportunities to accumulate private banks and remain bullish on HDFC Bank, Kotak Bank, Axis Bank, and IndusInd Bank.\",\n    \"context\": \"Analysts at Goldman Sachs believe that this steep correction offers opportunities to accumulate private banks. They remain bullish on HDFC Bank Kotak Bank Axis Bank and IndusInd Bank.\"\n  },\n  {\n    \"question\": \"What did Kotak Institutional Equities report about banks' performance in Q4FY24?\",\n    \"answer\": \"Banks reported a good March-ended quarter (Q4FY24) as operational profitability holds up. Asset quality also continued to improve while the proportion of delinquent loans on the balance sheet continued to decline.\",\n    \"context\": \"Kotak Institutional Equities said that banks reported a good Marchended quarter (Q4FY24) as operational profitability holds up. Asset quality also continued to improve while the proportion of delinquent loans on the balance sheet continued to decline.\"\n  },\n  {\n    \"question\": \"What was the overall credit growth for the banking system in May 2024?\",\n    \"answer\": \"20 percent YoY\",\n    \"context\": \"According to the latest RBI data overall credit growth for the banking system has stayed healthy at 20 percent YoY in May 2024 supported by the merger of HDFC into HDFC Bank while it stood at 16 percent adjusted for the impact of the merger.\"\n  },\n  {\n    \"question\": \"What was the NIM trend for banks during Q4FY24?\",\n    \"answer\": \"It showed a declining trend\",\n    \"context\": \"However banks showed a declining NIM trend during Q4FY24. Yields were either flat or slightly higher sequentially with some amount of repricing of MCLRlinked loans.\"\n  },\n  {\n    \"question\": \"What did Julius Baer say about private banks after India's 7.8 percent GDP growth YoY in first quarter of 2024?\",\n    \"answer\": \"They remain optimistic about private banks, stating that the momentum in the economy from existing reforms will not fade away.\",\n    \"context\": \"Nonetheless Julius Baer remains optimistic about private banks after India recorded 7.8 percent GDP growth YoY in first quarter of 2024.  While BJP s power may be diluted it is still intact and the momentum in the economy from existing reforms will not fade away  they said.\"\n  },\n  {\n    \"question\": \"Did the postelection verdict uncertainty have a negative impact on all private bank stocks?\",\n    \"answer\": \"No\",\n    \"context\": \"Private bank stocks recovered sharply in two days after they witnessed steep decline owing to postelection verdict uncertainty.\"\n  }\n]\n```\"\n    }\n]\n",
    "```python\n[\n    {\n        \"question\": \"What strategic partnership marks the Adani Group's first foray into the financial sector?\",\n        \"answer\": \"Adani Group's partnership with ICICI Bank to launch co-branded credit cards marks their first venture into the financial sector.\",\n        \"context\": \"The Adani Group, known for its presence in various sectors, has announced its entry into the financial sector by partnering with ICICI Bank. This strategic move involves the launch of co-branded credit cards, signifying Adani's intention to diversify its portfolio and tap into the financial services market. The partnership leverages Adani's reputation and customer base while capitalizing on ICICI Bank's expertise in financial products and services.\"\n    },\n    {\n        \"question\": \"How does Adani Group plan to leverage its customer touchpoints across businesses with this new venture?\",\n        \"answer\": \"Adani Group plans to leverage its customer touchpoints through its Adani One app, offering airport-linked benefits and rewards on spending across the Adani ecosystem.\",\n        \"context\": \"Adani Group has a diverse portfolio of businesses, creating multiple customer touchpoints. They plan to leverage these touchpoints through their Adani One app, offering a centralized platform for various services. The co-branded credit cards will incentivize spending within the Adani ecosystem, rewarding users for activities such as booking flights and hotels, paying utility bills, and more. This strategy aims to enhance customer loyalty and drive engagement within the Adani ecosystem.\"\n    },\n    {\n        \"question\": \"What benefits do the new Adani Group and ICICI Bank co-branded credit cards offer?\",\n        \"answer\": \"The cards offer airport lounge access, discounts on duty-free shopping, reward points on Adani ecosystem spends, and various other travel and lifestyle benefits.\",\n        \"context\": \"The Adani Group and ICICI Bank co-branded credit cards are designed to provide a rewarding experience, particularly for travelers. Cardholders can enjoy benefits like airport lounge access, discounts at duty-free shops, and priority services at airports. Additionally, the cards offer reward points for spending within the Adani ecosystem, covering services like flight and hotel bookings, utility payments, and more. The cards also come with lifestyle benefits like movie tickets and dining discounts, making them a comprehensive package for various needs.\"\n    },\n    {\n        \"question\": \"How does the Adani One app enhance the value proposition of these co-branded credit cards?\",\n        \"answer\": \"The Adani One app acts as a platform for booking services and earning rewards, making it integral to maximizing the benefits of the co-branded cards.\",\n        \"context\": \"The Adani One app plays a crucial role in enhancing the value proposition of the co-branded credit cards. It acts as a central hub for users to access various services within the Adani ecosystem, such as booking flights, hotels, and other travel arrangements, as well as managing utility payments and more. Using the app for these transactions allows cardholders to earn reward points, effectively linking the app's functionality to the credit cards' benefits. This integration aims to create a seamless and rewarding experience for users within the Adani ecosystem.\"\n    },\n    {\n        \"question\": \"What is the significance of Adani Group's partnership with Visa for this venture?\",\n        \"answer\": \"The partnership with Visa provides a globally recognized payment network for the co-branded credit cards, expanding their reach and acceptance.\",\n        \"context\": \"Adani Group's partnership with Visa is significant as it provides a robust and widely accepted payment network for the co-branded credit cards. Visa's global presence ensures that the cards can be used for transactions worldwide, both online and offline. This partnership aligns with Adani's vision of creating a seamless and comprehensive financial product. By leveraging Visa's network, Adani can cater to a wider customer base, including international travelers and those who frequently transact globally.\"\n    },\n    {\n        \"question\": \"What is the annual fee for the Adani One ICICI Bank Signature Credit Card?\",\n        \"answer\": \"The Adani One ICICI Bank Signature Credit Card has an annual fee of Rs 5000.\",\n        \"context\": \"The Adani One ICICI Bank Signature Credit Card, positioned as a premium offering, comes with an annual fee of Rs 5000. This fee structure is indicative of the card's comprehensive benefits and rewards program, designed for users who frequently utilize airport and travel-related services and prefer a premium experience. The fee structure reflects the value proposition of the card, which includes airport lounge access, priority services, and a rewarding points system for Adani ecosystem transactions.\"\n    },\n    {\n        \"question\": \"What does Jeet Adani, Director of Adani Group, say about the Adani One ICICI Bank Credit Cards\"\n    }\n]\n",
    "[\n  {\n    \"question\": \"Which stock has given a breakout of the falling trendline in a weekly time frame indicating an upward move?\",\n    \"answer\": \"Emami has given a breakout of the falling trendline in a weekly time frame indicating an upward move.\",\n    \"context\": \"Emami has given a breakout of the falling trendline in a weekly time frame indicating an upward move. The rise in volume during the breakout indicates buyers' interest in the security. The price is trading above the 50 EMA (Exponential Moving Average) which indicates an uptrend in the security. The momentum indicator RSI is moving in the northern direction supporting the price action.\"\n  },\n  {\n    \"question\": \"Which stock has been able to settle above the 10week close indicating a bullish trend?\",\n    \"answer\": \"RHIM has been able to settle above the 10week close indicating a bullish trend.\",\n    \"context\": \"RHIM has been able to settle above the 10week close indicating a bullish trend. Buyers have shown interest in the security leading it to close above the resistance. The increase in volume indicates interest in the security. The price has been able to close above the 50 EMA indicating a bullish trend. On the momentum front RSI is making higher highs supporting the price action.\"\n  },\n  {\n    \"question\": \"Which stock is in an overall uptrend and holding gains at higher zones?\",\n    \"answer\": \"Dixon Technologies is in an overall uptrend and holding gains at higher zones.\",\n    \"context\": \"Dixon Technologies is in an overall uptrend and holding gains at higher zones. It has given a consolidation breakout on a daily scale and is relatively outperforming within the IT space. The momentum indicator RSI is positively placed which has bullish implications.\"\n  },\n  {\n    \"question\": \"Which stock has given a trendline breakout on the weekly chart and achieved the highest daily close ever?\",\n    \"answer\": \"Motherson has given a trendline breakout on the weekly chart and achieved the highest daily close ever.\",\n    \"context\": \"Motherson has given a trendline breakout on the weekly chart and achieved the highest daily close ever. The breakout is supported by a surge in volumes which may support the ongoing up move. The momentum indicator RSI is positively placed which has bullish implications.\"\n  },\n  {\n    \"question\": \"Which stock is in an overall downtrend and continuously forming lower toplower bottom patterns on the daily chart?\",\n    \"answer\": \"Bajaj Finance is in an overall downtrend and continuously forming lower toplower bottom patterns on the daily chart.\",\n    \"context\": \"Bajaj Finance has given a support trendline breakout on a daily scale and closed below the same. The stock is in an overall downtrend and continuously forming lower toplower bottom patterns on the daily chart.\"\n  },\n  {\n    \"question\": \"Which stock is trading in a rangebound mode for the past many sessions?\",\n    \"answer\": \"Asian Paints stock is trading in a rangebound mode for the past many sessions.\",\n    \"context\": \"Asian Paints stock is in the accumulation zone trading in a rangebound mode for the past many sessions. The texture of the chart formation and technical indicator Relative Strength Index (RSI) indicate that the counter is in oversold territory. Therefore it is very likely to rebound from current levels for a new leg of the up move in the coming horizon.\"\n  },\n  {\n    \"question\": \"Which stock has given a breakout of an Ascending Triangle on the upside indicating a continuation in the uptrend?\",\n    \"answer\": \"On a weekly timeframe EID Parry has given a breakout of an Ascending Triangle on the upside indicating a continuation in the uptrend.\",\n    \"context\": \"On a weekly timeframe EID Parry has given a breakout of an Ascending Triangle on the upside indicating a continuation in the uptrend. The spurt in volume during the breakout indicates buyers' interest. The price has taken support at the 50 EMA and moved upward indicating an up move in the security. The momentum indicator RSI after cooling off has started moving in the northern direction supporting the price action.\"\n  },\n  {\n    \"question\": \"Which stock has given a breakout of the Double Bottom pattern signaling a change in trend (i.e. positive)?\",\n    \"answer\": \"Page Industries has given a breakout of the Double Bottom pattern signaling a change in trend (i.e. positive).\",\n    \"context\": \"Page Industries has given a breakout of the Double Bottom pattern signaling a change in trend (i.e. positive). The increase in volume during the buying days and fall in volume during selling days indicates accumulation in the security. Volume increasing during the breakout indicates that buyers are purchasing the security at CMP and are expecting an upward move. The price is trading above the 21 EMA indicating an uptrend in the security. The momentum indicator RSI trading in a higher range also indicates an uptrend in the security.\"\n  }\n]",
    "[\n  {\n    \"question\": \"Which companies are expected to release their quarterly earnings scorecard on May 30?\",\n    \"answer\": \"Nearly 900 companies will release their quarterly earnings scorecard on May 30 including Apollo Hospitals Enterprise Bharat Dynamics Concord Drugs Gateway Distriparks Godfrey Phillips India Hinduja Global Solutions Lux Industries Marksans Pharma Muthoot Finance Plaza Wires Salasar Techno Engineering Sunteck Realty Suven Pharmaceuticals Swan Energy Tarsons Products TBO Tek and Welspun Corp.\",\n    \"context\": \"Earnings Expected on Thursday\\nNearly 900 companies will release their quarterly earnings scorecard on May 30 including Apollo Hospitals Enterprise Bharat Dynamics Concord Drugs Gateway Distriparks Godfrey Phillips India Hinduja Global Solutions Lux Industries Marksans Pharma Muthoot Finance Plaza Wires Salasar Techno Engineering Sunteck Realty Suven Pharmaceuticals Swan Energy Tarsons Products TBO Tek and Welspun Corp.\"\n  },\n  {\n    \"question\": \"What was the profit of Tata Steel in Q4?\",\n    \"answer\": \"In Q4, Tata Steel's profit plunged 64.6% to Rs 554.6 crore from Rs 1566.2 crore in the previous year.\",\n    \"context\": \"Earnings Announced Post Market Hours on May 29\\nTata Steel Q4 (Consolidated YoY)\\nProfit plunges 64.6  to Rs 554.6 crore Vs Rs 1566.2 crore\"\n  },\n  {\n    \"question\": \"What is the dividend announced by Tata Steel's board?\",\n    \"answer\": \"Tata Steel's board announced a dividend of Rs 3.60 per share.\",\n    \"context\": \"Earnings Announced Post Market Hours on May 29\\nTata Steel Q4 (Consolidated YoY)\\n...Board announces dividend of Rs 3.60 per share\"\n  },\n  {\n    \"question\": \"How much revenue did Cummins India generate in Q4?\",\n    \"answer\": \"In Q4, Cummins India generated a revenue of Rs 2319 crore, a 20% increase from Rs 1933.9 crore in the previous year.\",\n    \"context\": \"Earnings Announced Post Market Hours on May 29\\nCummins India Q4 (Consolidated YoY)\\n...Revenue grows 20  to Rs 2319 crore Vs Rs 1933.9 crore\"\n  },\n  {\n    \"question\": \"Did NOCIL's other income increase or decrease in Q4?\",\n    \"answer\": \"In Q4, NOCIL's other income increased significantly from Rs 2.94 crore to Rs 24.7 crore.\",\n    \"context\": \"Earnings Announced Post Market Hours on May 29\\nNOCIL Q4 (Consolidated YoY)\\n...Other income zooms to Rs 24.7 crore Vs Rs 2.94 crore\"\n  },\n  {\n    \"question\": \"What was the profit of Lemon Tree Hotels in Q4?\",\n    \"answer\": \"Lemon Tree Hotels' profit surged by 42.3% to Rs 84 crore in Q4, compared to Rs 59 crore in the previous year.\",\n    \"context\": \"Earnings Announced Post Market Hours on May 29\\nLemon Tree Hotels Q4 (Consolidated YoY)\\nProfit surges 42.3  to Rs 84 crore Vs Rs 59 crore\"\n  },\n  {\n    \"question\": \"How much net loss did GMR Airports Infrastructure report in Q4?\",\n    \"answer\": \"In Q4, GMR Airports Infrastructure reported a net loss of Rs 167.6 crore, which was narrower than the loss of Rs 638.9 crore in the previous year.\",\n    \"context\": \"Earnings Announced Post Market Hours on May 29\\nGMR Airports Infrastructure Q4 (Consolidated YoY)\\nNet loss narrows to Rs 167.6 crore Vs loss of Rs 638.9 crore\"\n  },\n  {\n    \"question\": \"Did Bata India's revenue increase or decrease in Q4?\",\n    \"answer\": \"Bata India's revenue increased by 2.5% to Rs 797.9 crore in Q4, compared to Rs 778.6 crore in the previous year.\",\n    \"context\": \"Earnings Announced Post Market Hours on May 29\\nBata India Q4 (Consolidated YoY)\\n...Revenue rises 2.5  to Rs 797.9 crore Vs Rs 778.6 crore\"\n  }\n]",
    "[\n  {\n    \"question\": \"Which companies are expected to announce their earnings on Tuesday?\",\n    \"answer\": \"440 companies, including Engineers India, Aditya Birla Fashion and Retail, and Amara Raja Energy Mobility, are expected to announce their March quarter earnings on Tuesday.\",\n    \"context\": \"Earnings Expected on TuesdayEngineers India Aditya Birla Fashion and Retail Amara Raja Energy   Mobility Aster DM Healthcare Campus Activewear EIH Exicom TeleSystems General Insurance Corporation of India Hindware Home Innovation Indian Railway Catering and Tourism Corporation Medplus Health Services MTAR Technologies NBCC (India) Apeejay Surrendra Park Hotels Prestige Estates Projects RITES R R Kabel and Wockhardt are among the 440 companies set to announce their March quarter earnings on Tuesday.\"\n  },\n  {\n    \"question\": \"What was the profit reported by Life Insurance Corporation of India (LIC) in Q4?\",\n    \"answer\": \"LIC reported a profit of Rs 13781.6 crore in Q4, a 4.5% increase from the Rs 13190.8 crore reported in the same period last year.\",\n    \"context\": \"Earnings Announced Post Market Hours on May 27Life Insurance Corporation of India Q4 (Consolidated YoY)Profit increases 4.5  to Rs 13781.6 crore Vs Rs 13190.8 croreNet premium income jumps 15.5  to Rs 152767.3 crore Vs Rs 132223.2 croreOther income surges multifold to Rs 14164 crore Vs Rs 484.8 croreNet commission falls 2.2  to Rs 8273 crore Vs Rs 8460 croreLIC announces final dividend of Rs 6 per share for FY24\"\n  },\n  {\n    \"question\": \"Did Dish TV India report a profit or loss in Q4?\",\n    \"answer\": \"Dish TV India reported a net loss of Rs 1989.7 crore in Q4, which widened from the loss of Rs 1720.6 crore reported in the same period last year.\",\n    \"context\": \"Dish TV India Q4 (Consolidated YoY)Net loss widens to Rs 1989.7 crore Vs loss of Rs 1720.6 croreRevenue falls 19.4  to Rs 407 crore Vs Rs 504.8 croreExceptional loss at Rs 402.7 crore Vs loss at Rs 1907.61 crore\"\n  },\n  {\n    \"question\": \"What was the profit reported by Elgi Equipments in Q4?\",\n    \"answer\": \"Elgi Equipments reported a profit of Rs 76.2 crore in Q4, a 55.2% decline from the Rs 170.1 crore reported in the same period last year.\",\n    \"context\": \"Elgi Equipments Q4 (Consolidated YoY)Profit sinks 55.2  to Rs 76.2 crore Vs Rs 170.1 croreRevenue rises 3.6  to Rs 865.9 crore Vs Rs 835.7 croreExceptional item at Nil Vs loss at Rs 105.4 crore\"\n  },\n  {\n    \"question\": \"Did Timken India's parent entity Timken Singapore sell its stake in the company?\",\n    \"answer\": \"Yes, Timken Singapore is looking to sell a 6.6% stake worth Rs 1775 crore in Timken India.\",\n    \"context\": \"Timken IndiaParent entity Timken Singapore is looking to sell a 6.6  stake worth Rs 1775 crore in Timken India according to CNBCTV18 sources. The share sale is expected to have a floor price of Rs 3550 per share which represents a 10.2  discount to Monday s closing price.\"\n  },\n  {\n    \"question\": \"What action did the Reserve Bank of India (RBI) take against ICICI Bank?\",\n    \"answer\": \"The RBI imposed a monetary penalty of Rs 1 crore on ICICI Bank for noncompliance with RBI directions on Loans and Advances   Statutory and Other Restrictions.\",\n    \"context\": \"ICICI BankThe Reserve Bank of India (RBI) has imposed a monetary penalty of Rs 1 crore on ICICI Bank for noncompliance with RBI directions on Loans and Advances   Statutory and Other Restrictions.\"\n  },\n  {\n    \"question\": \"What percentage of shares did Amara Partners Growth Fund I acquire in Lumax Auto Technologies?\",\n    \"answer\": \"Amara Partners Growth Fund I acquired 0.89% of the paid-up equity in Lumax Auto Technologies, which is equivalent to 6.06 lakh equity shares.\",\n    \"context\": \"Lumax Auto TechnologiesAmara Partners Growth Fund I acquired 6.06 lakh equity shares (equivalent to 0.89  of the paidup equity in the company) at an average price of Rs 478 per share via open market transactions. Foreign portfolio investor Albula Investment Fund was the seller in this deal.\"\n  },\n  {\n    \"question\": \"Which private equity firm purchased additional shares in Nazara Technologies?\",\n    \"answer\": \"Plutus Wealth Management LLP purchased an additional 48.84 lakh equity shares in Nazara at an average price of Rs 620.5 per share.\",\n    \"context\": \"Nazara TechnologiesPlutus Wealth Management LLP purchased an additional 48.84 lakh equity shares (equivalent to 6.38  of paidup equity) in Nazara at an average price of Rs 620.5 per share. Plutus held a 6.63  stake in the company as of March 2024. Promoter Mitter Infotech LLP was the seller in this deal.\"\n  }\n]",
    "```\n[\n  {\n    \"question\": \"What was the amount of monetary penalty imposed on ICICI Bank by RBI?\",\n    \"answer\": \"Rs 1 crore\",\n    \"context\": \"The central bank imposed Rs 1crore penalty on ICICI Bank and Rs 91 lakh on YES Bank according to a press release.\"\n  },\n  {\n    \"question\": \"What was the reason for the monetary penalty imposed on ICICI Bank?\",\n    \"answer\": \"Sanctioning term loan(s) to certain entities in lieu of or to substitute budgetary resources envisaged for certain projects and without undertaking due diligence on the viability and bankability of the projects to ensure that revenue streams from the projects were sufficient to take care of the debt servicing obligations.\",\n    \"context\": \"The monetary penalty on ICICI Bank was imposed as it had sanctioned term loan(s) to certain entities in lieu of or to substitute budgetary resources envisaged for certain projects and without undertaking due diligence on the viability and bankability of the projects to ensure that revenue streams from the projects were sufficient to take care of the debt servicing obligations release said.\"\n  },\n  {\n    \"question\": \"What was the reason for the monetary penalty imposed on YES Bank?\",\n    \"answer\": \"Levying charges for non-maintenance of minimum balance in certain savings accounts having insufficient zero balance and opened and operated certain internal accounts in the name of its customers for unauthorized purposes like parking funds and routing customer transactions\",\n    \"context\": \"Penalty on YES Bank was imposed as bank had levied charges for nonmaintenance of minimum balance in certain savings accounts having insufficient zero balance and opened and operated certain internal accounts in the name of its customers for unauthorized purposes like parking funds and routing customer transactions the RBI said.\"\n  },\n  {\n    \"question\": \"When did the Reserve Bank of India (RBI) impose the monetary penalties?\",\n    \"answer\": \"May 27th\",\n    \"context\": \"The Reserve Bank of India (RBI) on May 27 said it has imposed monetary penalty on ICICI Bank and YES Bank for rule violations.\"\n  },\n  {\n    \"question\": \"What is the full form of RBI?\",\n    \"answer\": \"Reserve Bank of India\",\n    \"context\": \"The Reserve Bank of India (RBI) on May 27 said it has imposed monetary penalty on ICICI Bank and YES Bank for rule violations.\"\n  },\n  {\n    \"question\": \"What type of projects was ICICI Bank not undertaking due diligence on?\",\n    \"answer\": \"Projects where the revenue streams were not sufficient to take care of the debt servicing obligations.\",\n    \"context\": \"The monetary penalty on ICICI Bank was imposed as it had sanctioned term loan(s) to certain entities in lieu of or to substitute budgetary resources envisaged for certain projects and without undertaking due diligence on the viability and bankability of the projects to ensure that revenue streams from the projects were sufficient to take care of the debt servicing obligations release said.\"\n  },\n  {\n    \"question\": \"What was the purpose of the unauthorized internal accounts opened by YES Bank?\",\n    \"answer\": \"Parking funds and routing customer transactions.\",\n    \"context\": \"Penalty on YES Bank was imposed as bank had levied charges for nonmaintenance of minimum balance in certain savings accounts having insufficient zero balance and opened and operated certain internal accounts in the name of its customers for unauthorized purposes like parking funds and routing customer transactions the RBI said.\"\n  },\n  {\n    \"question\": \"What is the name of the CEO of ICICI Bank?\",\n    \"answer\": \"This question cannot be answered from the given context.\",\n    \"context\": \"The provided context does not mention the name of the CEO of ICICI Bank.\"\n  }\n]\n```\"\n    }\n]\n",
    "```python\n[\n    {\n        \"question\": \"Why did ICICI Bank's shares drop on May 22?\",\n        \"answer\": \"ICICI Bank's shares fell over 1 percent on May 22 after the bank issued 6.5 lakh equity shares under its employee stock option plan (ESOP).\",\n        \"context\": \"Shares of ICICI Bank fell over 1 percent to Rs 1108 per share on May 22 after the bank allotted 6.5 lakh equity shares of face value of Rs 2 each under the employee stock option plan (ESOP).\"\n    },\n    {\n        \"question\": \"How has ICICI Bank's stock performed this year compared to the Nifty 50 index?\",\n        \"answer\": \"ICICI Bank's stock has surged over 11 percent this year, outperforming the benchmark Nifty 50 index, which rose by 3 percent.\",\n        \"context\": \"So far this year the stock of this private sector lender has surged over 11 percent outperforming a 3 percent rise in the benchmark Nifty 50 index.\"\n    },\n    {\n        \"question\": \"What was the 52-week high for ICICI Bank's shares?\",\n        \"answer\": \"ICICI Bank's shares hit a 52-week high of Rs 1169 per share on April 30, 2024.\",\n        \"context\": \"Earlier ICICI Bank shares had hit 52week high of Rs 1169 per share on April 30 2024.\"\n    },\n    {\n        \"question\": \"Who is replacing Anish Madhavan as ICICI Bank's Group Chief Internal Auditor?\",\n        \"answer\": \"Rajendra Khandelwal has been appointed as the new Group Chief Internal Auditor and senior management personnel at ICICI Bank, effective June 1, 2024.\",\n        \"context\": \"ICICI Bank also approved appointment of Rajendra Khandelwal as the Group Chief Internal Auditor and senior management personnel effective June 1 2024. Khandelwal will replace Anish Madhavan whose term as GCIA is due for completion on May 31 2024.\"\n    },\n    {\n        \"question\": \"What is Rajendra Khandelwal's experience in banking and finance?\",\n        \"answer\": \"Rajendra Khandelwal brings 29 years of experience in banking and finance to his new role at ICICI Bank.\",\n        \"context\": \"With 29 years of banking and finance experience Khandelwal handled significant responsibilities in the areas of taxation wholesale banking planning operating expense management and accounts ICICI Bank said in an exchange filing.\"\n    },\n    {\n        \"question\": \"What was ICICI Bank's year-on-year net profit growth in the January-March quarter?\",\n        \"answer\": \"ICICI Bank recorded an 18.5 percent year-on-year increase in net profit to Rs 11672 crore in the January-March quarter (Q4FY24).\",\n        \"context\": \"Earlier ICICI Bank had clocked an 18.5 percent yearonyear (YoY) rise in net profit to Rs 11672 crore in the JanuaryMarch quarter (Q4FY24) while net interest income increased by 8.1 percent YoY to Rs 19093 crore.\"\n    },\n    {\n        \"question\": \"What is JM Financial's rating on ICICI Bank's stock?\",\n        \"answer\": \"JM Financial has reiterated a 'buy' rating on ICICI Bank's stock with a target price of Rs 1330 per share.\",\n        \"context\": \"Following its Q4 results brokerages maintained their bullish view on ICICI Bank. JM Financial reiterated its  buy  rating on the stock with its target price of Rs 1330 per share. They believe that the lender is poised to achieve an average return on asset (RoA) of 2.3 percent and return on equity (RoE) of 18.5 percent over FY25 26.\"\n    },\n    {\n        \"question\": \"What is JP Morgan's stance and target price for ICICI Bank?\",\n        \"answer\": \"JP Morgan has maintained an 'overweight' stance on ICICI Bank with a target price of Rs 1300 per share.\",\n        \"context\": \"Similarly CLSA has upheld its  buy  rating and raised the target price to Rs 1350 per share while JP Morgan maintained its  overweight  stance on ICICI Bank with a target price of Rs 1300 per share.\"\"\n    }\n]\n",
    "```python\n[\n    {\n        \"question\": \"What were the concerns raised by ICICI Securities' minority shareholders regarding the company's delisting?\",\n        \"answer\": \"Minority shareholders of ICICI Securities, led by Manu Rishi Gupta, raised concerns about potential breaches of shareholder privacy and manipulation of the voting process during the company's delisting in favor of merging with ICICI Bank.\",\n        \"context\": \"The ICICI Securities delisting saga faced setbacks amidst concerns from minority shareholders regarding potential breaches of shareholder privacy and manipulation of the voting process.  Over 100 shareholders, spearheaded by Manu Rishi Gupta, initiated a class-action lawsuit alleging ICICI Securities disclosed confidential shareholder information to ICICI Bank, compromising investor privacy and independence.\"\n    },\n    {\n        \"question\": \"What was the share swap ratio offered by ICICI Bank for the delisting of ICICI Securities?\",\n        \"answer\": \"ICICI Bank offered 67 equity shares of ICICI Bank for every 100 shares of ICICI Securities held by public shareholders.\",\n        \"context\": \"ICICI Bank's board approved the delisting of ICICI Securities on June 29, 2023. The scheme proposed that public shareholders of ICICI Securities would receive 67 equity shares of ICICI Bank for every 100 shares of ICICI Securities they held. This exchange would result in ICICI Securities becoming a wholly-owned subsidiary of ICICI Bank upon delisting.\"\n    },\n    {\n        \"question\": \"Why did some investors express concerns about the valuation of ICICI Securities during the delisting process?\",\n        \"answer\": \"Investors, including Manu Rishi Gupta, raised concerns about the depressed valuation of ICICI Securities during the delisting process. They pointed out that the share price was hovering around its IPO price of Rs 520, significantly lower than its potential value. Gupta highlighted the disparity between the valuation during the IPO in 2018 (30x trailing earnings) and the delisting offer (18x of FY23 earnings), questioning the fairness of the deal.\",\n        \"context\": \"Concerns arose regarding the depressed valuation and share swap ratio offered for ICICI Securities. Market participants and shareholders questioned the fairness of the deal, given the stock's low price relative to its potential.  Minority shareholder Manu Rishi Gupta rallied over 500 shareholders, emphasizing the difference between the company's valuation during its 2018 IPO (30x trailing earnings) and the delisting offer (18x of FY23 earnings).\"\n    },\n    {\n        \"question\": \"Which regulatory bodies gave their approval for the delisting of ICICI Securities?\",\n        \"answer\": \"The Reserve Bank of India (RBI), the Bombay Stock Exchange (BSE), and the National Stock Exchange of India (NSE) all gave their approval for the delisting of ICICI Securities.\",\n        \"context\": \"ICICI Bank received regulatory approvals for the delisting of ICICI Securities. The RBI granted its nod on November 9, 2023, subject to certain conditions. Subsequently, both the BSE and NSE issued 'no objection' letters for the delisting of ICICI Securities shares on November 29, 2023.\"\n    },\n    {\n        \"question\": \"When did ICICI Securities shareholders first publicly voice their concerns about the delisting?\",\n        \"answer\": \"ICICI Securities shareholders first publicly voiced their concerns regarding the delisting on January 16, 2024, during a post-earnings analyst conference call. They specifically expressed concerns about the proposed swap ratio and advocated for the company to remain listed.\",\n        \"context\": \"Shareholder discontent became apparent during a post-earnings analyst conference call on January 16, 2024. Investors voiced concerns about the swap ratio and argued for ICICI Securities to remain listed. Despite these concerns, ICICI Bank received NCLT approval for the shareholder voting process on January 18, 2024.\"\n    },\n    {\n        \"question\": \"What was the outcome of the shareholder vote on the delisting of ICICI Securities?\",\n        \"answer\": \"Despite resistance from retail investors, the delisting of ICICI Securities was approved on March 28, 2024, with 71.89 percent of votes cast in favor of the merger with ICICI Bank.\",\n        \"context\": \"The delisting of ICICI Securities was ultimately approved on March 28, 2024, with 71.89% of shareholder votes supporting the merger with ICICI Bank. This approval came despite resistance from retail investors and ongoing concerns about potential vote manipulation and breaches of shareholder privacy.\"\n    },\n    {\n        \"question\": \"Which mutual fund houses opposed the delisting\"\n    }\n]\n",
    "[{'question': 'How does ICICI Bank\\'s price-to-earnings (PE) ratio compare to its peers, Kotak Mahindra Bank and HDFC Bank, and the sector\\'s average?',\n  'answer': 'ICICI Bank currently trades at a PE ratio of 17.7X, slightly above Kotak Mahindra Bank\\'s 17.7X and HDFC Bank\\'s 17.1X. However, it remains expensive compared to the sector\\'s average PE ratio of 11.18X.',\n  'context': 'Currently, ICICI Bank trades at 17.7 times its price-to-earnings (PE) ratio, slightly above Kotak Mahindra’s 17.7X PE and HDFC Bank’s 17.1X PE. However, it remains expensive compared to the sector’s mean of 11.18X PE.'},\n {'question': 'What is the rationale behind Bernstein\\'s justification for ICICI Bank\\'s premium valuation compared to its peers?',\n  'answer': 'Bernstein analysts believe that ICICI Bank\\'s premium valuation is justified due to the lender\\'s ability to maintain a healthy Return on Assets (RoA) of 2.36%.',\n  'context': 'Analysts at Bernstein said that this premium valuation enjoyed by ICICI Bank compared to its peers was justified as the lender maintained a healthy RoA of 2.36 percent.'},\n {'question': 'What is JP Morgan\\'s outlook on ICICI Bank\\'s stock and what target price have they set?',\n  'answer': 'JP Morgan has given ICICI Bank an \"overweight\" rating with a target price of Rs 1300. They see further scope for upward rerating due to the bank\\'s better growth prospects.',\n  'context': 'JP Morgan’s analysts see further scope for upward rerating amid better growth prospects. “We believe the valuation is still reasonable at 13X FY26. We upgrade ICICI Bank’s FY25/26 EPS by 4 percent,” the brokerage firm added giving the bank an “overweight” rating and a target price of Rs 1300.'},\n {'question': 'How has ICICI Bank\\'s share price performed this year compared to the benchmark Nifty 50 index?',\n  'answer': 'ICICI Bank\\'s shares have surged over 13% this year, outperforming the benchmark Nifty 50 index, which gained only 1% during the same period.',\n  'context': 'So far this year, ICICI Bank’s shares have surged over 13 percent, outperforming the 1 percent gain in the benchmark Nifty 50 index during the same period.'},\n {'question': 'What is the reason behind analysts maintaining a bullish stance on ICICI Bank?',\n  'answer': 'Analysts have maintained their bullish stance on ICICI Bank due to the bank reporting another strong quarterly show, driven by factors such as sustained growth momentum in advances and deposits, technological prowess, and extensive reach.',\n  'context': 'As ICICI Bank reported another strong quarterly show, brokerages maintained their bullish stance on the lender and raised their target prices. Analysts at Geojit Financial Services put out a “buy” call on ICICI Bank with a target price of Rs 1,274 per share, citing the bank’s sustained growth momentum in advances and deposits driven by its technological prowess and extensive reach.'},\n {'question': 'What factors contribute to ICICI Bank\\'s positive future performance according to Geojit Financial Services?',\n  'answer': 'Geojit Financial Services highlights positive triggers such as healthy asset quality, adequate capitalization, and digital transformation as factors that bode well for ICICI Bank\\'s future performance.',\n  'context': 'Positive triggers such as healthy asset quality, adequate capitalization, and digital transformation augur well for the bank’s future performance,” they wrote in a post-result analysis.'},\n {'question': 'What is Prabhudas Lilladher\\'s target price for ICICI Bank and what are the key drivers for their positive outlook?',\n  'answer': 'Prabhudas Lilladher has set a target price of Rs 1450 per share for ICICI Bank, citing improved balance sheet, increased share of retail and SME loans, reduced loan-to-deposit ratio, and strong liquidity coverage ratio as key drivers for their positive outlook.',\n  'context': 'Prabhudas Lilladher too gave a “buy” call on ICICI Bank given its improved balance sheet and raised the target price to Rs 1,450 per share from Rs 1,300. ICICI Bank’s share of retail and SME loans increased to 75.4 percent in FY24, while its loan-to\"\n    }\n]\n",
    "[\n  {\n    \"question\": \"Who resigned from ICICI Bank on May 10?\",\n    \"answer\": \"Bijith Bhaskar\",\n    \"context\": \"ICICI Bank on May 10 said Bijith Bhaskar who is the head of cards payment solutions ecommerce ecosystem and consumer finance of the company has resigned with effect from May 18.\"\n  },\n  {\n    \"question\": \"What was Bijith Bhaskar's position at ICICI Bank?\",\n    \"answer\": \"Head of cards payment solutions ecommerce ecosystem and consumer finance\",\n    \"context\": \"Bijith Bhaskar who is the head of cards payment solutions ecommerce ecosystem and consumer finance of the company has resigned with effect from May 18.\"\n  },\n  {\n    \"question\": \"When did Bijith Bhaskar resign from ICICI Bank?\",\n    \"answer\": \"May 10\",\n    \"context\": \"ICICI Bank on May 10 said Bijith Bhaskar who is the head of cards payment solutions ecommerce ecosystem and consumer finance of the company has resigned with effect from May 18.\"\n  },\n  {\n    \"question\": \"Why did Bijith Bhaskar resign from ICICI Bank?\",\n    \"answer\": \"Purely for personal reasons and to pursue opportunities outside the bank\",\n    \"context\": \"In his resignation letter Bhaskar said that he was quitting  purely for personal reasons  and to  pursue opportunities outside the bank .\"\n  },\n  {\n    \"question\": \"How long was Bijith Bhaskar associated with ICICI Bank?\",\n    \"answer\": \"21 years\",\n    \"context\": \"He was part of the bank for 21 years according to the filing.\"\n  },\n  {\n    \"question\": \"What data glitch did ICICI Bank recently experience?\",\n    \"answer\": \"17000 newly issued credit cards were linked to incorrect accounts in digital channels\",\n    \"context\": \"Last month the secondlargest private bank in the country admitted to a data glitch that led to the bank s 17000 newlyissued credit cards getting affected.\"\n  },\n  {\n    \"question\": \"Did any misuse occur due to the data glitch at ICICI Bank?\",\n    \"answer\": \"No\",\n    \"context\": \"The bank however assured that the mistake was soon rectified and there was no reported case of misuse.\"\n  },\n  {\n    \"question\": \"What is the current status of the data glitch at ICICI Bank?\",\n    \"answer\": \"The mistake was soon rectified\",\n    \"context\": \"The bank however assured that the mistake was soon rectified and there was no reported case of misuse.\"\n  }\n]",
    "```\n[\n  {\n    \"question\": \"What banks have their ratings affirmed by Fitch Ratings?\",\n    \"answer\": \"Fitch Ratings has affirmed the ratings of Axis Bank and ICICI Bank.\",\n    \"context\": \"Fitch Ratings on Thursday affirmed the ratings of Axis Bank and ICICI Bank with a stable outlook citing supportive operating environment and large domestic franchise.\"\n  },\n  {\n    \"question\": \"What is the Long-Term Issuer Default Rating (IDR) for Axis Bank and ICICI Bank?\",\n    \"answer\": \"IDR at BB\",\n    \"context\": \"Fitch Ratings has affirmed Indiabased Axis Bank and ICICI Bank s LongTerm Issuer Default Rating (IDR) at  BB   the global agency said in two separate rating commentaries.\"\n  },\n  {\n    \"question\": \"What is the Government Support Rating (GSR) for Axis Bank and ICICI Bank?\",\n    \"answer\": \"GSR at bb\",\n    \"context\": \"Fitch has also affirmed the banks  Government Support Rating (GSR) at  bb   and Viability Rating (VR) at  bb .\"\n  },\n  {\n    \"question\": \"What is the Viability Rating (VR) for Axis Bank and ICICI Bank?\",\n    \"answer\": \"VR at bb\",\n    \"context\": \"Fitch has also affirmed the banks  Government Support Rating (GSR) at  bb   and Viability Rating (VR) at  bb .\"\n  },\n  {\n    \"question\": \"What is the expectation for support from the government for Axis Bank and ICICI Bank?\",\n    \"answer\": \"Expectation of a moderate probability of extraordinary state support from the government relative to large state banks.\",\n    \"context\": \"Fitch said its IDR ratings reflect expectation of a moderate probability of extraordinary state support from the government relative to large state banks.\"\n  },\n  {\n    \"question\": \"What is the expected GDP growth for India in 2024 and 2025?\",\n    \"answer\": \"7 per cent in 2024 and 6.5 per cent in 2025\",\n    \"context\": \"Fitch expects GDP growth of 7 per cent in 2024 and 6.5 per cent in 2025 supported by investment prospects.\"\n  },\n  {\n    \"question\": \"What is the outlook for Axis Bank's earnings and profitability?\",\n    \"answer\": \"The outlook is stable.\",\n    \"context\": \"We have revised the outlook on Axis  earnings and profitability score to stable from positive as we do not see a significant further upside to the core metric from current levels despite remaining high relative to the years before FY23  it added.\"\n  },\n  {\n    \"question\": \"What is the outlook for ICICI Bank's earnings and profitability?\",\n    \"answer\": \"The outlook is positive.\",\n    \"context\": \"On ICICI Bank Fitch said it maintains a positive outlook on its earnings and profitability score as it expects profitability to remain elevated relative to prior years.\"\n  }\n]\n```\"\n    }\n]\n",
    "[\n  {\n    \"question\": \"What was ICICI Bank's net interest income (NII) growth in Q4FY24?\",\n    \"answer\": \"ICICI Bank's NII grew by 8.1% YoY and 2.2% QoQ to INR 190928 Mn in Q4FY24.\",\n    \"context\": \"Net interest income (NII) grew 8.1%  YoY ( 2.2%  QoQ) to INR 190928 Mn in Q4FY24.\"\n  },\n  {\n    \"question\": \"How did ICICI Bank's Pre-Provision Operating Profit (PPOP) perform in Q4FY24?\",\n    \"answer\": \"ICICI Bank's PPOP grew by 8.8% YoY and 2.1% QoQ to INR 150388 Mn in Q4FY24.\",\n    \"context\": \"PreProvision Operating Profit (PPOP) for Q4FY24 grew 8.8%  YoY ( 2.1%  QoQ) to INR 150388 Mn.\"\n  },\n  {\n    \"question\": \"What was the primary reason for ICICI Bank's profit after tax growth in Q4FY24?\",\n    \"answer\": \"ICICI Bank's profit after tax grew by 17.4% YoY and 4.2% QoQ to INR 107075 Mn in Q4FY24, primarily due to lower provisions.\",\n    \"context\": \"The profit after tax surged by 17.4%  YoY ( 4.2%  QoQ) to INR 107075 Mn in Q4FY24 on account of lower provisions.\"\n  },\n  {\n    \"question\": \"Did ICICI Bank's net profit exceed analysts' estimates in Q4FY24?\",\n    \"answer\": \"Yes, ICICI Bank's net profit was 2.0% higher than analysts' estimates in Q4FY24, driven by slightly lower-than-expected provisions.\",\n    \"context\": \"Net profit was 2.0%  higher than our estimates led by slightly lowerthanexpected provisions.\"\n  },\n  {\n    \"question\": \"What adjustments have been made to ICICI Bank's FY26E profit estimates?\",\n    \"answer\": \"ICICI Bank's FY26E profit estimates have been slightly cut by 3.4%, factoring in slightly higher operating costs related to the Bank's continued investment in branches and technology.\",\n    \"context\": \"We have slightly cut our FY26E profit estimates by 3.4%  factoring in slightly higher operating costs given the Bank s continued investment in branches and technology.\"\n  },\n  {\n    \"question\": \"What P/ABV multiple has KR Choksey applied to ICICI Bank's FY26E ABV?\",\n    \"answer\": \"KR Choksey has applied a P/ABV multiple of 2.5x to ICICI Bank's FY26E ABV of INR 475.9 per share.\",\n    \"context\": \"We have applied a P ABV multiple of 2.5x (earlier 2.3x) to the FY26E ABV of INR 475.9 per share\"\n  },\n  {\n    \"question\": \"What is the implied SOTP valuation for ICICI Bank based on KR Choksey's analysis?\",\n    \"answer\": \"Based on KR Choksey's analysis, the implied SOTP valuation for ICICI Bank is INR 1355 per share, implying a potential upside of 18.2%.\",\n    \"context\": \"implying a SOTP valuation of INR 1355 per share (earlier INR 1250) implying a potential upside of 18.2 .\"\n  },\n  {\n    \"question\": \"What is KR Choksey's recommendation for ICICI Bank shares?\",\n    \"answer\": \"KR Choksey maintains a 'BUY' rating on ICICI Bank shares.\",\n    \"context\": \"Accordingly we maintain our  BUY  rating on ICICI Bank s shares.\"\n  }\n]",
    "```python\n[\n    {\n        \"question\": \"What is SEBI investigating regarding ICICI Bank and ICICI Securities?\",\n        \"answer\": \"SEBI is investigating allegations that ICICI Bank employees contacted ICICI Securities shareholders in an attempt to influence their votes on a delisting proposal.\",\n        \"context\": \"The Securities and Exchange Board of India (SEBI) is investigating allegations of ICICI Bank employees contacting ICICI Securities shareholders in an attempt to influence them before a vote on a delisting proposal in March, Mint reported. This involved a proposed delisting of ICICI Securities and its merger with its parent company, ICICI Bank.\"\n    },\n    {\n        \"question\": \"How did ICICI Securities shareholders respond to the alleged actions of ICICI Bank?\",\n        \"answer\": \"Over 500 ICICI Securities shareholders filed complaints with SEBI alleging that ICICI Bank employees contacted them to influence their votes on the delisting proposal.\",\n        \"context\": \"Over 500 shareholders of ICICI Securities had collaborated through WhatsApp and social media to file numerous complaints with SEBI. These complaints alleged that ICICI Bank employees had contacted them in an attempt to influence their vote in favor of the delisting and merger.\"\n    },\n    {\n        \"question\": \"What concerns did Manu Rishi Guptha raise regarding ICICI Bank's actions?\",\n        \"answer\": \"Manu Rishi Guptha, a minority shareholder in ICICI Securities, alleged that ICICI Bank and ICICI Securities reached out to retail shareholders to persuade them to vote in favor of the merger. He also expressed concerns about data privacy breaches as ICICI Bank, not ICICI Securities, made the calls, implying data sharing.\",\n        \"context\": \"Manu Rishi Guptha, a Bengaluru-based fund manager and a minority shareholder in ICICI Securities, stated that both ICICI Securities and ICICI Bank had been reaching out to retail shareholders of the former, persuading them to vote in favor of the merger scheme. He highlighted that these actions potentially led to minority shareholder data being compromised. Since the calls were made by ICICI Bank and not by ICICI Securities, it implies that shareholder details were shared with the parent company.\"\n    },\n    {\n        \"question\": \"How many complaints did ICICI Securities' minority investors file with SEBI?\",\n        \"answer\": \"Minority investors of ICICI Securities filed 6,070 complaints with SEBI, primarily concerning data privacy breaches and the valuation of the company for delisting.\",\n        \"context\": \"Guptha stated that minority investors of ICICI Securities had filed 6,070 complaints with SEBI, including complaints on the SCORES platform, SEBI's online platform for filing grievances. The primary accusations in these grievances involved the breach of data privacy concerning ICICI Securities' shareholders and the valuation at which the company was slated for delisting.\"\n    },\n    {\n        \"question\": \"What was ICICI Bank's response to the allegations of influencing shareholder votes?\",\n        \"answer\": \"ICICI Bank clarified that their outreach program aimed to encourage higher voting participation, not influence decision-making. However, Quantum MF labeled this clarification as a 'smokescreen' to hide 'malicious' intentions.\",\n        \"context\": \"In response to the stock exchanges, ICICI Bank clarified that the 'outreach program' aimed to encourage higher participation in voting rather than influence decision-making. However, Quantum MF, another stakeholder, labeled this clarification as a 'smokescreen' and an effort to conceal the 'malicious' intentions of ICICI Securities.\"\n    },\n    {\n        \"question\": \"What was the outcome of the shareholder vote on the delisting of ICICI Securities?\",\n        \"answer\": \"Minority shareholders voted in favor of delisting ICICI Securities, leading to a complete merger with ICICI Bank.\",\n        \"context\": \"On March 27, minority shareholders voted in favor of delisting ICICI Securities to wholly merge the entity with its parent, ICICI Bank. Following the merger, the bank now holds a 74.73 percent stake in the brokerage firm, with public shareholders owning the remaining shares.\"\n    },\n    {\n        \"question\": \"What were the concerns regarding the valuation of ICICI Securities for delisting?\",\n        \"answer\": \"Several retail shareholders objected to the proposed valuation for delisting. According to the plan, ICICI Securities shareholders were to receive 67 shares of ICICI Bank for every 100 shares they held in the brokerage firm, a valuation that some shareholders deemed unfair.\",\n        \"context\": \"Several retail shareholders, collectively owning approximately 6 percent of the company, voiced objections regarding the valuation at which the delisting was proposed. According to the plan, shareholders of ICICI Securities were to receive 67 shares of ICICI Bank for every 100\"\n    }\n]\n",
    "```python\n[\n    {\n        \"question\": \"How has ICICI Bank improved the payment experience for its NRI customers?\",\n        \"answer\": \"ICICI Bank has enabled instant payments through UPI for its NRI customers using their international mobile numbers, making it easier for them to manage everyday transactions.\",\n        \"context\": \"ICICI Bank recognized the challenges faced by their NRI customers who had to rely on Indian mobile numbers for UPI payments. To simplify this process, they introduced a feature allowing NRI customers to link their international mobile numbers directly to their NRE/NRO accounts. This eliminates the need for an Indian SIM card, providing greater convenience and accessibility for NRIs to manage their finances and make payments while abroad.\"\n    },\n    {\n        \"question\": \"What specific transactions can ICICI Bank's NRI customers perform using their international mobile numbers?\",\n        \"answer\": \"NRI customers of ICICI Bank can utilize their international mobile numbers for various payments, including utility bills, merchant transactions, and e-commerce purchases. This streamlined approach simplifies their financial interactions within India.\",\n        \"context\": \"ICICI Bank aimed to provide a comprehensive solution for NRI customers, enabling them to conduct a wide range of transactions seamlessly. By linking their international mobile numbers, NRIs can conveniently handle essential payments such as utilities, merchant purchases, and online shopping. This eliminates the need for multiple payment methods or reliance on others, empowering NRIs with greater financial independence.\"\n    },\n    {\n        \"question\": \"Which countries can ICICI Bank's NRI customers avail this new UPI facility from?\",\n        \"answer\": \"ICICI Bank's new UPI facility with international mobile numbers is available to NRI customers residing in 10 countries: USA, UK, UAE, Canada, Singapore, Australia, Hong Kong, Oman, Qatar, and Saudi Arabia.\",\n        \"context\": \"ICICI Bank's decision to initially roll out this facility across these 10 countries was strategically driven by the significant concentration of their NRI customer base within these regions. This phased approach allows the bank to effectively cater to a large segment of their NRI customers while ensuring the smooth implementation and adoption of this new payment method.\" \n    },\n    {\n        \"question\": \"What is the name of ICICI Bank's mobile banking app that facilitates this new UPI payment feature?\",\n        \"answer\": \"This UPI payment feature for NRI customers using international mobile numbers is available through ICICI Bank's mobile banking app called 'iMobile Pay'.\",\n        \"context\": \"ICICI Bank integrated this new feature into their existing mobile banking app, 'iMobile Pay,' for a seamless and user-friendly experience. This strategic integration allows NRI customers to access this functionality alongside the app's existing range of banking services, providing a centralized platform for their financial needs without the need to download an additional application.\" \n    },\n    {\n        \"question\": \"What was the previous process for NRIs to make UPI payments before this update by ICICI Bank?\",\n        \"answer\": \"Before this update by ICICI Bank, NRI customers were required to register an Indian mobile number with their bank accounts to make UPI payments, which often posed logistical challenges.\",\n        \"context\": \"Prior to this update, the requirement for an Indian mobile number to access UPI payments posed a significant hurdle for NRI customers. They often had to rely on family members or friends in India to use their mobile numbers or obtain a new SIM card during visits, leading to inconvenience and security concerns. ICICI Bank's initiative directly addresses this challenge, simplifying the process and enhancing security for NRI customers.\"\n    },\n    {\n        \"question\": \"How does ICICI Bank's new feature benefit NRIs beyond convenience?\",\n        \"answer\": \"Apart from convenience, ICICI Bank's new feature eliminates the need for NRIs to switch SIM cards when they visit India, making their banking experience smoother.\",\n        \"context\": \"Previously, NRI customers visiting India often faced the hassle of switching between their international and Indian SIM cards to manage transactions and access banking services. This process not only caused inconvenience but also raised security concerns related to SIM swapping. By enabling UPI payments through international numbers, ICICI Bank eliminates these issues, allowing for uninterrupted access and enhancing security for NRI customers during their visits.\"\n    },\n    {\n        \"question\": \"Who is the Head of Digital Channels and Partnerships at ICICI Bank, quoted in the context?\",\n        \"answer\": \"Sidharatha Mishra is the Head of Digital Channels and Partnerships at ICICI Bank, as mentioned in the context.\",\n        \"context\": \"Sidharatha Mishra, in his role as Head of Digital Channels and Partnerships at ICICI Bank, plays a pivotal role in driving the bank's digital transformation and enhancing customer experience. His leadership and vision are instrumental in developing and implementing innovative solutions like\"\n    }\n]\n",
    "```\n[\n  {\n    \"question\": \"What does ICICI Bank specialize in?\",\n    \"answer\": \"ICICI Bank specializes in retail and corporate banking, Forex and treasury operations, investment banking, insurance, and financial services.\",\n    \"context\": \"ICICI Bank Ltd operates a network of banks located throughout India. The Group specializes in retail and corporate banking in addition to Forex and treasury operations. ICICI Bank also provides a wide variety of investment banking insurance and financial services to its clients.\"\n  },\n  {\n    \"question\": \"What was ICICI Bank's net interest income (NII) in Q4FY24?\",\n    \"answer\": \"ICICI Bank's net interest income (NII) in Q4FY24 was Rs. 19093cr.\",\n    \"context\": \"In Q4FY24 the bank s net interest income (NII) grew 8.1  YoY to Rs. 19093cr.\"\n  },\n  {\n    \"question\": \"What was ICICI Bank's net interest margin (NIM) in Q4FY24?\",\n    \"answer\": \"ICICI Bank's net interest margin (NIM) in Q4FY24 was 4.4%.\",\n    \"context\": \"Net interest margin (NIM) contracted 50bps YoY to 4.4  due to rising cost of deposits.\"\n  },\n  {\n    \"question\": \"What was ICICI Bank's profit after tax (PAT) in Q4FY24?\",\n    \"answer\": \"ICICI Bank's PAT in Q4FY24 was Rs. 10708cr.\",\n    \"context\": \"PAT for the quarter stood at Rs. 10708cr rising 17.4  YoY due to lower operating expenses and provisions.\"\n  },\n  {\n    \"question\": \"Why did ICICI Bank's PAT increase in Q4FY24?\",\n    \"answer\": \"ICICI Bank's PAT increased in Q4FY24 due to lower operating expenses and provisions.\",\n    \"context\": \"PAT for the quarter stood at Rs. 10708cr rising 17.4  YoY due to lower operating expenses and provisions.\"\n  },\n  {\n    \"question\": \"What is the outlook for ICICI Bank?\",\n    \"answer\": \"The outlook for ICICI Bank is positive, with the company expected to continue its long-term growth prospects.\",\n    \"context\": \"Also with better asset mix and granularisation of deposits the bank has been able to manage NIM well. Therefore we continue to remain optimistic about the company s longterm growth prospects and reiterate our BUY rating on the stock with an SOTPbased target price of Rs. 1274.\"\n  },\n  {\n    \"question\": \"What is the target price for ICICI Bank?\",\n    \"answer\": \"The target price for ICICI Bank is Rs. 1274.\",\n    \"context\": \"Therefore we continue to remain optimistic about the company s longterm growth prospects and reiterate our BUY rating on the stock with an SOTPbased target price of Rs. 1274.\"\n  },\n  {\n    \"question\": \"What type of recommendations report is provided in the article?\",\n    \"answer\": \"The article provides Geojit Financial Services research report on ICICI Bank.\",\n    \"context\": \"Geojit Financial Services research report on ICICI BankICICI Bank Ltd operates a network of banks located throughout India.\"\n  }\n]\n```\"\n    }\n]\n",
    "```python\n[\n    {\n        \"question\": \"How did ICICI Bank's stock price react to the rumor of Managing Director Sandeep Bakhshi's potential exit?\",\n        \"answer\": \"Despite the initial concern, ICICI Bank's stock price experienced only a minor decline of 1 percent, closing at Rs 1139 per share on May 2.\",\n        \"context\": \"The market reacted to the rumor of Sandeep Bakhshi's potential exit from ICICI Bank with concern, as evidenced by the stock's initial response. However, the bank's prompt denial of the rumor, which originated from a report in The Morning Context, helped to mitigate any significant negative impact. As a result, the stock price only experienced a marginal decline of 1 percent, ending the trading day at Rs 1139 per share on May 2.\"\n    },\n    {\n        \"question\": \"What factors contributed to ICICI Bank's impressive stock price growth under Sandeep Bakhshi's leadership?\",\n        \"answer\": \"ICICI Bank's stock price increased fourfold under Bakhshi, driven by restored investor confidence, outpacing SBI in market capitalization, and significant improvements in financial performance.\",\n        \"context\": \"Sandeep Bakhshi's tenure as Managing Director and CEO of ICICI Bank has been marked by a remarkable turnaround in the bank's fortunes. Since taking over from his predecessor, Chandra Kochhar, in October 2018, Bakhshi has successfully steered the bank towards a path of growth and profitability. Under his leadership, ICICI Bank has witnessed a fourfold increase in its stock price, reaching Rs 1152 from a low of Rs 355 in October 2018. This impressive growth is a testament to the restored investor confidence in the bank, fueled by Bakhshi's strategic vision and execution capabilities.  Furthermore, ICICI Bank has managed to outpace its larger counterpart, State Bank of India (SBI), in terms of market capitalization, further underscoring the success of Bakhshi's leadership.\"\n    },\n    {\n        \"question\": \"What were the key challenges faced by ICICI Bank at the time of Sandeep Bakhshi's appointment as MD and CEO?\",\n        \"answer\": \"When Bakhshi took over ICICI Bank in 2018, it was reeling from money laundering allegations against former MD Chandra Kochhar, leading to low investor confidence.\",\n        \"context\": \"Sandeep Bakhshi stepped into the role of Managing Director and CEO of ICICI Bank at a time when the institution was grappling with significant challenges. The bank's reputation had been tarnished by allegations of money laundering against his predecessor, Chandra Kochhar, leading to a crisis of confidence among investors. The bank was in a precarious position, requiring decisive leadership and a clear strategic direction to navigate the turbulent waters.\"\n    },\n    {\n        \"question\": \"How did Sandeep Bakhshi's leadership impact ICICI Bank's market capitalization ranking compared to its peers?\",\n        \"answer\": \"Under Bakhshi, ICICI Bank's market cap surged from Rs 2.01 lakh crore in 2018 to Rs 8.09 lakh crore in 2024, surpassing SBI to become India's second-largest lender after HDFC Bank.\",\n        \"context\": \"Sandeep Bakhshi's tenure at ICICI Bank has been nothing short of transformative, particularly regarding the bank's market capitalization. When he assumed leadership in 2018, ICICI Bank's market cap stood at Rs 2.01 lakh crore. By 2024, under Bakhshi's guidance, this figure had skyrocketed to an impressive Rs 8.09 lakh crore.  This remarkable growth propelled ICICI Bank past State Bank of India (SBI), securing its position as India's second-largest lender by market capitalization, trailing only HDFC Bank.\"\n    },\n    {\n        \"question\": \"What specific measures did Sandeep Bakhshi undertake to improve ICICI Bank's financial health, as highlighted by Jignesh Shial?\",\n        \"answer\": \"According to Jignesh Shial, Bakhshi revitalized ICICI Bank by focusing on expanding retail lending, broadening the bank's geographic reach, enhancing profitability, and effectively managing bad loans.\",\n        \"context\": \"Jignesh Shial, Director of Research and Head of the BFSI Sector at InCred Capital, lauded Sandeep Bakhshi's remarkable contributions to ICICI Bank's resurgence. Shial highlighted Bakhshi's strategic focus on several key areas that have been instrumental in the bank's turnaround. These include revitalizing retail lending operations, strategically expanding the bank's\"\n    }\n]\n",
    "```python\n[\n    {\n        \"question\": \"What did ICICI Bank say about the report claiming CEO Sandeep Bakhshi's desire to step down?\",\n        \"answer\": \"ICICI Bank refuted the report published in The Morning Context as baseless and a figment of imagination. They clarified that Sandeep Bakhshi had not expressed any desire to resign as MD and CEO due to personal reasons.\",\n        \"context\": \"On May 2nd, ICICI Bank firmly denied media reports suggesting that their CEO and MD, Sandeep Bakhshi, wished to resign from his position. The reports, originating from The Morning Context, claimed Bakhshi wanted to step down due to personal emergencies. However, the bank dismissed these claims as entirely unfounded and fabricated, emphasizing their commitment to transparency and stakeholder trust.\"\n    },\n    {\n        \"question\": \"Why did ICICI Bank release a statement on May 2?\",\n        \"answer\": \"ICICI Bank issued a statement to address and deny a report published in The Morning Context that claimed their CEO and MD, Sandeep Bakhshi, wanted to resign due to personal reasons.\",\n        \"context\": \"A report surfaced in The Morning Context on May 2nd alleging that ICICI Bank's CEO and MD, Sandeep Bakhshi, was seeking to relinquish his position due to personal emergencies. The report further claimed that the Reserve Bank of India (RBI) opposed Bakhshi's departure. This prompted ICICI Bank to release a statement categorically denying the report's claims.\"\n    },\n    {\n        \"question\": \"How did ICICI Bank's stock react to the rumors about their CEO on May 2?\",\n        \"answer\": \"ICICI Bank's shares remained relatively stable, trading flat at Rs 1150 as of 9:24 am on May 2, despite the rumors surrounding their CEO's potential resignation.\",\n        \"context\": \"Despite the rumors surrounding CEO Sandeep Bakhshi's potential resignation circulating on May 2nd, ICICI Bank's stock price remained relatively unaffected. Trading activity showed the shares flat at Rs 1150 as of 9:24 am. This suggests that investors were not significantly swayed by the unconfirmed report and maintained confidence in the bank's stability.\"\n    },\n    {\n        \"question\": \"What was the market capitalization milestone achieved by ICICI Bank recently?\",\n        \"answer\": \"ICICI Bank recently became the fifth Indian company, and the second bank in India, to surpass the Rs 8 lakh crore market capitalization mark.\",\n        \"context\": \"In the week preceding May 2nd, ICICI Bank achieved a significant milestone by becoming the fifth Indian company, and only the second bank in the country, to surpass the Rs 8 lakh crore market capitalization mark. This achievement followed a surge in the bank's share price, which rallied by over 4 percent, fueled by strong earnings results.\"\n    },\n    {\n        \"question\": \"What contributed to ICICI Bank exceeding the Rs 8 lakh crore market cap?\",\n        \"answer\": \"ICICI Bank's shares surged by over 4 percent due to their impressive earnings report, propelling the company's market capitalization to exceed Rs 8 lakh crore.\",\n        \"context\": \"ICICI Bank's stock experienced a significant boost, rallying by over 4 percent, in response to the bank's robust earnings report. This surge in share price propelled the company's market capitalization to surpass the Rs 8 lakh crore threshold, marking a significant milestone for the bank and reflecting investor confidence in its financial performance.\"\n    },\n    {\n        \"question\": \"How did ICICI Bank's net profit perform in Q4 FY24?\",\n        \"answer\": \"ICICI Bank reported a net profit of Rs 10,708 crore in Q4 FY24, marking a substantial 20% increase compared to the same period in the previous fiscal year (Q4 FY23).\",\n        \"context\": \"ICICI Bank released its Q4 FY24 earnings report, showcasing impressive financial performance. The bank recorded a net profit of Rs 10,708 crore, representing a significant 20% increase compared to its net profit in Q4 FY23. This growth was attributed to strong loan growth and a decrease in credit costs, despite pressure on profit margins.\"\n    },\n    {\n        \"question\": \"What was the driving force behind ICICI Bank's impressive Q4 FY24 results?\",\n        \"answer\": \"ICICI Bank's strong Q4 FY24 performance was primarily driven by robust growth in advances (loans) and a reduction in credit costs, despite facing some pressure on margins.\",\n        \"context\": \"The key drivers behind ICICI Bank's stellar\"\n    }\n]\n",
    "```\n[\n  {\n    \"question\": \"What is the target price set for ICICI Bank and what is the expected upside potential for YES Bank?\",\n    \"answer\": \"ICICI Bank has a target price of Rs 1280, representing an upside potential of approximately twice the width of the consolidation range. YES Bank has an upside potential of around Rs 41, estimated based on its recent breakout above a long-term resistance level.\",\n    \"context\": \"From a technical standpoint market analysts often observe that the potential movement following a breakout from such consolidation phases could be approximately twice the width of the consolidation range. Applying this principle to ICICI Bank we can reasonably set a target for the stock at around Rs 1280.\\n\\nThe recent price action of YES Bank indicates a significant development in its longterm trend. Based on this technical analysis investors may consider initiating long positions in YES Bank within the price range of Rs 25 to 28. The upside potential for the stock is estimated to be around Rs 41 representing a substantial increase from current levels.\"\n  },\n  {\n    \"question\": \"What is the significance of the Bearish Butterfly pattern in State Bank of India's chart?\",\n    \"answer\": \"The emergence of a Bearish Butterfly pattern near the Rs 835840 zone on the State Bank of India (SBIN) chart typically indicates a potential reversal in the ongoing upside, suggesting a loss of upward momentum.\",\n    \"context\": \"In the case of State Bank of India (SBIN) there has been a notable upward movement amounting to a 100point increase over the past seven trading sessions. This surge translates to a substantial gain of approximately 13 percent to 14 percent. However it s crucial to note the emergence of a Bearish Butterfly pattern near the Rs 835840 zone on the chart. The presence of this pattern typically indicates a potential reversal in the ongoing upside suggesting that the stock s upward momentum might be losing steam.\"\n  },\n  {\n    \"question\": \"What is the recommended trading strategy for ICICI Bank after its recent breakout?\",\n    \"answer\": \"Analysts recommend buying on dips for investors interested in entering or increasing their positions in ICICI Bank, as the stock is expected to continue its bullish momentum.\",\n    \"context\": \"From a technical standpoint market analysts often observe that the potential movement following a breakout from such consolidation phases could be approximately twice the width of the consolidation range. Applying this principle to ICICI Bank we can reasonably set a target for the stock at around Rs 1280. This target reflects the anticipated magnitude of the breakout move beyond the previous range. In light of this bullish outlook a strategy of buying on dips is recommended for investors interested in entering or increasing their positions in ICICI Bank.\"\n  },\n  {\n    \"question\": \"What is the recommended strategy for State Bank of India in light of the Bearish Butterfly pattern?\",\n    \"answer\": \"Investors are advised to book profits on their SBIN positions and adopt a wait-and-watch approach, anticipating a meaningful correction in the stock's price.\",\n    \"context\": \"Given this technical signal investors may consider the prudent strategy of booking profits on their SBIN positions. By doing so they secure gains accrued during the recent bullish phase. Subsequently investors can adopt a waitandwatch approach anticipating a meaningful correction in the stock s price.\"\n  },\n  {\n    \"question\": \"What is the rationale behind the suggested long positions in YES Bank?\",\n    \"answer\": \"The breakout above a long-term resistance level and its subsequent retest confirm a bullish outlook for YES Bank, leading analysts to recommend initiating long positions.\",\n    \"context\": \"The recent price action of YES Bank indicates a significant development in its longterm trend. After enduring a prolonged period of downward pressure symbolised by a bearish trendline that persisted for 3.5 years YES Bank s stock price has managed to break above this formidable resistance level. What s particularly noteworthy is that the stock has not only breached this longstanding bear line but has also retraced to retest it from above. This retest serves as a crucial confirmation that the breakout is indeed genuine strengthening the conviction in the bullish outlook for YES Bank.\"\n  },\n  {\n    \"question\": \"What is the current status and potential outlook for IREDA?\",\n    \"answer\": \"IREDA is facing resistance at the upper boundary of the Bollinger Bands and a bearish candlestick formation, indicating a challenging environment for further upward movement in the immediate term.\",\n    \"context\": \"Currently IREDA (Indian Renewable Energy Development Agency) is encountering significant resistance around the upper boundary of the Bollinger Bands a technical indicator that depicts volatility and potential price levels. This resistance is reinforced by the presence of a bearish candlestick formation which typically suggests selling pressure in the market. The conjunction of these two factors indicates a challenging environment for further upward movement in the stock s price in the immediate term.\"\n  },\n  {\n    \"question\": \"What is the recommended entry point for long positions in IREDA?\",\n    \"answer\": \"Analysts suggest waiting for a pullback in IREDA's price to around Rs 160 before initiating long positions.\",\n    \"context\": \"Consequently it is advisable for investors to exercise patience and await a pullback in the stock s price. This pullback is expected to lead the price down to around the Rs 160 level offering a more favourable entry point for initiating long positions.\"\n  },\n  {\n    \"question\": \"What is the stop-loss level recommended for long positions in YES Bank?\",\n    \"answer\": \"A stop-loss order near Rs 19 on a daily closing basis is suggested for managing risk in YES Bank trades.\",\n    \"context\": \"Based on this technical analysis investors may consider initiating long positions in YES Bank within the price range of Rs 25 to 28. The upside potential for the stock is estimated to be around Rs 41 representing a substantial increase from current levels. However it s important to manage risk effectively in trading or investing. Therefore a prudent approach would involve placing a stoploss order near Rs 19 on a daily closing basis.\"\n  }\n]\n```\"\n    }\n]\n"
]