[
    "[\n  {\n    \"question\": \"What is the cashback being offered by Swiggy and HDFC's cobranded credit card on food delivery and grocery delivery?\",\n    \"answer\": \"10 percent cashback\",\n    \"context\": \"The card offers a hefty 10 percent cashback on food delivery, grocery delivery under Instamart, and its dining-out platform Dineout.\"\n  },\n  {\n    \"question\": \"Which payment platform will host the SwiggyHDFC card?\",\n    \"answer\": \"Mastercard network\",\n    \"context\": \"The card will be hosted on the Mastercard network.\"\n  },\n  {\n    \"question\": \"How does the cashback offered by SwiggyHDFC card compare to other branded credit cards?\",\n    \"answer\": \"Much higher than the usual five percent offered by other brands\",\n    \"context\": \"The cashback offered is much higher than the usual five percent offered by brands for shopping on their own platform.\"\n  },\n  {\n    \"question\": \"What are a few examples of e-commerce platforms that offer cashback through the SwiggyHDFC card?\",\n    \"answer\": \"Amazon, Flipkart, Myntra, Nykaa, Ola, Uber, PharmEasy, NetMeds, BookmyShow and others\",\n    \"context\": \"The card will also offer five percent cashback on shopping across other e-commerce platforms such as Amazon, Flipkart, Myntra, Nykaa, Ola, Uber, PharmEasy, NetMeds, BookmyShow and several others, the statement said.\"\n  },\n  {\n    \"question\": \"What is a major benefit of the SwiggyHDFC card compared to other cobranded cards?\",\n    \"answer\": \"Customers can shop across multiple platforms without losing cashback benefits\",\n    \"context\": \"In fact, with an AmazonICICI credit card, a customer cannot get five percent cashback on Flipkart and vice versa. Hence the Swiggy card makes more sense for anyone who shops across these platforms.\"\n  },\n  {\n    \"question\": \"What is the catch associated with the high cashback rewards offered by the SwiggyHDFC card?\",\n    \"answer\": \"Cashback is given in the form of Swiggy Money, which can only be used on Swiggy\",\n    \"context\": \"However, the only catch being that the cashback will be deposited as Swiggy Money and can be used only on Swiggy.\"\n  },\n  {\n    \"question\": \"How does the cashback redemption process of the SwiggyHDFC card compare to the Amazon ICICI credit card?\",\n    \"answer\": \"Similar to Amazon ICICI credit card, cashback is given as Swiggy Money/Amazon Pay Balance, which can only be used on respective platforms\",\n    \"context\": \"For reference, even the Amazon ICICI credit card offers the cashbacks as Amazon Pay Balance and can be used only on Amazon and its partner merchants.\"\n  },\n  {\n    \"question\": \"What are some of the reasons behind Swiggy's launch of a cobranded credit card?\",\n    \"answer\": \"To cultivate loyalty and drive up usage amidst declining market share\",\n    \"context\": \"The credit card launch and the aggressive cashback offers are happening at a time when Swiggy is gradually losing market share to Zomato and its grocery delivery platform Blinkit.\"\n  }\n]",
    "[\n  {\n    \"question\": \"Who is the managing director and CEO of HDFC Bank?\",\n    \"answer\": \"Sashidhar Jagdishan\",\n    \"context\": \"HDFC Bank's managing director and CEO Sashidhar Jagdishan on July 19 warned managerial level employees of transgression from good working culture saying he is aware of such instances and has the resolve to  nip this in the bud.\"\n  },\n  {\n    \"question\": \"What did HDFC Bank's CEO say about the importance of good working culture?\",\n    \"answer\": \"Managers are uniquely positioned to represent the culture the Bank stands for. Talent Potential and Capabilities can best be harnessed through an enabling culture\",\n    \"context\": \"In his message Jagdishan stressed the importance of good working culture saying that it defines the experience of each employee. Managers are uniquely positioned to represent the culture the Bank stands for. Talent Potential and Capabilities can best be harnessed through an enabling culture  Jagdishan said.\"\n  },\n  {\n    \"question\": \"What initiative has HDFC Bank adopted to promote good managerial behavior?\",\n    \"answer\": \"Nurture Care and Collaborate\",\n    \"context\": \"Towards this aim the bank has adopted the managerial behaviour architecture based on the principles of  Nurture Care and Collaborate  said Jagdishan adding that this should translate into simple behaviours that managers can demonstrate in their interactions with their teams.\"\n  },\n  {\n    \"question\": \"What has been a significant contributor to attrition at HDFC Bank?\",\n    \"answer\": \"Covid\",\n    \"context\": \"Jagdishan attributed Covid as one of the reasons for high attrition that may have prompted the younger workforce to recalibrate what they  want from their lives  the CEO said.\"\n  },\n  {\n    \"question\": \"What was the attrition rate at HDFC Bank in fiscal year 2022-23?\",\n    \"answer\": \"30 percent\",\n    \"context\": \"Earlier in an interaction with the media the bank s chief financial officer Srinivasan Vaidyanathan had said that the lender witnessed a 30 percent employee attrition in the fiscal year 202223.\"\n  },\n  {\n    \"question\": \"What type of products have been reported to be mis-sold by banks?\",\n    \"answer\": \"Life insurance policies\",\n    \"context\": \"Incidents of product misselling have been reported across the banking industry. In the past there have been instances where life insurance policies were sold to customers aged above 75 years in Tier IIIII cities.\"\n  },\n  {\n    \"question\": \"What is HDFC Bank's policy on misconduct in the workplace?\",\n    \"answer\": \"Zero tolerance\",\n    \"context\": \"In a statement made available to   HDFC Bank said that on the basis of a preliminary enquiry into the matter the concerned employee has been suspended and a detailed investigation has been initiated which will be undertaken as per the Conduct guidelines of the bank.The banking major further added that they have a zerotolerance policy for any form of misconduct at the workplace and firmly believe in treating all our employees with dignity and respect.\"\n  },\n  {\n    \"question\": \"What is the purpose of the merger between HDFC and HDFC Bank?\",\n    \"answer\": \"To give HDFC Bank entry to India's booming housing loan market and to eliminate regulatory arbitrage for HDFC.\",\n    \"context\": \"The merger gave HDFC Bank entry to India s booming housing loan market while for HDFC the decision made sense on account of vanishing regulatory arbitrage earlier available for nonbanking finance companies.\"\n  }\n]",
    "[\n  {\n    \"question\": \"Which sector is currently the focus of Dalal Street?\",\n    \"answer\": \"Financials, with a specific focus on Nonbanking financial companies (NBFCs).\",\n    \"context\": \"Financials remain the darlings of Dalal Street with nonbanking financial companies (NBFCs) now grabbing the spotlight within this sector.\"\n  },\n  {\n    \"question\": \"What did mutual funds do in June?\",\n    \"answer\": \"Invested heavily in NBFC stocks while booking profits from private banking stocks.\",\n    \"context\": \"In June mutual funds heavily invested in NBFC stocks while booking profits from private banking stocks.\"\n  },\n  {\n    \"question\": \"What is the current market sentiment regarding interest rates?\",\n    \"answer\": \"Analysts and fund managers suggest that the peak of the interest cycle is approaching its end.\",\n    \"context\": \"The current market sentiment suggests that the peak of the interest cycle is approaching its end according to analysts and fund managers.\"\n  },\n  {\n    \"question\": \"How is India expected to respond to interest rate cuts in developed markets?\",\n    \"answer\": \"India is expected to follow suit and cut interest rates as well.\",\n    \"context\": \"As central banks in developed markets begin to cut interest rates India is expected to follow suit.\"\n  },\n  {\n    \"question\": \"What impact will lower interest rates have on NBFCs?\",\n    \"answer\": \"Lower liability costs, leading to higher profit margins and profitability.\",\n    \"context\": \"Resultantly the liability costs for NBFCs are likely to decrease leading to higher profit margins and increased profitability.\"\n  },\n  {\n    \"question\": \"What segments of NBFCs saw increased holdings from mutual funds in June?\",\n    \"answer\": \"Housing finance, consumer finance, and microfinance.\",\n    \"context\": \"Mutual funds in June raised their holdings across various NBFC segments be it housing finance consumer finance or microfinance.\"\n  },\n  {\n    \"question\": \"What is the outlook for loan demand across different product categories?\",\n    \"answer\": \"Strong across vehicle, SME, consumer segments, and gold finance.\",\n    \"context\": \"Loan demand remains strong across product categories like vehicle SME consumer segments and gold finance.\"\n  },\n  {\n    \"question\": \"What is the expected growth rate for AUM of NBFCs in Q1 FY24?\",\n    \"answer\": \"Above 20 percent year on year for most NBFCs.\",\n    \"context\": \"The Street expects assets under management (AUM) growth above 20 percent year on year for most NBFCs in Q1 FY24.\"\n  },\n  {\n    \"question\": \"What is the current status of credit growth?\",\n    \"answer\": \"Well-entrenched and expected to continue for the medium term.\",\n    \"context\": \"Credit growth is now wellentrenched and can continue for the medium term.\"\n  },\n  {\n    \"question\": \"What is the likelihood of major NPL shocks in the next few quarters?\",\n    \"answer\": \"Very low.\",\n    \"context\": \"The probability of any big NPL (nonperforming loans) shocks coming over the next few quarters is very low  Vinay Sharma Fund Manager  Equity Investments Nippon India Mutual Fund said.\"\n  },\n  {\n    \"question\": \"Which asset management companies increased their stake in NBFCs in June?\",\n    \"answer\": \"HDFC AMC, Shriram Finance, Creditaccess Grameen, and Mahindra Mahindra Financial Services.\",\n    \"context\": \"In June asset management companies upped their stake in HDFC Shriram Finance Creditaccess Grameen and Mahindra   Mahindra Financial Services among several other names.\"\n  },\n  {\n    \"question\": \"Why did mutual funds increase their stake in HDFC Shriram Finance?\",\n    \"answer\": \"Arbitrage opportunity ahead of merger with HDFC Bank.\",\n    \"context\": \"While HDFC can be looked at as MFs jumping on an arbitrage opportunity ahead of merger with HDFC Bank inflows for other NBFCs were largely on the back of improving outlook on their asset quality and margins.\"\n  },\n  {\n    \"question\": \"Why are NBFCs able to offer higher margins than banks?\",\n    \"answer\": \"They borrow at higher rates but lend at even higher rates.\",\n    \"context\": \"NBFCs borrow from banks or raise money from nonconvertible debentures. In both cases they are borrowing at high rates but at the same time they are lending at even higher rates.\"\n  },\n  {\n    \"question\": \"What is the outlook for NIMs of NBFCs?\",\n    \"answer\": \"Some NBFCs could see a contraction, while others may maintain or see a marginal increase.\",\n    \"context\": \"While some NBFCs could see their NIMs (net interest margins) contract by 515 basis points given the increase in the cost of funds analysts at Systematix Institutional Equities believe other NBFCs will likely maintain or see a marginal increase in NIMs aided by a change in their portfolio mix and upward revision in lending rates.\"\n  },\n  {\n    \"question\": \"Which segments are NBFCs more willing to extend credit to than banks?\",\n    \"answer\": \"High-yield segments like SME loans, loans against property, and unsecured personal B2C loans.\",\n    \"context\": \"Moreover when it comes to highyield segments like SME (small and medium enterprise) loans loans against property and unsecured personal B2C (businesstoconsumer) loans NBFCs are more willing to extend credit compared to several regulatory checks by banks.\"\n  },\n  {\n    \"question\": \"Why are analysts positive about the future of NBFCs?\",\n    \"answer\": \"Shift in focus from margin pressures to growth opportunities.\",\n    \"context\": \"According to Krishna Sanghavi  CIO Equity Mahindra Manulife Mutual Fund NBFCs will continue to rerate as the focus shifts from margin pressures.  FY23 saw some derating for NBFCs on concerns over margins while banks saw profit gains as well as rerating. Q1FY24 saw a rerating for NBFCs as post the policy pause by RBI market expectations shifted away from margin pressure  he said.\"\n  },\n  {\n    \"question\": \"Which NBFCs saw big block deals in June?\",\n    \"answer\": \"CreditAccess Grameen and Shriram Finance.\",\n    \"context\": \"Bargain buysMoreover mutual funds also jumped at the opportunity to buy NBFC stocks at a bargain. For instance CreditAccess Grameen and Shriram Finance both saw big block deals in June at a slight discount to the then market price.\"\n  },\n  {\n    \"question\": \"What is the outlook for credit costs of NBFCs in Q1 FY24?\",\n    \"answer\": \"Expected to be maintained at Q4 levels, except for a few like Mahindra Finance and Cholamandalam Finance.\",\n    \"context\": \"In Q1 FY24 analysts expect the credit cost of most NBFCs likely to be maintained at Q4 levels except for a few like Mahindra Finance and Cholamandalam Finance which could see a normalised credit cost.\"\n  },\n  {\n    \"question\": \"Which company is expected to disrupt the NBFC sector?\",\n    \"answer\": \"Jio Financial Services.\",\n    \"context\": \"And finally the space is also heating up with the entry of Jio Financial Services soon. While it is expected that JFS will disrupt the sector and heat up the competition fund managers do not seem to mind loading up on the already listed names to capitalise on India s growth story.\"\n  }\n]",
    "[\n  {\n    \"question\": \"Who founded HDFC?\",\n    \"answer\": \"HDFC was founded by H.T Parekh.\",\n    \"context\": \"Founded by H T Parekh uncle of Deepak Parekh.\"\n  },\n  {\n    \"question\": \"When was HDFC incorporated?\",\n    \"answer\": \"HDFC was incorporated on October 17, 1977.\",\n    \"context\": \"Incorporated on October 17 1977\"\n  },\n  {\n    \"question\": \"Why did Deepak Parekh join HDFC?\",\n    \"answer\": \"Deepak Parekh joined HDFC because he wanted to leave his job at Chase Manhattan Bank, where he was earning twice the salary offered by HDFC.\",\n    \"context\": \"Deepak Parekh joined the company in 1978 leaving his Chase Manhattan Bank job where he was earning twice the salary offered by HDFC.\"\n  },\n  {\n    \"question\": \"Who refused to invest in HDFC's IPO?\",\n    \"answer\": \"UTI, the only mutual fund in India at that time, refused to invest in HDFC's IPO.\",\n    \"context\": \"Deepak Parekh approached UTI seeking investment in HDFC s IPO. UTI  the only mutual fund in India that time  refused saying retail lending for home loans was too risky\"\n  },\n  {\n    \"question\": \"What was the issue size of HDFC's IPO?\",\n    \"answer\": \"The issue size of HDFC's IPO was Rs 10 crore (10 lakh shares of Rs 100 each).\",\n    \"context\": \"HDFC IPO launched in 1978. Issue size  Rs 10 crore (10 lakh shares of Rs 100 each). Shares issued to public at par (no premium).\"\n  },\n  {\n    \"question\": \"How many equity shares were issued to the public in HDFC's IPO?\",\n    \"answer\": \"399874 equity shares of Rs 100 were offered to the public in HDFC's IPO.\",\n    \"context\": \"399874 equity shares of Rs 100 offered to the public. The Corporation received 10697 applications for 473976 equity shares. The Corporation allotted the shares to 10543 applicants.\"\n  },\n  {\n    \"question\": \"What is HDFC's CAGR over the last three decades?\",\n    \"answer\": \"HDFC's CAGR over the last three decades is around 19 percent.\",\n    \"context\": \"The stock has posted a stellar CAGR of around 19 percent over the last three decades.\"\n  },\n  {\n    \"question\": \"How much would Rs 100000 invested in HDFC in May 1995 be worth today?\",\n    \"answer\": \"Rs 100000 invested in HDFC in May 1995 would be worth Rs 12639000 today (without dividends).\",\n    \"context\": \"Rs 100000 invested in HDFC in May 1995 would have grown to Rs 12639000 today (without dividends).\"\n  }\n]",
    "```python\n[\n  {\n    \"question\": \"What was the key differentiator between housing finance providers according to Deepak Parekh?\",\n    \"answer\": \"Empathy is the key differentiator between housing finance providers.\",\n    \"context\": \"Dealing with home loan customers requires immense patience. It is about understanding the needs and feelings of a home loan customer assuaging their anxiety during this complex transaction customising solutions explaining financial implications of a mortgage product and lending responsibly to ensure a customer is not overstretched  the veteran banker said.\"\n  },\n  {\n    \"question\": \"Why did HDFC merge with HDFC Bank?\",\n    \"answer\": \"HDFC merged with HDFC Bank to gain entry into the lucrative home loan business and to address the increasing regulatory challenges faced by NBFCs.\",\n    \"context\": \"While the merger gave the muchneed big entry to the bank into the lucrative home loan business for the parent too the decision made immense sense for one key reason. For NBFCs life was getting tougher in India.\"\n  },\n  {\n    \"question\": \"What was the initial response to HDFC's IPO in 1978?\",\n    \"answer\": \"The issue was undersubscribed, indicating a lack of interest in home loans at the time.\",\n    \"context\": \"The company was listed in 1978 with a face value of Rs 100 each. The issue did not get a great response in fact it was undersubscribed.\"\n  },\n  {\n    \"question\": \"Who founded HDFC?\",\n    \"answer\": \"H. T. Parekh, the uncle of Deepak Parekh, founded HDFC.\",\n    \"context\": \"Founded by H T Parekh uncle of Deepak Parekh HDFC was incorporated on October 17 1977 and disbursed its first home loan in 1978 to D. B. Remedios in Mumbai.\"\n  },\n  {\n    \"question\": \"What was the key challenge faced by the founding team of HDFC?\",\n    \"answer\": \"Home loans were not a popular product, and HDFC was not a well-known brand.\",\n    \"context\": \"To start with the founding team had an unenviable job. Home loans were not a popular product back then and no one knew HDFC as a brand.\"\n  },\n  {\n    \"question\": \"When was HDFC's first home loan disbursed?\",\n    \"answer\": \"HDFC disbursed its first home loan in 1978 to D. B. Remedios in Mumbai.\",\n    \"context\": \"Founded by H T Parekh uncle of Deepak Parekh HDFC was incorporated on October 17 1977 and disbursed its first home loan in 1978 to D. B. Remedios in Mumbai.\"\n  },\n  {\n    \"question\": \"What is the new market capitalization of HDFC Bank after the merger with HDFC?\",\n    \"answer\": \"Rs 14.6 lakh crore\",\n    \"context\": \"Further HDFC Bank s market capitalisation will rise to Rs 14.6 lakh crore from Rs 9.45 lakh crore prior to the merger.\"\n  },\n  {\n    \"question\": \"What was the RBI's response to HDFC's request for a merger with HDFC Bank?\",\n    \"answer\": \"The RBI granted critical relaxations on certain aspects, such as priority sector lending norms and treatment of ownership of subsidiaries.\",\n    \"context\": \"The RBI gave critical relaxations on certain aspects such as priority sector lending norms and treatment of ownership of subsidiaries in April 21 2023. Also the RBI gave six months to HDFC customers to switch to new benchmarks.\"\n  }\n]\n```\"\n    }\n]\n",
    "[{'question': 'How did the market valuation of Reliance Industries change last week?', 'answer': 'Reliance Industries experienced the most significant increase in market valuation among the top 10 firms, adding Rs 57,338.56 crore and reaching Rs 1,78,30,43.16 crore.', 'context': 'Driven by a positive trend in domestic equities, the Indian stock market witnessed substantial gains, particularly among the top valued firms. The benchmark BSE Sensex rose by 0.86 percent, reaching an all-time high on July 7. Reliance Industries emerged as a major gainer, with its valuation soaring by Rs 57,338.56 crore, reaching an impressive Rs 1,78,30,43.16 crore. This surge solidified its position as the most valued company in the top 10.'}, {'question':\"\n    }\n]\n",
    "[\n  {\n    \"question\": \"Why do finfluencers not want to be registered as research analysts with SEBI?\",\n    \"answer\": \"Finfluencers do not want to be registered as research analysts with SEBI because of the restrictions placed on trading a stock that they have recommended and by extension live trading.\",\n    \"context\": \"There have been many reasons shared for why finfluencers or financial influencers do not want to be registered as research analysts (RAs) with the market regulator SEBI including the restrictions placed on trading a stock that they have recommended and by extension live trading.\"\n  },\n  {\n    \"question\": \"How many times was the public issue of Senco Gold subscribed on the second day of bidding?\",\n    \"answer\": \"The public issue of Senco Gold was subscribed 2.68 times on the second day of bidding.\",\n    \"context\": \"The public issue of Senco Gold has received good response from investors especially retail and high networth individuals with 2.68 times subscription through bids for 2.52 crore equity shares against an IPO size of 94.18 lakh on July 5 the second day of bidding.\"\n  },\n  {\n    \"question\": \"What is the starting price of the Maruti Suzuki Invicto hybrid MPV?\",\n    \"answer\": \"The starting price of the Maruti Suzuki Invicto hybrid MPV is Rs 24.79 lakh.\",\n    \"context\": \"With the aim of widening its range in the premium segment of the passenger vehicle market Maruti Suzuki has launched Invicto MPV its largest and most expensive model. The MPV will be available at a starting price of Rs 24.79 lakh for the basic model and goes up to Rs 28.42 lakh for the topend variant exshowroom.\"\n  },\n  {\n    \"question\": \"Which company will replace HDFC in the S P BSE Sensex index from July 13?\",\n    \"answer\": \"JSW Steel will replace HDFC in the S P BSE Sensex index from July 13.\",\n    \"context\": \"BSE rejig  JSW Steel to replace HDFC in Sensex from July 13JSW Steel will replace mortgage major Housing Development Finance Corporation (HDFC) in S P BSE Sensex index from July 13 according to the bourse s release on July 5.\"\n  },\n  {\n    \"question\": \"Which three companies are set for an epic clash in the premium motorcycle segment?\",\n    \"answer\": \"Hero MotoCorp, Bajaj and Eicher Motors are set for an epic clash in the premium motorcycle segment.\",\n    \"context\": \"Battle Royale  Hero MotoCorp Bajaj and Eicher Motors set for an epic clash in premium motorcycle segmentThe battle for premium motorcycle segment is heating up with the entry of Harley Davidson X440 developed in collaboration with Hero MotoCorp and TriumphBajaj s Speed 400 and Scrambler 400 X.\"\n  },\n  {\n    \"question\": \"Is Marico optimistic about recovery in rural demand and growth prospects?\",\n    \"answer\": \"Yes, Marico is optimistic about recovery in rural demand and growth prospects.\",\n    \"context\": \"Marico optimistic about recovery in rural demand and growth prospectsMarico Ltd. said on July 5 that despite lack of clear signs of improvement in demand trends during the quarter the sector remained stable with urban markets maintaining a steady performance in their quarterly update of Q1 FY24.\"\n  }\n]",
    "```python\n[\n  {\n    \"question\": \"Who will replace HDFC in the S P BSE Sensex index from July 13?\",\n    \"answer\": \"JSW Steel\",\n    \"context\": \"JSW Steel will replace mortgage major Housing Development Finance Corporation (HDFC) in S P BSE Sensex index from July 13 according to the bourse s release on July 5.\"\n  },\n  {\n    \"question\": \"Why is HDFC being replaced in the S P BSE Sensex index?\",\n    \"answer\": \"Due to the completion of the merger between HDFC and HDFC Bank.\",\n    \"context\": \"The rejig is a result of the completion of the biggest corporate merger of HDFC with HDFC Bank which came into effect on July 1.\"\n  },\n  {\n    \"question\": \"Which company will replace HDFC on the S P BSE 500?\",\n    \"answer\": \"JBM Auto Components Ltd\",\n    \"context\": \"On S P BSE 500 HDFC will be replaced by JBM Auto Components Ltd and on S P BSE 100 by Zomato.\"\n  },\n  {\n    \"question\": \"How much did JSW Steel's shares close on BSE on July 5?\",\n    \"answer\": \"Rs 792.45 apiece\",\n    \"context\": \"Shares of JSW Steel on Wednesday (July 5) closed 0.54 percent lower at Rs 792.45 apiece on BSE.\"\n  },\n  {\n    \"question\": \"Which company will replace HDFC on the Nifty 50 index?\",\n    \"answer\": \"LTIMindtree\",\n    \"context\": \"Meanwhile on Nifty 50 index LTIMindtree a subsidiary of engineering giant Larsen   Toubro will replace HDFC from July 13.\"\n  },\n  {\n    \"question\": \"When will HDFC be removed from all other BSE indices?\",\n    \"answer\": \"July 13\",\n    \"context\": \"As on July 13 HDFC Ltd will be removed from all the other BSE indices.\"\n  },\n  {\n    \"question\": \"When is the record date for determining eligible shareholders for HDFC Bank and HDFC merger?\",\n    \"answer\": \"July 13\",\n    \"context\": \"The boards have set July 13 as the record date to determine the eligible shareholders for allotment of shares under the merger deal.\"\n  },\n  {\n    \"question\": \"By how much is the loan book of the merged HDFC Bank and HDFC entity expected to increase?\",\n    \"answer\": \"38.77 percent\",\n    \"context\": \"The loan book of the merged entity is expected to increase by 38.77 percent to Rs 22.21 lakh crore as against Rs 16 lakh crore as on March 31 as per the investor presentation of HDFC Bank.\"\n  }\n]\n```\"\n    }\n]\n",
    "[{'question': 'What was the reason for HDFC Bank\\'s stock decline in morning trade on July 5?', 'answer': 'HDFC Bank\\'s stock declined by around 3 percent in morning trade on July 5 after the company released its first quarter business update for FY24.', 'context': 'On July 5, HDFC Bank released its first quarter business update for FY24. Following the announcement, the bank\\'s stock experienced a decline of around 3 percent in morning trade. This suggests that investors may have reacted negatively to some aspects of the business update, leading to a sell-off in the stock.'}, {'question': 'How did HDFC Bank\\'s advances perform year-on-year in Q1 FY24?', 'answer': 'HDFC Bank\\'s advances grew by nearly 15.8 percent year-on-year (YoY) in Q1 FY24, reaching approximately Rs 16.15 lakh crore compared to Rs 13.95 lakh crore a year ago.', 'context': 'HDFC Bank reported a significant year-on-year increase in advances for the first quarter of fiscal year 2024. The bank\\'s advances, which represent loans given out to borrowers, reached approximately Rs 16.15 lakh crore, reflecting a growth of nearly 15.8 percent compared to the same period in the previous fiscal year when advances stood at Rs 13.95 lakh crore.'}, {'question': 'What was the quarter-on-quarter growth rate of HDFC Bank\\'s deposits in Q1 FY24?', 'answer': 'HDFC Bank\\'s deposits grew by 1.6 percent quarter-on-quarter (QoQ) in Q1 FY24, reaching Rs 19.13 lakh crore compared to Rs 18.83 lakh crore in Q4 FY23.', 'context': 'Analyzing HDFC Bank\\'s deposit growth on a quarter-on-quarter basis, the bank witnessed a 1.6 percent increase in deposits in Q1 FY24. This indicates that the bank\\'s efforts to attract and retain deposits yielded positive results, as deposits reached Rs 19.13 lakh crore compared to Rs 18.83 lakh crore in the previous quarter, Q4 FY23.'}, {'question': 'How did HDFC Bank\\'s retail deposits perform in Q1 FY24?', 'answer': 'HDFC Bank\\'s retail deposits increased by Rs 38,000 crore in Q1 FY24, representing a growth of 21.5 percent year-on-year (YoY) and 2.5 percent quarter-on-quarter (QoQ).', 'context': 'HDFC Bank witnessed strong growth in retail deposits during Q1 FY24. Retail deposits, which typically come from individual customers, increased by Rs 38,000 crore compared to the same period last year. This represents a substantial year-on-year growth rate of 21.5 percent. Additionally, retail deposits grew by 2.5 percent compared to the previous quarter, Q4 FY23.'}, {'question': 'How much loan did HDFC Bank purchase from HDFC Ltd. in Q1 FY24?', 'answer': 'HDFC Bank purchased loans worth Rs 11,632 crore from HDFC Ltd. through the direct assignment route under the home loan arrangement in Q1 FY24.', 'context': 'As part of the home loan arrangement between HDFC Bank and HDFC Ltd., HDFC Bank purchased loans amounting to Rs 11,632 crore in Q1 FY24. This acquisition of loans was facilitated through the direct assignment route, allowing HDFC Bank to expand its loan portfolio and potentially benefit from the existing customer base and loan assets of HDFC Ltd.'}, {'question': 'What was the status of HDFC Bank\\'s CASA deposits as of June 30, 2023?', 'answer': 'As of June 30, 2023, HDFC Bank\\'s CASA deposits stood at Rs 8.13 lakh crore, reflecting an increase of 10.7 percent compared to Rs 7.34 lakh crore on June 30, 2022.', 'context': 'HDFC Bank\\'s CASA (Current Account Savings Account) deposits, which are considered a more stable and cost-effective source of funding for banks, experienced positive growth. As of June 30, 2023, the bank\\'s CASA deposits reached Rs 8.13 lakh crore, marking a significant year-on-year increase of 10.7 percent compared to Rs 7.34 lakh crore on the same date in the previous year.'}, {'question': 'What was the CASA ratio\"\n    }\n]\n",
    "```python\n[\n  {\n    \"question\": \"What was the approximate amount of advances for HDFC Bank in Q1FY24?\",\n    \"answer\": \"Rs 16155 billion\",\n    \"context\": \"HDFC Bank informed the exchanges on July 5 that its advances aggregated to approximately Rs 16155 billion for the quarter ended June 30 up nearly 15.8 percent from Rs 13951 billion a year ago.\"\n  },\n  {\n    \"question\": \"What was the percentage increase in HDFC Bank's advances compared to the previous year in Q1FY24?\",\n    \"answer\": \"15.8 percent\",\n    \"context\": \"HDFC Bank informed the exchanges on July 5 that its advances aggregated to approximately Rs 16155 billion for the quarter ended June 30 up nearly 15.8 percent from Rs 13951 billion a year ago.\"\n  },\n  {\n    \"question\": \"What was the approximate amount of deposits for HDFC Bank in Q1FY24?\",\n    \"answer\": \"Rs 19130 billion\",\n    \"context\": \"The bank's deposits aggregated to approximately Rs 19130 billion in Q1FY24 posting a growth of around 19.2 percent over Rs 16048 billion from a year ago and a growth of around 1.6 percent over Rs 18834 billion from Q4FY23.\"\n  },\n  {\n    \"question\": \"What was the percentage increase in HDFC Bank's deposits compared to Q4FY23?\",\n    \"answer\": \"1.6 percent\",\n    \"context\": \"The bank's deposits aggregated to approximately Rs 19130 billion in Q1FY24 posting a growth of around 19.2 percent over Rs 16048 billion from a year ago and a growth of around 1.6 percent over Rs 18834 billion from Q4FY23.\"\n  },\n  {\n    \"question\": \"What was the approximate amount of CASA deposits for HDFC Bank as of June 30, 2023?\",\n    \"answer\": \"Rs 8130 billion\",\n    \"context\": \"The Bank's current account and savings account (CASA) deposits aggregated to approximately Rs 8130 billion as of June 30 2023 agrowth of around 10.7 percent over Rs 7346 billion as of June 30 2022.\"\n  },\n  {\n    \"question\": \"What was the percentage increase in HDFC Bank's CASA deposits compared to June 30, 2022?\",\n    \"answer\": \"10.7 percent\",\n    \"context\": \"The Bank's current account and savings account (CASA) deposits aggregated to approximately Rs 8130 billion as of June 30 2023 agrowth of around 10.7 percent over Rs 7346 billion as of June 30 2022.\"\n  },\n  {\n    \"question\": \"What was the approximate amount of gross advances for the merged entity of HDFC and HDFC Bank in Q1FY24?\",\n    \"answer\": \"Rs 22450 billion\",\n    \"context\": \"The merged entity's gross advances aggregated to approximately Rs 22450 billion in Q1FY24 up by nearly 13.1 percent over Rs 19859 billion as of June 30 and up by 0.7 percent over Rs 22302 billion as of March 31.\"\n  },\n  {\n    \"question\": \"What was the percentage increase in the merged entity's gross advances compared to Q4FY23?\",\n    \"answer\": \"0.7 percent\",\n    \"context\": \"The merged entity's gross advances aggregated to approximately Rs 22450 billion in Q1FY24 up by nearly 13.1 percent over Rs 19859 billion as of June 30 and up by 0.7 percent over Rs 22302 billion as of March 31.\"\n  }\n]\n```\"\n    }\n]\n",
    "[\n  {\n    \"question\": \"Which company is replacing HDFC in the Nifty 50 index?\",\n    \"answer\": \"LTIMindtree\",\n    \"context\": \"LTIMindtree, a subsidiary of engineering giant Larsen & Toubro, will replace mortgage major Housing Development Finance Corporation (HDFC) from the Nifty 50 index from July 13.\"\n  },\n  {\n    \"question\": \"What is the reason for HDFC being replaced in the Nifty 50 index?\",\n    \"answer\": \"HDFC's merger with HDFC Bank\",\n    \"context\": \"This comes in the aftermath of HDFC's merger with its twin entity and the country's largest private lender, HDFC Bank, coming into effect on July 1.\"\n  },\n  {\n    \"question\": \"When will LTIMindtree replace HDFC in the Nifty 50 index?\",\n    \"answer\": \"July 13\",\n    \"context\": \"These changes shall become effective from July 13, a release issued by the National Stock Exchange (NSE) stated.\"\n  },\n  {\n    \"question\": \"Which other indices will HDFC be replaced in?\",\n    \"answer\": \"Nifty 100, Nifty 500, Nifty Financial Services, Nifty Financial Services Ex-Bank, Nifty Housing, Nifty Core Housing, and Nifty High Beta 50.\",\n    \"context\": \"Among other indices, HDFC will be replaced by LIC Housing Finance in Nifty Financial Services, by Poonawalla Fincorp in Nifty Financial Services Ex-Bank, by Phoenix Mills in Nifty Housing, by Brigade Enterprises in Nifty Core Housing, and by Ambuja Cements in Nifty High Beta 50.\"\n  },\n  {\n    \"question\": \"What is LTIMindtree's market capitalization?\",\n    \"answer\": \"Largest 50th company in India by market capitalization\",\n    \"context\": \"Following HDFC's amalgamation into HDFC Bank, LTIMindtree was set to become the 50th biggest company in India by market capitalization.\"\n  },\n  {\n    \"question\": \"When did LTIMindtree commence trading on the domestic stock exchanges?\",\n    \"answer\": \"December 5, 2022\",\n    \"context\": \"Notably, LTIMindtree, which is a merger between LT Infotech and Mindtree, marked the commencement of trading on the domestic stock exchanges on December 5, 2022.\"\n  },\n  {\n    \"question\": \"What was LTIMindtree's stock price on July 4?\",\n    \"answer\": \"Rs 5250.55 per share\",\n    \"context\": \"In the trading session on July 4, LTIMindtree's stock traded in the green. The scrip settled at Rs 5250.55 apiece at the NSE, which was 0.75 percent higher than the previous day's close.\"\n  },\n  {\n    \"question\": \"Who is the parent company of LTIMindtree?\",\n    \"answer\": \"Larsen & Toubro\",\n    \"context\": \"LTIMindtree a subsidiary of engineering giant Larsen & Toubro will replace mortgage major Housing Development Finance Corporation (HDFC) from Nifty 50 index from July 13.\"\n  }\n]",
    "```json\n[\n    {\n        \"question\": \"What was the closing price of HDFC shares on the BSE after the merger announcement?\",\n        \"answer\": \"Shares of HDFC climbed 1.76 per cent to settle at Rs 2871.20 on the BSE after the merger announcement.\",\n        \"context\": \"The Indian equity market witnessed a bullish trend on Monday, particularly benefiting the newly merged entity, HDFC.  Shares of HDFC experienced a 1.76% increase, closing at Rs 2871.20 on the Bombay Stock Exchange (BSE). This positive movement can be attributed to the merger announcement and the overall optimistic market sentiment.\"\n    },\n    {\n        \"question\": \"How did the HDFC twins perform on the first day of trading after the merger?\",\n        \"answer\": \"Both HDFC and HDFC Bank ended the day in positive territory, with HDFC up 1.76% and HDFC Bank up 1.05%.\",\n        \"context\": \"The merger of HDFC and HDFC Bank generated significant interest in the stock market. On the first day of trading post-merger, both entities witnessed positive growth. HDFC shares rose by 1.76%, while HDFC Bank shares saw a 1.05% increase. This positive performance highlights the market's confidence in the newly formed entity.\"\n    },\n    {\n        \"question\": \"What was the combined market valuation of HDFC and HDFC Bank on the BSE?\",\n        \"answer\": \"The combined market valuation of HDFC and HDFC Bank reached an impressive Rs 1493119.33 crore on the BSE.\",\n        \"context\": \"The merger of HDFC and HDFC Bank created a financial powerhouse, as evidenced by their combined market valuation on the Bombay Stock Exchange (BSE). The total market capitalization of the merged entity stood at a staggering Rs 1493119.33 crore, reflecting the market's recognition of the combined strengths and potential of the two entities.\"\n    },\n    {\n        \"question\": \"When did HDFC merge with HDFC Bank?\",\n        \"answer\": \"HDFC merged with its subsidiary HDFC Bank on Saturday.\",\n        \"context\": \"The long-awaited merger of HDFC and HDFC Bank reached its culmination on Saturday. This strategic move created a financial giant, poised to capitalize on the growing Indian economy. The merger brought together the strengths of both entities, promising a wider range of financial products and services for its customers.\"\n    },\n    {\n        \"question\": \"What was the impact of the HDFC twins' rally on the equity market?\",\n        \"answer\": \"The rally in HDFC twins' shares contributed significantly to the positive momentum observed in the equity market.\",\n        \"context\": \"The Indian equity market witnessed a surge in activity and positive sentiment, driven in part by the impressive performance of the newly merged HDFC entity. The rally in HDFC twins' shares instilled confidence in investors and contributed significantly to the overall upward trend in the market.\"\n    },\n    {\n        \"question\": \"What is the significance of July 13, 2023, in the HDFC - HDFC Bank merger?\",\n        \"answer\": \"July 13, 2023, has been set as the record date for determining the HDFC Ltd shareholders eligible to receive HDFC Bank shares.\",\n        \"context\": \"As part of the merger process between HDFC and HDFC Bank, July 13, 2023, holds special significance. This date serves as the record date for identifying the shareholders of HDFC Ltd who will be issued and allotted shares of HDFC Bank. This step is crucial in ensuring a smooth transition of ownership and integration of the two entities.\"\n    },\n    {\n        \"question\": \"What happened to the warrants of HDFC Limited after the merger?\",\n        \"answer\": \"The warrants of HDFC Limited will continue under the name of HDFC Bank from July 13, 2023.\",\n        \"context\": \"Following the merger of HDFC and HDFC Bank, the warrants of HDFC Limited will be transferred and continued under the name of HDFC Bank. This transition, effective from July 13, 2023, ensures the continuity of these financial instruments under the umbrella of the merged entity.\"\n    },\n    {\n        \"question\": \"Besides the HDFC twins' performance, what else contributed to the positive market trend?\",\n        \"answer\": \"The BSE Sensex, a benchmark index of the Indian stock market, jumped 486.49 points or 0.75 per cent to settle at its all-time closing high of 65205.\"\n    }\n]\n",
    "[\n  {\n    \"question\": \"Who spoke about the hurdles of selling a home loan in the initial stage of HDFC?\",\n    \"answer\": \"Nitin Walia, Assistant Manager of a branch in Delhi, mentioned the struggles of convincing people about home loans when the concept wasn't widely accepted.\",\n    \"context\": \"Some HDFC employees   spoke to recall their early days including the struggles of selling home loans when the product wasn’t popular.  I still remember the first day I joined HDFC. Now I’ve worked for more than two decades with the company and it feels like home to me  said Nitin Walia Assistant Manager of a branch in Delhi.\"\n  },\n  {\n    \"question\": \"Why did Keki Mistry feel that HDFC created their own competition?\",\n    \"answer\": \"As the sole mortgage lender in India initially, HDFC's efforts to train individuals and banks in mortgage lending inadvertently led to the creation of competitors in the industry.\",\n    \"context\": \"HDFC opened in 1977 and was the sole mortgage lender in India at that time. Keki Mistry CEO and Vice Chairman HDFC in an exclusive interview to   in March 2023 said that initially it was the only mortgage lender in India and with time  we created our competition. Also read  Here’s how much Deepak Parekh earned when he joined HDFC. See offer letter We trained some individuals and banks to start mortgage lending. During the early years of the company home loans were not popular in India  Mistry said.\"\n  },\n  {\n    \"question\": \"Who recalled Deepak Parekh's commitment to strengthening the HDFC Cricket team?\",\n    \"answer\": \"Mahesh Shah, former Corporate Communications Head at HDFC, recounted an instance where Parekh, during a lunch break in a cricket match, discussed plans to enhance the team's performance.\",\n    \"context\": \"Mahesh Shah former Corporate Communications Head at HDFC said that the first word that comes to his mind when he recalls his journey with HDFC is commitment. Shah recalled that in May 1987 Deepak Parekh Chairman HDFC came to Cross Maidan to motivate the HDFC Cricket team during the finals of the Corporate Cricket tournament  The Times Shield.  He took me for a stroll on the ground as it was a lunch break to discuss the status of the match which he responded HDFC will win. He wanted to know if we needed to strengthen the team to meet the challenges of a higher level and he stuck to his commitment of a spinner being recruited  said Shah.\"\n  },\n  {\n    \"question\": \"What factors contributed to the growth of HDFC, according to Mahesh Shah?\",\n    \"answer\": \"Shah attributed HDFC's success to the company's commitment to creating a positive and supportive work environment from its inception.\",\n    \"context\": \"Shah recalled that during his time in HDFC he remembered the growth of the company and summed it up in one word   commitment.  The management of the company created an environment of subtleness and friendliness from the earliest days  said Shah.\"\n  },\n  {\n    \"question\": \"How did HDFC Bank's loan book grow significantly over the years?\",\n    \"answer\": \"HDFC Bank's loan book grew tremendously from Rs 2.3 lakh crore in 2013 to Rs 16 lakh crore in 2023, reflecting the bank's strong performance and expansion in the lending sector.\",\n    \"context\": \"With time HDFC and HDFC Bank became mammoths in their respective sectors. The bank’s loan book over the years grew tremendously from Rs 2.3 lakh crore in 2013 to Rs 16 lakh crore in 2023.\"\n  },\n  {\n    \"question\": \"Why did HDFC consider merging with HDFC Bank?\",\n    \"answer\": \"HDFC and HDFC Bank decided to merge to create a more powerful entity in the Indian banking industry, with HDFC Bank becoming 100% owned by public shareholders and HDFC shareholders owning 41% of the bank.\",\n    \"context\": \"HDFC and HDFC Bank announced the decision to merge on April 4 2022. As per the plan HDFC will acquire a 41 percent stake in HDFC Bank through the merger.In fact Parekh had said back in 2015 itself that his firm could consider a merger with HDFC Bank if circumstances were favourable. But the wait for the merger got longer with the parent putting the idea on the backburner. Parekh had said that the merger makes sense provided there is no loss for shareholders.\"\n  },\n  {\n    \"question\": \"What did Nitin Walia say about the culture at HDFC?\",\n    \"answer\": \"Walia described the culture at HDFC as homelike, emphasizing the sense of belonging and comfort he felt during his two decades with the company.\",\n    \"answer\": \" I still remember the first day I joined HDFC. Now I’ve worked for more than two decades with the company and it feels like home to me  said Nitin Walia Assistant Manager of a branch in Delhi.\",\n    \"context\": \"I still remember the first day I joined HDFC. Now I’ve worked for more than two decades with the company and it feels like home to me  said Nitin Walia Assistant Manager of a branch in Delhi.\"\n  },\n  {\n    \"question\": \"How did Deepak Parekh describe HDFC's brand identity?\",\n    \"answer\": \"Parekh asserted that HDFC is an iconic brand that holds a strong position in the minds of customers, and that it cannot be taken away from them.\",\n    \"answer\": \"HDFC is an iconic brand. No one can take HDFC from us  said another senior employee.\",\n    \"context\": \"HDFC is an iconic brand. No one can take HDFC from us  said another senior employee.\"\n  }\n]",
    "[\n  {\n    \"question\": \"What is HDFC Bank's goal for growth?\",\n    \"answer\": \"HDFC Bank aims to double its size every four years.\",\n    \"context\": \"In a letter to the over 4000 employees from HDFC who joined the bank s rolls on Saturday Jagdishan said the future is bright and the work on realising the potential of the merger starts now.The runway for financial services and mortgage which are so underserved and under penetrated is going to be very large. HDFC Bank  the combined entity  with a large and growing distribution and customer franchise more than adequate capital healthy asset quality and profitability will be best positioned to capture growth. The pace at which we aim to grow  we could be creating a new HDFC Bank every 4 years  he said.\"\n  },\n  {\n    \"question\": \"What is the key challenge HDFC Bank is addressing in its growth strategy?\",\n    \"answer\": \"HDFC Bank is addressing the underserved and underpenetrated financial services and mortgage market in India.\",\n    \"context\": \"In a letter to the over 4000 employees from HDFC who joined the bank s rolls on Saturday Jagdishan said the future is bright and the work on realising the potential of the merger starts now.The runway for financial services and mortgage which are so underserved and under penetrated is going to be very large. HDFC Bank  the combined entity  with a large and growing distribution and customer franchise more than adequate capital healthy asset quality and profitability will be best positioned to capture growth. The pace at which we aim to grow  we could be creating a new HDFC Bank every 4 years  he said.\"\n  },\n  {\n    \"question\": \"How many branches does HDFC Bank plan to add annually to support its growth?\",\n    \"answer\": \"HDFC Bank plans to add about 1500 branches every year to better serve the middle class and upper segment of the country.\",\n    \"context\": \"To realise its growth aims Jagdishan said the bank will be adding about 1500 branches every year for some years to better serve the middle class and upper segment of the country.\"\n  },\n  {\n    \"question\": \"What is HDFC Bank's strategy for leveraging its merger with HDFC?\",\n    \"answer\": \"HDFC Bank is leveraging its merger with HDFC to move from sales management to a relationship management model and cross-sell products and services within its franchise.\",\n    \"context\": \"HDFC Bank will move from sales management to a relationship management model because of the opportunity to crosssell that exists within the franchise after the addition of mortgage finance insurance and asset management subsidiaries Jagdishan said. The velocity of product sales and the reduced touch points to serve the customer will be a game changer with this  power of bundling   he added.\"\n  },\n  {\n    \"question\": \"What was the cost-to-revenue ratio of HDFC?\",\n    \"answer\": \"HDFC's cost-to-revenue ratio was 0.04 per cent, the lowest for any mortgage company in the world.\",\n    \"context\": \"Jagdishan said the costtorevenue ratio of HDFC at 0.04 per cent was the lowest for any mortgage company in the world and thanked its leadership including Deepak Parekh Keki Mistry and Renu Karnad for creating such an institution.\"\n  },\n  {\n    \"question\": \"What is the significance of the merger between HDFC and HDFC Bank?\",\n    \"answer\": \"The merger between HDFC and HDFC Bank creates the fourth most valued lender in the world and narrows the gap with the second largest Indian bank, SBI.\",\n    \"context\": \"Postmerger HDFC Bank will become the fourth most valued lender in the world and narrow the gap by asset size with stateowned SBI to be the second largest Indian bank.\"\n  },\n  {\n    \"question\": \"What is the combined networth of HDFC Bank and HDFC after the merger?\",\n    \"answer\": \"The combined networth of HDFC Bank and HDFC after the merger is over Rs 4.14 lakh crore.\",\n    \"context\": \"With the merger the networth of the entity would be over Rs 4.14 lakh crore.\"\n  },\n  {\n    \"question\": \"What is the rationale behind HDFC Bank's increased focus on digital investments?\",\n    \"answer\": \"HDFC Bank's increased focus on digital investments aims to transform the bank into a \\\"technology company into banking\\\" and enhance customer delight.\",\n    \"context\": \"It will continue investments on the digital front as well which Jagdishan said will make HDFC Bank into a  technology company into banking  and added that the same will get unveiled over the next three years.\"\n  }\n]",
    "```\n[\n  {\n    \"question\": \"What is the ranking of the merged entity in the Indian banking industry?\",\n    \"answer\": \"Second only to the State Bank of India\",\n    \"context\": \"The merger of India's largest private sector bank HDFC Bank and the home loan major Housing Development Finance Corporation has created a behemoth in the Indian banking industry second only to the State Bank of India in terms of assets.\"\n  },\n  {\n    \"question\": \"What percentage increase is expected in the merged entity's loan book?\",\n    \"answer\": \"38.77 percent\",\n    \"context\": \"As per the   research the loan book or advances of the merged entity is expected to increase by 38.77 percent to Rs 22.21 lakh crore.\"\n  },\n  {\n    \"question\": \"How much of the investment in HDFC Bank is held by the mutual fund industry?\",\n    \"answer\": \"Rs 117456 crore\",\n    \"context\": \"As per the latest data the overall mutual fund industry has held about Rs 117456 crore of the investment in HDFC Bank while Rs 61805 crore in HDFC Ltd.\"\n  },\n  {\n    \"question\": \"How many actively managed schemes held HDFC Bank stock for more than 15 years?\",\n    \"answer\": \"22\",\n    \"context\": \"Data compiled from ACEMF shows that there were 22 actively managed schemes (except sector funds) held the stock of HDFC bank in their portfolio for more than 15 years.\"\n  },\n  {\n    \"question\": \"How much did HDFC Bank shares reward investors with over the last 15 years?\",\n    \"answer\": \"1589 percent\",\n    \"context\": \"As of June 30 2023 HDFC Bank and HDFC shares rewarded the investors with returns of 1589 percent and 618 percent respectively over the last 15 years.\"\n  },\n  {\n    \"question\": \"What percentage of HDFC's stock was held by actively managed schemes for 15 years?\",\n    \"answer\": \"618 percent\",\n    \"context\": \"As of June 30 2023 HDFC Bank and HDFC shares rewarded the investors with returns of 1589 percent and 618 percent respectively over the last 15 years.\"\n  },\n  {\n    \"question\": \"What type of mutual fund schemes were most likely to hold HDFC Bank stock?\",\n    \"answer\": \"Actively managed schemes\",\n    \"context\": \"Both HDFC Bank and HDFC were the most favourite stocks of many actively managed schemes over period.\"\n  },\n  {\n    \"question\": \"How much did HDFC shares reward investors with over the last 15 years?\",\n    \"answer\": \"9 active schemes\",\n    \"context\": \"Meanwhile as much as nine active schemes held the stocks of HDFC in their portfolio for the 15 years.\"\n  }\n]\n```\"\n    }\n]\n",
    "[{\"question\": \"When did HDFC Bank initiate the rebranding of erstwhile HDFC Ltd offices?\", \"answer\": \"HDFC Bank started rebranding the offices of the former HDFC Ltd on Saturday, July 1, 2023, coinciding with the first day of their merged operations.\", \"context\": \"The merger of HDFC Ltd, a prominent housing finance provider, into HDFC Bank, a leading private sector lender, marked a significant event in the Indian corporate landscape. The merger process, first announced on April 4 of the previous year, culminated in the official merger on July 1, 2023. As part of the merger, HDFC Bank undertook the rebranding of all former HDFC Ltd offices and branches, totaling over 500, to reflect the unified HDFC Bank brand identity.\"}, {\"question\": \"How long is the rebranding of all HDFC Ltd offices and branches expected to take?\", \"answer\": \"HDFC Bank estimates that the entire rebranding process for all HDFC Ltd offices and branches will take approximately 24 hours to complete.\", \"context\": \"The rebranding initiative, a massive undertaking, involves replacing signage, marketing materials, and other visual elements at over 500 locations across India. HDFC Bank has mobilized significant resources to ensure a smooth and efficient transition, aiming to minimize disruption to customer service during the process.\"}, {\"question\": \"What significant milestone did HDFC Bank achieve on July 1, 2023?\", \"answer\": \"HDFC Bank, on July 1, 2023, achieved a major milestone by merging with HDFC Ltd, formerly the largest non-banking home financier in India.  This merger created a financial behemoth and reshaped the landscape of India's financial sector. \", \"context\": \"July 1, 2023, marked a pivotal moment for HDFC Bank as it successfully completed the merger with HDFC Ltd. This merger brought to a close HDFC Ltd's 44-year legacy as an independent entity and ushered in a new era for both organizations under the unified banner of HDFC Bank.\"}, {\"question\": \"Who will be addressing the HDFC Bank townhall following the merger, and what is their role?\", \"answer\": \"Sashidhar Jagdishan, Managing Director and Chief Executive of HDFC Bank, is scheduled to address a townhall later in the evening.\", \"context\": \"Following the merger, Sashidhar Jagdishan, in his capacity as the Managing Director and Chief Executive of HDFC Bank, assumed the responsibility of leading the newly integrated entity. To address the concerns and expectations of employees and stakeholders, he is slated to host a townhall, providing insights into the merger's implications and the organization's future direction.\"}, {\"question\": \"What is the estimated total business value of the merged HDFC entity?\", \"answer\": \"The merged HDFC entity boasts a substantial total business value of Rs 41 lakh crore as of March 2023.\", \"context\": \"The merger of HDFC Ltd into HDFC Bank created a financial powerhouse with a staggering total business value exceeding Rs 41 lakh crore at the close of March 2023. This substantial figure underscores the sheer scale and reach of the merged entity within the Indian financial services sector.\"}, {\"question\": \"How will the merger of HDFC Ltd and HDFC Bank impact global banking rankings?\", \"answer\": \"The HDFC merger positions HDFC Bank as the world's fourth most valuable lender, narrowing the gap with SBI, India's second-largest bank.\", \"context\": \"The HDFC merger significantly elevates HDFC Bank's global standing, propelling it to the position of the world's fourth most valuable lender. This remarkable achievement highlights the enhanced financial strength and market capitalization of the merged entity, positioning it as a dominant player in the global banking arena.\"}, {\"question\": \"What is the ownership structure of HDFC Bank following the merger?\", \"answer\": \"Post-merger, HDFC Bank will be 100% owned by public shareholders, with former HDFC shareholders holding a 41% stake.\", \"context\": \"The merger resulted in a change in the ownership structure of HDFC Bank. Public shareholders now hold complete ownership of the bank, while former shareholders of HDFC Ltd received a 41% stake in HDFC Bank. This distribution ensures a balanced ownership structure, reflecting the contributions of both entities to the merged organization.\"}, {\"question\": \"What will happen to existing HDFC Ltd shareholders' shares after the merger with HDFC Bank?\", \"answer\": \"HDFC Ltd shareholders will receive 42 shares of HDFC Bank for every 25 shares they previously held.\", \"context\": \"As part of the merger agreement, a share swap ratio was established to compensate HDFC Ltd shareholders.  Each shareholder of HDFC Ltd is entitled to receive\"\n    }\n]\n",
    "[\n{\n\"question\": \"When is the effective date of the merger between HDFC and HDFC Bank?\",\n\"answer\": \"July 1, 2023\",\n\"context\": \"The boards of mortgage lender Housing Development Finance Corporation (HDFC) and private lender HDFC Bank have approved July 1 as the effective date of merger.\"\n},\n{\n\"question\": \"What is the record date for determining the shareholders of HDFC who will be issued shares of HDFC Bank?\",\n\"answer\": \"July 13, 2023\",\n\"context\": \"The board has approved  July 1 2023 to be the  effective date  of the (amalgamation) scheme on which date the certified order of the NCLT sanctioning the scheme will be filed by HDFC Investments HDFC Holdings the Corporation and HDFC Bank with the Registrar of Companies (RoC)  a regulatory filing by HDFC stated.\"\n},\n{\n\"question\": \"When is the record date for continuation of warrants of HDFC in the name of HDFC Bank?\",\n\"answer\": \"July 13, 2023\",\n\"context\": \"July 13 has also been fixed as the record date for  continuation of warrants of the Corporation in the name of HDFC Bank  it added.\"\n},\n{\n\"question\": \"What is the record date for transfer of commercial papers of HDFC in the name of HDFC Bank?\",\n\"answer\": \"July 7, 2023\",\n\"context\": \"The filing also noted that July 7 has been fixed as the record date for  transfer of commercial papers of the Corporation in the name ofHDFC Bank  and July 12 for  transfer of nonconvertible debentures .\"\n},\n{\n\"question\": \"What is the record date for transfer of nonconvertible debentures?\",\n\"answer\": \"July 12, 2023\",\n\"context\": \"The filing also noted that July 7 has been fixed as the record date for  transfer of commercial papers of the Corporation in the name ofHDFC Bank  and July 12 for  transfer of nonconvertible debentures .\"\n},\n{\n\"question\": \"Who is the MD and CEO of HDFC Bank?\",\n\"answer\": \"Sashidhar Jagdishan\",\n\"context\": \"Commenting on the boards  final approval for the megamerger HDFC Bank MD and CEO Sashidhar Jagdishan said  This is a defining event in our journey and I m confident that our combined strength will enable us to create a holistic ecosystem of financial services. We re truly happy towelcome the talented team of HDFC Ltd into the HDFC Bank family.\"\n},\n{\n\"question\": \"What is the growth opportunity on housing loans for the combined entity HDFC Bank?\",\n\"answer\": \"Bigger than HDFC\",\n\"context\": \"The growth opportunity on housing loans will be bigger in HDFC Bank (the combined entity) than HDFC  said Mistry.\"\n},\n{\n\"question\": \"What percentage of HDFC Bank will existing shareholders of HDFC own once the merger is complete?\",\n\"answer\": \"41%\",\n\"context\": \"Once the deal comes into force HDFC Bank will be 100 percent owned by public shareholders and existing shareholders of HDFC will own 41 percent of the bank.\"\n}\n]"
]