[
    "[\n  {\n    \"question\": \"What was the percentage jump in Adani Ports and Special Economic Zone Limited's consolidated net profit for the quarter ended March 31, 2024?\",\n    \"answer\": \"76%\",\n    \"context\": \"Adani Ports and Special Economic Zone Limited (APSEZ) on May 2 reported 76  jump in consolidated net profit (attributable to equity shareholders of parent) at Rs 2040 crore for the quarter ended March 31 2024 helped by a jump in cargo volumes.\"\n  },\n  {\n    \"question\": \"What was the consolidated net profit reported by Adani Ports in the year-ago period?\",\n    \"answer\": \"Rs 1158 crore\",\n    \"context\": \"It reported consolidated net profit of Rs 1158 crore in the yearago period.\"\n  },\n  {\n    \"question\": \"What was the percentage increase in Adani Ports' revenue from operations in Q4FY24?\",\n    \"answer\": \"19%\",\n    \"context\": \"The Adani Group firm s revenue from operations rose 19  to Rs 6897 crore in Q4FY24 as compared to Rs 5797 crore in Q4FY23.\"\n  },\n  {\n    \"question\": \"What was the dividend declared by Adani Ports per equity share for the financial year 202324?\",\n    \"answer\": \"Rs 6\",\n    \"context\": \"The company declared dividend of Rs 6 per equity share of Rs 2 face value for the financial year 202324.\"\n  },\n  {\n    \"question\": \"What was the highest ever quarterly volume achieved by Adani Ports?\",\n    \"answer\": \"109 million metric tonnes (MMT)\",\n    \"context\": \"Adani Ports achieved its highest ever quarterly volumes at 109 million metric tonnes (MMT) in the JanuaryMarch period.\"\n  },\n  {\n    \"question\": \"What was the percentage growth in Adani Ports' domestic cargo volumes in FY24?\",\n    \"answer\": \"21%\",\n    \"context\": \"In FY24 APSEZ s domestic cargo volumes grew by 21  YoY versus 7.5  growth in India s cargo volumes in FY24.\"\n  },\n  {\n    \"question\": \"What was the net debt to EBITDA ratio of Adani Ports at the end of FY24?\",\n    \"answer\": \"2.3x\",\n    \"context\": \"APSEZ outperformed its upper end of guidance provided at the beginning of the financial year on cargo revenue and EBITDA by 6 8  while closing the year with net debt to EBITDA ratio of 2.3x vs its guidance of 2.5x.\"\n  },\n  {\n    \"question\": \"What is the strategic partnership model of Adani Ports and Special Economic Zone Limited?\",\n    \"answer\": \"End-to-end service strategic partnership with key customers leveraging the network effect through its string of ports and focus on operational efficiencies.\",\n    \"context\": \"Clearly the company s business model of endtoend service strategic partnership with key customers leveraging the network effect through its string of ports and focus on operational efficiencies is yielding results  said Ashwani Gupta WholeTime Director   CEO APSEZ.\"\n  }\n]",
    "```json\n[\n    {\n        \"question\": \"How could the escalating Israel-Iran conflict potentially impact Adani Ports?\",\n        \"answer\": \"Adani Ports, which owns and operates the Haifa port in Israel, faces a potential risk if the conflict escalates. While there's been no direct impact so far, the port, being critical infrastructure, could become a target, especially given its recent acquisition by Adani in January 2024.\",\n        \"context\": \"The conflict between Israel and Iran has raised concerns about its potential impact on global markets. Adani Ports, an Indian multinational, finds itself in a vulnerable position due to its ownership of the Haifa port in northern Israel. The company completed its acquisition of the port in January 2024 for approximately US $1.03 billion and operates it in partnership with a local entity.  While the conflict hasn't directly impacted the port's operations yet, a broader escalation could change this. The port, being a crucial part of Israel's infrastructure, could become a target, potentially disrupting Adani Ports' operations and impacting its revenue.\"\n    },\n    {\n        \"question\": \"What is the anticipated effect of the Israel-Iran conflict on Sun Pharma's subsidiary, Taro?\",\n        \"answer\": \"Sun Pharma's subsidiary, Taro, being an Israeli firm, might face production challenges if the conflict escalates and staff members are called for active military duty. However, this impact is not expected to significantly affect Sun Pharma's overall consolidated financials.\",\n        \"context\": \"The ongoing conflict has raised concerns about its potential impact on companies with operations in the region. Sun Pharma, a major Indian pharmaceutical company, has a subsidiary named Taro, based in Israel. While the conflict hasn't directly affected Taro's operations, a potential escalation could lead to disruptions. If the situation worsens, Taro's staff might be called upon for active military service, potentially impacting production to some extent. However, analysts predict that this impact on Taro is unlikely to significantly affect Sun Pharma's overall consolidated financial performance.\"\n    },\n    {\n        \"question\": \"How will the Israel-Iran conflict affect the stock of Oil Marketing Companies (OMCs) like HPCL, IOCL, and BPCL?\",\n        \"answer\": \"The conflict could push crude oil prices higher, potentially reaching $100 per barrel. This price surge would negatively impact Indian Oil Marketing Companies (OMCs) such as Hindustan Petroleum Corporation (HPCL), Indian Oil Corporation (IOCL), and Bharat Petroleum Corporation (BPCL), increasing their input costs and potentially squeezing their profit margins.\",\n        \"context\": \"The escalating tensions between Israel and Iran have sent ripples through the global energy market, with the potential to disrupt crude oil supply. As both countries are key players in the region, further escalation could trigger a surge in crude oil prices, potentially pushing it beyond $100 per barrel. This price surge would directly impact Oil Marketing Companies (OMCs) in India, including major players like Hindustan Petroleum Corporation (HPCL), Indian Oil Corporation (IOCL), and Bharat Petroleum Corporation (BPCL), as they rely heavily on crude oil imports to meet domestic demand. The rising crude prices would translate into increased input costs for these companies, potentially squeezing their profit margins and impacting their financial performance.\"\n    },\n    {\n        \"question\": \"What is the expected impact of rising crude oil prices on paint manufacturers like Akzo Nobel India, Berger Paints, Indigo Paints, and Shalimar Paints?\",\n        \"answer\": \"As crude oil derivatives constitute a significant portion of paint manufacturing costs, rising prices due to the conflict will likely hurt paint manufacturers like Akzo Nobel India, Berger Paints, Indigo Paints, and Shalimar Paints. This could result in narrower profit margins for these companies.\",\n        \"context\": \"The paint industry is heavily reliant on crude oil derivatives, which form a significant part of their raw material costs. With the escalating Israel-Iran conflict threatening to disrupt crude oil supply and push prices higher, paint manufacturers in India are bracing for a potential impact. Companies like Akzo Nobel India, Berger Paints, Indigo Paints, and Shalimar Paints are particularly vulnerable, as crude oil derivatives account for almost 40% of their input costs. Any surge in crude oil prices directly translates into higher input costs for these manufacturers, potentially squeezing their profit margins and impacting their overall profitability.\"\n    },\n    {\n        \"question\": \"How will the Israel-Iran conflict likely affect tyre companies like MRF, CEAT, Apollo Tyres, JK Tyres, and Goodyear Tire & Rubber India?\",\n        \"answer\": \"The tyre industry relies heavily on crude oil derivatives for synthetic rubber production. As a result, if the conflict drives up crude oil prices, tyre companies such as MRF, CEAT, Apollo Tyres, JK Tyres, and Goodyear Tire & Rubber India could experience reduced profit margins.\",\n        \"context\": \"The tyre industry\"\n    }\n]\n",
    "[\n  {\n    \"question\": \"What happened to the share price of Adani Ports on April 8th?\",\n    \"answer\": \"The share price of Adani Ports fell 2 percent in opening trade.\",\n    \"context\": \"Shares of Adani Ports fell 2 percent in opening trade after a large Rs 913crore deal took place on the exchanges on April 8.\"\n  },\n  {\n    \"question\": \"What was the volume of shares traded in the large deal?\",\n    \"answer\": \"One crore shares were traded in the large deal.\",\n    \"context\": \"The large deal also tipped a spike in volumes in the counter as one crore shares changed hands on the exchanges so far significantly higher than the onemonth daily traded average of 35 lakh shares.\"\n  },\n  {\n    \"question\": \"What percentage of the company's equity was traded in the large deal?\",\n    \"answer\": \"Around 67 lakh shares making up 0.3 percent equity in the company changed hands.\",\n    \"context\": \"Around 67 lakh shares making up 0.3 percent equity in the company changed hands at an average of Rs 1361 per share.\"\n  },\n  {\n    \"question\": \"What was the average price per share in the large deal?\",\n    \"answer\": \"The average price per share in the large deal was Rs 1361.\",\n    \"context\": \"Around 67 lakh shares making up 0.3 percent equity in the company changed hands at an average of Rs 1361 per share.\"\n  },\n  {\n    \"question\": \"What was the floor price of the deal?\",\n    \"answer\": \"The floor price of the deal represented an over 1 percent discount to the previous close.\",\n    \"context\": \"The floor price of the deal represented an over 1 percent discount to the previous close.\"\n  },\n  {\n    \"question\": \"What did Citi revise its target price for Adani Ports to?\",\n    \"answer\": \"Citi revised its target price for Adani Ports to Rs 1758.\",\n    \"context\": \"Buoyed by this Citi revised its target price for the stock upward to Rs 1758 as against tht previous Rs 1564 indicating a potential upside of about 27.8 percent.\"\n  },\n  {\n    \"question\": \"What did Morgan Stanley reaffirm its rating on Adani Ports to?\",\n    \"answer\": \"Morgan Stanley reaffirmed its \\\"overweight\\\" rating on Adani Ports.\",\n    \"context\": \"Morgan Stanley also reaffirmed its  overweight  rating on the stock retaining a target price of Rs 1576.\"\n  },\n  {\n    \"question\": \"What volume growth did Morgan Stanley report for Adani Ports for the past fiscal year?\",\n    \"answer\": \"Morgan Stanley reported that Adani Ports' volume growth for the past fiscal year surpassed expectations with eight out of ten ports reporting doubledigit growth.\",\n    \"context\": \"According to the  brokerage the volume growth for the past fiscal year surpassed expectations with eight out of ten ports reporting doubledigit growth.\"\n  }\n]",
    "[\n  {\n    \"question\": \"What was the highest monthly cargo volume reported by Adani Ports and SEZ?\",\n    \"answer\": \"38 million metric tonnes (MMT)\",\n    \"context\": \"Brokerages retained their bullish outlook on Adani Ports and SEZ after the company reported its highestever monthly cargo volume of 38 million metric tonnes (MMT) in March.\"\n  },\n  {\n    \"question\": \"What was the percentage increase in cargo handled by Adani Ports in FY24?\",\n    \"answer\": \"24 percent\",\n    \"context\": \"Adani Ports also handled 420 MMT of cargo in FY24 (including international ports) clocking a 24 percent onyear rise.\"\n  },\n  {\n    \"question\": \"What is the current stock price of Adani Ports?\",\n    \"answer\": \"Rs 1378 apiece\",\n    \"context\": \"At 9.20 am Adani Ports stock was quoting Rs 1378 apiece higher by 2.7 percent compared to the previous session s closing price.\"\n  },\n  {\n    \"question\": \"What percentage of India's cargo volumes was routed through Adani Ports in FY24?\",\n    \"answer\": \"More than onefourth\",\n    \"context\": \"During FY24 more than onefourth of all India cargo volumes was routed through APSEZ ports.\"\n  },\n  {\n    \"question\": \"What is the target price set by Citi for Adani Ports?\",\n    \"answer\": \"Rs 1758 per share\",\n    \"context\": \"Citi has raised its target price on the stock from Rs 1564 per share to around Rs 1758 apiece implying an upside of around 27.8 percent.\"\n  },\n  {\n    \"question\": \"What is the expected EBITDA growth for Adani Ports in Q4?\",\n    \"answer\": \"Around 29 percent\",\n    \"context\": \"The strong volume growth should lead to coreport EBITDA growth of around 29 percent onyear while consolidated EBITDA and PBT should grow 27 percent and 24 percent.\"\n  },\n  {\n    \"question\": \"What is Morgan Stanley's target price for Adani Ports?\",\n    \"answer\": \"Rs 1576 per share\",\n    \"context\": \"Morgan Stanley also maintained its  overweight  call with a target price of Rs 1576 per share indicating a 14.5 percent upside.\"\n  },\n  {\n    \"question\": \"What percentage of ports reported doubledigit growth for Adani Ports in FY24?\",\n    \"answer\": \"Eight out of 10\",\n    \"context\": \"The international broking firm said that the volume growth for the financial year gone by beat the guidance with eight on 10 ports reporting doubledigit growth.\"\n  }\n]",
    "```\n[\n  {\n    \"question\": \"How much stake will Adani Ports acquire in Gopalpur Port?\",\n    \"answer\": \"95 percent\",\n    \"context\": \"Adani Ports and Special Economic Zone will acquire a 95 percent stake in Gopalpur Port in Odisha for an equity value of Rs 1349 crore in order to strengthen its east coast footprint India s largest private port operator said on March 26.\"\n  },\n  {\n    \"question\": \"From whom will Adani Ports purchase the stake in Gopalpur Port?\",\n    \"answer\": \"Shapoorji Pallonji Group (SP Group) and Orissa Stevedores\",\n    \"context\": \"Adani Ports will purchase a 56 percent stake in the port from realestate conglomerate Shapoorji Pallonji Group (SP Group) and a 39 percent from Orissa Stevedores.\"\n  },\n  {\n    \"question\": \"What are the benefits of Adani Ports acquiring Gopalpur Port?\",\n    \"answer\": \"It will add to the Adani Group s panIndia port network east coast vs west coast cargo volume parity and strengthen APSEZ s integrated logistics approach\",\n    \"context\": \"GPL (Gopalpur Port) will add to the Adani Group s panIndia port network east coast vs west coast cargo volume parity and strengthen APSEZ s integrated logistics approach  said Karan Adani managing director at Adani Ports.\"\n  },\n  {\n    \"question\": \"What types of cargo does Gopalpur Port handle?\",\n    \"answer\": \"dry bulk cargo including iron ore coal limestone ilmenite and alumina\",\n    \"context\": \"The port handles a mix of dry bulk cargo including iron ore coal limestone ilmenite and alumina reports said.\"\n  },\n  {\n    \"question\": \"Who advised the Shapoorji Pallonji Group on this deal?\",\n    \"answer\": \"Deutsche Bank\",\n    \"context\": \"The Shapoorji Pallonji Group was advised by Deutsche Bank on this deal.\"\n  },\n  {\n    \"question\": \"What is the current share price of Adani Ports?\",\n    \"answer\": \"Rs 1276.70\",\n    \"context\": \"On March 22 the Adani Ports stock closed at Rs 1276.70on the National Stock Exchange up 1.13 percent from the previous close.\"\n  },\n  {\n    \"question\": \"What is the significance of the planned divestments of Gopalpur Port and Dharamtar Port?\",\n    \"answer\": \"They demonstrate the SP Group s ability to turn around assets and create stakeholder value in a relatively short period of time\",\n    \"context\": \"The planned divestments of Gopalpur Port and Dharamtar Port at a significant enterprise value demonstrate our group s ability to turn around assets and create stakeholder value in a relatively short period of time capitalising our core strengths in project development and construction  a spokesperson for the SP Group said.\"\n  },\n  {\n    \"question\": \"What is the port s current handling capacity?\",\n    \"answer\": \"20 million tonnes of freight per year\",\n    \"context\": \"The port can now handle 20 million tonnes of freight a year and runs at high efficiency levels.\"\n  }\n]\n```\"\n    }\n]\n",
    "[{\"question\": \"What was the reason behind the surge in Adani Ports' stock price?\", \"answer\": \"Adani Ports' stock price reached a new all-time high due to a substantial 33% year-on-year increase in cargo volumes for February, reaching 35.4 MMT.\", \"context\": \"The stock market reacted positively to Adani Ports' impressive performance in February, as evidenced by its stock reaching a new all-time high. This surge was fueled by the company's announcement of a significant 33% year-on-year growth in cargo volumes, hitting 35.4 MMT. This positive development underscores Adani Ports' strong market position and its ability to capitalize on increasing trade activities.\"}, {\"question\": \"How did Adani Ports' cargo volume in February 2024 compare to the same period last year?\", \"answer\": \"Adani Ports witnessed a significant 33% year-on-year increase in cargo volumes in February 2024, handling 35.4 MMT compared to the previous year.\", \"context\": \"In February 2024, Adani Ports handled a total of 35.4 MMT of cargo, demonstrating a remarkable 33% growth compared to the same month in the previous year. This substantial increase in cargo volume signifies the company's robust operational efficiency and its ability to cater to the growing demands of the maritime trade sector.\"}, {\"question\": \"Which Adani Ports facility achieved a notable cargo volume milestone in February?\", \"answer\": \"Dhamra Port, operated by Adani Ports, achieved its highest-ever monthly cargo volume of 4.22 MMT in February.\", \"context\": \"Amongst its various port facilities, Adani Ports' Dhamra Port stood out by achieving a significant milestone in February. The port handled a record-breaking 4.22 MMT of cargo, marking its highest-ever monthly volume. This achievement highlights Dhamra Port's growing importance as a key cargo handling hub for Adani Ports.\"}, {\"question\": \"What is Adani Ports' target for total cargo handled by the end of the financial year?\", \"answer\": \"Adani Ports aims to handle over 400 MMT of cargo before the end of the fiscal year in March.\", \"context\": \"Adani Ports has set an ambitious target of handling over 400 MMT of cargo by the end of the current financial year in March. With a cumulative cargo volume of 382 MMT already achieved in the first 11 months, the company appears well-positioned to surpass this goal comfortably.\"}, {\"question\": \"How long did it take Adani Ports to reach the milestone of handling 350 MMT of cargo at its Indian ports?\", \"answer\": \"Adani Ports achieved the milestone of surpassing 350 MMT of cargo volume at its domestic ports in a span of 318 days.\", \"context\": \"Demonstrating its operational efficiency and strong market presence, Adani Ports managed to achieve a significant milestone by handling over 350 MMT of cargo volume at its domestic ports within a timeframe of 318 days. This accomplishment highlights the company's rapid growth trajectory and its ability to efficiently manage large cargo volumes.\"}, {\"question\": \"What was the performance of Adani Ports' logistics arm in terms of rail volumes?\", \"answer\": \"Adani Ports' logistics arm recorded a 21% year-on-year increase in rail volumes, reaching 542,000 TEUs.\", \"context\": \"Adani Ports' logistics arm exhibited strong performance, with year-to-date rail volumes surging by 21% year-on-year to reach 542,000 TEUs. This growth signifies the company's focus on expanding its logistical capabilities to complement its port operations and provide integrated solutions to clients.\"}, {\"question\": \"What rating did Motilal Oswal assign to Adani Ports' stock, and what was the target price?\", \"answer\": \"Motilal Oswal gave Adani Ports' stock a 'buy' rating with a target price of Rs 1,410 in their January 8 report.\", \"context\": \"In a research report published on January 8, brokerage firm Motilal Oswal expressed a positive outlook on Adani Ports' stock, assigning it a 'buy' rating and setting a target price of Rs 1,410. This recommendation reflects the brokerage's confidence in the company's future growth prospects and its ability to deliver strong returns for investors.\"}, {\"question\": \"How has Adani Ports' stock performed compared to the Nifty 50 index in the past six months?\", \"answer\": \"Adani Ports' stock has outperformed the Nifty 50 index, surging by around 70% compared to\"\n    }\n]\n",
    "```json\n[\n  {\n    \"question\": \"What was the net sales of Adani Ports in December 2023?\",\n    \"answer\": \"Rs. 6920.10 crore\",\n    \"context\": \"Net Sales at Rs 6920.10 crore in December 2023 up 44.59  from Rs. 4786.17 crore in December 2022.\"\n  },\n  {\n    \"question\": \"How much was the quarterly net profit of Adani Ports in December 2023?\",\n    \"answer\": \"Rs. 2208.41 crore\",\n    \"context\": \"Quarterly Net Profit at Rs. 2208.41 crore in December 2023 up 67.87  from Rs. 1315.54 crore in December 2022.\"\n  },\n  {\n    \"question\": \"What was the EBITDA of Adani Ports in December 2023?\",\n    \"answer\": \"Rs. 4800.05 crore\",\n    \"context\": \"EBITDA stands at Rs. 4800.05 crore in December 2023 up 62.08  from Rs. 2961.50 crore in December 2022.\"\n  },\n  {\n    \"question\": \"What is the current EPS of Adani Ports?\",\n    \"answer\": \"Rs. 10.22\",\n    \"context\": \"Adani Ports EPS has increased to Rs. 10.22 in December 2023 from Rs. 6.09 in December 2022.\"\n  },\n  {\n    \"question\": \"What was the closing price of Adani Ports shares on February 01, 2024?\",\n    \"answer\": \"1218.85\",\n    \"context\": \"Adani Ports shares closed at 1218.85 on February 01 2024 (NSE)\"\n  },\n  {\n    \"question\": \"What is the return on Adani Ports shares over the last 6 months?\",\n    \"answer\": \"59.25%\",\n    \"context\": \"and has given 59.25  returns over the last 6 months\"\n  },\n  {\n    \"question\": \"What is the return on Adani Ports shares over the last 12 months?\",\n    \"answer\": \"146.16%\",\n    \"context\": \"and 146.16  over the last 12 months.\"\n  }\n]\n```\"\n    }\n]\n",
    "[\n  {\n    \"question\": \"What was the percentage increase in Adani Ports' net profit during the third quarter?\",\n    \"answer\": \"64 percent\",\n    \"context\": \"Adani Ports outgrew the Street estimates with a 64 percent surge in Q3 net profit and pushed the stock to a fresh 52week high on the NSE on February 2.\"\n  },\n  {\n    \"question\": \"What was the primary driver behind Adani Ports' increased net profit?\",\n    \"answer\": \"Robust power sales and higher capacity utilisation\",\n    \"context\": \"The surge in the thirdquarter bottomline to Rs 2250 crore and a 47 percent spike in onyear revenue to Rs 7426 crore were driven by robust power sales and higher capacity utilisation.\"\n  },\n  {\n    \"question\": \"What is the expected annual growth rate for Adani Ports' cargo volume?\",\n    \"answer\": \"Double digits for the next 34 years\",\n    \"context\": \"Sustainable market share gains expansion of LPG LNG terminals at Mundra and Dhamra and the upcoming Vizhingham port are likely to keep Adani Ports volume growth ticking in double digits for the next 34 years according to analysts at Nuvama Institutional Equities.\"\n  },\n  {\n    \"question\": \"What are the major factors contributing to the company's volume growth?\",\n    \"answer\": \"Consolidation of volumes, focus on ports with O D demand over transshipment\",\n    \"context\": \"As shipping lines deploy larger vessels and consolidate routes the focus will move to ports with O D demand over transshipment. Thus this consolidation will be a boost for APSEZ given its scale panIndia presence and existing strong relationships with container liner companies Nuvama said.\"\n  },\n  {\n    \"question\": \"What is Bernstein's target price for Adani Ports?\",\n    \"answer\": \"Rs 1243 per share\",\n    \"context\": \"Bernstein has an outperform rating on Adani Ports with a target price of Rs 1243 per share.\"\n  },\n  {\n    \"question\": \"What is Adani Ports' EBITDA margin?\",\n    \"answer\": \"71.3 percent\",\n    \"context\": \"The company s port EBITDA margin improved to 71.3 percent driven by efficiency gains and better utilisation.\"\n  },\n  {\n    \"question\": \"What is the revised target price for Adani Ports as per Jefferies?\",\n    \"answer\": \"Rs 1425\",\n    \"context\": \"Jefferies said in a report that operationally Adani Ports is continuing to move from strength to strength with the market share moving up to 26 percent from 14 percent in FY15 and expected to be over 30 percent by FY25. As core port EBITDA growth remains upward of double digits backed by volumes we remain positive on the stock the brokerage said putting a buy tag on the stock with a revised target price of Rs 1425 (as against Rs 1365 earlier) in the base case scenario.\"\n  },\n  {\n    \"question\": \"What is one of the potential upside scenarios for Adani Ports according to Jefferies?\",\n    \"answer\": \"Faster rampup at other ports in the portfolio and pickup in port realisation\",\n    \"context\": \"In an upside scenario where Mundra cargo volume growth picks up Faster rampup at the other ports in the portfolio and pickup in port realisation is seen the stock may rally to Rs 1630 Jefferies said.\"\n  }\n]",
    "[\n  {\n    \"question\": \"How much did Adani Ports shares increase on February 2?\",\n    \"answer\": \"Around 5 percent\",\n    \"context\": \"Adani Ports shares jumped around 5 percent on February 2 to hit a fresh 52week high of Rs 1287.20 a day after the company's Q3 earnings beat estimates.\"\n  },\n  {\n    \"question\": \"What was the main reason behind Adani Ports' strong Q3 performance?\",\n    \"answer\": \"Robust power sales to customers and higher capacity utilisation\",\n    \"context\": \"For the December quarter, Adani Ports' net profit more than doubled on-year to Rs 2250 crore driven by robust power sales to customers and higher capacity utilisation.\"\n  },\n  {\n    \"question\": \"What is the current sentiment among analysts regarding Adani Ports?\",\n    \"answer\": \"Bullish\",\n    \"context\": \"Analysts remain bullish on Adani Ports given the high cargo volumes and the healthy growth trajectory of the logistics business.\"\n  },\n  {\n    \"question\": \"How much did Adani Ports' revenue increase in Q3?\",\n    \"answer\": \"47 percent YoY to Rs 7426 crore\",\n    \"context\": \"Adani Ports' revenue surged 47 percent YoY to Rs 7426 crore driven by an increase in cargo volumes.\"\n  },\n  {\n    \"question\": \"What factors contributed to Adani Ports' revenue growth?\",\n    \"answer\": \"Increase in cargo volumes and improved efficiencies\",\n    \"context\": \"The revenue growth was aided by an increase in cargo volumes. The operating profit growth was attributed to improved efficiencies and capacity utilisation.\"\n  },\n  {\n    \"question\": \"What was the stock price of Adani Ports at 9:52 am on the NSE?\",\n    \"answer\": \"Rs 1278.75\",\n    \"context\": \"At 9:52 am, Adani Ports shares were trading 4.9 percent higher at Rs 1278.75 on the National Stock Exchange (NSE).\"\n  },\n  {\n    \"question\": \"How has Adani Ports' stock performed in the last year compared to the benchmark Nifty 50?\",\n    \"answer\": \"Outperformed by 176 percent\",\n    \"context\": \"In the last one year, the stock has surged 176 percent outperforming benchmark Nifty 50 which has risen 24 percent during this period.\"\n  },\n  {\n    \"question\": \"What is the main reason for the increase in Adani Ports' cargo volumes?\",\n    \"answer\": \"The context does not provide a specific reason for the increase in cargo volumes.\",\n    \"context\": \"The context does not explicitly state the reason for the increase in cargo volumes.\"\n  }\n]",
    "[{'question': 'What was the Net Sales of Adani Ports in December 2023?', 'answer': 'The Net Sales of Adani Ports in December 2023 was Rs 1886.67 crore.', 'context': 'The provided financial data indicates a significant increase in Adani Ports\\' Net Sales, reaching Rs 1886.67 crore in December 2023. This represents a substantial 36.89% growth compared to the Net Sales of Rs. 1378.24 crore in December 2022. Such a robust increase in Net Sales suggests strong operational performance and potentially favorable market conditions for Adani Ports during this period.'}, {'question': 'How much did the Net Sales of Adani Ports increase year-on-year in December 2023?', 'answer': 'The Net Sales of Adani Ports went up by 36.89% year-on-year in December 2023.', 'context': 'The financial data reveals a remarkable 36.89% year-on-year increase in Adani Ports\\' Net Sales for December 2023. This signifies a healthy growth trend in the company\\'s top-line performance, suggesting increased demand for its services or successful implementation of growth strategies.'}, {'question': 'What is the Quarterly Net Profit of Adani Ports in December 2023?', 'answer': 'Adani Ports reported a Quarterly Net Profit of Rs. 525.49 crore in December 2023.', 'context': 'The financial information highlights a significant increase in Adani Ports\\' profitability. Specifically, the Quarterly Net Profit surged to Rs. 525.49 crore in December 2023. This represents a remarkable growth compared to the Rs. 11.40 crore reported in December 2022, indicating improved operational efficiency and potentially favorable market conditions.'}, {'question': 'What was the percentage increase in Adani Ports\\'s Quarterly Net Profit in December 2023 compared to December 2022?', 'answer': 'Adani Ports witnessed a staggering 4509.56% surge in its Quarterly Net Profit in December 2023 compared to the same period in the previous year.', 'context': 'The provided data points to a dramatic increase in Adani Ports\\' profitability. The Quarterly Net Profit experienced an exceptional surge, skyrocketing by 4509.56% in December 2023 compared to December 2022. This extraordinary growth signifies substantial improvements in the company\\'s operational efficiency, potentially coupled with favorable market factors, resulting in significantly higher profitability.'}, {'question': 'What was the EBITDA of Adani Ports as of December 2023?', 'answer': 'The EBITDA of Adani Ports in December 2023 stood at Rs. 1771.40 crore.', 'context': 'The financial figures indicate a robust EBITDA of Rs. 1771.40 crore for Adani Ports in December 2023. This figure reflects the company\\'s earnings before interest, taxes, depreciation, and amortization, highlighting its core operating profitability. The substantial EBITDA suggests strong financial health and efficient management of operating expenses.'}, {'question': 'How much did the EBITDA of Adani Ports increase in December 2023 compared to the previous year?', 'answer': 'The EBITDA of Adani Ports witnessed a notable increase of 114.5% in December 2023 compared to December 2022.', 'context': 'The financial data reveals a significant improvement in Adani Ports\\' EBITDA, which surged by 114.5% in December 2023 compared to the same period in the previous year. This substantial increase indicates enhanced operational efficiency, potentially driven by factors such as revenue growth, cost optimization measures, or a combination of both.'}, {'question': 'What was the EPS of Adani Ports in December 2023?', 'answer': 'Adani Ports reported an EPS of Rs. 2.43 in December 2023.', 'context': 'The financial data for Adani Ports indicates that the company achieved an EPS of Rs. 2.43 in December 2023. EPS, or Earnings Per Share, represents the portion of a company\\'s profit allocated to each outstanding share of common stock. This figure provides insights into the company\\'s profitability from the perspective of its shareholders.'}, {'question': 'What was the closing price of Adani Ports shares on NSE on February 01, 2024?', 'answer': 'On February 01, 2024, Adani Ports shares closed at Rs. 1218.8\"\n    }\n]\n",
    "[\n  {\n    \"question\": \"What was Adani Ports' net profit for the quarter ended December 2023?\",\n    \"answer\": \"Rs 2210 crore\",\n    \"context\": \"Adani Ports on February 1 reported robust earnings for the quarter ended December 2023. Its consolidated net profit jumped 65 percent onyear to Rs 2210 crore while its revenue surged 47 percent YoY to Rs 7426 crore driven by an increase in cargo volumes.\"\n  },\n  {\n    \"question\": \"What was the revenue of Adani Ports for the quarter ended December 2023?\",\n    \"answer\": \"Rs 7426 crore\",\n    \"context\": \"Adani Ports on February 1 reported robust earnings for the quarter ended December 2023. Its consolidated net profit jumped 65 percent onyear to Rs 2210 crore while its revenue surged 47 percent YoY to Rs 7426 crore driven by an increase in cargo volumes.\"\n  },\n  {\n    \"question\": \"What was the EBITDA of Adani Ports for the quarter ended December 2023?\",\n    \"answer\": \"Rs 4292 crore\",\n    \"context\": \"The company's earnings before interest taxes depreciation and amortisation (EBITDA) was also up surging 59 percent to Rs 4292 crore.\"\n  },\n  {\n    \"question\": \"What was the growth in Adani Ports' net profit for the quarter ended December 2023?\",\n    \"answer\": \"65 percent\",\n    \"context\": \"Adani Ports on February 1 reported robust earnings for the quarter ended December 2023. Its consolidated net profit jumped 65 percent onyear to Rs 2210 crore while its revenue surged 47 percent YoY to Rs 7426 crore driven by an increase in cargo volumes.\"\n  },\n  {\n    \"question\": \"What was the growth in Adani Ports' revenue for the quarter ended December 2023?\",\n    \"answer\": \"47 percent\",\n    \"context\": \"Adani Ports on February 1 reported robust earnings for the quarter ended December 2023. Its consolidated net profit jumped 65 percent onyear to Rs 2210 crore while its revenue surged 47 percent YoY to Rs 7426 crore driven by an increase in cargo volumes.\"\n  },\n  {\n    \"question\": \"What was the growth in Adani Ports' EBITDA for the quarter ended December 2023?\",\n    \"answer\": \"59 percent\",\n    \"context\": \"The company's earnings before interest taxes depreciation and amortisation (EBITDA) was also up surging 59 percent to Rs 4292 crore.\"\n  },\n  {\n    \"question\": \"What was the growth in Adani Ports' cargo volume for the quarter ended December 2023?\",\n    \"answer\": \"23 percent\",\n    \"context\": \"The overall cargo volume was 311 MMT in the nine months ended December up 23 percent yearonyear.\"\n  },\n  {\n    \"question\": \"What was the growth in Adani Ports' cargo volume in the nine months ended December 2023?\",\n    \"answer\": \"23 percent\",\n    \"context\": \"The overall cargo volume was 311 MMT in the nine months ended December up 23 percent yearonyear.\"\n  }\n]",
    "[\n  {\n    \"question\": \"What is the expected net profit of Adani Ports in Q3?\",\n    \"answer\": \"Adani Ports' consolidated net profit is expected to jump 61 percent on-year to Rs 2123 crore in Q3.\",\n    \"context\": \"Consolidated net profit may jump 61 percent on-year to Rs 2123 crore and revenue may surge 44 percent to Rs 6913 crore according to the average estimate of four brokerages polled by  .\"\n  },\n  {\n    \"question\": \"What is the expected revenue growth of Adani Ports in Q3?\",\n    \"answer\": \"Adani Ports' revenue is expected to surge 44 percent to Rs 6913 crore in Q3.\",\n    \"context\": \"Consolidated net profit may jump 61 percent on-year to Rs 2123 crore and revenue may surge 44 percent to Rs 6913 crore according to the average estimate of four brokerages polled by  .\"\n  },\n  {\n    \"question\": \"What is the expected EBITDA growth of Adani Ports in Q3?\",\n    \"answer\": \"Adani Ports' EBITDA is expected to rise by 33 percent in Q3.\",\n    \"context\": \"Adani Ports  earnings before interest taxes depreciation and amortisation (EBITDA) is seen rising 33 percent.\"\n  },\n  {\n    \"question\": \"What is the expected margin decline of Adani Ports in Q3?\",\n    \"answer\": \"Adani Ports' margins are expected to decline by 100 basis points (bps) to 61 percent in Q3.\",\n    \"context\": \"However margins may decline 100 basis points (bps) to 61 percent in Q3.\"\n  },\n  {\n    \"question\": \"What is the cargo handling market share of Adani Ports?\",\n    \"answer\": \"Adani Ports has a more than 24 percent market share in cargo handling.\",\n    \"context\": \"APSEZ has a more than 24 percent market share in cargo handling.\"\n  },\n  {\n    \"question\": \"How did Adani Ports' cargo volumes perform in Q3?\",\n    \"answer\": \"Adani Ports' total volumes handled in Q3 stood at 108.7 million metric tonnes (MMT), leading to a healthy jump in revenue.\",\n    \"context\": \"Total volumes handled at Adani Ports during Q3 stood at 108.7 million metric tonnes (MMT) leading to a healthy jump in revenue.\"\n  },\n  {\n    \"question\": \"What is Adani Ports' expected volume guidance for FY24?\",\n    \"answer\": \"Adani Ports has increased its volume guidance to 400 MMT in FY24 from 370-390 MMT earlier.\",\n    \"context\": \"With monthly volumes of about 35 MMT the company increased volume guidance to 400 MMT in FY24 from 370390 MMT earlier.\"\n  },\n  {\n    \"question\": \"What are the key monitorables for investors in Adani Ports?\",\n    \"answer\": \"The key monitorables for investors in Adani Ports are improvement in utilization at existing and recently acquired ports, growth in the logistics business, recovery in global trade, and volume ramp-up.\",\n    \"context\": \"Improvement in utilisation at existing and recently acquired ports growth in the logistics business along with the recovery in global trade and volume rampup remain the key monitorables for investors.\"\n  }\n]",
    "[{'question': 'Why did the share prices of Adani Group firms increase, particularly Adani Enterprises?', 'answer': 'Shares of Adani Group firms, especially Adani Enterprises, surged due to a confluence of positive factors. Cantor Fitzgerald, an international brokerage firm, initiated coverage on Adani Enterprises with an \"overweight\" call, setting a target price of Rs 4,368. They believe Adani Enterprises is vital for India's economic growth, making it a unique long-term investment. This positive outlook, coupled with talks of Adani Group seeking to raise $3 billion in funding, contributed to the share price surge.', 'context': 'The share prices of all Adani Group firms experienced a significant increase, reaching up to nearly 6 percent, on January 29th. This surge was primarily driven by several key factors, including discussions of fundraising initiatives. Leading the pack was the flagship company, Adani Enterprises, which saw its stock price soar by over 5 percent, hitting an intraday high of Rs 3,050 on the National Stock Exchange. This impressive performance was fueled by Cantor Fitzgerald, an international brokerage firm, initiating coverage on the stock with an \"overweight\" call, indicating a positive outlook for the company.'}, {'question': 'What is Cantor Fitzgerald’s outlook on Adani Enterprises?', 'answer': 'Cantor Fitzgerald believes that Adani Enterprises is essential for India’s economic growth, making it a unique long-term investment opportunity. They view the current risk-reward ratio as attractive and have assigned a target price of Rs 4,368 for Adani Enterprises.', 'context': 'Cantor Fitzgerald, an international brokerage firm, has initiated coverage on Adani Enterprises with a bullish outlook. They have assigned an \"overweight\" call to the stock, indicating their belief that it will outperform the market. The firm's positive stance is rooted in their assessment of Adani Enterprises' pivotal role in India's economic expansion. Cantor Fitzgerald contends that the company is strategically positioned to capitalize on the country's growth trajectory, making it an attractive investment proposition for the long term.'}, {'question': 'What steps has Adani taken to address concerns raised in the Hindenburg report?', 'answer': 'According to Cantor Fitzgerald, Adani has taken measures to mitigate liquidity risk, enhance governance practices, and bolster transparency. These actions come in the wake of the Hindenburg report, which had leveled allegations of stock manipulation and other wrongdoings against the Adani Group. ', 'context': 'Cantor Fitzgerald acknowledges the impact of the Hindenburg report, which had accused the Adani Group of stock manipulation and other wrongdoings, leading to a significant decline in the group's stock prices. However, the firm emphasizes that Adani has taken steps to address the concerns raised in the report. These measures include efforts to reduce liquidity risk, improve governance practices, and enhance transparency. By taking these steps, Adani aims to restore investor confidence and demonstrate its commitment to ethical and responsible business practices.'}, {'question': 'How close is Adani Enterprises’ stock price to its pre-Hindenburg report levels?', 'answer': 'Adani Enterprises is nearing its pre-Hindenburg research report levels. Almost a year ago, the report by the American short-seller Hindenburg, accusing the Adani Group of stock manipulation and other wrongdoings, caused a steep decline in the group's stock prices. ', 'context': 'The stock price of Adani Enterprises is approaching its levels prior to the release of the Hindenburg research report, which had a significant impact on the company's valuation. It has been nearly a year since the report, published by the American short-seller Hindenburg, sent shockwaves through the market. The report accused the Adani Group of engaging in stock manipulation and other unethical practices, leading to a sharp decline in the share prices of Adani Group companies. Since then, Adani Enterprises has been gradually recovering, with its stock price moving closer to its pre-Hindenburg levels.'}, {'question': 'Besides Adani Enterprises, which other Adani Group companies experienced stock price increases?', 'answer': 'In addition to Adani Enterprises, other Adani Group companies, including Adani Energy Solutions, Adani Power, Adani Ports, Adani Green Energy, Adani Total Gas, Adani Wilmar, ACC, Ambuja Cement, and NDTV, also witnessed gains in their stock prices.', 'context': \"The positive sentiment surrounding the Adani Group extended beyond Adani Enterprises, as several other companies within the conglomerate also witnessed notable gains in their stock prices. Adani Energy Solutions saw its shares jump over 5 percent following the announcement of its wholly-owned subsidiary, Adani Energy Solutions StepTwelve Limited (AESSTL). Adani Power's stock price surged over 3 percent after AdaniConnex (ACX), a joint venture between Adani Group and EdgeConneX, secured\"\n    }\n]\n",
    "[\n  {\n    \"question\": \"What is the outlook for Adani Ports and Special Economic Zone Ltd. (APSEZ) and Adani Electricity Mumbai Ltd. (AEML)?\",\n    \"answer\": \"Stable\",\n    \"context\": \"S P Global upgraded its outlook on Adani Ports and Special Economic Zone Ltd. (APSEZ) and Adani Electricity Mumbai Ltd. (AEML) to stable from negative while affirming their credit ratings.\"\n  },\n  {\n    \"question\": \"Why did S P Global upgrade its outlook on APSEZ and AEML?\",\n    \"answer\": \"Strong business fundamentals and robust cash flows\",\n    \"context\": \"The stable outlook reflects strong business fundamentals and robust cash flows for AEML and APSEZ in the next 12 to 24 months.\"\n  },\n  {\n    \"question\": \"What did the shortseller report released in January 2023 allege?\",\n    \"answer\": \"Noncompliance of minimum public shareholding nondisclosures of related party transactions or stock price manipulation among others\",\n    \"context\": \"The report alleged noncompliance of minimum public shareholding nondisclosures of related party transactions or stock price manipulation among others.\"\n  },\n  {\n    \"question\": \"What did Adani Group do in response to the allegations?\",\n    \"answer\": \"Denied all allegations\",\n    \"context\": \"All allegations were denied by Adani Group.\"\n  },\n  {\n    \"question\": \"What did S P Global say about the conclusion of most regulatory investigations into the Adani Group?\",\n    \"answer\": \"Reduced downside risk\",\n    \"context\": \"S P said it believes the conclusion of most regulatory investigations into the Adani Group without evidence of wrongdoing has reduced downside risk.\"\n  },\n  {\n    \"question\": \"What are some governance risks that the Adani Group remains exposed to?\",\n    \"answer\": \"Part of a large familyowned conglomerate with ambitious growth plans and relatedparty transactions\",\n    \"context\": \"It added though that the group remains exposed to some governance risks as part of a large familyowned conglomerate with ambitious growth plans and relatedparty transactions.\"\n  },\n  {\n    \"question\": \"What did the Supreme Court of India confirm earlier this month?\",\n    \"answer\": \"SEBI had completed its investigation of 22 of the 24 allegations against the Adani portfolio entities without any adverse findings\",\n    \"context\": \"Earlier this month the Supreme Court of India issued a judgement confirming that Securities and Exchange Board of India (SEBI) had completed its investigation of 22 of the 24 allegations against the Adani portfolio entities without any adverse findings.\"\n  },\n  {\n    \"question\": \"What did S P Global forecast for APSEZ's ratio of funds from operations (FFO) to debt?\",\n    \"answer\": \"Increase to 2124 percent over FY2425\",\n    \"context\": \"We forecast APSEZ s ratio of funds from operations (FFO) to debt to increase to 2124 percent over FY2425 from about 18.5 percent in FY23.\"\n  }\n]",
    "```\n[\n  {\n    \"question\": \"What is the reason behind the marginal rise in Indian equities?\",\n    \"answer\": \"Despite the initial gains, Indian equities ended slightly higher due to concerns over the quarterly results of Infosys and TCS.\",\n    \"context\": \"India s benchmark indices ended marginally higher trimming most of their intraday gains as investors were concerned over the quarterly results of Infosys and TCS.\"\n  },\n  {\n    \"question\": \"Which two IT companies posted weak growth in their third quarter results?\",\n    \"answer\": \"Both Infosys and TCS, India's top two software companies, reported muted third quarter results due to weakness in key markets.\",\n    \"context\": \"Tata Consultancy Services grew marginally faster than its closest rival Infosys in the December quarter even as both IT heavyweights remained at risk of post weak growth numbers in 202324. Infosys has cut its revenue growth guidance for the third consecutive quarter. TCS beat analyst expectations slightly but still saw muted growth.\"\n  },\n  {\n    \"question\": \"What kind of changes has the expert committee of SEBI suggested for public listing?\",\n    \"answer\": \"The expert panel of SEBI has proposed providing companies more flexibility to alter the issue size after submitting an offer document, as well as allowing more avenues to maintain the mandatory minimum 20% promoter contribution after market listing.\",\n    \"context\": \"Corporate India s pathway to public listing could get easier as an expert committee of the Securities and Exchange Board of India has suggested providing firms more flexibility to alter the issue size post the submission of an offer document. The panel has also recommended more avenues to maintain the mandatory minimum 20 percent promoter contribution after market listing.\"\n  },\n  {\n    \"question\": \"Which companies is Tata Consumer Products set to acquire controlling stakes in?\",\n    \"answer\": \"Tata Consumer Products is expected to acquire controlling stakes in Capital Foods and Organic India, a maker of organic teas and health products backed by Fabindia.\",\n    \"context\": \"Tata Consumer to acquire controlling stake in Capital foods and Organic IndiaAfter months of negotiations Tata Consumer Products is set to buy controlling stakes in Capital Foods which owns Ching s Secret and Organic India an organic teas and health products maker backed by Fabindia. A formal announcement is expected by early next week.\"\n  },\n  {\n    \"question\": \"What is the investment deal between Blackstone and L&T?\",\n    \"answer\": \"Nexus Select Trust, a Blackstone-owned retail-focused REIT, has signed a preliminary agreement to acquire three malls in Hyderabad from Larsen & Toubro for approximately Rs 300-350 million.\",\n    \"context\": \"Blackstone looks to buy three malls in Hyderabad from L T for around   300 millionNexus Select Trust a retailfocused real estate investment trust of global private equity giant Blackstone has signed a preliminary pact to acquire three malls from Larsen   Toubro in Hyderabad for  300350 million.\"\n  },\n  {\n    \"question\": \"According to RBI Governor, what changes are needed in the Insolvency Code?\",\n    \"answer\": \"RBI Governor Shaktikanta Das suggests a review of the Insolvency Code's implementation, emphasizing the need to ensure distinct weightage for various categories of debtors and a continued focus on a financial creditor-led resolution framework.\",\n    \"context\": \"Reserve Bank governor says bankruptcy code needs course correctionA review of the implementation of the insolvency code and its impact so far suggests a need for course correction which should include ensuring distinct weightage for various categories of debtors according to Reserve Bank of India Governor Shaktikanta Das. The code should continue to lay emphasis on a financial creditorled resolution framework in an overarching manner Das said.\"\n  },\n  {\n    \"question\": \"What is unique about the bond placement by Adani Ports?\",\n    \"answer\": \"Adani Ports and Special Economic Zone has used an unconventional structure to place bonds with credit funds, where investors have the right to claim Adani Ports' receivables from another group firm in the event of a default.\",\n    \"context\": \"Adani Ports uses rare structure to place bonds with credit funds to mobilize Rs 500 croreAdani Ports and Special Economic Zone has used an unconventional structure to raise debt funds. The company with a market capitalization of Rs 2.6 lakh crore has placed uniquely structured bonds with a clutch of local private credit funds to mobilize Rs 500 crore. In the event of a default investors will have the right to claim Adani Ports  receivables from another group firms that had borrowed from the former.\"\n  },\n  {\n    \"question\": \"Why is the State Bank of India cautious about payment transactions for Russian crude?\",\n    \"answer\": \"The State Bank of India is avoiding payment transactions for Russian crude oil purchased by state-run refiners to prevent US sanctions imposed in December 2022.\",\n    \"context\": \"State Banks shirks payment transactions for Russian crude amid Western sanctionsThe State Bank of India is avoiding payment transactions for Russian crude oil bought by staterun refiners to avert US sanctions that came into force in December 2022. India s largest lender is the authorized dealer bank for foreign transactions of staterun refiners.\"\n  },\n  {\n    \"question\": \"What is the reason behind the increase in net tax receipts in India?\",\n    \"answer\": \"The rise in net direct tax receipts is attributed to a 19.4% annualized growth in corporate and personal incomes.\",\n    \"context\": \"Higher incomes and corporate profits boost net tax receipts by 19.4 percentThe net direct tax receipts after refunds have gone up 19.4 percent on an annualized basis to Rs 14.7 lakh crore in the current financial year till December 10 the finance ministry has said. It shows strong tax buoyancy and should exceed the central government s direct tax collection target of Rs 18.2 trillion in the year to March.\"\n  },\n  {\n    \"question\": \"What is the latest news about Google's layoffs?\",\n    \"answer\": \"In an effort to cut costs, Google is laying off hundreds of employees working on its digital assistant hardware and engineering teams.\",\n    \"context\": \"Google retrenches hundreds of staff in drive to rationalize costs following AmazonGoogle is in the process of laying off hundreds of employees working on its digital assistant hardware and engineering teams as it drives to cut costs. The development comes a day after Amazon said it was laying off hundreds of employees in its Prime Video and studios business.\"\n  }\n]\n```\"\n    }\n]\n",
    "[\n  {\n    \"question\": \"When did Adani Ports and Special Economic Zone (APSEZ) raise Rs 500 crore?\",\n    \"answer\": \"On January 9, 2024\",\n    \"context\": \"The company raised Rs 500 crore today i.e. January 9 2024 by allotment of 50000 rated secured listed redeemable nonconvertible debentures (NCDs) of face value of Rs 100000  each on private placement basis  it said.\"\n  },\n  {\n    \"question\": \"How did Adani Ports and Special Economic Zone (APSEZ) raise Rs 500 crore?\",\n    \"answer\": \"By issuing nonconvertible debentures on a private placement basis\",\n    \"context\": \"Adani Ports and Special Economic Zone (APSEZ) on Tuesday raised Rs 500 crore by issuing nonconvertible debentures on private placement basis.\"\n  },\n  {\n    \"question\": \"What is the tenure of the two listed bonds issued by Adani Ports and Special Economic Zone (APSEZ)?\",\n    \"answer\": \"One maturing in five years and the other in 10 years\",\n    \"context\": \"Billionaire Gautam Adani s firm in a regulatory filing said it has accepted bids aggregating to Rs 500 crore for two listed bonds with one maturing in five years and the other in 10 years.\"\n  },\n  {\n    \"question\": \"What is the face value of each nonconvertible debenture (NCD) issued by Adani Ports and Special Economic Zone (APSEZ)?\",\n    \"answer\": \"Rs 100,000\",\n    \"context\": \"The company raised Rs 500 crore today i.e. January 9 2024 by allotment of 50000 rated secured listed redeemable nonconvertible debentures (NCDs) of face value of Rs 100000  each on private placement basis  it said.\"\n  },\n  {\n    \"question\": \"Where will the NCDs issued by Adani Ports and Special Economic Zone (APSEZ) be listed?\",\n    \"answer\": \"On the wholesale debt market segment of BSE\",\n    \"context\": \"The NCDs will be listed on the wholesale debt market segment of BSE.\"\n  },\n  {\n    \"question\": \"What is the position of Adani Ports and Special Economic Zone (APSEZ) in the Indian port sector?\",\n    \"answer\": \"It is the largest port developer and operator in India\",\n    \"context\": \"APSEZ is the largest port developer and operator in India with 7 strategically located ports and terminals on the west coast and as many ports and terminals on the east coast representing 26 per cent of the country s total port volumes.\"\n  },\n  {\n    \"question\": \"How many ports and terminals does Adani Ports and Special Economic Zone (APSEZ) have on the west coast of India?\",\n    \"answer\": \"7\",\n    \"context\": \"APSEZ is the largest port developer and operator in India with 7 strategically located ports and terminals on the west coast and as many ports and terminals on the east coast representing 26 per cent of the country s total port volumes.\"\n  },\n  {\n    \"question\": \"What percentage of India's total port volumes does Adani Ports and Special Economic Zone (APSEZ) handle?\",\n    \"answer\": \"26%\",\n    \"context\": \"APSEZ is the largest port developer and operator in India with 7 strategically located ports and terminals on the west coast and as many ports and terminals on the east coast representing 26 per cent of the country s total port volumes.\"\n  }\n]",
    "```\n[\n  {\n    \"question\": \"Who met with the Telangana government on behalf of the Adani Group?\",\n    \"answer\": \"Karan Adani, CEO of Adani Ports and SEZs, and Ashish Rajvanshi, CEO of Defence and Aerospace.\",\n    \"context\": \"Adani Group representatives led by CEO of Adani Ports and SEZs Karan Adani and CEO of Defence and Aerospace Ashish Rajvanshi met Chief Minister Revanth Reddy here.\"\n  },\n  {\n    \"question\": \"What did the Adani Group delegation discuss with the Telangana government?\",\n    \"answer\": \"They discussed setting up a data center and aerospace park in the state.\",\n    \"context\": \"The representatives held talks with the government to set up a data centre along with an aerospace park in the state it said.\"\n  },\n  {\n    \"question\": \"What did the Chief Minister of Telangana assure the Adani delegation?\",\n    \"answer\": \"He assured them that the state government would provide the required amenities infrastructure and subsidies to new industries to promote industrial growth and create more employment opportunities.\",\n    \"context\": \"The chief minister assured the Adani delegation that the state government would provide the required amenities infrastructure and subsidies to new industries to promote industrial growth and create more employment opportunities.\"\n  },\n  {\n    \"question\": \"What did the Adani Group representatives say about their existing projects in Telangana?\",\n    \"answer\": \"They said that the group would continue existing projects and sought necessary support from the government to establish new ones.\",\n    \"context\": \"The CM said the government is inviting investments from Adani Group to set up industries in Telangana even as the Adani representatives said the group would continue existing projects and sought necessary support from the government to establish new ones.\"\n  },\n  {\n    \"question\": \"What did the Adani Group delegation say about their plans for setting up new industries in Telangana?\",\n    \"answer\": \"They said that the company is ready to set up industries and create new jobs despite the change of government in Telangana.\",\n    \"context\": \"The Adani Group delegation said the company is ready to set up industries and create new jobs despite the change of government in Telangana.\"\n  },\n  {\n    \"question\": \"Who else was present at the meeting between the Adani Group delegation and the Telangana government?\",\n    \"answer\": \"Industries Minister D Sridhar Babu Chief Secretary Santhi Kumari IT Secretary Jayesh Ranjan and others.\",\n    \"context\": \"Industries Minister D Sridhar Babu Chief Secretary Santhi Kumari IT Secretary Jayesh Ranjan and others were present at the meeting.\"\n  },\n  {\n    \"question\": \"What is Adani Group's main business focus?\",\n    \"answer\": \"The context does not provide information about Adani Group's main business focus.\",\n    \"context\": \"\"\n  },\n  {\n    \"question\": \"What is the size of Adani Group's investment in Telangana?\",\n    \"answer\": \"The context does not provide information about the size of Adani Group's investment in Telangana.\",\n    \"context\": \"\"\n  }\n]\n```\"\n    }\n]\n",
    "[{'question': 'How much funds does Adani Ports and Special Economic Zone Limited plan to raise, and through what means?',\n  'answer': 'Adani Ports and Special Economic Zone Limited (APSEZ) plans to raise up to Rs 5000 crore through a public issuance of non-convertible debentures. Each debenture will have a face value of Rs. 1000, and the issuance may occur in one or more tranches.',\n  'context': 'According to a stock exchange filing on January 3rd, Adani Ports and Special Economic Zone Limited (APSEZ) has received board approval to raise up to Rs 5000 crore. This fundraising will be done through a public issuance of non-convertible debentures, each with a face value of Rs. 1000. The company may choose to issue these debentures in one or more tranches. This decision highlights the company’s proactive approach to securing funds for potential growth opportunities.'},\n {'question': 'What is the significance of Adani Ports and Special Economic Zone’s cargo volume target for FY 2023-24?',\n  'answer': \"Adani Ports and Special Economic Zone Limited is aiming to handle over 400 metric tonnes (MMT) of cargo volume in FY 2023-24. This target, if achieved, would exceed the upper end of their initial guidance range of 370-390 MMT. This ambition underscores their positive outlook on business growth and market share expansion.\",\n  'context': 'In the current financial year 2023-24, Adani Ports and Special Economic Zone Limited has set an ambitious target of handling over 400 metric tonnes (MMT) of cargo volume. This aspiration surpasses the upper limit of the 370-390 MMT guidance range initially projected at the beginning of the year. Achieving this target would be a significant accomplishment, demonstrating the company’s operational strength and ability to capitalize on growing trade volumes.'},\n {'question': 'How did Adani Ports and Special Economic Zone Limited’s cargo volume perform in December 2023?',\n  'answer': 'Adani Ports and Special Economic Zone Limited reported a 42% year-on-year (YoY) increase in cargo volumes, reaching 35.65 MMT in December 2023. This substantial growth highlights the company’s robust operational performance and ability to attract higher cargo traffic.',\n  'context': 'Adani Ports and Special Economic Zone Limited shared positive news in December 2023, reporting a significant 42% year-on-year (YoY) jump in cargo volumes. This surge resulted in a total of 35.65 MMT of cargo handled during the month. The impressive growth underlines the company’s effectiveness in attracting and managing higher cargo traffic, potentially driven by increased economic activity and market demand.'},\n {'question': 'What is the latest update on the legal matters involving Adani Ports and Special Economic Zone Limited and the Hindenburg issue?',\n  'answer': 'The Supreme Court of India, on January 3, 2024, made a significant decision regarding the petitions related to the Hindenburg issue and Adani Ports and Special Economic Zone Limited.  The court chose to dispose of the petitions requesting an investigation by a Special Investigation Team (SIT) or the Central Bureau of Investigation (CBI). This decision arrived a month after the court had reserved its judgment on the allegations of stock price manipulation by the Adani Group.',\n  'context': 'In a significant legal development, the Supreme Court of India addressed the petitions concerning the Hindenburg issue and Adani Ports and Special Economic Zone Limited on January 3, 2024. The court decided to dispose of the petitions seeking an investigation by either a Special Investigation Team (SIT) or the Central Bureau of Investigation (CBI). This decision came after a month-long period following the court’s reservation of its judgment on the allegations of stock price manipulation involving the Adani Group in November.'},\n {'question': 'What leadership changes were announced by Adani Ports and Special Economic Zone Limited on January 3, 2024?',\n  'answer': 'Adani Ports and Special Economic Zone Limited announced key leadership changes on January 3, 2024. Gautam Adani transitioned from his role as Chairman and Managing Director to become the Executive Chairman. Karan Adani, previously the Chief Executive Officer, assumed the position of Managing Director.  Ashwani Gupta was appointed as the new CEO.',\n  'context': 'Adani Ports and Special Economic Zone Limited unveiled a series of significant leadership changes during a board meeting on January 3, 2024.  Gautam Adani, previously serving as both Chairman and Managing Director, took\"\n    }\n]\n",
    "[\n  {\n    \"question\": \"Who was redesignated as the executive chairman of Adani Ports and SEZ?\",\n    \"answer\": \"Gautam Adani\",\n    \"context\": \"Adani Ports and SEZ, the ports and logistics arm of the Adani group on January 3 announced a rejig in its top brass with the company s chairman and managing director Gautam Adani being redesignated as its executive chairman.\"\n  },\n  {\n    \"question\": \"Who has been appointed as the new CEO of Adani Ports and SEZ?\",\n    \"answer\": \"Ashwani Gupta\",\n    \"context\": \"Karan Adani the company s incumbent chief executive officer has been redesignated as the MD whereas Ashwani Gupta has been named as the new CEO.\"\n  },\n  {\n    \"question\": \"When will Gautam Adani take over as the executive chairman of Adani Ports and SEZ?\",\n    \"answer\": \"January 4, 2024\",\n    \"context\": \"Gautam Adani who would now be the company s executive chairman will assume the charge with effect from January 4 2024 till the end of his current term i.e. up to June 30 2027 the company informed the exchanges.\"\n  },\n  {\n    \"question\": \"What is the tenure of Ashwani Gupta as the CEO of Adani Ports and SEZ?\",\n    \"answer\": \"Three years\",\n    \"context\": \"The appointment of Ashwani Gupta as the CEO will also come into effect from January 4 Adani Ports said adding that he has been given a threeyear tenure.\"\n  },\n  {\n    \"question\": \"How much funds is Adani Ports and SEZ planning to raise?\",\n    \"answer\": \"Rs 5000 crore\",\n    \"context\": \"Adani Ports also said that its board of directors in the meeting held today gave their nod to the proposal to raise Rs 5000 crore via the issuance of secured rated listed and redeemable nonconvertible debentures (NCDs).\"\n  },\n  {\n    \"question\": \"What is the face value of the NCDs to be issued by Adani Ports and SEZ?\",\n    \"answer\": \"Rs 1000 each\",\n    \"context\": \"The NCDs of face value of Rs 1000 each amounting up to Rs5000 crore would be issued in one or more tranches the company said in the exchange filing.\"\n  },\n  {\n    \"question\": \"To whom has the board of Adani Ports and SEZ delegated the powers for the NCD issue?\",\n    \"answer\": \"Finance committee\",\n    \"context\": \"For the purpose of the issue the company s board has delegated the powers to the company s finance committee to approve implement and carry out activities in connection with the issue it added.\"\n  },\n  {\n    \"question\": \"At what price did Adani Ports and SEZ scrip settle on the BSE on January 3?\",\n    \"answer\": \"Rs 1093.50 apiece\",\n    \"context\": \"The announcements came shortly after Adani Ports s scrip settled at Rs 1093.50 apiece on the BSE gaining by 1.39 percent as against the previous day s close.\"\n  }\n]",
    "[{'question': 'What was the outcome of the US International Development Finance Corp (DFC) due diligence on Adani Group?', 'answer': 'The US International Development Finance Corp (DFC) conducted due diligence on Adani Group before granting a $553 million loan for a container terminal project in Sri Lanka. The DFC found no support for the allegations made by Hindenburg Research against Adani Group, indicating that the US government did not consider the accusations of corporate fraud to be of consequence. ', 'context': 'Adani Group stocks continued to rally on December 6, surging up to 16 percent after a report indicated that a US agency found the accusations by Hindenburg Research against the Gautam Adani-led conglomerate irrelevant. The US International Development Finance Corp (DFC) conducted due diligence before extending the conglomerate a $553 million loan for a container terminal in Sri Lanka, a Bloomberg report said. A senior US official affirmed that the US government considered the Hindenburg Research allegations of corporate fraud against Adani inconsequential.'}, {'question': 'Why did Adani Green Energy stock surge?', 'answer': 'Adani Green Energy stock surged by 16 percent, adding to the 20 percent gains from the previous session. This spike was driven by the company\\'s announcement of securing an additional $1.36 billion in funding through a senior debt facility.  Over the past month, Adani Green Energy stock has surged by an impressive 70 percent.', 'context': 'Adani Green Energy led the pack surging up to 16 percent. This added to the 20 percent gains seen in the previous session. The spike comes after the company announced that it secured an additional  $1.36 billion funding through a senior debt facility. In the last month, the Adani Green Energy stock surged 70 percent.'}, {'question': 'What is the current status of Adani Ports stock?', 'answer': \"Adani Ports stock reached a new record high for the second consecutive session on December 6th.  The stock has rebounded nearly three times from its low of Rs 392, which occurred after the release of the critical Hindenburg report in January 2023. This surge follows a 'buy' call from global brokerage firm Citi, which also raised its target price for the stock to Rs 1,213 per share from Rs 972.\", 'context': 'Adani Ports scaled a fresh record high for the second straight session on December 6. The stock has recovered nearly three times from its lows of Rs 392 after the scathing Hindenburg report came out in January 2023. The rise comes after global brokerage Citi put a \"buy\" call on the stock and raised the target raised to Rs 1213 per share from Rs 972 earlier. Despite the rally after the recent state election results, the brokerage thinks there is still ample scope for valuations to rerate.'}, {'question': 'What is the market capitalization of Adani Enterprises Ltd?', 'answer': 'Adani Enterprises Ltd. experienced a surge of around 3 percent, reaching Rs 3,154.55 on the National Stock Exchange, propelling its market capitalization to surpass the Rs 3.4 lakh crore mark. The stock has seen a remarkable increase of over 175 percent from its 52-week low, which it reached earlier this year following a report accusing the group of stock manipulation and other wrongdoings.', 'context': 'Adani Enterprises Ltd surged around 3 percent to Rs 3154.55 on the National Stock Exchange. Its market capitalisation topped the Rs 3.4 lakh crore mark. The stock has surged more than 175 percent from its 52-week low touched earlier this year following the report that accused the group of stock manipulation and other wrongdoings.'}, {'question': 'What was the performance of Adani Total Gas shares?', 'answer': \"Shares of Adani Total Gas surged by 15%, reaching a new 52-week high of Rs 1,033.00.  This impressive gain, which adds to the previous session's rise of nearly 20%, has pushed the company's market value beyond Rs 1 lakh crore.\", 'context': \"Adding to the previous session's gains of nearly 20 percent, shares of Adani Total Gas gained 15 percent to hit a fresh 52-week high of Rs 1033.00, pushing the company's market value above Rs 1 lakh crore.\"}, {'question': 'What is the Jefferies target price for Ambuja Cements?', 'answer': \"After Ambuja Cements completed its acquisition of SIL, brokerage firm Jefferies issued a 'buy' call on the stock, setting a target price of Rs\"\n    }\n]\n",
    "[\n  {\n    \"question\": \"What happened to the shares of Adani Group companies on December 5?\",\n    \"answer\": \"The shares of Adani Group companies surged up to 20 percent on December 5.\",\n    \"context\": \"Shares of Adani Group companies surged up to 20 percent on December 5 following a report that a US agency found the accusations made by Hindenburg Research against the Gautam Adani-led power-to-port conglomerate to be irrelevant.\"\n  },\n  {\n    \"question\": \"What did the US agency find about the accusations against Adani Group?\",\n    \"answer\": \"The US agency found the accusations made by Hindenburg Research against the Gautam Adani-led power-to-port conglomerate to be irrelevant.\",\n    \"context\": \"Shares of Adani Group companies surged up to 20 percent on December 5 following a report that a US agency found the accusations made by Hindenburg Research against the Gautam Adani-led power-to-port conglomerate to be irrelevant.\"\n  },\n  {\n    \"question\": \"What did International Development Finance Corp conduct before extending a loan to Adani Group?\",\n    \"answer\": \"International Development Finance Corp conducted a due diligence investigation before extending the conglomerate a $553 million loan for a container terminal in Sri Lanka.\",\n    \"context\": \"International Development Finance Corp (DFC) conducted a due diligence investigation before extending the conglomerate a $553 million loan for a container terminal in Sri Lanka, a Bloomberg report said. We couldn’t verify the report independently.\"\n  },\n  {\n    \"question\": \"What was the percentage increase in shares of Adani Enterprises Ltd?\",\n    \"answer\": \"The shares of Adani Enterprises Ltd surged more than 10 percent to Rs 2784.30 on the National Stock Exchange.\",\n    \"context\": \"Following the update, flagship Adani Enterprises Ltd surged more than 10 percent to Rs 2784.30 on the National Stock Exchange. Its market capitalisation topped Rs 3 lakh crore mark once again. The stock has surged 173 percent from its 52-week low touched earlier this year following the report that accused the group of stock manipulation and other wrongdoings.\"\n  },\n  {\n    \"question\": \"How much additional funding did Adani Green Energy secure?\",\n    \"answer\": \"Adani Green Energy secured an additional $1.36 billion funding via a senior debt facility.\",\n    \"context\": \"Adani Green Energy led the pack gaining up to 17 percent after the company announced that it secured an additional $1.36 billion funding via a senior debt facility.\"\n  },\n  {\n    \"question\": \"What was the percentage increase in shares of Adani Ports and Special Economic Zone Ltd?\",\n    \"answer\": \"The shares of Adani Ports and Special Economic Zone Ltd (ASPEZ) surged 15 percent and 17 percent, respectively, to hit a new 52-week high.\",\n    \"context\": \"Share of Adani Ports and Special Economic Zone Ltd (ASPEZ) surged 15 percent and 17 percent respctively to hit a new 52-week highs.\"\n  },\n  {\n    \"question\": \"What was the percentage increase in shares of Adani Energy Solutions?\",\n    \"answer\": \"The shares of Adani Energy Solutions surged 20 percent to Rs 1084.4 on NSE.\",\n    \"context\": \"Adani Energy Solutions also surged 20 percent to Rs 1084.4 on NSE.\"\n  },\n  {\n    \"question\": \"What was the intraday high of Adani Total Gas shares on NSE?\",\n    \"answer\": \"The shares of Adani Total Gas gained 20 percent to hit an intraday high of Rs 878.7 on NSE.\",\n    \"context\": \"Shares of Adani Total Gas gained 20 percent to hit an intraday high of Rs 878.7 on NSE with a total valuation of around to Rs 96,600 crore.\"\n  },\n  {\n    \"question\": \"What was the percentage increase in shares of Adani Wilmar?\",\n    \"answer\": \"The shares of Adani Wilmar also jumped over 10 percent to Rs 380.85.\",\n    \"context\": \"Adani Wilmar also jumped over 10 percent to Rs 380.85.\"\n  },\n  {\n    \"question\": \"What percentage stake does Ambuja Cement now hold in SIL?\",\n    \"answer\": \"Ambuja Cement now holds a controlling stake of 54.51 percent in SIL.\",\n    \"context\": \"With the acquisition funded entirely through internal accruals, Ambuja Cement now holds a controlling stake of 54.51 percent in SIL.\"\n  },\n  {\n    \"question\": \"What was the percentage increase in shares of ACC?\",\n    \"answer\": \"The shares of ACC jumped 8 percent.\",\n    \"context\": \"Among other Adani Group companies, shares of ACC jumped 8 percent and NDTV 18 percent.\"\n  },\n  {\n    \"question\": \"What was the combined market cap of Adani Group companies at the time of the report?\",\n    \"answer\": \"The combined mcap of Adani Group companies was at Rs 13.87 lakh crore.\",\n    \"context\": \"The combined mcap of Adani Group companies were at Rs 13.87 lakh crore.\"\n  }\n]",
    "```json\n[\n    {\n        \"question\": \"How have Adani group stocks performed in the last six months, and what is the reason behind this performance?\",\n        \"answer\": \"Adani group stocks have rebounded considerably in the past six months. This follows a period of sharp decline triggered by the Hindenburg Research report, which accused the group of stock manipulation and other wrongdoings. Though the group has denied these allegations, the impact on stock prices was significant.\",\n        \"context\": \"The Adani group stocks experienced a significant downturn following the release of the Hindenburg Research report. This report, published earlier this year, leveled serious allegations against the group, including stock manipulation and other unethical financial practices. These accusations led to a sell-off of Adani stocks, resulting in a substantial decline in their value. However, over the past six months, the stocks have shown resilience and have been steadily recovering. This recovery can be attributed to several factors, including the group's efforts to address the allegations and reassure investors. Despite this recent rebound, it is important to note that the stocks are yet to fully recover to their pre-Hindenburg levels.\"\n    },\n    {\n        \"question\": \"What is Madhusudan Kela's current stance on investing in Adani Group stocks?\",\n        \"answer\": \"Madhusudan Kela, while acknowledging that Adani group stocks have shown extraordinary returns in the past, advises caution. He favors specific companies within the group, particularly those operating in the renewables sector. He intends to maintain his investments in these specific companies.\",\n        \"context\": \"Madhusudan Kela, a veteran investor and founder of MK Ventures,  expresses a cautiously optimistic view on Adani group stocks.  He acknowledges the phenomenal growth the group has demonstrated over the past five years, generating exceptional returns for investors. However, Kela emphasizes the importance of a selective approach when investing in the group's companies. He highlights the renewables sector as an area of particular interest, expressing confidence in its potential and indicating his intention to maintain his investments in this segment.\"\n    },\n    {\n        \"question\": \"Did Samir Arora hold Adani group stocks before, and what is his current position?\",\n        \"answer\": \"Samir Arora, founder of Helios Capital, was not previously invested in Adani group stocks. However, he entered into long positions in Adani Ports and Ambuja Cement earlier this year during a period of price consolidation.  He continues to hold these positions.\",\n        \"context\": \"Samir Arora, a seasoned hedge fund investor and founder of Helios Capital,  adopted a contrarian approach by acquiring stakes in select Adani group companies.  Previously not invested in the group, Arora strategically entered into long positions in Adani Ports and Ambuja Cement during a phase of price consolidation, capitalizing on potentially undervalued assets. This investment approach indicates his confidence in the long-term prospects of these specific companies, despite the prevailing market sentiment.\"\n    },\n    {\n        \"question\": \"How has Adani Ports stock performed since the Hindenburg report?\",\n        \"answer\": \"Adani Ports stock experienced a significant drop, hitting a 52-week low of Rs 395 in February following the Hindenburg report.  However, it has since recovered to Rs 809, demonstrating resilience but still down 18 percent from its all-time high.\",\n        \"context\": \"Adani Ports, a key company within the Adani Group, witnessed a dramatic decline in its stock price after the publication of the Hindenburg report.  The stock plummeted to a 52-week low of Rs 395 in February as investors reacted to the allegations. Despite this setback, the stock has mounted a considerable comeback, recovering to Rs 809. While this recovery signifies renewed investor confidence, it's worth noting that the stock remains 18% below its historical peak.\"\n    },\n    {\n        \"question\": \"Which Adani group company has been impacted the most by the Hindenburg report, and how significant is the decline?\",\n        \"answer\": \"Adani Total Gas has suffered the most significant decline among all Adani group firms, with its stock plummeting by 80 percent this year.\",\n        \"context\": \"Amongst the Adani Group companies, Adani Total Gas has borne the brunt of the negative fallout from the Hindenburg report.  Its stock price has taken a severe hit, plummeting by a staggering 80% since the beginning of the year. This drastic decline underscores the severity of the impact the Hindenburg allegations have had on investor sentiment toward the company.\"\n    },\n    {\n        \"question\": \"What has been the trend of foreign portfolio investors (FPIs) towards Adani Group stocks recently?\",\n        \"answer\": \"Despite Gautam Adani's attempts to reassure investors and the recent recovery\"\n    }\n]\n"
]