[
    "``````\n{\n  \"question\": \"What is the net income of Apple Inc. in 2021?\",\n  \"answer\": \"Apple Inc.'s net income in 2021 was $94.68 billion.\",\n  \"context\": \"In 2021, Apple Inc. reported a net income of $94.68 billion, an increase of 24% from the previous year. This growth was primarily driven by strong sales of the iPhone 12 and other products. The company also benefited from the continued shift to online shopping and the increased demand for digital services.\"\n},\n{\n  \"question\": \"What is the revenue of Microsoft Corporation in 2022?\",\n  \"answer\": \"Microsoft Corporation's revenue in 2022 was $198.3 billion.\",\n  \"context\": \"Microsoft Corporation reported revenue of $198.3 billion in 2022, an increase of 18% from the previous year. This growth was driven by strong demand for the company's cloud computing services, including Azure and Microsoft 365. The company also benefited from the continued growth of its gaming business.\"\n},\n{\n  \"question\": \"What is the profit margin of Amazon.com, Inc. in 2021?\",\n  \"answer\": \"Amazon.com, Inc.'s profit margin in 2021 was 4.2%.\",\n  \"context\": \"Amazon.com, Inc.'s profit margin in 2021 was 4.2%, down from 6.3% in the previous year. This decline was primarily due to the increased costs associated with the COVID-19 pandemic, including shipping and logistics expenses. Despite the decline in profit margin, the company's revenue continued to grow, driven by the strong demand for e-commerce.\"\n},\n{\n  \"question\": \"What is the return on equity (ROE) of Alphabet Inc. in 2022?\",\n  \"answer\": \"Alphabet Inc.'s ROE in 2022 was 21.5%.\",\n  \"context\": \"Alphabet Inc.'s ROE in 2022 was 21.5%, up from 18.3% in the previous year. This improvement was driven by the company's strong growth in revenue and net income. The company also benefited from the continued growth of its digital advertising business.\"\n},\n{\n  \"question\": \"What is the price-to-earnings (P/E) ratio of Tesla, Inc. in 2023?\",\n  \"answer\": \"Tesla, Inc.'s P/E ratio in 2023 is 68.6.\",\n  \"context\": \"Tesla, Inc.'s P/E ratio in 2023 is 68.6, up from 55.4 in the previous year. This increase in P/E ratio reflects the strong demand for the company's electric vehicles and the continued growth of its business. The company also benefited from the passage of the Inflation Reduction Act, which provides tax credits for the purchase of electric vehicles.\"\n},\n{\n  \"question\": \"What is the debt-to-equity ratio of Meta Platforms, Inc. in 2022?\",\n  \"answer\": \"Meta Platforms, Inc.'s debt-to-equity ratio in 2022 was 0.25.\",\n  \"context\": \"Meta Platforms, Inc.'s debt-to-equity ratio in 2022 was 0.25, up from 0.21 in the previous year. This increase in debt-to-equity ratio was primarily due to the company's issuance of bonds to fund its capital expenditures. Despite the increase in debt-to-equity ratio, the company's financial position remains strong.\"\n},\n{\n  \"question\": \"What is the dividend yield of Johnson & Johnson in 2021?\",\n  \"answer\": \"Johnson & Johnson's dividend yield in 2021 was 2.5%.\",\n  \"context\": \"Johnson & Johnson's dividend yield in 2021 was 2.5%, up from 2.3% in the previous year. This increase in dividend yield reflects the company's continued commitment to returning cash to shareholders. The company also benefited from the strong performance of its pharmaceutical business.\"\n},\n{\n  \"question\": \"What is the current ratio of Berkshire Hathaway Inc. in 2023?\",\n  \"answer\": \"Berkshire Hathaway Inc.'s current ratio in 2023 is 1.25.\",\n  \"context\": \"Berkshire Hathaway Inc.'s current ratio in 2023 is 1.25, up from 1.18 in the previous year. This improvement in current ratio reflects the company's strong liquidity position. The company also benefited from the strong performance of its insurance and investment businesses.\"\n}\n``````\"\n    }\n]\n",
    "[\n  {\n    \"question\": \"What was the percentage decline in ONGC's crude oil production in Q1 of FY2024-25?\",\n    \"answer\": \"1.4 percent\",\n    \"context\": \"Oil and Natural Gas Corporation reported a decline of 1.4 percent in its total crude oil production in the first quarter of the financial year 202425 the company said in a press release on August 5.\"\n  },\n  {\n    \"question\": \"How many million metric tonnes of crude oil did ONGC produce in Q1 of FY2024-25?\",\n    \"answer\": \"5.237 MMT\",\n    \"context\": \"ONGC s total crude oil production came in at 5.237 million metric tonnes (MMT) compared to 5.311 MMT last year.\"\n  },\n  {\n    \"question\": \"What was the percentage decline in ONGC's gas production in Q1 of FY2024-25?\",\n    \"answer\": \"4.1 percent\",\n    \"context\": \"The company s total gas production in Q1 declined 4.1 percent at 5.008 BCM compared to 5.221 BCM last year.\"\n  },\n  {\n    \"question\": \"How many BCM of gas did ONGC produce in Q1 of FY2024-25?\",\n    \"answer\": \"5.008 BCM\",\n    \"context\": \"The company s total gas production in Q1 declined 4.1 percent at 5.008 BCM compared to 5.221 BCM last year.\"\n  },\n  {\n    \"question\": \"Despite what government initiative did ONGC's oil and gas production decline in Q1 of FY2024-25?\",\n    \"answer\": \"Government's push for increasing domestic and gas production in the country to reduce reliance on imports for energy needs\",\n    \"context\": \"The decline in oil and gas production comes despite the government s push for increasing domestic and gas production in the country to reduce reliance on imports for energy needs.\"\n  },\n  {\n    \"question\": \"What percentage of its crude oil requirement does India currently import?\",\n    \"answer\": \"87 percent\",\n    \"context\": \"India currently imports around 87 percent of its crude oil and almost 50 percent of its gas requirement.\"\n  },\n  {\n    \"question\": \"What percentage decline did ONGC's consolidated net profit see in Q1 of FY2024-25 compared to the same period last year?\",\n    \"answer\": \"42.8 percent\",\n    \"context\": \"In Q1 ONGC posted a decline of 42.8 percent in consolidated net profit at Rs 10236 crore as compared to Rs 17893 crore in the same period a year ago.\"\n  },\n  {\n    \"question\": \"How much revenue from operations did ONGC report in Q1 of FY2024-25?\",\n    \"answer\": \"Rs 1.66 lakh crore\",\n    \"context\": \"The stateowned oil and gas exploration major reported 1.7 percent increase in revenue from operations for the quarter amounting to Rs 1.66 lakh crore compared to Rs 1.63 lakh crore recorded in the same period of the previous year.\"\n  }\n]",
    "[{'question': 'What was the performance of Oil and Natural Gas Corporation (ONGC) in the first quarter of the financial year 2024-25?',\n  'answer': 'ONGC reported a 43% decline in consolidated net profit in the first quarter of the financial year 2024-25, primarily due to a decline in crude oil and gas production.',\n  'context': \"Oil and Natural Gas Corporation (ONGC) experienced a challenging first quarter in FY 2024-25, marked by a significant drop in profitability. The company's consolidated net profit plummeted by 43% compared to the same period in the previous fiscal year. This decline can be attributed to a decrease in crude oil and gas production during the quarter. Despite an increase in revenue from operations, driven by higher crude oil prices, ONGC's profitability was impacted by the lower production volumes. The company highlighted that it has made five new discoveries in FY25, which could potentially contribute to production growth in the future.\"},\n {'question': 'How did the crude oil price realization for Oil and Natural Gas Corporation (ONGC) change in Q1?',\n  'answer': 'Oil and Natural Gas Corporation (ONGC) realized a crude oil price of $83.05 per barrel from its nominated fields in Q1, compared to $76.36 per barrel during the same period last year.',\n  'context': \"Despite a decline in production, ONGC benefited from a favorable increase in crude oil prices. The company's realization per barrel of crude oil from its nominated fields reached $83.05 in the first quarter, a notable rise from $76.36 per barrel in the corresponding period of the previous year. This positive price development helped to partially offset the impact of reduced production volumes on ONGC's revenue.  However, the company's overall profitability was still significantly affected by the decline in production.\"},\n {'question': 'What was the impact on Oil and Natural Gas Corporation (ONGC) s stock price after the Q1 results?',\n  'answer': 'Following the announcement of its first-quarter results, Oil and Natural Gas Corporation (ONGC) witnessed a 6.06% decline in its share price, closing at Rs 310.15 apiece on August 5.',\n  'context': \"The market reacted to ONGC's first-quarter results with pessimism, as reflected in the decline in the company's stock price. On August 5, following the earnings announcement, ONGC's shares closed 6.06% lower at Rs 310.15 apiece. This negative market sentiment suggests that investors were concerned about the decline in ONGC's profitability and production levels. The new discoveries announced by the company did not appear to alleviate these concerns in the immediate aftermath of the earnings release.\"},\n {'question': 'What were the Oil and Natural Gas Corporation (ONGC) s total crude oil and gas production figures for Q1?',\n  'answer': \"In the first quarter, Oil and Natural Gas Corporation (ONGC) produced 5.237 million metric tonnes (MMT) of crude oil and 5.008 billion cubic meters (BCM) of gas.  Crude oil production decreased by 1.4% year-on-year, while gas production saw a larger decline of 4.1% compared to the same period last year.\",\n  'context': 'ONGC faced production challenges in the first quarter, with both crude oil and natural gas output declining compared to the previous year. The company produced 5.237 million metric tonnes (MMT) of crude oil, representing a decrease of 1.4% year-on-year. Natural gas production experienced a more significant drop of 4.1%, reaching 5.008 billion cubic meters (BCM) compared to 5.221 BCM in the corresponding period of the previous year. These production declines were the primary factor behind the decline in ONGC\\'s profitability during the quarter.'},\n {'question': 'What is the amount of Oil and Natural Gas Corporation (ONGC) s consolidated net profit in Q1 FY24-25?',\n  'answer': 'ONGC reported a consolidated net profit of Rs 10,236 crore in the first quarter of FY24-25. This represents a significant decline of 43% compared to the net profit of Rs 17,893 crore recorded in the same period last year.',\n  'context': \"ONGC's consolidated net profit for the first quarter of FY24-25 stood at Rs 10,236 crore, marking a substantial 43% drop from the Rs 17,893 crore profit reported during the same\"\n    }\n]\n",
    "```\n[\n  {\n    \"question\": \"What was the consolidated net profit of Oil and Natural Gas Corporation (ONGC) in the first quarter of the financial year 2024-25?\",\n    \"answer\": \"Rs 10,236 crore\",\n    \"context\": \"Oil and Natural Gas Corporation (ONGC) posted a decline of 42.8 percent in consolidated net profit at Rs 10236 crore in the first quarter of the financial year 202425.\"\n  },\n  {\n    \"question\": \"How much was ONGC's consolidated net profit in the same period a year ago?\",\n    \"answer\": \"Rs 17,893 crore\",\n    \"context\": \"Oil and Natural Gas Corporation (ONGC) posted a decline of 42.8 percent in consolidated net profit at Rs 10236 crore in the first quarter of the financial year 202425 as compared to Rs 17893 crore in the same period a year ago.\"\n  },\n  {\n    \"question\": \"What was the sequential change in ONGC's consolidated net profit in the quarter ended June 30?\",\n    \"answer\": \"11 percent decrease\",\n    \"context\": \"Sequentially ONGC s consolidated net profit fell 11 percent in the quarter ended June 30 from Rs 11526.53 crore in the March quarter.\"\n  },\n  {\n    \"question\": \"What was ONGC's revenue from operations for the quarter?\",\n    \"answer\": \"Rs 1.66 lakh crore\",\n    \"context\": \"The stateowned oil and gas exploration major reported 1.7 percent increase in revenue from operations for the quarter amounting to Rs 1.66 lakh crore compared to Rs 1.63 lakh crore recorded in the same period of the previous year.\"\n  },\n  {\n    \"question\": \"What was ONGC's EBITDA for Q1?\",\n    \"answer\": \"Rs 18,617.5 crore\",\n    \"context\": \"ONGC s earnings before interest tax depreciation and amortisation (EBITDA) for Q1 rose to Rs 18617.5 crore.\"\n  },\n  {\n    \"question\": \"What was the crude oil price realization from ONGC's nominated fields for Q1?\",\n    \"answer\": \"$83.05 per barrel\",\n    \"context\": \"Crude oil price realization from ONGC s nominated fields was  83.05 per barrel for Q1 compared to  76.36 per barrel for the same period last year.\"\n  },\n  {\n    \"question\": \"What was the change in ONGC's crude oil production in Q1 compared to last year?\",\n    \"answer\": \"1.4 percent decrease\",\n    \"context\": \"In the first quarter the company s total crude oil production declined 1.4 percent from last year at 5.237 million metric tonnes (MMT).\"\n  },\n  {\n    \"question\": \"What was the change in ONGC's gas production in Q1 compared to last year?\",\n    \"answer\": \"4.1 percent decrease\",\n    \"context\": \"ONGC s total gas production in Q1 declined 4.1 percent at 5.008 BCM from last year the company said in a press release.\"\n  },\n  {\n    \"question\": \"How many discoveries has ONGC declared in FY25 so far?\",\n    \"answer\": \"5\",\n    \"context\": \"The company said it has declared total five discoveries in FY25 so far.\"\n  },\n  {\n    \"question\": \"What was the closing price of ONGC's shares on August 5?\",\n    \"answer\": \"Rs 310.15 apiece\",\n    \"context\": \"On August 5 ONGC s shares closed 6.06 percent lower at Rs 310.15 apiece.\"\n  }\n]\n```\"\n    }\n]\n",
    "[\n  {\n    \"question\": \"What is ONGC focusing on in Tripura due to rapid urbanization?\",\n    \"answer\": \"ONGC is focusing on cluster drilling to extract gas by using old wells in Tripura due to rapid urbanization.\",\n    \"context\": \"Due to rapid urbanisation in Tripura ONGC is focusing on cluster drilling to extract gas by using old wells because facilities are already available there. Also we don t need to get fresh approval from the state for gas exploration or extraction in those sites. There is also no need to acquire land which has become a costly affair he said.\"\n  },\n  {\n    \"question\": \"How many rigs are currently being used by ONGC to explore natural gas in the northeastern state?\",\n    \"answer\": \"At present, six rigs are being used by ONGC to explore natural gas in the northeastern state.\",\n    \"context\": \"At present six rigs are being used by ONGC to explore natural gas in the northeastern state.\"\n  },\n  {\n    \"question\": \"What is the target set by ONGC for gas extraction in the current fiscal?\",\n    \"answer\": \"ONGC has set a target of extracting 1675 MMSCM of gas during the current fiscal year (202425).\",\n    \"context\": \"We have already set a target of extracting 1675 MMSCM of gas during the current fiscal year (202425) while the production was 1527 MMSCM in 202324 ONGC s Tripura Asset Manager Krishna Kumar told PTI.\"\n  },\n  {\n    \"question\": \"What is the issue faced by ONGC if one of the units of the Palatana power plant shuts down?\",\n    \"answer\": \"If one of the units of the Palatana power plant in the state shuts down for any reason, the gas supply becomes surplus, causing loss to ONGC.\",\n    \"context\": \"Emphasising the issue of proper utilisation of gas Kumar said if one of the units of the Palatana power plant in the state shuts down for any reason the gas supply becomes surplus causing loss to ONGC.\"\n  },\n  {\n    \"question\": \"What is the volume of gas produced by ONGC in Tripura in the 2023-24 fiscal?\",\n    \"answer\": \"ONGC produced 1527 million standard cubic meters (MMSCM) of gas in Tripura in the 2023-24 fiscal.\",\n    \"context\": \"ONGC produced 1527 million standard cubic metres (MMSCM) of gas in Tripura in the 202324 fiscal while it has set a target of extracting 1675 MMSCM gas in the current fiscal.\"\n  },\n  {\n    \"question\": \"What is ONGC doing to boost the exploration drive in Tripura?\",\n    \"answer\": \"ONGC will dig as many as 20 new wells for gas exploration in the financial year 2024-25 and one more rig will be added shortly to boost the exploration drive.\",\n    \"context\": \"He said that ONGC will dig as many as 20 new wells for gas exploration in the financial year 202425 and one more rig will be added shortly to boost the exploration drive.\"\n  },\n  {\n    \"question\": \"What is the reason behind the reduction in gas supply to various gas-based power generation plants in Tripura?\",\n    \"answer\": \"The reason behind the reduction in gas supply to various gas-based power generation plants in Tripura is not mentioned in the given context.\",\n    \"context\": \"The decision comes amid reports of a reduction in gas supply to various gasbased power generation plants in the state.\"\n  },\n  {\n    \"question\": \"Which government agencies operate the gas-based power plants in Tripura?\",\n    \"answer\": \"The names of the government agencies that operate the gas-based power plants in Tripura are not mentioned in the given context.\",\n    \"context\": \"Various staterun agencies operate the gasbased power plants in Tripura.\"\n  }\n]",
    "[\n  {\n    \"question\": \"What percentage of shares did OVL acquire in the BTC pipeline?\",\n    \"answer\": \"0.737%\",\n    \"context\": \"The agreement also includes acquiring 0.737 per cent shares of the Baku Tbilisi Ceyhan (BTC) pipeline company through its whollyowned subsidiary ONGC BTC Limited  it added.\"\n  },\n  {\n    \"question\": \"Who is the operator of the ACG field?\",\n    \"answer\": \"BP\",\n    \"context\": \"BP is the operator of the field with a 30.37 per cent stake. The remaining stake in the field is divided between Japanese firms and ExxonMobil. ACG is a supergiant offshore oil field in the Caspian Sea operated by oil major BP since 1999.\"\n  },\n  {\n    \"question\": \"In what year was the ACG contract extended to 2049?\",\n    \"answer\": \"2017\",\n    \"context\": \"ACG contract extension till 2049 was signed between field partners and SOCAR in September 2017.\"\n  },\n  {\n    \"question\": \"What is the total investment for the acquisitions?\",\n    \"answer\": \"Up to USD 60 million\",\n    \"context\": \"The acquisitions expected to be completed in the upcoming months involve a total investment of up to USD 60 million.\"\n  },\n  {\n    \"question\": \"In which countries does OVL have a stake in oil and gas projects?\",\n    \"answer\": \"15 countries, including Vietnam and Venezuela\",\n    \"context\": \"OVL holds a stake in 32 oil and gas projects in 15 countries ranging from Vietnam to Venezuela.\"\n  },\n  {\n    \"question\": \"What is SOCAR's original stake in BTC?\",\n    \"answer\": \"25.0%\",\n    \"context\": \"SOCAR already held a 25.0 per cent stake in ACG a 25.0 per cent stake in BTC via Azerbaijan BTC Limited and 50 per cent in Karabakh.\"\n  },\n  {\n    \"question\": \"When was the Azeri Central East production platform commissioned?\",\n    \"answer\": \"Early 2024\",\n    \"context\": \"The field has been developed in phases and a seventh production platform Azeri Central East has been commissioned in early 2024  the statement said.\"\n  },\n  {\n    \"question\": \"Where is the Sangachal terminal located?\",\n    \"answer\": \"On the shores of the Caspian Sea\",\n    \"context\": \"It links the Sangachal terminal on the shores of the Caspian Sea to the Ceyhan marine terminal on the Turkish Mediterranean coast.\"\n  }\n]",
    "```\n[\n  {\n    \"question\": \"Why are shares of Oil and Natural Gas Corp trading higher?\",\n    \"answer\": \"Shares of Oil and Natural Gas Corp are trading higher after Reuters reported citing industry source that India's largest oil and gas exploration company has sought a waiver from the U.S. Office of Foreign Assets Control to lift crude oil from Venezuela.\",\n    \"context\": \"Shares of Oil and Natural Gas Corp are trading higher after Reuters reported citing industry source that India s largest oil and gas exploration company has sought a waiver from the U.S. Office of Foreign Assets Control to lift crude oil from Venezuela.The report said ONGC is optimistic of winning an approval according to a source who declining to be named.Earlier this year US had reimposed sanctions on Venezuela citing that the country had broken an accord to hold free and fair elections.India and even American oil refiners had increased imports of Venezuelan oil in 2023 after a sixmonth waiver from sanctions was announced which ended in April this year. Oil from Venezuela was among the cheapest for India s oil refiners with average landed cost reported at  60.60 a barrel in January this year.The Reuters report added that ONGC has been hopeful of recovering  500 million worth of dividends pending since 2014 for the stake it holds in Venezuelan projects. ONGC has instead sought oil instead of the pending dividend however there has not been much progress on that front so far.Crude oil has rallied this year helped by supply cuts by OPEC  though a volatility has declined to multiyear lows in June.\"\n  },\n  {\n    \"question\": \"What is ONGC's outlook on winning approval from the U.S. Office of Foreign Assets Control?\",\n    \"answer\": \"ONGC is optimistic of winning an approval according to a source who declining to be named.\",\n    \"context\": \"Shares of Oil and Natural Gas Corp are trading higher after Reuters reported citing industry source that India s largest oil and gas exploration company has sought a waiver from the U.S. Office of Foreign Assets Control to lift crude oil from Venezuela.The report said ONGC is optimistic of winning an approval according to a source who declining to be named.Earlier this year US had reimposed sanctions on Venezuela citing that the country had broken an accord to hold free and fair elections.India and even American oil refiners had increased imports of Venezuelan oil in 2023 after a sixmonth waiver from sanctions was announced which ended in April this year. Oil from Venezuela was among the cheapest for India s oil refiners with average landed cost reported at  60.60 a barrel in January this year.The Reuters report added that ONGC has been hopeful of recovering  500 million worth of dividends pending since 2014 for the stake it holds in Venezuelan projects. ONGC has instead sought oil instead of the pending dividend however there has not been much progress on that front so far.Crude oil has rallied this year helped by supply cuts by OPEC  though a volatility has declined to multiyear lows in June.\"\n  },\n  {\n    \"question\": \"Why did the U.S. reimpose sanctions on Venezuela?\",\n    \"answer\": \"The U.S. reimposed sanctions on Venezuela citing that the country had broken an accord to hold free and fair elections.\",\n    \"context\": \"Shares of Oil and Natural Gas Corp are trading higher after Reuters reported citing industry source that India s largest oil and gas exploration company has sought a waiver from the U.S. Office of Foreign Assets Control to lift crude oil from Venezuela.The report said ONGC is optimistic of winning an approval according to a source who declining to be named.Earlier this year US had reimposed sanctions on Venezuela citing that the country had broken an accord to hold free and fair elections.India and even American oil refiners had increased imports of Venezuelan oil in 2023 after a sixmonth waiver from sanctions was announced which ended in April this year. Oil from Venezuela was among the cheapest for India s oil refiners with average landed cost reported at  60.60 a barrel in January this year.The Reuters report added that ONGC has been hopeful of recovering  500 million worth of dividends pending since 2014 for the stake it holds in Venezuelan projects. ONGC has instead sought oil instead of the pending dividend however there has not been much progress on that front so far.Crude oil has rallied this year helped by supply cuts by OPEC  though a volatility has declined to multiyear lows in June.\"\n  },\n  {\n    \"question\": \"How much did ONGC pay for Venezuelan oil in January of this year?\",\n    \"answer\": \"ONGC paid an average of $60.60 per barrel for Venezuelan oil in January of this year.\",\n    \"context\": \"Shares of Oil and Natural Gas Corp are trading higher after Reuters reported citing industry source that India s largest oil and gas exploration company has sought a waiver from the U.S. Office of Foreign Assets Control to lift crude oil from Venezuela.The report said ONGC is optimistic of winning an approval according to a source who declining to be named.Earlier this year US had reimposed sanctions on Venezuela citing that the country had broken an accord to hold free and fair elections.India and even American oil refiners had increased imports of Venezuelan oil in 2023 after a sixmonth waiver from sanctions was announced which ended in April this year. Oil from Venezuela was among the cheapest for India s oil refiners with average landed cost reported at  60.60 a barrel in January this year.The Reuters report added that ONGC has been hopeful of recovering  500 million worth of dividends pending since 2014 for the stake it holds in Venezuelan projects. ONGC has instead sought oil instead of the pending dividend however there has not been much progress on that front so far.Crude oil has rallied this year helped by supply cuts by OPEC  though a volatility has declined to multiyear lows in June.\"\n  },\n  {\n    \"question\": \"What is ONGC hoping to recover from its stake in Venezuelan projects?\",\n    \"answer\": \"ONGC is hoping to recover $500 million worth of dividends pending since 2014 for its stake in Venezuelan projects.\",\n    \"context\": \"Shares of Oil and Natural Gas Corp are trading higher after Reuters reported citing industry source that India s largest oil and gas exploration company has sought a waiver from the U.S. Office of Foreign Assets Control to lift crude oil from Venezuela.The report said ONGC is optimistic of winning an approval according to a source who declining to be named.Earlier this year US had reimposed sanctions on Venezuela citing that the country had broken an accord to hold free and fair elections.India and even American oil refiners had increased imports of Venezuelan oil in 2023 after a sixmonth waiver from sanctions was announced which ended in April this year. Oil from Venezuela was among the cheapest for India s oil refiners with average landed cost reported at  60.60 a barrel in January this year.The Reuters report added that ONGC has been hopeful of recovering  500 million worth of dividends pending since 2014 for the stake it holds in Venezuelan projects. ONGC has instead sought oil instead of the pending dividend however there has not been much progress on that front so far.Crude oil has rallied this year helped by supply cuts by OPEC  though a volatility has declined to multiyear lows in June.\"\n  },\n  {\n    \"question\": \"Has ONGC made any progress in recovering the pending dividend from its stake in Venezuelan projects?\",\n    \"answer\": \"There has not been much progress on that front so far.\",\n    \"context\": \"Shares of Oil and Natural Gas Corp are trading higher after Reuters reported citing industry source that India s largest oil and gas exploration company has sought a waiver from the U.S. Office of Foreign Assets Control to lift crude oil from Venezuela.The report said ONGC is optimistic of winning an approval according to a source who declining to be named.Earlier this year US had reimposed sanctions on Venezuela citing that the country had broken an accord to hold free and fair elections.India and even American oil refiners had increased imports of Venezuelan oil in 2023 after a sixmonth waiver from sanctions was announced which ended in April this year. Oil from Venezuela was among the cheapest for India s oil refiners with average landed cost reported at  60.60 a barrel in January this year.The Reuters report added that ONGC has been hopeful of recovering  500 million worth of dividends pending since 2014 for the stake it holds in Venezuelan projects. ONGC has instead sought oil instead of the pending dividend however there has not been much progress on that front so far.Crude oil has rallied this year helped by supply cuts by OPEC  though a volatility has declined to multiyear lows in June.\"\n  },\n  {\n    \"question\": \"What has helped crude oil prices rally this year?\",\n    \"answer\": \"Crude oil prices have rallied this year helped by supply cuts by OPEC.\",\n    \"context\": \"Shares of Oil and Natural Gas Corp are trading higher after Reuters reported citing industry source that India s largest oil and gas exploration company has sought a waiver from the U.S. Office of Foreign Assets Control to lift crude oil from Venezuela.The report said ONGC is optimistic of winning an approval according to a source who declining to be named.Earlier this year US had reimposed sanctions on Venezuela citing that the country had broken an accord to hold free and fair elections.India and even American oil refiners had increased imports of Venezuelan oil in 2023 after a sixmonth waiver from sanctions was announced which ended in April this year. Oil from Venezuela was among the cheapest for India s\"\n    }\n]\n",
    "```\n[\n  {\n    \"question\": \"What is ONGC's goal for carbon emissions by 2038?\",\n    \"answer\": \"Net zero carbon emission goal by 2038.\",\n    \"context\": \"ONGC shares gained after the firm announced it will invest around Rs 2 lakh crore to establish renewable energy sites and green hydrogen plants in an attempt to achieve its netzero carbon emission goal by 2038.\"\n  },\n  {\n    \"question\": \"How much will ONGC invest by 2030 to establish renewable energy capacity?\",\n    \"answer\": \"Rs 97,000 crore.\",\n    \"context\": \"Additionally the stateowned firm will invest Rs 97000 crore by 2030 to establish 5 gigawatts of renewable energy capacity green hydrogen biogas a pump storage plant and an offshore wind project.\"\n  },\n  {\n    \"question\": \"How much did ONGC shares increase by on the NSE at 9.30 am?\",\n    \"answer\": \"0.7 percent.\",\n    \"context\": \"At 9.30 am ONGC shares were quoting Rs 299.25 on the NSE higher by 0.7 percent.\"\n  },\n  {\n    \"question\": \"How much will ONGC invest in green hydrogen or green ammonia plants by 2035?\",\n    \"answer\": \"Rs 65,500 crore.\",\n    \"context\": \"The oil and gas firm said it will invest Rs 65500 crore more by 2035 for either a green hydrogen or green ammonia plant and the last Rs 38000 crore by 2038 in creating 1 GW of offshore wind projects.\"\n  },\n  {\n    \"question\": \"How many million tonnes of carbon emissions will ONGC offset as a result of these projects?\",\n    \"answer\": \"Around 9 million tonnes.\",\n    \"context\": \"As a result of these projects ONGC will be able to offset around 9 million tonnes of carbon emissions it is directly or indirectly responsible for.\"\n  },\n  {\n    \"question\": \"How much will ONGC invest to cut gas flaring to zero by 2030?\",\n    \"answer\": \"Rs 5,000 crore.\",\n    \"context\": \"The firm said it will put Rs 5000 crore to cut gas flaring to zero by 2030 through technological intervention.\"\n  },\n  {\n    \"question\": \"How much methane did ONGC release into the atmosphere in 2021-22?\",\n    \"answer\": \"554 million cubic meters.\",\n    \"context\": \"ONGC released 554 million cubic metres of methane in 202122 into the atmosphere mostly because it was an incidental byproduct of oil.\"\n  },\n  {\n    \"question\": \"What percentage did ONGC shares jump in the trade over the past year?\",\n    \"answer\": \"More than 80 percent.\",\n    \"context\": \"Over the past year shares of staterun ONGC jumped more than 80 percent in the trade as against a 26 percent rise in the frontline Nifty 50 index during the same period.\"\n  }\n]   \n```\"\n    }\n]\n",
    "```json\n[\n    {\n        \"question\": \"What is Jefferies' stance on ONGC's stock, and what is their target price?\",\n        \"answer\": \"Jefferies has maintained its 'buy' rating on ONGC stock, setting a target price of Rs 390 per share. This represents a potential 50% increase from the current share price.\",\n        \"context\": \"Despite the recent dip in ONGC's stock price, international brokerage firm Jefferies remains optimistic. They have retained their 'buy' call on the stock, citing the Indian government's consistent policies as a factor that should sustain ONGC's high profitability.  Jefferies believes the recent decline in share price presents a good opportunity for investors and has set a target price of Rs 390 per share, indicating a potential 50% upside from current levels.\"\n    },\n    {\n        \"question\": \"How has ONGC's stock performed since the recent election results in India?\",\n        \"answer\": \"ONGC's stock price has dropped by around 9% since the June 4th election results, when the ruling BJP party failed to secure a clear majority.\",\n        \"context\": \"The outcome of the recent Indian elections has impacted ONGC's stock performance. Since the June 4th announcement that the ruling BJP party did not achieve a simple majority, investors have been selling their ONGC shares, resulting in a roughly 9% decline in the stock's value.\"\n    },\n    {\n        \"question\": \"What does Jefferies see as the key factors to watch for in ONGC's future performance?\",\n        \"answer\": \"Jefferies highlights ONGC's production increase in the KG basin during the third quarter of the current fiscal year and its impact on profitability as key indicators to monitor.\",\n        \"context\": \"Jefferies emphasizes the importance of tracking specific aspects of ONGC's operations for investors.  They believe that the company's efforts to ramp up production in the KG basin during the third quarter of this fiscal year will be crucial. Additionally, how this increase in production translates into profitability will be a key indicator of ONGC's future success.\"\n    },\n    {\n        \"question\": \"What is the potential risk to ONGC according to Jefferies?\",\n        \"answer\": \"Jefferies identifies significant fluctuations in crude oil prices – either a sharp rise or fall – as potential risks for ONGC's future performance.\",\n        \"context\": \"While optimistic overall, Jefferies does acknowledge potential challenges for ONGC. They warn that substantial volatility in the price of crude oil, whether a sudden surge or a steep decline, could negatively impact the company's future prospects. \"\n    },\n    {\n        \"question\": \"How does Jefferies expect ONGC to perform financially in the coming years?\",\n        \"answer\": \"Jefferies predicts ONGC will generate substantial free cash flow and reduce its consolidated net debt, resulting in profitable growth from FY24 to FY26.\",\n        \"context\": \"In a note published on April 15th, Jefferies outlined their positive outlook for ONGC's financial performance. They anticipate the company will generate significant free cash flow over the next few fiscal years (FY24-FY26), enabling ONGC to pay down its consolidated net debt. This strategic financial management is expected to lead to a period of profitable growth for the company.\"\n    },\n    {\n        \"question\": \"What is Jefferies' opinion on the recent correction in ONGC's stock price?\",\n        \"answer\": \"Jefferies believes the recent drop in ONGC's stock price is excessive and presents an attractive buying opportunity for investors.\",\n        \"context\": \"Although ONGC's stock has experienced a downturn, Jefferies views this as an overreaction by the market. They believe the decline is disproportionate to the company's actual performance and potential, making it a good time for investors to consider buying shares at a discounted price.\"\n    },\n    {\n        \"question\": \"How has ONGC's stock performed compared to the Nifty 50 index in the last year?\",\n        \"answer\": \"ONGC's stock has outperformed the Nifty 50 index significantly, rising 67% in the past year compared to the index's 25% gain.\",\n        \"context\": \"ONGC's stock has demonstrated strong performance over the past year, even with the recent dip.  The stock has climbed an impressive 67% during this period, exceeding the broader market's performance, as represented by the Nifty 50 index, which saw a 25% increase.\"\n    },\n    {\n        \"question\": \"What is the reason behind Jefferies' confidence in ONGC's sustained profitability\"\n    }\n]\n",
    "[\n  {\n    \"question\": \"What is ONGC seeking help for?\",\n    \"answer\": \"ONGC is seeking help from an internationally proven technical service provider to raise oil and gas production from its flagship but old and maturing Mumbai field in the Arabian Sea.\",\n    \"context\": \"Stateowned Oil and Natural Gas Corporation (ONGC) is seeking help from an internationallyproven technical service provider to raise oil and gas production from its flagship but old and maturing Mumbai field in the Arabian Sea.\"\n  },\n  {\n    \"question\": \"When did the Mumbai High field commence production?\",\n    \"answer\": \"The giant multilayered Mumbai High field commenced production 48 years ago in 1976.\",\n    \"context\": \"The giant multilayered Mumbai High field which commenced production 48 years ago in 1976 is currently in its mature stage of production and ONGC has implemented a number of schemes in this field to improve production  it said.\"\n  },\n  {\n    \"question\": \"What is the current production of the Mumbai High field?\",\n    \"answer\": \"The field is currently producing 134000 bpd and about 10 million standard cubic metres per day of gas.\",\n    \"context\": \"While it hit a peak output of 40000 barrels per day in 1989 the field is producing 134000 bpd and about 10 million standard cubic metres per day of gas.\"\n  },\n  {\n    \"question\": \"What is the estimated balance reserve of the Mumbai High field?\",\n    \"answer\": \"The field is estimated to hold a balance reserve of 80 million tonnes (610 million barrels) of oil and over 40 billion cubic metres of gas.\",\n    \"context\": \"The field is estimated to hold a balance reserve of 80 million tonnes (610 million barrels) of oil and over 40 billion cubic metres of gas.\"\n  },\n  {\n    \"question\": \"What will the service provider be paid?\",\n    \"answer\": \"The service provider would be paid a fixed fee and a biddable share from the revenue earned from incremental production over an agreed baseline.\",\n    \"context\": \"The service provider would give technical solutions for raising the output. It will be paid a fixed fee and a biddable share from the revenue earned from incremental production over an agreed baseline.\"\n  },\n  {\n    \"question\": \"When are the bids due?\",\n    \"answer\": \"The bids are due in midSeptember.\",\n    \"context\": \"The firm said adding that the bids are due in midSeptember.\"\n  },\n  {\n    \"question\": \"What is the scope of work for the service provider?\",\n    \"answer\": \"The identified service provider would carry out a comprehensive review of field performance and identify improvements in wells reservoirs including water injection and facilities management (WRFM).It would suggest and help implement suitable technological interventions to improve production. Integrated reservoir FEED studies and development of detailed work plans for field development would also be within the scope of work it said.\",\n    \"context\": \"The identified service provider would carry out a comprehensive review of field performance and identify improvements in wells reservoirs including water injection and facilities management (WRFM).It would suggest and help implement suitable technological interventions to improve production. Integrated reservoir FEED studies and development of detailed work plans for field development would also be within the scope of work it said.\"\n  },\n  {\n    \"question\": \"What are the requirements for participating in the ICB?\",\n    \"answer\": \"All international oil and gas majors having annual revenue above USD 75 billion are invited to participate in this ICB.\",\n    \"context\": \"All international oil and gas majors having annual revenue above USD 75 billion are invited to participate in this ICB.\"\n  }\n]",
    "```\n[\n  {\n    \"question\": \"What was ONGC's reported EBITDA in the fourth quarter of fiscal year 2024?\",\n    \"answer\": \"ONGC's reported EBITDA stood at INR174 billion in the fourth quarter of fiscal year 2024, a 7% increase year-over-year.\",\n    \"context\": \"Motilal Oswal's research report on ONGC's reported EBITDA stood at INR174b ( 7  YoY) in 4QFY24 3  below our estimate mainly due to higherthanexpected other expenses.\"\n  },\n  {\n    \"question\": \"What was the primary reason for ONGC's higher-than-expected other expenses in the fourth quarter?\",\n    \"answer\": \"The sharp rise in other expenses was due to one-off charges of INR9 billion for tax-related matters.\",\n    \"context\": \"The sharp rise in other expenses was due to oneoff charges of INR9b for taxrelated matters.\"\n  },\n  {\n    \"question\": \"How much higher was ONGC's fourth-quarter PAT than Motilal Oswal's estimate?\",\n    \"answer\": \"ONGC's fourth-quarter PAT was 13% higher than Motilal Oswal's estimate.\",\n    \"context\": \"4Q PAT was 13  higher than our estimate mainly aided by lowerthan expected depreciation and dry well writeoffs.\"\n  },\n  {\n    \"question\": \"What is ONGC's management's expectation for total production (excluding JVs) in the next three years?\",\n    \"answer\": \"ONGC management expects total production (excl. JV) to rise to 47 million tonnes of oil equivalent in the next three years, up from 39 million tonnes of oil equivalent currently.\",\n    \"context\": \"ONGC management expects total production (excl. JV) to rise to 47mmtoe in the next three years from 39mmtoe now mainly driven by KG98 2 and Daman upside development.\"\n  },\n  {\n    \"question\": \"What is the expected ramp-up rate for gas production from the KG98 2 asset?\",\n    \"answer\": \"Gas production from the KG98 2 asset is expected to ramp up to 10 million standard cubic meters per day by the end of fiscal year 2025.\",\n    \"context\": \"Gas production from the KG98 2 asset which will begin in 3QFY25 is expected to ramp up to 10mmscmd by FY25 end while oil production could ramp up to 45000bopd by 4QFY25.\"\n  },\n  {\n    \"question\": \"What is ONGC's expected capex for fiscal year 2025?\",\n    \"answer\": \"ONGC expects capex to normalize at INR330-350 billion in fiscal year 2025.\",\n    \"context\": \"FY24 capex stood at INR370b attributed to oneoff projects and the capitalization of some expenses. ONGC expects capex to normalize at INR330350b in FY25.\"\n  },\n  {\n    \"question\": \"At what multiple is ONGC currently trading?\",\n    \"answer\": \"ONGC is currently trading at 2.8x FY26E EV EBITDA (SA) and 7.1x FY26E P E (SA).\",\n    \"context\": \"OutlookONGC is trading at 2.8x FY26E EV EBITDA (SA) and 7.1x FY26E P E (SA).\"\n  },\n  {\n    \"question\": \"What is Motilal Oswal's target price for ONGC?\",\n    \"answer\": \"Motilal Oswal values ONGC at 7x FY26E adj. EPS of INR34 and adds the value of investments to arrive at a target price of INR340.\",\n    \"context\": \"We value the company at 7x FY26E adj. EPS of INR34 and add the value of investments to arrive at our TP of INR340.\"\n  }\n]\n```\"\n    }\n]\n",
    "[\n    {\n        \"question\": \"Why did Oil and Gas stocks drop sharply on June 4th?\",\n        \"answer\": \"Oil and Gas stocks fell due to profit-booking after a significant rally in the previous session.\",\n        \"context\": \"Oil and Gas stocks bled on June 4 as investors rushed to book profits after the sharp rally in the previous session.\"\n    },\n    {\n        \"question\": \"Which company's stock dropped the most on June 4th?\",\n        \"answer\": \"Adani Total Gas's stock fell over 10 percent, leading the losses in the Nifty Oil & Gas index.\",\n        \"context\": \"The Nifty Oil   Gas index slipped over 5 percent in early trade with losses led by Adani Total Gas which nosedived over 10 percent.\"\n    },\n    {\n        \"question\": \"What caused the Nifty Oil & Gas index to rise on June 3rd?\",\n        \"answer\": \"The Nifty Oil & Gas index rose on June 3rd due to exit polls indicating a strong victory for the BJP-led NDA in the Indian elections.\",\n        \"context\": \"The Nifty Oil   Gas index had risen over 6 percent in the previous session after exit polls hinted at a thumping victory for the BJPled NDA with over 350 seats.\"\n    },\n    {\n        \"question\": \"How much did Sensex and Nifty 50 drop after early election results showed a less emphatic NDA victory?\",\n        \"answer\": \"Sensex and Nifty 50 dropped more than 4 percent, eroding nearly Rs 25 lakh crore from BSE market capitalization.\",\n        \"context\": \"As early leads showed the NDA coalition s majority may not be as emphatic as exit polls had forecast Sensex and Nifty 50 dropped more than 4 percent eroding nearly Rs 25 lakh crore from BSE market capitalisation.\"\n    },\n    {\n        \"question\": \"What is Deven Choksey's opinion on the market's reaction to the election results?\",\n        \"answer\": \"Deven Choksey believes that the market is overreacting based on limited election results and that the counting process is slower than usual due to physical counting under VVPAT.\",\n        \"context\": \"Follow our market blog to catch all the live actionDeven Choksey MD of DRChoksey FinServ believes that the market is reacting with just two rounds of counting done. Also due to physical counting under VVPAT the process is slower this time around.\"\n    },\n    {\n        \"question\": \"According to Deven Choksey, how is the market likely to behave once the election results are fully known?\",\n        \"answer\": \"Choksey believes that the market will stabilize and high-beta stocks will continue to be bought.\",\n        \"context\": \"However he emphasized that longterm investors were unlikely to make hasty decisions in response to the market volatility as the fundamental prospects of the economy and corporate sector remain intact despite the election outcome.According to the Choksey market will once again stabilize and the same high beta stocks will be bought.\"\n    },\n    {\n        \"question\": \"What is the impact of profit-taking on the share prices of ONGC and Gail India?\",\n        \"answer\": \"Shares of ONGC and Gail India, along with other PSUs in the sector, fell up to 7 percent due to profit-taking.\",\n        \"context\": \"Shares of ONGC Gail India and other PSUs in the sector including HPCL Indian Oil and BPCL also fell up to 7 percent on account of profittaking.\"\n    },\n    {\n        \"question\": \"How did the market respond to the early election results that indicated a less decisive victory for the NDA?\",\n        \"answer\": \"The market reacted negatively, with Sensex and Nifty 50 dropping more than 4 percent.\",\n        \"context\": \"As early leads showed the NDA coalition s majority may not be as emphatic as exit polls had forecast Sensex and Nifty 50 dropped more than 4 percent eroding nearly Rs 25 lakh crore from BSE market capitalisation.\"\n    }\n]",
    "[{'question': 'What were the key financial results of ONGC (Oil and Natural Gas Corporation) based on Prabhudas Lilladher\\'s research report?',\n  'answer': 'ONGC reported an operating profit of Rs174.1bn, aligning with Prabhudas Lilladher\\'s estimates. Their Profit After Tax (PAT) stood at Rs98.7bn on a standalone basis. Notably, their other income exceeded expectations, reaching Rs36.8bn.',\n  'context': \"Prabhudas Lilladher's research report provides a detailed analysis of ONGC's recent financial performance. The report highlights that ONGC's operating profit matched their projections, indicating stable operational performance. Additionally, the reported PAT figure signifies the company's standalone profitability. Interestingly, the report points out that ONGC's income generated from sources other than its core operations surpassed initial expectations, suggesting the company effectively leveraged additional revenue streams.\"},\n {'question': 'How did ONGC\\'s oil and gas production fare in the recent quarter, according to Prabhudas Lilladher?',\n  'answer': 'Prabhudas Lilladher reported that ONGC witnessed a 3% quarter-on-quarter growth in oil production. However, gas production remained stagnant over the same period.',\n  'context': 'The report underscores ONGC\\'s production performance, revealing a positive trend in oil production with a 3% increase compared to the previous quarter. This growth suggests operational efficiency and potentially favorable market conditions for ONGC\\'s oil segment. Conversely, the flat gas production indicates a lack of growth in this area, prompting further investigation into potential contributing factors such as market dynamics or production challenges.'},\n {'question': 'What is the outlook for ONGC\\'s oil and gas production, as per Prabhudas Lilladher\\'s analysis?',\n  'answer': 'Prabhudas Lilladher projects a positive trajectory for ONGC\\'s production, estimating a 6% Compound Annual Growth Rate (CAGR) in total oil production and a more robust 11% CAGR in total gas production between FY24 and FY26E.',\n  'context': 'Looking ahead, the report provides an optimistic view of ONGC\\'s production capabilities. The projected CAGR figures suggest a consistent growth trajectory for both oil and gas production over the specified period. The higher projected CAGR for gas production implies a potential acceleration in ONGC\\'s efforts to capitalize on the growing demand for natural gas.'},\n {'question': 'What is Prabhudas Lilladher\\'s recommendation and target price for ONGC\\'s stock?',\n  'answer': 'Prabhudas Lilladher maintains a \"Hold\" rating for ONGC\\'s stock, setting a target price of Rs 265. This valuation is based on a multiple of 7 times their FY26 adjusted Earnings Per Share (EPS) forecast of Rs 28.1, supplemented by the estimated value of ONGC\\'s investments, amounting to Rs 68.',\n  'context': \"Prabhudas Lilladher's \"Hold\" rating suggests that while they anticipate stable performance from ONGC, they don't foresee significant short-term growth exceeding the market average. The target price of Rs 265 reflects their valuation model, which takes into account both the company's projected earnings and the worth of its investment portfolio. This information is crucial for investors to make informed decisions regarding buying, selling, or holding ONGC's stock.\"},\n {'question': 'What was the dividend announcement made by ONGC?',\n  'answer': 'ONGC has declared a final dividend of Rs2.5 per share for the fiscal year.',\n  'context': 'This announcement of a final dividend signifies ONGC\\'s commitment to rewarding its shareholders. The dividend payout ratio and yield are crucial factors for investors seeking regular income from their investments in ONGC.'},\n {'question': 'What is the incremental production from ONGC\\'s KG Basin?',\n  'answer': 'ONGC\\'s KG Basin has achieved an incremental production of 12,000 barrels of oil per day (bopd) and 2.4 million standard cubic meters per day (mmscmd) of gas.',\n  'context': 'The substantial incremental production from the KG Basin highlights its significance in ONGC\\'s overall production portfolio. This increase contributes positively to the company\\'s revenue streams and future growth prospects.'},\n {'question': 'What is the current trading multiple for ONGC\\'s stock, according to Prabhudas Lilladher?',\n  'answer': 'ONGC\\'s stock is currently trading at a multiple of 6.2 times its FY25-26 estimated EPS, as per Prabhudas Lilladher\\'s analysis.',\n  'context': \"\"\n    }\n]\n",
    "[\n  {\n    \"question\": \"What is the expected production increase for ONGC in the next three years?\",\n    \"answer\": \"47 million metric tons of oil equivalent (mmtoe), up from the current 39 mmtoe.\",\n    \"context\": \"ONGC's management expects total production to rise to 47 million metric ton of oil equivalent (mmtoe) over the next three years up from 39 mmtoe currently.\"\n  },\n  {\n    \"question\": \"What is the target price set by Motilal Oswal for ONGC?\",\n    \"answer\": \"Rs 340, implying a 21% potential upside.\",\n    \"context\": \"Motilal Oswal increased its total production assumptions for FY25 FY26 by 2 percent 3 percent. The brokerage increased its price target to Rs 340 implying 21 percent potential upside and reiterated its buy rating on the stock.\"\n  },\n  {\n    \"question\": \"What is the target price set by Jefferies for ONGC?\",\n    \"answer\": \"Rs 390 per share, indicating an upside of nearly 40% from the previous session's closing price.\",\n    \"context\": \"International brokerage Jefferies kept its buy call on the player steady with a target price of Rs 390 per share. This indicates an upside of nearly 40 percent from the previous session s closing price.\"\n  },\n  {\n    \"question\": \"What is the reason for ONGC's profit jump, according to Jefferies?\",\n    \"answer\": \"Lower exploration costs and higher other income.\",\n    \"context\": \"Jefferies said that ONGC s jump in profit was 14 percent ahead of its expectations as a result of lower exploration costs and higher other income.\"\n  },\n  {\n    \"question\": \"What is JM Financial's view on ONGC's risk-reward ratio?\",\n    \"answer\": \"Still reasonable despite the recent rally.\",\n    \"context\": \"JM Financial also maintained its buy rating with an unchanged price target of Rs 300 per share as riskreward is still reasonable despite the recent rally.\"\n  },\n  {\n    \"question\": \"How much have ONGC shares increased in the past year?\",\n    \"answer\": \"Around 70%, compared to a 23% gain in the Nifty 50 index.\",\n    \"context\": \"Over the past year ONGC shares have surged around 70 percent as compared to a 23 percent gain in the frontline index Nifty 50.\"\n  },\n  {\n    \"question\": \"What is ONGC's capex expected to be in FY25?\",\n    \"answer\": \"Rs 33,000-35,000 crore, after a one-off capex of Rs 37,000 crore in FY24.\",\n    \"context\": \"FY24 capex stood at Rs 37000 crore attributed to oneoff projects and the capitalization of some expenses. ONGC expects capex to normalise at Rs 3300035000 crore in FY25.\"\n  },\n  {\n    \"question\": \"What is the reason for ONGC's higher revenue in Q4 FY24?\",\n    \"answer\": \"Marginal increase in revenue from operations.\",\n    \"context\": \"The stateowned oil and gas exploration major reported marginal increase in revenue from operations for the fourth quarter of FY24 amounting to Rs 1.66 lakh crore.\"\n  }\n]",
    "[{'question': 'What were the Net Sales of ONGC in March 2024, and how did they compare to the previous year?',\n  'answer': 'ONGC reported Net Sales of Rs 34636.69 crore in March 2024, reflecting a decrease of 4.56% compared to Rs. 36292.55 crore in March 2023.',\n  'context': 'The provided financial data reveals that ONGC experienced a slight decline in Net Sales for the fiscal year ending in March 2024. Specifically, their Net Sales decreased by 4.56%, dropping from Rs. 36292.55 crore in March 2023 to Rs 34636.69 crore in March 2024. This suggests a potential softening in revenue generation for the company during this period, prompting further investigation into the factors contributing to this decline.'},\n {'question': 'How did ONGC’s Quarterly Net Profit change from March 2023 to March 2024?',\n  'answer': 'ONGC witnessed a significant increase in their Quarterly Net Profit, rising from Rs. 247.70 crore in March 2023 to Rs. 9869.37 crore in March 2024.',\n  'context': 'The financial data indicates a remarkable improvement in ONGC’s profitability, with their Quarterly Net Profit skyrocketing from Rs. 247.70 crore in March 2023 to a staggering Rs. 9869.37 crore in March 2024. This substantial increase of 4084.4% suggests significant improvements in the company’s operational efficiency and profitability drivers, warranting further analysis to understand the underlying factors contributing to this positive financial performance.'},\n {'question': 'What was the EBITDA of ONGC in March 2024, and how did it compare to the previous year?',\n  'answer': 'ONGC’s EBITDA in March 2024 was Rs. 19570.70 crore, marking a 41.82% increase compared to Rs. 13799.53 crore in March 2023.',\n  'context': 'The provided figures highlight a positive trend in ONGC’s earnings before interest, taxes, depreciation, and amortization (EBITDA), which serves as a key indicator of the company’s financial health and operational performance. In March 2024, ONGC recorded an EBITDA of Rs. 19570.70 crore, reflecting a substantial 41.82% increase from Rs. 13799.53 crore in March 2023. This significant growth in EBITDA suggests enhanced operational efficiency and improved profitability for the company.'},\n {'question': 'What was the EPS for ONGC in March 2024, and how does it compare to the EPS in March 2023?',\n  'answer': 'ONGC's EPS surged to Rs. 7.85 in March 2024, a stark contrast to Rs. 0.20 in March 2023, indicating substantial earnings growth on a per-share basis.',\n  'context': 'The provided data reveals a dramatic improvement in ONGC’s earnings per share (EPS), a crucial metric for evaluating a company’s profitability from a shareholder’s perspective. In March 2024, ONGC reported an EPS of Rs. 7.85, representing a significant leap from Rs. 0.20 in March 2023. This remarkable growth in EPS reflects the company’s enhanced profitability and its ability to generate higher earnings for its shareholders.'},\n {'question': 'What was the closing price of ONGC shares on May 18, 2024, and on which stock exchange?',\n  'answer': 'ONGC shares closed at Rs. 279.00 on the National Stock Exchange (NSE) on May 18, 2024.',\n  'context': 'On May 18, 2024, ONGC’s shares concluded trading on the National Stock Exchange (NSE) at a closing price of Rs. 279.00. This information provides a snapshot of the company’s stock performance on that particular day and serves as a reference point for investors and market analysts tracking ONGC’s stock movements.'},\n {'question': 'What were the 6-month and 12-month returns for ONGC shares as of May 18, 2024?',\n  'answer':\"\n    }\n]\n",
    "[{'question': 'What was the consolidated net profit of ONGC in the fourth quarter of FY24?', 'answer': 'ONGC reported a consolidated net profit of Rs 11,526.53 crore in the fourth quarter of FY24.', 'context': 'Oil and Natural Gas Corporation (ONGC) experienced a significant surge in profitability in the fourth quarter of FY24, reporting a consolidated net profit of Rs 11,526.53 crore. This impressive figure represents a substantial 78 percent increase compared to the same period in the previous year. However, it is worth noting that this growth in net profit was accompanied by a marginal increase in revenue from operations during the January-March 2024 period. ONGC, a leading explorer in the oil and gas industry, witnessed a 1.6 percent decline in crude oil production in FY24, despite government efforts to bolster domestic production and reduce reliance on imports. This decline in production highlights the challenges faced by the company in a dynamic market environment.'}, {'question': 'How did ONGC\\'s revenue from operations perform in the fourth quarter of FY24?', 'answer': 'ONGC\\'s revenue from operations saw a slight increase, reaching Rs 1.66 lakh crore in the fourth quarter of FY24.', 'context': 'In the fourth quarter of FY24, ONGC's revenue from operations experienced a marginal increase, reaching Rs 1.66 lakh crore compared to Rs 1.64 lakh crore in the corresponding period of the previous year. This uptick in revenue, while modest, suggests a degree of stability in the company's operational performance. However, it's essential to consider this revenue growth in the context of ONGC's crude oil production, which experienced a slight decline of 1.6 percent in FY24, despite governmental initiatives to encourage domestic production and reduce reliance on imports.'}, {'question': 'What was the crude oil price realisation for ONGC in Q4 FY24?', 'answer': 'ONGC achieved a crude oil price realisation of $80.81 per barrel from its nominated fields in Q4 FY24.', 'context': 'During the fourth quarter of FY24, ONGC realized a price of $80.81 per barrel for its crude oil from designated fields. This figure represents a notable increase from the $77.12 per barrel realized in the same period of the previous year. This favorable price realization contributed positively to ONGC's financial performance during the quarter, as higher oil prices generally translate to increased revenue for oil-producing companies.'}, {'question': 'How did ONGC\\'s crude oil production fare in Q4 FY24 and FY24 overall?', 'answer': 'ONGC\\'s crude oil production increased by 2.4 percent in Q4 FY24, reaching 5.359 million metric tonnes. However, the company saw a 1.6 percent decline in total oil production for the full fiscal year.', 'context': 'Analyzing ONGC's crude oil production reveals a mixed picture. In the fourth quarter of FY24, the company witnessed a 2.4 percent increase in production, reaching 5.359 million metric tonnes. This positive quarterly performance, however, was not sufficient to offset a decline observed earlier in the fiscal year. Consequently, ONGC's total oil production for the full fiscal year FY24 experienced a 1.6 percent decrease compared to the previous year. This decline comes despite the Indian government's push for increased domestic oil production to reduce the country's dependence on imports.'}, {'question': 'What was the gas production trend for ONGC in Q4 FY24 and the entire fiscal year?', 'answer': 'ONGC\\'s gas production declined in both Q4 FY24 and FY24 overall, falling by 3 percent and 3.3 percent respectively.', 'context': 'ONGC's gas production exhibited a downward trend in both the fourth quarter of FY24 and the full fiscal year. In Q4, gas production decreased by 3 percent compared to the same period last year, reaching 5.101 billion cubic meters (BCM). This decline continued for the entire fiscal year (2023-24), with total gas production falling by 3.3 percent. The factors contributing to this decline in gas production could include natural reservoir depletion, operational challenges, or strategic decisions made by the company.'}, {'question': 'What was the total capital expenditure by ONGC in FY24?', 'answer': 'ONGC invested around Rs 37,000 crore in capital expenditure during FY24.', 'context': 'Throughout FY24, ONGC allocated a substantial amount of capital, approximately Rs 37,000 crore, towards capital expenditure. This figure represents a significant increase\"\n    }\n]\n",
    "[\n  {\n    \"question\": \"What was ONGC's net sales in March 2024?\",\n    \"answer\": \"ONGC's net sales in March 2024 were Rs 166770.63 crore.\",\n    \"context\": \"Net Sales at Rs 166770.63 crore in March 2024 up 1.65  from Rs. 164066.72 crore in March 2023.\"\n  },\n  {\n    \"question\": \"What was ONGC's quarterly net profit in March 2024?\",\n    \"answer\": \"ONGC's quarterly net profit in March 2024 was Rs. 10107.36 crore.\",\n    \"context\": \"Quarterly Net Profit at Rs. 10107.36 crore in March 2024 up 172.03  from Rs. 3715.48 crore in March 2023.\"\n  },\n  {\n    \"question\": \"What was ONGC's EBITDA in March 2024?\",\n    \"answer\": \"ONGC's EBITDA in March 2024 was Rs. 26329.83 crore.\",\n    \"context\": \"EBITDA stands at Rs. 26329.83 crore in March 2024 up 11.29  from Rs. 23658.81 crore in March 2023.\"\n  },\n  {\n    \"question\": \"What was ONGC's EPS in March 2024?\",\n    \"answer\": \"ONGC's EPS in March 2024 was Rs. 8.03.\",\n    \"context\": \"ONGC EPS has increased to Rs. 8.03 in March 2024 from Rs. 2.95 in March 2023.\"\n  },\n  {\n    \"question\": \"What is the current share price of ONGC?\",\n    \"answer\": \"ONGC shares closed at 279.00 on May 18 2024 (NSE).\",\n    \"context\": \"ONGC shares closed at 279.00 on May 18 2024 (NSE) and has given 41.02  returns over the last 6 months and 67.72  over the last 12 months.\"\n  },\n  {\n    \"question\": \"What were ONGC's returns over the last 6 months?\",\n    \"answer\": \"ONGC's returns over the last 6 months were 41.02%.\",\n    \"context\": \"ONGC shares closed at 279.00 on May 18 2024 (NSE) and has given 41.02  returns over the last 6 months and 67.72  over the last 12 months.\"\n  },\n  {\n    \"question\": \"What were ONGC's returns over the last 12 months?\",\n    \"answer\": \"ONGC's returns over the last 12 months were 67.72%.\",\n    \"context\": \"ONGC shares closed at 279.00 on May 18 2024 (NSE) and has given 41.02  returns over the last 6 months and 67.72  over the last 12 months.\"\n  },\n  {\n    \"question\": \"What is the context of the given information?\",\n    \"answer\": \"The given information is about ONGC's financial performance in March 2024.\",\n    \"context\": \"Net Sales at Rs 166770.63 crore in March 2024 up 1.65  from Rs. 164066.72 crore in March 2023.Quarterly Net Profit at Rs. 10107.36 crore in March 2024 up 172.03  from Rs. 3715.48 crore in March 2023.EBITDA stands at Rs. 26329.83 crore in March 2024 up 11.29  from Rs. 23658.81 crore in March 2023.ONGC EPS has increased to Rs. 8.03 in March 2024 from Rs. 2.95 in March 2023.ONGC shares closed at 279.00 on May 18 2024 (NSE) and has given 41.02  returns over the last 6 months and 67.72  over the last 12 months.\"\n  }\n]",
    "```\n[\n  {\n    \"question\": \"How much was ONGC's consolidated net profit in Q4 of FY23-24?\",\n    \"answer\": \"Rs 11526.53 crore\",\n    \"context\": \"Oil and Natural Gas Corporation (ONGC) posted an increase of around 78 percent in consolidated net profit at Rs 11526.53 crore in the fourth quarter of the financial year 2023-24 compared to Rs 6478.23 crore in the same period last year.\"\n  },\n  {\n    \"question\": \"How did ONGC's consolidated net profit compare to the previous quarter?\",\n    \"answer\": \"Marginally increased\",\n    \"context\": \"Sequentially, ONGC's consolidated net profit increased marginally in the quarter ended March 31 from Rs 11104.50 crore posted in the previous quarter.\"\n  },\n  {\n    \"question\": \"What was ONGC's revenue from operations in Q4 of FY23-24?\",\n    \"answer\": \"Rs 1.66 lakh crore\",\n    \"context\": \"The state-owned oil and gas exploration major reported a marginal increase in revenue from operations for the fourth quarter of the current fiscal year, amounting to Rs 1.66 lakh crore compared to Rs 1.64 lakh crore recorded in the same period of the previous year.\"\n  },\n  {\n    \"question\": \"What dividend per share did ONGC's board of directors recommend?\",\n    \"answer\": \"Rs 2.50 per share\",\n    \"context\": \"The company's board of directors recommended a final dividend of Rs 2.50 per equity share of face value of Rs 5 each for the financial year 2023-24, subject to the approval of shareholders.\"\n  },\n  {\n    \"question\": \"How did ONGC's EBITDA perform in Q4 of FY23-24?\",\n    \"answer\": \"Increased to Rs 25772 crore\",\n    \"context\": \"ONGC's earnings before interest, tax, depreciation, and amortization (EBITDA) for Q4 rose to Rs 25772 crore from Rs 15752 crore during the corresponding period last year.\"\n  },\n  {\n    \"question\": \"What was the average analyst estimate for ONGC's net profit in Q4 of FY23-24?\",\n    \"answer\": \"Rs 8434 crore\",\n    \"context\": \"According to the average of eight analysts' estimates surveyed by, the upstream oil company's net profit was seen falling over 11 percent year-on-year to Rs 8434 crore.\"\n  },\n  {\n    \"question\": \"How did ONGC's crude oil production perform in Q4 of FY23-24?\",\n    \"answer\": \"Increased by 2.4 percent\",\n    \"context\": \"In the fourth quarter, the company's total crude oil production increased 2.4 percent from last year at 5.359 million metric tonnes (MMT).\"\n  },\n  {\n    \"question\": \"How many exploratory and development wells did ONGC drill in FY23-24?\",\n    \"answer\": \"541 wells, including 103 exploratory and 438 development wells\",\n    \"context\": \"ONGC drilled 541 wells, the highest recorded in the past 34 years, comprising 103 exploratory and 438 development wells.\"\n  }\n]\n```\"\n    }\n]\n",
    "[{'question': 'Why did Norway's central bank exclude APSEZ from its government pension fund?', 'answer': 'Norway\\'s central bank excluded APSEZ from its government pension fund due to ethical concerns regarding the company\\'s business association with the armed forces in Myanmar, presenting an \"unacceptable risk\" of human rights violations.', 'context': \"Norway's central bank decided to exclude Adani Ports and Special Economic Zone (APSEZ) from its government pension fund due to concerns about the company's previous business dealings in Myanmar. The bank's ethical guidelines prohibit investments in companies that contribute to serious human rights violations, particularly in conflict zones. APSEZ had business ties with the armed forces in Myanmar, which has been widely condemned for its human rights abuses. Although APSEZ sold its Myanmar assets in May 2022, the Norwegian fund's Council of Ethics was not satisfied with the lack of transparency surrounding the sale. The council noted the absence of information about the buyer and expressed concern that APSEZ might still have indirect links to the Myanmar military. This lack of clarity led the council to conclude that investing in APSEZ posed an unacceptable risk to the ethical integrity of the Norwegian Government Pension Fund Global (GPFG).\"}, {'question': 'What specific concern did the Norwegian fund have about APSEZ\\'s dealings in Myanmar despite the company selling its assets there?', 'answer': 'Despite APSEZ selling its Myanmar assets, the Norwegian fund was concerned about the lack of transparency surrounding the sale, particularly the lack of information about the buyer and the possibility of continued links between APSEZ and the Myanmar military.', 'context': \"While APSEZ asserted that it had sold its Myanmar port operations to Solar Energy Ltd in May 2023, the Norwegian fund's Council of Ethics expressed serious concerns about the opacity of the transaction.  The council highlighted the lack of publicly available information about Solar Energy Ltd and its connections, if any, to the Myanmar military regime. APSEZ's inability or unwillingness to disclose the buyer's identity raised red flags for the council, as it hindered their ability to ascertain whether APSEZ had truly severed ties with entities complicit in human rights abuses in Myanmar.  The council emphasized that the absence of such crucial information created an unacceptable level of risk for the Norwegian Government Pension Fund Global (GPFG), given the gravity of the human rights violations occurring in Myanmar.\"}, {'question': 'What is the Norwegian Government Pension Fund Global (GPFG) and what are its ethical guidelines?', 'answer': 'The GPFG is Norway\\'s sovereign wealth fund managed by Norges Bank. It has strict ethical guidelines that prohibit investments in companies complicit in serious human rights violations, corruption, environmental damage, and other unethical practices.', 'context': \"The Norwegian Government Pension Fund Global (GPFG), commonly known as the Norwegian oil fund, is the world's largest sovereign wealth fund.  It was established in 1990 to manage the surplus revenues generated by Norway's oil and gas sector. The fund's primary objective is to ensure the long-term financial well-being of Norway's future generations. The GPFG operates under a strict ethical framework, adhering to guidelines set by the Norwegian Ministry of Finance and overseen by the Norwegian Parliament. These guidelines explicitly prohibit investments in companies that contribute to or are complicit in serious human rights violations, engage in corrupt practices, cause severe environmental damage, produce certain weapons systems, or manufacture tobacco.\"}, {'question': 'When and why did the Norwegian bank exclude ITC from its investment portfolio?', 'answer': 'The Norwegian bank excluded ITC from its investment portfolio in January 2020 due to its involvement in the production of tobacco, which contradicts the fund\\'s ethical guidelines.', 'context': \"In January 2020, the Norwegian bank took the significant step of excluding ITC, an Indian conglomerate, from its investment portfolio. This decision was made based on ITC's substantial involvement in the production and sale of tobacco products. The Norwegian Government Pension Fund Global (GPFG) adheres to a strict ethical framework that prohibits investments in companies engaged in activities deemed harmful to public health, including the production of tobacco. The fund's decision to exclude ITC reflects its commitment to aligning its investments with its ethical principles and promoting responsible business practices globally.\"}, {'question': 'Why was Zuari Agro Chemicals excluded from the Norwegian fund\\'s investment portfolio?', 'answer': 'Zuari Agro Chemicals was excluded from the Norwegian fund\\'s portfolio in October 2013 due to alleged human rights violations, a clear breach of the fund\\'s ethical guidelines.', 'context': \"In October 2013, Zuari Agro Chemicals, an Indian fertilizer company, faced exclusion from the Norwegian fund's investment portfolio due to serious allegations of human rights violations. The Norwegian Government Pension Fund Global (GPFG) places paramount importance on its ethical guidelines, which strictly prohibit investments in companies complicit in or contributing to human\"\n    }\n]\n",
    "[\n  {\n    \"question\": \"What is the estimated net profit of ONGC for the quarter ended March 2024?\",\n    \"answer\": \"Rs 8434 crore\",\n    \"context\": \"The upstream oil company's net profit is seen falling over 11 percent year-on-year to Rs 8434 crore according to the average of 8 analysts estimates surveyed by.\"\n  },\n  {\n    \"question\": \"What factors are expected to contribute to the decline in ONGC's net profit?\",\n    \"answer\": \"Lower oil and gas production and a lower administered price mechanism for gas.\",\n    \"context\": \"The decline in profit after tax (PAT) is expected to be on account of lower oil and gas production and a lower administered price mechanism for gas.\"\n  },\n  {\n    \"question\": \"By how much is ONGC's revenue expected to decline in Q4FY24?\",\n    \"answer\": \"1.11 percent\",\n    \"context\": \"The company's Q4 revenue is expected to decline marginally by 1.11 percent to Rs 34404 crore.\"\n  },\n  {\n    \"question\": \"What is the reason for the expected decline in ONGC's EBITDA in Q4FY24?\",\n    \"answer\": \"Lower administered price mechanism (APM) gas price and lower oil and gas production\",\n    \"context\": \"Meanwhile EBITDA is seen falling half a percent YoY to Rs 17251 crore on lower administered price mechanism (APM) gas price and lower oil and gas production by ONGC but partially offset by higher crude oil realisation.\"\n  },\n  {\n    \"question\": \"What is the expected change in ONGC's oil sales volume in Q4FY24?\",\n    \"answer\": \"4 percent increase\",\n    \"context\": \"Oil sales volumes are seen rising 4 percent on-year but gas sales volumes are expected to decline 2 percent YoY.\"\n  },\n  {\n    \"question\": \"How is Kotak Institutional Equities expecting ONGC's EBITDA to grow in Q4FY24?\",\n    \"answer\": \"35 percent QoQ\",\n    \"context\": \"With both oil and gas prices capped and volumes largely flat Kotak Institutional Equities expects a modest 35 percent QoQ EBITDA growth for upstream firms like ONGC led by lower operating expenses (Opex).\"\n  },\n  {\n    \"question\": \"Why is ONGC's PAT likely to decline on a sequential basis in Q4FY24?\",\n    \"answer\": \"Higher writeoffs and survey expenses\",\n    \"context\": \"The PSU's PAT is likely to decline 14 percent on a sequential basis as well due to likely higher writeoffs and survey expenses in the fiscal fourth quarter the brokerage said.\"\n  },\n  {\n    \"question\": \"What is the expected change in ONGC's net crude and gas realization in Q4FY24?\",\n    \"answer\": \"Flattish sequentially\",\n    \"context\": \"JM Financial expects ONGC's Q4FY24 net crude and gas realization to be largely flattish sequentially. Sales volume is also expected to be flat to slightly lower on a quarter-on-quarter (QoQ) basis.\"\n  }\n]",
    "[\n  {\n    \"question\": \"Who is reportedly in talks to form a consortium to bid for Ayana Renewable Power?\",\n    \"answer\": \"ONGC and NTPC Green Energy are reportedly in talks to form a consortium to bid for Ayana Renewable Power.\",\n    \"context\": \"Oil and Natural Gas Corporation (ONGC) and NTPC Green Energy are reportedly in talks to form a consortium to bid for Ayana Renewable Power which is owned by the National Investment and Infrastructure Fund (NIIF) as interest grows in acquiring the Bengalurubased firm.\"\n  },\n  {\n    \"question\": \"Who is the owner of Ayana Renewable Power?\",\n    \"answer\": \"The National Investment and Infrastructure Fund (NIIF) is the owner of Ayana Renewable Power.\",\n    \"context\": \"Ayana Renewable Power is owned by the National Investment and Infrastructure Fund (NIIF) as interest grows in acquiring the Bengalurubased firm.\"\n  },\n  {\n    \"question\": \"Who else is in the running to acquire Ayana Renewable?\",\n    \"answer\": \"JSW Neo Energy, Sekura Energy, Masdar, Macquarie, and Sembcorp are also in the running to acquire Ayana Renewable.\",\n    \"context\": \"JSW Neo Energy Sekura Energy Masdar Macquarie and Sembcorp are also in the running to acquire Ayana Renewable.\"\n  },\n  {\n    \"question\": \"What is the expected timeline for the bidding process?\",\n    \"answer\": \"NIIF is expected to shortlist bidders in the coming weeks, allowing them to conduct due diligence before submitting binding financial proposals.\",\n    \"context\": \"NIIF is expected to shortlist bidders in the coming weeks allowing them to conduct due diligence before submitting binding financial proposals.\"\n  },\n  {\n    \"question\": \"What is the name of the subsidiary that ONGC launched earlier this year?\",\n    \"answer\": \"ONGC Green is the name of the subsidiary that ONGC launched earlier this year.\",\n    \"context\": \"Earlier this year, ONGC launched ONGC Green, a subsidiary dedicated to renewable energy projects, while NTPC Green Energy has plans for an initial public offering.\"\n  },\n  {\n    \"question\": \"What are NTPC Green Energy's plans for an initial public offering?\",\n    \"answer\": \"NTPC Green Energy has plans for an initial public offering.\",\n    \"context\": \"Earlier this year, ONGC launched ONGC Green, a subsidiary dedicated to renewable energy projects, while NTPC Green Energy has plans for an initial public offering.\"\n  },\n  {\n    \"question\": \"What type of projects does Ayana Renewable Power have in its pipeline?\",\n    \"answer\": \"Ayana Renewable Power boasts a substantial pipeline of over 4 GW of solar, wind, and hybrid power projects across multiple states.\",\n    \"context\": \"Ayana Renewable Power boasts a substantial pipeline of over 4 GW of solar wind and hybrid power projects across multiple states.\"\n  },\n  {\n    \"question\": \"What is Ayana Renewable Power's operational capacity?\",\n    \"answer\": \"Ayana Renewable Power has an operational capacity of 1.3 GW in Andhra Pradesh, Karnataka, and Rajasthan.\",\n    \"context\": \"With an operational capacity of 1.3 GW in Andhra Pradesh Karnataka and Rajasthan Ayana is a significant player in the renewable energy sector.\"\n  }\n]",
    "[\n  {\n    \"question\": \"What did Morgan Stanley issue on the PSU stock of Oil and Natural Gas Corporation (ONGC)?\",\n    \"answer\": \"Morgan Stanley issued an overweight call on the PSU stock of Oil and Natural Gas Corporation (ONGC).\",\n    \"context\": \"Shares of Oil and Natural Gas Corporation (ONGC) gained on April 18 as Morgan Stanley has issued an overweight call on the PSU stock with a target of Rs 304 per share.\"\n  },\n  {\n    \"question\": \"What is the target price set by Morgan Stanley for ONGC?\",\n    \"answer\": \"The target price set by Morgan Stanley for ONGC is Rs 304 per share.\",\n    \"context\": \"Shares of Oil and Natural Gas Corporation (ONGC) gained on April 18 as Morgan Stanley has issued an overweight call on the PSU stock with a target of Rs 304 per share.\"\n  },\n  {\n    \"question\": \"What is expected to support a steady 18-20 percent return on equity (RoE) for ONGC?\",\n    \"answer\": \"Stable regulations are anticipated to support a steady 18-20 percent return on equity (RoE) for ONGC.\",\n    \"context\": \"Additionally stable regulations are anticipated to support a steady 1820 percent return on equity (RoE).\"\n  },\n  {\n    \"question\": \"Why has the ONGC stock gained over 5 percent in the last five trading sessions?\",\n    \"answer\": \"The ONGC stock has gained over 5 percent in the last five trading sessions due to a surge in crude oil prices amid rising hostilities between Israel and Iran.\",\n    \"context\": \"The ONGC stock has gained over 5 percent in the last five trading sessions due to a surge in crude oil prices amid rising hostilities between Israel and Iran.\"\n  },\n  {\n    \"question\": \"What is the potential upside from the previous close as per Jefferies' target price for ONGC?\",\n    \"answer\": \"The potential upside from the previous close as per Jefferies' target price for ONGC is 37 percent.\",\n    \"context\": \"Jefferies also recently initiated coverage on ONGC with a buy rating driven by favourable crude and gas reforms as well as improved profitability. The brokerage has set a target price of Rs 390 apiece implying a potential upside of 37 percent from the previous close.\"\n  },\n  {\n    \"question\": \"How does Jefferies expect ONGC to benefit from the tight crude oil market?\",\n    \"answer\": \"Jefferies expects ONGC to gain from a tight crude oil market as the IEA (International Energy Agency) anticipates a supply deficit of 1.5 million barrels per day in 2023.\",\n    \"context\": \"According to Jefferies analysts ONGC stands to gain from a tight crude oil market as the IEA (International Energy Agency).\"\n  },\n  {\n    \"question\": \"How has the government's pragmatism allowed ONGC to increase its net realization?\",\n    \"answer\": \"The government's pragmatism has allowed ONGC to increase its net realization to $75 even in the face of industry underrecoveries.\",\n    \"context\": \"The government s pragmatism has also allowed it to increase ONGC net realization to  75 even in the face of industry underrecoveries.\"\n  },\n  {\n    \"question\": \"What is expected to add to earnings for ONGC, according to Jefferies?\",\n    \"answer\": \"Reforms to gas pricing are expected to add to earnings for ONGC, according to Jefferies.\",\n    \"context\": \"Reforms to gas pricing are expected to add to earnings for ONGC Jefferies added.\"\n  }\n]",
    "```\n[\n  {\n    \"question\": \"What is the current trading price of ONGC shares?\",\n    \"answer\": \"Rs 275 per share\",\n    \"context\": \"ONGC shares are up by 3.63  percent trading at Rs 275 per share.\"\n  },\n  {\n    \"question\": \"How much have ONGC shares contributed to the recovery of the BSE Oil & Gas index?\",\n    \"answer\": \"200 points\",\n    \"context\": \"ONGC shares alone are seen contributing to 200 points to recovery of BSE Oil   Gas index.\"\n  },\n  {\n    \"question\": \"What is the target price for ONGC shares according to Jefferies?\",\n    \"answer\": \"Rs 390 per share\",\n    \"context\": \"ONGC shares are rallying after Jefferies initiated a  buy  call with Rs 390 per share target price.\"\n  },\n  {\n    \"question\": \"Why does Jefferies believe that ONGC shares are undervalued?\",\n    \"answer\": \"They are trading at a steeper discount to the benchmark Nifty compared to their long-term average.\",\n    \"context\": \"According to Jefferies the ONGC shares are trading at a steeper discount to the benchmark Nifty compared to its longterm average.\"\n  },\n  {\n    \"question\": \"Which other companies are contributing to the recovery of the BSE Oil & Gas index?\",\n    \"answer\": \"IGL, GAIL, Linde India, and Petronet LNG\",\n    \"context\": \"The index is seen recovering by more than 1000 points from day s low. The index made a low of 27339 and is trading near 28400 levels  staging a recovery lead by IGL ONGC GAIL Linde India and Petronet LNG.\"\n  },\n  {\n    \"question\": \"How has the BSE Oil & Gas index performed compared to the BSE Sensex in the past six months?\",\n    \"answer\": \"The BSE Oil & Gas index has outperformed the BSE Sensex by 55% to 15%.\",\n    \"context\": \"Since November 2023 BSE Oil   Gas rose by 55 percent while BSE Sensex has gained by 15 percent.\"\n  },\n  {\n    \"question\": \"What is the current status of the BSE Sensex as of 10.45 am on April 15th?\",\n    \"answer\": \"Down by 500 points\",\n    \"context\": \"ONGC shares are seen rallying on bourses on April 15 a weak market day where BSE Sensex is down by 500 points at 10.45 am.\"\n  },\n  {\n    \"question\": \"What is the name of the consultancy firm that believes ONGC is near its 2014 multiyear breakout?\",\n    \"answer\": \"Rupic consultancy\",\n    \"context\": \"Darpan Patil of Rupic consultancy believes that ONGC is near its 2014 multiyear breakout.\"\n  }\n]\n```\"\n    }\n]\n"
]