[
    "Adani Energy Solutions is likely to launch Rs 6,000-crore Qualified Institutional Placement (QIP) later on July 30, CNBC-Awaaz reported on July 30 citing sources.Demand for the QIP has already crossed three times, the channel reported.GQG, ADIA, Qatar Fund, US-based funds are likely investors in the QIP. Eastspring, White Oak, Nomura, Bandhan MF, Axis MF, IIFL are also likely to participate in QIP, reported CNBC-Awaaz.Floor price is likely to be Rs 1,025 per share and maximum 5 percent discount will be allowed on the floor price.Bankers advising Adani on the share sale are Nomura, SBI Capital Markets, and ICICI Securities.At 2:30 pm on July 30, Adani Energy Solutions shares were trading 5.8 percent higher at Rs 1,112.55 apiece.Last week, Adani Energy Solutions reported a 47 per cent yearly rise in its consolidated revenue from operations in the April-June quarter. The consolidated revenues were at Rs 5,379 crore, the company earnings data showed.Adani Energy Solutions has reported a 47 per cent yearly rise in its consolidated revenue from operations in the April-June quarter. The consolidated revenues were at Rs 5,379 crore, the company earnings data released today showed.\n       ",
    "Promoters raised their holdings in five Adani Group firms -- Adani Energy Solutions Ltd, Adani Enterprises Ltd, Ambuja Cement Ltd, Adani Power Ltd and Adani Green Energy Ltd – by pumping in a little over Rs 23,000 crore during the June quarter, the latest shareholding data shows.Promoter holding in Ambuja Cement has risen by 3.59 percentage points to 70.33 percent from 66.74 percent. In April, the company said that the Gautam Adani family had invested an additional Rs 8,339 crore towards capacity expansion . The Adani family had in October 2022 invested Rs 5,000 crore, and then Rs 6,661 crore in March this year.Cumulatively, the multiple rounds of investment completed the planned Rs 20,000 crore capital infusion into Ambuja Cements.In Adani Enterprises, the promoter holding rose by 2.11 percentage points to 74.72 percent during the quarter. Based on the average stock price of Rs 3,175 during the quarter, promoters would have shelled out roughly Rs 7,600 crore for the additional stake.Promoter holding in Adani Green Energy increased by 1.15 percentage points to 57.52 percent. Based on the average stock price of Rs 1,788 during the quarter, the additional stake would have cost the promoters around Rs 3,200 crore.Promoter holding in Adani Power rose 0.96 percentage points to 72.71 percent, and that in Adani Energy Solutions increased by 1.72 percentage points to 74.94 percent. Based on the average stock price for the quarter, the promoters would have spend around Rs 2,642 crore and Rs 1,917 crore respectively.Meanwhile, the promoter stakes in ACC, Adani Ports and SEZ, Adani Total Gas, and Adani Wilmar remained unchanged from the previous quarter.Ajay Bodke, an independent analyst, said promoters raising stakes in firms was a signal of their confidence in the long-term growth prospects of the businesses. It also reflected the promoters’ belief that the intrinsic value of the company was higher than what the market thought it was worth.Meanwhile, foreign investors have significantly reduced their holdings across several Adani Group companies during the June quarter. Rajiv Jain's GQG Partners has retained their stakes in various Adani Group stocks, except for ACC and Adani Power Ltd. GQG sold around 34 lakh shares of Adani Power, valued at Rs 244 crore, and 35.73 lakh shares of ACC, valued at Rs 240 crore.Adani Enterprises saw FII holdings decrease from 14.41 percent to 11.73 percent, while their exposure to Adani Energy Solutions stake dropped from 17.49 percent to 15.53 percent, and to Ambuja Cements fell from 11.09 percent to 9.59 percent. Similarly, Adani Green Energy's FII holdings declined from 18.15 percent to 16.91 percent, and ACC saw a reduction from 6.17 percent to 5.64 percent.Adani Total Gas saw a slight decrease in FII stake, as did NDTV and Adani Wilmar. In contrast, FII stake in Adani Ports and SEZ increased by 0.21 percentage points during the same period.Last week, the Supreme Court rejected a plea for review of its January 3 decision not to transfer the probe into stock price manipulation allegations against the Adani Group to a special investigation team or the CBI. The court upheld its earlier ruling that SEBI's ongoing investigation into the allegations inspires confidence, despite claims of errors in the judgment and new material presented by the petitioner's counsel.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Private equity firm CVC Capital Partners is in talks with Adani Group and Torrent Group to sell a controlling stake in Indian Premier League (IPL) team Gujarat Titans (GT), The Economic Times has reported.CVC may offload a majority stake in the IPL franchise while retaining a minority holding, the report added.Moneycontrol couldn't independently verify the report.The lock-in period that prevents new teams from selling a stake will end in February 2025.According to the report, GT could be valued between $1 billion-$1.5 billion. \"Having missed out on the opportunity to own IPL's Ahmedabad franchise in 2021, both Adani and Torrent are vying aggressively to buy a majority stake in Gujarat Titans. For CVC, it's a great opportunity to monetise its stake in the franchise,\" an official told ET.Also Read | Gujarat Titans, HealthCare Global backer CVC raises $6.8 bn for largest Asia fundAdani, Torrent, and CVC declined to comment to ET.Gujarat Titans joined the IPL bandwagon in 2022 when the league added two new teams. CVC Capital had acquired the team for Rs 5,625 crore.In 2023, Adani Group bagged WPL's Ahmedabad franchise with a top bid of Rs 1,289 crore.With Rs 193 billion of assets under management, CVC backs sports big time with investments in LaLiga, Premiership Rugby, Volleyball World, and Women's Tennis Association, the report added.\n       ",
    "Sirius Digitech, a joint venture between Adani Group and International Holding Company, on July signed binding pacts to buy Coredge.io Private Limited, an AI and cloud platform company.As per the regulatory filing, Adani Group will buy 77.5 percent stake in Coredge's parent Parserlabs India. Parserlabs owns 100 percent of Coredge.io. The cost of acquisition will be Rs. 20,000 per equity share having face value of rupee 1 each.Via this agreement, Coredge.io, which offers AI and cloud services, will enable Sirius Digitech to provide Machine Learning as-a-Service.Coredge.io offers secure and compliant cloud services for AI applications safeguarding data sovereignty and supports clients across Japan, Singapore and India. It will will enable Sirius Digitech to provide Machine Learning as-a-Service“As nations increasingly prioritise data security, it is more important than ever that organisations have the option to retain their data within national borders rather than relying solely on the public cloud. Sovereign Data Centers become extremely important forprotecting sensitive information and maintaining national security, given the exponential growth in artificial intelligence-driven demand for computation and sovereign data stack,” said Jeet Adani, Director of Adani Group. “An additional benefit of this acquisition is our ability to put AI capabilities directly in the hands of organisations that require specialised sovereign cloud services for AI training and inferencing,\" he added.Ajay Bhatia, CEO of Sirius International Holding said, “This step underscores our commitment to offering a portfolio of secure, trusted and localised cloud AI technologies to our customers and partners.\"Further, Arif Khan, CEO of Coredge.io added, “Partnering with Sirius marks an exciting new chapter for our sovereign AI and cloud platform business, both in India and globally.\"Meanwhile, shares of Adani group's flagship company Adani Enterprises closed marginally up at Rs 3,110 apiece on BSE on July 16 against its previous close.In a move to go with with AI, the Adani Group, led by Gautam Adani, had last year announced that it has formed a joint venture with a unit of UAE’s International Holding Co. to explore artificial intelligence and other technologies, signaling deepening ties between the Indian conglomerate and its Middle-East backers.Adani Global Ltd. and IHC’s Sirius International Holding Ltd. will own 49 percent and 51 percent respectively in the Sirius Digitech International Ltd., which will be based in Abu Dhabi, as per the statement released in December 2023. Both partners will have an equal representation on the board of new entity which will also explore Internet of Things and blockchain besides AI, it had added.\n       ",
    "The Securities and Exchange Board of India’s (Sebi) show cause notice to Hindenburg Research alleges various violations, but the primary accusation relates to the short seller’s misleading disclosure that it did not have any direct or indirect exposure to Adani Group shares listed in India.The capital market watchdog alleged that Hindenburg Research, which released the report on the Adani group in January 2023, misled the market by claiming its exposure to Adani Group securities was limited to",
    "Hindenburg Research called out India’s markets regulator for failing to address the fraud it alleged in a report on the Adani Group early last year, adding that it saw gains of only over $4 million in the short-seller episode that caused an epic market rout for the conglomerate.Securities and Exchange Board of India, or Sebi, “seems more interested in pursuing those who expose such practices” while its investigation into billionaire Gautam Adani’s empire has hit a wall, the US short-seller said in a statement on its website Monday. It got a notice from Sebi in June saying its scathing January 2023 report on the Adani Group had certain misrepresentations and inaccurate statements that were meant to mislead readers.The bombshell report earned a gross revenue of about $4.1 million through gains related to Adani shorts from “one investor relationship” — it didn’t name who — and about “$31,000 through our own short of Adani U.S. bonds,” Hindenburg said in the July 1 statement.Hindenburg alleged last year widespread corporate malfeasance by the ports-to-power conglomerate, calling it “the largest con in corporate history.” Despite Adani Group repeatedly denying Hindenburg’s allegations, the ensuing stock rout at one point had wiped out more than $150 billion in market value of its listed companies. Adani Group has recovered bulk of the stock losses since.‘Masking Kotak’Sebi’s notice “conspicuously failed to name the party that has an actual tie to India: Kotak Bank,” which created and oversaw the offshore fund structure used by Hindenburg’s investor partner to bet against Adani, Hindenburg said. The regulator “masked the “Kotak” name with the acronym “KMIL”,” it added.KMIL refers to Kotak Mahindra Investments Ltd., the asset management company.“Sebi has neglected its responsibility, seemingly doing more to protect those perpetrating fraud than to protect the investors being victimized by it,” Hindenburg said in the statement.The Indian markets regulator didn’t immediately respond to Bloomberg’s request for comment. Representatives for Kotak and the Adani Group did not immediately respond to requests for comment.In the wake of Hindenburg’s Adani report, India’s Supreme Court ordered Sebi to probe allegations while setting up an expert panel to look into regulatory lapses.In January this year, the top court asked Sebi to wrap up its investigation within three months and said no more probes are needed.Hindenburg’s latest broadside comes at a time when India’s newly energized opposition parties have been criticizing Prime Minister Narendra Modi for crony capitalism and favoring billionaires like Adani and Mukesh Ambani over the rest of the citizens in a fiery standoff in the parliament this week.\n       ",
    "US-based Hindenburg research has received a show cause notice from market regulator SEBI regarding its Adani Report, the firm said in a blog post on July 2.The 46-page show cause notice was delivered on June 27, said Hindenburg. The blog post adds that the research firm was short on Adani shares 'through a deal with an investor partner who was indirectly short Adani derivatives through a non-Indian, offshore fund structure'.The post revealing Sebi notice reiterates its position that Hindenburg had adequately disclosed that it was short on Adani shares, 'so readers could weigh the potential for bias given that we stood to benefit from a decline in Adani shares.'The blog post claims that Kotak Bank created the offshore fund that was used by its investor partner to short Adani shares. \"Kotak Bank, one of India’s largest banks and brokerage firms founded by Uday Kotak, which created and oversaw the offshore fund structure used by our investor partner to bet against Adani\", it said.The Hindenburg blog post also adds market regulator Sebi's mention that the research report “contained certain misrepresentations/inaccurate statements” meant to “mislead readers.” Refuting the statement in the notice, Hindenburg said that such alleged \"misleading statements are generally the crux of any fraudulent 'scheme', thus these findings would be crucial for a case advanced by any credible regulator\".This story is being updated ",
    "Adani group is looking to invest about Rs 2 lakh crore by 2030 to build 40 gigawatts of renewable energy generation capacity, as it targets net zero emissions across businesses by 2050, top officials said on Tuesday.The apple-to-airport conglomerate currently has over 10 GW of capacity to generate electricity from renewable sources like sunlight and wind energy and is looking to add 6-7 GW every year to reach 50 GW by 2030.\"Considering the ballpark number of Rs 5 crore per megawatt, the investment could be in the range of Rs 2 lakh crore by 2030,\" Adani Green Energy Ltd Executive Director Sagar Adani told reporters here.Its CEO Amit Singh said the company would also build a 5 GW pump storage capacity to peak power demand during the night when sunlight is not available, and wind intensity is not strong enough to turn wind turbines to produce electricity. The carbon credits renewable capacity generates, together with a few other measures, will help turn the group net zero by 2050.AGEL added 2.8 GW capacity in the 2023-2024 (April 2023 to March 2024) fiscal, which was 15 per cent of India's total renewable energy capacity addition, Singh said.\"This year, our target is 6 GW,\" he said.Going forward, that kind of capacity addition or higher is likely every year, Adani said, adding that 80 per cent of the 50 GW capacity will be solar and the rest wind.The conglomerate is building factories to make wafers used in solar panels to generate electricity and wind turbines.Singh said the group is now looking at making 3 MW wind turbines for areas with lower wind speeds.It currently makes wind turbines of 5.2 MW capacity that are suited for high-potential areas like Khavada in Gujarat.India is the world's third-largest economy in terms of energy needs, and its energy demand is projected to surge 25-35 per cent by 2030. Its peak energy demand is estimated to be 366.4 GW by 2031-32.AGEL brought on a stream of 2,848 MW (2.8 GW) renewables capacity, the largest greenfield expansion in India's renewable energy sector. This included 2,418 MW solar and 430 MW wind projects.Of the capacity commissioned in FY24 includes 2,000 MW of solar capacity from Adani Green Energy's World's largest renewable energy project of 30,000 MW, being built at Khavda, Gujarat. The project is spread across 538 square kilometres, almost five times the city of Paris. Once built, it will be the largest power plant in the world, regardless of the energy source.AGEL is also targeting the addition of at least 5,000 MW pumped storage project (PSP) capacity by 2030 in the first phase, Singh said. It has begun the construction of the first 500 MW PSP in Andhra Pradesh. The company has a robust development pipeline of hydro-pumped storage projects across Andhra Pradesh, Maharashtra, Tamil Nadu and Telangana.With this, AGEL has revised its renewable energy target to 50,000 MW from 45,000 MW by 2030.AGEL's current operational portfolio is 10,934 MW, which consists of 7,393 MW solar, 1,401 MW wind and 2,140 MW wind-solar hybrid capacity. It is the first company in India to surpass the 10,000 MW renewable energy capacity.Over the past five years, its operational capacity addition has outpaced the industry, achieving a CAGR of 41 per cent compared to India's 13 per cent.AGEL's total locked-in portfolio stands at 21,953 MW (10,934 MW is operational, and 11,019 MW is under execution).About 93 per cent of AGEL's portfolio comprising 20,368 MW is now backed by 25-year fixed tariff PPAs with sovereign/sovereign equivalent counterparties, which gives it revenue predictability, and 7 per cent is merchant portfolio, offering higher realisations. \n       ",
    "Adani Green Energy revised its renewable energy capacity target to 50 gigawatts (GW) by 2030, up from the earlier target of 45 GW, said Gautam Adani, Chairman of the Adani Group, on June 24.Speaking at the group’s annual general meeting (AGM), the business tycoon said Adani Green Energy added 2.8 GW in the last year, 15 percent of India’s total renewable capacity addition.The commissioning of the first 2 GW at the world’s largest renewable energy plant in Khavda within 12 months of breaking ground set a record, he said adding that the achievement highlights execution capabilities of the company.“Already generating 3,000 MW of clean energy, our aggressive timeline aims to develop 30 GW capacity in the next five years. This will be enough to power nations like Belgium and Switzerland. For us, the Khavda park is a testimony of our commitment to sustainability and a symbol of national pride,” said Adani.In line with India’s aim to increase reliance on renewable energy, the Adani group had set a renewable energy park spread over 538 square kilometres in Khavda, Gujarat. The company had earlier pointed out that the region is endowed with one of the best wind and solar resources in the country, which makes it ideal for giga-scale RE (renewable energy) development.The region witnesses around 2,060 kWh/m2 of high solar irradiation, making it ideal for solar energy generation and speeds of around 8 meters per second, the company added.\n       ",
    "Adani Group Chairman Gautam Adani delved on the Hindenburg incident at the 32nd annual general meeting of the conglomerate on June 24 and cited the  short-seller's over 100 pages long report on the group as \"baseless accusations\".\"It was a two-sided attack – a vague criticism of our financial standing and, at the same time, an information distortion campaign, dragging us into a political battlefield. The attack was a calculated strike two days before the closing of our Follow-on Public Offer,\"  said Adani about the US short seller's scathing report against the conglomerate last year.Hindenburg fiascoHindenburg, in a report, accused the group of stock manipulation and improper use of tax havens triggering a sell-off in Gautam Adani's ports-to-power conglomerate.Later, an expert panel, established by the Supreme Court, found no conclusive evidence of stock manipulation by the Adani Group, though it recommended improvements to the regulatory framework to protect investors.\"Amplified by a segment of vested media, it was designed to defame us, do maximum damage and erode our hard-earned market value,\" Adani added.He further reiterated the group's efforts to navigate the crisis and said that the company raised an additional Rs 40,000 crore,  covering the next two years of its debt repayment.\"We safeguarded our portfolio against any volatility by pre-paying Rs 17,500 crore in margin-linked financing,\"  said Adani in his speech at the AGM.The group's net debt to EBITDA improved to 2.2 from 3.3.\"Our commitment to operational excellence and transparent disclosures was validated not only by rating agencies and the well-informed financial community, but also by respected global investors like GQG Partners, TotalEnergies, IHC, QIA and the US Development Finance Corporation – all of whom chose to invest in us.,\" added Adani.Bullish on IndiaThe group is optimistic on the domestic growth and is eyeing higher growth opportunities from government's infrastructure push.\"Given the multiplier effect, the government of India has rightly focused on infrastructure development by raising its funding by 16% to over Rs 11 lakh crore for this financial year. It is worthwhile to note that annual spending has tripled in the last 5 years,\" Adani further said.He stressed on the role of state governments in implementing the initiatives related to infrastructure development.\"With the government now in its third term, your company is well positioned to continue the economic and social programs,\" he added.Segment updatesAdani gave an update on the conglomerate's future plans and balance sheet and reiterated the group's goal  to develop 30 GW capacity in the next five years, which it claims will be enough to power nations like Belgium and Switzerland.Given renewable energy’s growth potential, Adani Green Energy revised its FY 2029-30 target from 45 GW to 50 GW. In the year, we added 2.8 GW, 15% of India’s total renewable capacity addition, Adani said.Meanwhile, he noted that passenger traffic at Adani-operated airports stood at 88.6 million.He also restated the group's ambitions of reaching combined cement capacity of 140 million tonne per annum by 2028. \" Ambuja Cements was the lead supplier for India's longest sea bridge - the 21.9 km long Mumbai trans harbour link,\" added Adani.For Adani Energy Solutions, transmission order book stands at Rs 17,000 crore, and our smart metering order book has expanded to 228 lakh units.\n       ",
    "Adani Group plans to invest Rs 25,000-27,500 crore (about $3 billion) to set up its first pumped-storage hydropower (PSH) facility as it aims to gain an edge in the country's thriving clean-energy industry, Livemint reported.PSH produces electricity by moving water between two reservoirs at different elevations.Adani Green will set up a PSH capacity of 5 GW in the next five years and then increase to 25 GW, which will take the group’s total green-energy capability to 70 GW, the report said.The company has also revised its original green-energy target for 2030 from 45 GW to 50 GW, as per the report.Moneycontrol couldn't independently verify the report. Adani Group will set up PSH generation facilities in Maharashtra, Andhra Pradesh, Tamil Nadu and Telangana which will require an investment of Rs 25,000-27,500 crore, based on the current costs, the report added.PSH is a type of hydroelectric energy storage. It is a configuration of two water reservoirs at different elevations that can generate power as water moves down from one to the other (discharge), passing through a turbine.Also Read | Weak hydroelectricity production may stimulate further usage of coal: S&P reportIndia's hydroelectricity output recorded its steepest fall in at least 38 years during the year ended March 31, a Reuters analysis of government data showed, as erratic rainfall forced further dependence on coal-fired power amid higher demand.\n       ",
    "Adani group has plans to invest over $100 billion in energy transition projects and manufacturing capabilityÂ toÂ produce every major component required for the green energy generation, Chairman of the group Gautam Adani said on June 19.Speaking at the 'Infrastructure - the Catalyst for India's Future' event organized by Crisil, Gautam Adani underscored India's immense potential of energy transition and digital infrastructure.",
    "Adani group will invest more than USD 100 billion (around Rs 835 crore) in energy transition projects and manufacturing capability to produce every major component required for green energy generation, its chairman said on Wednesday.Besides building solar parks to produce electricity from sunlight and wind farms that do the same from wind, the conglomerate is building major facilities to manufacture electrolyzers for making green hydrogen, wind power turbines and solar panels.Green hydrogen, which is made by splitting hydrogen from water with the help of electrolyzers powered by clean energy, is seen as a potential panacea for decarbonizing the industry as well as transportation.Speaking at 'Infrastructure - the Catalyst for India's Future' event of Crisil, Adani Group chairman Gautam Adani said energy transition and digital infrastructure are trillion-dollar opportunities which will transform India both at a local and at a global scale.\"The next decade will see us invest more than USD 100 billion in the energy transition space and further expand our integrated renewable energy value chain that today already spans the manufacturing of every major component required for green energy generation,\" he said.The coal-to-ports group wants to produce the \"world's least expensive green electron\" that will become the feedstock for several sectors that must meet the sustainability mandate.\"And to make this happen, we are already building the world's largest single-site renewable energy park in Khavda, in the district of Kutch (in Gujarat). Just this single location will generate 30 GW of power, thereby taking our total renewable energy capacity to 50 GW by 2030,\" he said.Adani said the energy transition space will fundamentally change the global energy landscape forever. \"The global transition market was valued at approximately USD 3 trillion in 2023 and is expected to grow to nearly USD 6 trillion by 2030, and thereafter double every 10 years till 2050.\"\"As many of you know, in the case of India, our country aims to install 500 gigawatts of renewable energy capacity by 2030. This ambitious target will require annual investments of over USD 150 billion dollars. The transition to green energy in India is expected to generate millions of new jobs in sectors such as solar and wind, energy storage, hydrogen and its derivatives, EV charging stations, as well as grid infrastructure development,\" he said.On digital infrastructure, he said data is indeed the new oil and at the heart of all the action is the Data Centre - the critical infrastructure needed to power all forms of computational needs, especially AI workloads for machine learning algorithms, natural language processing, computer vision, and deep learning.All of this is dependent on the ability to process data at an unprecedented speed and scale which are the precise capabilities that data centres provide. However, this will need massive amounts of energy, making the data centre business the largest energy consuming industry in the world, he said.\"This makes the energy transition even more complex and is raising electricity prices, thereby adding to the already high prices because of the combined impact of climate change and demand growth,\" Adani said.The billionaire said the infrastructure required for energy transition and the infrastructure required for digital transformation are now inseparable as the technology sector becomes the largest consumer of the precious green electrons.Adani group's digital footprint will span industrial clouds across each of its businesses that it will productize and then take to market, operational technology cybersecurity offerings, super apps to leverage its B2C businesses across wide variety of consumer facing businesses, Artificial Intelligence labs to capitalize on India's fast emerging expertise to provide AI services to the world, and Data Centres that will form the backbone of the energy intensive digital revolution.\"In fact, it is anticipated that by the year 2030, the world will need 100 to 150 GW of additional green energy just for the AI data centres. We already have India's largest order book for data centres and are now in discussions for additional gigawatt-scale green AI data centres which we are uniquely positioned to deliver,\" he said.\n       ",
    "HighlightsThe Adani Group-backed Ambuja Cement, the second-largest cement player in the domestic market, has announced the acquisition of Hyderabad-based Penna Cement at an enterprise value of Rs 10,422 crore. Ambuja will acquire 100 percent of Penna Cement from\n                                    ",
    "The Adani Group unit that controls a major Australian coal port has obtained a private credit loan of about A$500 million ($333 million), according to people familiar with the matter.The company North Queensland Export Terminal Pty Ltd. got the loan from Farallon Capital Management and King Street Capital Management, said people who asked not to be identified as the matter is private. Spokespeople at an Australian Adani group company, Farallon and King Street declined to comment.Australian coal-related companies are increasingly turning to higher interest-rate private loans as banks globally become more reluctant about providing financing to commodity-related companies due to ESG concerns. Sydney-based coal miner Whitehaven Coal Ltd. earlier this year secured a $1.1 billion loan to buy two mines, attracting 17 private credit lenders and only one bank, while a consortium led by Golden Energy and Resources Pte Ltd., controlled by Indonesia’s Widjaja family, has also sounded out direct lenders.The proceeds of the private loan obtained by Adani’s North Queensland Export Terminal are to be used to refinance existing debt, according to the people. An Adani Group representative also declined to comment.North Queensland Export Terminal is a part of Bravus Australia, an Adani Group company which runs integrated energy and infrastructure services in Australia. North Queensland Export Terminal acquired a 99-year leasehold operation of the terminal from a Queensland Government entity in June 2011.Billionaire Gautam Adani’s ports-to-power group is one of India’s largest thermal power producers with multiple coal-based plants in the nation. The group, which has recovered in large measure from a scathing short-seller report last year, said in December it will invest $100 billion in green energy over the next decade as it aims to become a net zero emitter by 2050.\n       ",
    "The Adani Group is exploring the acquisition of several cement companies, including Hyderabad-based Penna Cement, Gujarat-headquartered Saurashtra Cement, the cement business of Jaiprakash Associates, and Vadraj Cement, owned by ABG Shipyard.According to a report by Economic Times, the group has earmarked $3 billion for these acquisitions. This move is part of Adani’s aggressive inorganic growth strategy aimed at increasing its cement production capacity and surpassing Aditya Birla Group’s UltraTech to become India’s largest cement manufacturer within the next three to four years, ET added.Moneycontrol could not independently verify the story. Adani declined to comment on ET's inquiry, while Penna Cement and Saurashtra Cement did not respond. The resolution professional for Vadraj Cement and the secretarial department of JP Associates also did not reply to ET's queries by press time.The group's interest in these companies is driven by expectations of a surge in demand as the Indian government continues its infrastructure development initiatives, supported by record capital expenditure. According to Economic Times, Penna Cement is estimated to be valued at around Rs 9,000 crore, with the potential for a higher valuation depending on its capacity expansion from 10 MTPA (million tonnes per annum) to 15.5 MTPA.Also Read | Adani Group targets 20% share in Indian cement market by FY28Saurashtra Cement currently has a market capitalisation of Rs 1,487 crore, Economic Times reports. In April 2022, Dalmia Bharat signed a definitive agreement to acquire Jaiprakash Associates' cement, clinker, and power plants for Rs 5,666 crore, but this deal has been delayed due to shareholder disputes.The ET report also adds that the Adani Group is prepared to offer an enterprise value (EV) of $85-120 per ton for these mid-sized cement businesses and may consider a premium for companies with capacity expansion potential, limestone mines, and packing terminals. Notably, Adani acquired Sanghi Cement, which has a capacity of 6.1 MTPA, at $100 EV per ton last year.Penna Cement also has a packing terminal capacity of 2.8 MTPA. Saurashtra Cement has a capacity of around 5 MTPA, Jaiprakash Associates 9.5 MTPA, and Vadraj Cement 6 MTPA. Both Jaiprakash Associates and Vadraj Cement are currently undergoing bankruptcy proceedings.The insolvency of Jaiprakash Associates was triggered by ICICI Bank. The National Company Law Appellate Tribunal (NCLAT) has refused to stay the process but has told ICICI Bank it may consider a one-time settlement proposal submitted by the company.Also Read | Adani group infuses Rs 8,339 cr more into Ambuja Cements, total stake now at 70.3%Ambuja Cement is likely to be the preferred route for these acquisitions by the Adani Group, given it had cash and cash equivalents of Rs 24,338 crore on its books at the end of April, bolstered by Rs 8,339 crore in warrant money from the promoter. The company does not have any debt. Adani may also consider ACC if synergies are better, especially in southern India, where the group currently has a lower market share.\n       ",
    "Shares of Adani Ports and Special Economic Zone (ASPEZ) gained 10 percent on June 3 as the company's wholly owned subsidiary Adani International Ports Holdings Pte Ltd (AIPH) signed a 30-year concession agreement with the Tanzania Ports Authority to operate and manage Container Terminal 2 at the Dar es Salaam Port in Tanzania.The Dar es Salaam Port is a gateway port with a well-connected network of roadways and railways, Adani Ports and Special Economic Zone (APSEZ) said in a statement.East Africa Gateway Ltd (EAGL) has signed a Share Purchase Agreement for the acquisition of a 95 percent stake in Tanzania International Container Terminal Services Limited (TICTS) from Hutchison Port Holdings Limited (and its affiliate Hutchison Port Investments Limited) and Harbours Investment Limited for a purchase consideration of $39.5 million.Follow our market blog to catch all the lie action\"TICTS currently owns all the port handling equipment and employs the manpower. Adani will operate CT2 through TICTS,\" the company’s statement read. EAGL has been incorporated as a joint venture of AIPH, AD Ports Group, and East Harbour Terminals Ltd (EHTL), Adani Ports added.ASPEZ will be the controlling shareholder and will consolidate EAGL on its books, it said.CT2, with four berths, has an annual cargo handling capacity of 1 million TEUs (twenty-foot equivalent units) and managed 0.82 million TEUs of containers in 2023, estimated to be 83 percent of Tanzania’s total container volumes,” APSEZ informed in a regulatory filing.According to APSEZ’s disclosure to stock exchanges, TICTS’ turnover in 2023 was $43.7 million.“The signing of the concession for Container Terminal 2 at Dar es Salaam Port is in line with APSEZ’s ambition of becoming one of the largest port operators globally by 2030,” said Karan Adani, Managing Director, APSEZ.Also Read | Adani Ports signs 30-year concession pact to operate terminal at Dar es Salaam Port in TanzaniaAt 9:42 am, shares of Adani Ports were trading 10 percent higher at Rs 1,581.10 on the National Stock Exchange (NSE). So far this year, the stock has rallied 50 percent, outperforming benchmark Nifty 50 which has risen around 3.6 percent during this period.In the 12 months gone by, Adani Ports stock has soared 114 percent, more than doubling investors' money.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Adani Group companies posted a record 45 per cent rise in pre-tax profit (EBITDA) to Rs 82,917 crore (about USD 10 billion) in FY24 as the apples-to-airport conglomerate made a massive comeback, the group said on Sunday.Emerging from a damning report of a US short seller, which hit the market value of its listed companies, Adani Group in 2023-24 focused on containing debt, reducing founder share pledge and consolidating the business in core competencies. The five-year CAGR (compound annual growth rate) for profit growth was 54 per cent.As much as 84 per cent of EBITDA is from 'core infrastructure' businesses, providing highly predictable cash flows.Cash profit or funds flow from operations (FFO) was at Rs 56,828 crore, registering a growth of 51 per cent year-on-year through a disciplined investment strategy providing high conversion, Adani Group said in a statement.Strong Asset Base built over three decades supporting resilient critical infrastructure stands at Rs 4,78,137 crore (USD 57 billion) - this asset base serves a consumer base of 350 million users.\"The performances for FY24 (2023-24 fiscal) and the past five years signify the strength and stability of Adani portfolio and the robustness of its businesses that despite all the external volatilities and headwinds continue to deliver strong and consistent growth year after year. It also highlights its superior capital allocation strategy that maximises returns and minimises risks,\" the statement said.From FY19 to FY24, Adani portfolio's gross assets increased at a 25 per cent CAGR, while EBITDA grew at 27 per cent CAGR. In comparison, the net debt increased at only 14 per cent. \"This exhibits the group's exceptional capability in efficiently deploying the capital,\" it said.\"In FY24, the Adani portfolio of companies rose to their best, delivering record EBITDA growth of 45 per cent. With surging cash flows and enhanced credit profiles, Adani portfolio of companies are in a 'Stronger than Ever' position to accelerate growth investments,\" it added.The consumer user base of the platform has increased to 350 million, with fast-growing consumer franchises across airports, electricity distribution, smart metering, gas distribution and direct-to-consumer digital platform.\"Rising cash flows from rapidly growing profits have lowered the net leverage significantly,\" it said. \"The portfolio is now very conservatively leveraged with net debt to EBITDA as low as 2.2x; down from 3.3x - this demonstrates a disciplined growth profile providing stable, predictable and resilient performance year-on-year,\" it said.The assured cash flows with multi-decadal visibility give Adani portfolio companies an advantage over the industry. It enables them to optimise leveraging i.e. operate at higher net debt to EBITDA than industry benchmark, yet with lower risks.This leads to faster asset addition, higher growth and maximising returns for shareholders. At 2.2x, Adani portfolio has a balance sheet capacity for even higher growth.\"Total Gross Assets increased by Rs 65,901 crore (USD 8 billion) and now stand at Rs 4,78,220 crore (USD 57.4 billion),\" it said.\"Adani Enterprises Ltd housing green hydrogen, airports business and Adani Green Energy Ltd implementing renewable power generation capacity witnessed the highest gross asset additions or 61 per cent of the total gross asset added. The gains from these will reflect in FY25 earnings.\" Adani group said high liquidity is maintained with a cash balance at 24.8 per cent of gross debt. A cash balance of Rs 59,791 crore (USD 7.2 billion) provides benchmark liquidity cover.In FY24, the group's flagship Adani Enterprises commissioned an ingot wafer unit as part of solar module manufacturing, wind turbine facility and copper smelter. Adani Cement completed the Sanghi Cement acquisition while promoters infused more funds into the company.Adani Ports acquired Gopalpur port, Adani Power commissioned a 1.6 GW Godda power plant, Adani Green added 2.8 GW renewable energy capacity and commenced operations of a solar power project in Khavda, Gujarat, and Adani Energy Solutions put up 1,244 circuit kilometres of transmission lines.\n       ",
    "Udupi Cochin Shipyard Limited (UCSL), a wholly-owned subsidiary of India's leading shipyard, Cochin Shipyard Limited (CSL), has secured a major order from Ocean Sparkle Limited, a prominent Indian tug operator under Adani Harbour Services Limited.The contract for construction of three ASD (Azimuth Stern Drive) Tugs of 70 T bollard pull power was signed by Harikumar A, CEO, UCSL and Hiren Shah, MD and CEO, OSL, according to a CSL statement on Friday.UCSL had earlier contracted construction of two 62 T bollard pull ASD tugs for OSL.Both these tugs were delivered by UCSL before contractual delivery dates, and have been deployed by OSL at Paradeep Port and New Mangalore Port.These new 70 Tonne bollard pull tugs will have a length of 33 metre, Beam of 12.2 metre and draft of 4.2 metre, the statement said.They will be propelled by two main engines of 1838 kW, thrusters of 2.7 metre dia, diesel generators of 150 kW, forward towing winch, aft winch, deck crane (3T) and external fire fighting system (FIFI-1-2800 Cu metre per hr).These tugs, designed by Robert Allan Limited, world's leading design house for harbour tugs, will be built under the Indian Flag and classed with the Indian Register of Shipping (IRS).They will confirm to the ASTDS (Approved Standard Tug Design and Specifications), promulgated by the Government of India, in line with the Aatmanirbhar Bharat and Make in India initiatives.UCSL is the first shipyard to contract and construct tugs confirming to ASTDS, it said.UCSL had earlier signed contracts with Polestar Maritime Limited for construction of 2 ASD tugs of 70 T bollard pull.The first vessel has been handed over to the owners ahead of its contractual delivery date.This vessel, named 'Konna Star', has been put into operation at Deendayal Port, Kandla.The second vessel of the series is under construction at UCSL yard in Malpe, Karnataka. Polestar Maritime Limited has also placed a repeat order on UCSL for construction of one more 70 T bollard pull tug.UCSL has made great strides in a short span of time after a major revival since its takeover by CSL in Sep 2020. The Yard's order book also includes six numbers of 3800 Deadweight Dry Cargo Vessels for M/s Wilson ASA, Norway.\"We are extremely happy to be chosen again as the preferred partner by Ocean Sparkle Limited and Polestar Maritime Limited for construction of tugs for augmenting their fleet,\" said Madhu Nair, CMD, CSL, who is also the Chairman of UCSL.He said, \"Both CSL and our subsidiary UCSL are committed to delivering high quality tugs benchmarking construction cycle time with emphasis on sustainable solutions, to serve the evolving maritime ecosystem.\n       ",
    "Adani Group firms' shares surged on May 31 amid heightened trading activity, bucking the trajectory of the benchmark indices.At 1440 hours on May 31, shares of Adani Enterprises soared by more than 7 percent, while Adani Ports & SEZ saw a gain of 4 percent. Adani Total Gas surged by 10 percent, while Adani Power climbed to 13 percent and Adani Energy Solutions was trading nearly 3 percent higher. Adani Green Energy shares rose by 4.4 percent, while Adani Wilmar, Ambuja Cements, and ACC recorded gains 3.6 percent, 2 percent and 2 percent, respectively. NDTV's shares rose 9 percent.Meanwhile, India’s benchmark Sensex and Nifty indices were volatile ahead of the outcome of national elections. At 1435 hours, Sensex was trading 43 points lower while Nifty was down 8 points.All 10 Adani Group stocks surged on Friday, collectively gaining Rs 84,283 crore in market capitalization (mcap). This rise was attributed to general market optimism following the re-election of the incumbent Bharatiya Janata Party government for a third term.Recently, Snowcap Research warned that Adani Green Energy, part of Gautam Adani's conglomerate, risks missing growth targets without a share issue to bolster finances. With falling return targets and rising debt costs, Adani Green could struggle to fund its 2030 renewable energy goal, the researcher said.Snowcap estimated that Adani Green can only cover half its funding needs without additional capital and will likely deliver 11-12% returns instead of the 17% target announced in 2021. Adani Green refuted these claims as baseless and factually inaccurate. Adani Green's shares fell initially but recovered some losses.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Shares of Paytm hit 5 percent upper circuit for the second straight session on May 30. The stock has seen a sharp rally after a report said that billionaire Gautam Adani is considering buying a stake in Paytm's parent company One97 Communications.Paytm, however, issued a clarification later stating that the report was nothing but speculation.\"We hereby clarify that the abovementioned news item is speculative and the company is not engaged in any discussions in this regard. We have always made and will continue to make disclosures in compliance with our obligations under the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015,\" Paytm said in an official statement.Adani Group also clarified on the media report, saying, \"Categorically deny this baseless speculation, it is totally false and untrue\".Follow our market blog to catch all the live actionOn January 31, the RBI imposed business restrictions on the Paytm Payments Bank (PPBL) citing repeated violations of norms and non-compliance with multiple rules.The banking regulator barred PPBL from accepting fresh deposits and doing credit transactions after February 29. Paytm stock fell to a 52-week low of Rs 310 on May 9.Therefore, the speculation of a partnership with the Adani Group comes at an opportune moment for the beleaguered fintech major which reported weak number for the quarter ended March 2024.Paytm's net loss widened to Rs 550 crore in Q4FY24, a 3.2X jump compared to Q4FY23, as its margins took a hit post RBI’s crippling ban on PPBL. Its revenue from operations fell 2.9 percent YoY to Rs 2,267 crore.At present, founder Vijay Shekhar Sharma holds almost 19 percent stake in Paytm, which is valued at Rs 4,218 at previous session's closing price of Rs 342 . Sharma individually owns 9 percent of Paytm and indirectly owns 10 percent through the overseas company Resilient Asset Management.At 2:23 pm, Paytm shares were trading 5 percent higher at Rs 377.40 on the National Stock Exchange (NSE). Market cap of the fintech firm climbed to Rs 24,001 crore. YES Securities revised its price target on the stock to Rs 450 recently as it values Paytm at 2.8 times FY26 price to sales.Also Read | Paytm, Adani Group deny talks of any deal for stake buy; Paytm stock hits upper circuitDolat Capital expects Paytm stock to recover and rally to Rs 650. \"Paytm’s renewed focus on business growth & cost efficiency signals the right direction to revival.We believe the current market price does not factor a potential sharper recovery Q2 onwards and thus we maintain ‘Buy’ rating with discounted cash flow (DCF) based price target of Rs 650,\" the brokerage said.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "The board of Adani Enterprises , on May 28, approved a fundraising plan of Rs 16,600 crore, while the board of Adani Energy Solutions had approved a plan to raise up to Rs 12,500 crore on  May 27.The boards of the two Adani group companies - the flagship Adani Enterprises Ltd and its energy transmission and distribution business Adani Energy Solutions Ltd - had announced plans to collectively raise as much as Rs 29,100 crore ($3.5 billion) this week, stock exchange filings show.On May 26, Moneycontrol first reported that the two boards were planning to approve fundraising plans, collectively worth around $3.5-4 billion. The group plans to invest the proceeds in airports and new energy businesses, including green hydrogen, Moneycontrol reported.In its stock exchange filing, Adani Enterprises said that its board had approved issuance of securities for an aggregate amount not exceeding Rs 16,600 crore by way of qualified institutional placement (QIP) or other permissible mode in one or more tranches, subject to the approval of the shareholders at the company’s annual general meeting on June 24.Adani Energy Solutions' annual general meeting will be held on June 25, where shareholder approval will be sought for its fundraising plan.Adani group’s plan to raise funds through equity dilution comes at a time when Adani group stocks have shrugged off the impact of the Hindenburg Research report of January 2023 and reached the pre-Hindenburg levels.On May 24, Moneycontrol reported that six Adani Group stocks, including Adani Enterprises Ltd, Adani Green Energy Ltd and Adani Ports & SEZ, have erased the losses triggered by a critical Hindenburg report and are now trading above their January 2023 levels, when the report was published by the short-seller.Also Read: Six Adani group stocks trade at pre-Hindenburg report levelsThe other four stocks -- Adani Total Gas, Adani Energy Solutions, Adani Wilmer and NDTV -- still trade below pre-Hindenburg levels, Moneycontrol reported. Adani Total Gas is still down 74 percent from its pre-Hindenburg high, Adani Energy Solutions by 59 percent, Adani Wilmar 35 percent, and NDTV by 11 percent.The rally in Adani Group's stocks in the past two sessions has pushed the market value of the group stocks above $200 billion, as per the report.Year to date, Adani Ports and Special Economic Zone Ltd and Adani Power Ltd have been standout performers, gaining more than 40 percent and 35 percent, respectively.However, broadcaster New Delhi Television Ltd has been a laggard, losing 5.5 percent. Ambuja Cements and Adani Entertainment have also seen significant gains, rising 25 percent and 20 percent, respectively.Owing to the resurgence in Adani group stocks, Rajiv Jain’s GQG, which emerged as the white knight for the group following the short seller report, has seen its investment in Adani stocks grow 150% to $10 billion. ",
    "The Adani Group is looking to expand into e-commerce and payment services, business daily Financial Times reported on May 28, citing several people familiar with the development.The FT report said the Adani Group is looking to apply for a licence to run on the Unified Payments Interface (UPI), and is also in talks with banks to finalise plans of a co-branded Adani credit card.If approved, the group will enter India's digital payments landscape and compete with incumbents Google Pay and Walmart -backed PhonePe.Financial Times reached out to the Adani group and they declined to comment.The Adani Group is also reported to be in talks to offer online shopping through the e-commerce platform Open Network for Digital Commerce (ONDC), the FT report added.These plans are surfacing as the group looks to diversify into consumer-facing businesses by building a digital business to take on Reliance Industries and Google in this space. Adani Group so far does not have a significant presence in the consumer-facing businesses. The group had launched Adani One in late 2022, an app to offer travel services and hotel bookings.The FT report cited people familiar with the matter and reported that the e-commerce and payments foray aim to 'initially target existing users of its businesses'. A large number of people use Adani's gas and electricity services, or travel to airports that it operates. Financial Times cited people stating that users on Adani app could gather loyalty points for bill payment or duty-free purchase, and then redeem them for shopping online.The report also stated that Adani Group may add content from NDTV - the media entity it owns - to its app this year.Earlier, Moneycontrol had reported on the group's plans to raise funds to invest in new energy businesses.The Adani Group is in the process of recovering from a January 2023 report by U.S. short-seller Hindenburg that triggered a sell-off in group's listed shares. So far, four of the seven group companies have surpassed pre-Hinderburg report levels, including Adani Enterprises.\n       ",
    "The boards of two Adani group companies - flagship Adani Enterprises Ltd and its energy transmission and distribution business Adani Energy Solutions Ltd - will meet this week to approve a fundraising plan to the tune of $3.5-4 billion, collectively, sources told Moneycontrol.The board of Adani Energy Solutions will meet on Monday (May 27), while the board of Adani Enterprises is meeting on Tuesday (May 28).“Adani group is looking to approve fundraising plans to raise around $3.5-4 billion through a combination of equity and debt through various routes including a QIP (qualified institutional placement) offering,” said one of the sources.The group plans to raise funds to invest in its businesses such as airports and new energy including green hydrogen.An Adani group spokesperson could not be immediately reached for a comment.The plans to raise funds through a possible equity dilution comes at a time when Adani group stocks have shrugged off the impact of the Hindenburg Research report of January 2023 and reached the pre-Hindenburg levels.On May 24, Moneycontrol reported that six Adani Group stocks, including Adani Enterprises Ltd, Adani Green Energy Ltd and Adani Ports & SEZ, have erased the losses triggered by a critical Hindenburg report and are now trading above their January 2023 levels, when the report was published by the short-seller.The other four stocks Adani Total Gas, Adani Energy Solutions, Adani Wilmer and NDTV still trade below pre-Hindenburg levels, Moneycontrol reported. Adani Total Gas is still down 74 percent from its pre-Hindenburg high, Adani Energy Solutions is down 59 percent, Adani Wilmar 35 percent, and NDTV 11 percent down.The rally in Adani Group's stocks in the past two sessions has pushed the market value of group stocks above $200 billion, as per the Moneycontrol report. Year to date, Adani Ports and Special Economic Zone Ltd and Adani Power Ltd have been standout performers, gaining more than 40 percent and 35 percent, respectively. However, broadcaster New Delhi Television Ltd has been a laggard, losing 5.5 percent. Ambuja Cements and Adani Entertainment have also seen significant gains, rising 25 percent and 20 percent, respectively.Owing to the resurgence in Adani group stocks, Rajiv Jain’s GQG, which emerged as white knight for the group following the short seller report, has seen its investment in Adani stocks grow 150% to $10 billion\n       "
]