[
    "The new tax framework, introduced in the 2024-25 Union Budge, is designed to stabilise savings flows and is unlikely to be a significant deterrent for investors, Neelkanth Mishra, Chief Economist at Axis Bank told Moneycontrol. This is true even for FIIs who have an option to invest in other countries.\"If the country's returns are going to be attractive over the next three to five years, a 20-30 basis point or even a 50 basis point reduction in returns is not going to be a major deterrent,\" he said.Follow our live blog for all the market actionThe Union Budget for 2024-25 hiked the long-term capital gains (LTCG) tax on all financial and non-financial assets to 12.5 percent from 10 percent, while short-term capital gains (STCG) tax on some assets would be 20 percent.Although there was a temporary sell-off by Foreign Institutional Investors (FIIs) following the announcement, Mishra said that this will not have a lasting impact on market trends. \"We did see FII (Foreign Institutional Investors) selling yesterday (July 23), but frankly, I don't see this having a lasting effect.\"When asked about the rationale behind the adjustments to capital gains tax, Mishra said, \"I think the objective of this whole exercise was to reduce the distortion in savings or flow of savings caused by differentials in tax rates.\"Mishra said that previously, there was a complex mix of long-term and short-term capital gains taxes varying by asset class.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Private lender Axis Bank is expected to achieve double-digit growth in profit and net interest income (NII) for the April-June quarter (Q1FY25), driven by healthy loan growth. The company will release its Q1 results on July 24, 2024.According to the average estimate of eight brokerages, Mumbai-headquartered Axis Bank is projected to register a 13 percent year-on-year (YoY) profit growth at Rs 6,576 crore in Q1FY25 as against Rs 5,797 crore in Q1FY24. NII is also expected to rise by 12 percent YoY to Rs 13,361 crore in Q1FY25, compared to Rs 11,958 crore in the same period last year.What factors are driving the earnings?Strong loan, deposit growth: Axis Bank's loans, or advances, are expected to increase by 13.5 percent YoY to Rs 9.74 lakh crore in Q1FY25, while deposits are predicted to grow by 12.3 percent YoY to Rs 10.5 lakh crore, according to analysts at YES Securities.Improving asset quality: The lender's gross non-performing assets (NPA) are likely to decrease to 1.5 percent in the quarter ended June, down from 1.7 percent in the same period last year. Net NPA is also expected to improve to 0.3 percent in Q1FY25, from 0.4 percent a year ago, according to Motilal Oswal analysts.Margin contraction: Analysts at Phillip Capital anticipate a 6 basis points (bps) YoY contraction in Axis Bank's margins to 4.04 percent in Q1FY25, down from 4.1 percent in Q1FY24 due to rising funding costs.What to look out for in the quarterly show?Market participants will keenly watch out for Axis Bank's margin outlook, slippages in unsecured segment, deposit mobilisation, and asset quality trends for the rest of the fiscal year.So far this year, the stock of this private lender surged over 14 percent, outpacing benchmark Nifty 50's 12 percent rise.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Fintech firm One 97 Communications, which owns the brand Paytm, has partnered with Axis Bank to provide point of sales solutions and card payment machines to banks and its merchant network, the company said on Tuesday.Paytm's EDC devices (card machines) come equipped with an integrated software that offers complete store management services, including inventory management, invoice generation, promotions and discounts, sales tracking and reporting, CRM, etc, the company said in a regulatory filing.\"By integrating our POS solutions and EDC devices (card machines) with Axis Bank's expansive merchant network, we are enhancing transaction efficiency and providing comprehensive store management services. This partnership extends our reach and strengthens customer engagement and satisfaction, ultimately supporting merchants in growing their businesses,\" Paytm spokesperson said.Through this partnership, Paytm expects its technology to reach a wider merchant base via Axis Bank, thereby enhancing the capabilities of both entities.For Axis Bank, this collaboration strengthens their merchant acquiring portfolio, enabling them to offer payment solutions, the filing said.\"We are happy to support Paytm in the EDC business. This partnership enables us to extend our relevant business offerings to a larger base of merchants and this is an exciting milestone to build upon,\" Sanjeev Moghe, President & Head, Cards & Payments, Axis Bank, said.\n       ",
    "Though still inordinately high, top private sector lenders Axis Bank and Kotak Mahindra Bank saw a drop-off in the number of employees leaving in 2023-24, an analysis of the banks' annual reports showed. Data from Axis Bank’s annual report showed that the bank reported a total attrition rate of 28.8 percent in FY24 compared to 34.8 percent in FY23. Kotak Mahindra Bank saw an attrition rate of 39.6 percent in FY24 versus 45.9 percent in FY23.Overall, the banks continued to record their highest attrition rate at the junior level but on a year-on-year basis, they reported a fall in the number. For Axis Bank, employees in the 21-30 age group constituted the largest segment of those quitting, with a 25 percent attrition rate. However, this was lower than the 35 percent recorded last year. Kotak Mahindra Bank saw an attrition rate of 43 percent among its junior level employees, an improvement over last year's 58 percent.“Higher attrition was observed primarily in field sales personnel and contact centers,” Kotak Mahindra Bank said in its annual report.The top private banks saw an average attrition rate of 35-40 percent in the last financial year. In a bid to retail talent, many plan to introduce training and other benefit programmes.For instance, Kotak Mahindra Bank said that it has launched a raft of measures to provide growth opportunities to its employees. “In an effort to improve the Bank’s attrition rate and enhance engagement, multiple initiatives have been introduced and strengthened throughout the year to address three major areas: Career Growth, Salaries and Benefits, and Manager/Management Style,” the bank said in its annual report.Industry experts said that high employee turnover in banks, especially at the junior level, is the reality with most leaving for fintech companies.Though the attrition rate has eased, industry experts said it would be difficult to maintain it at these levels. The human resources head of a bank, who did not wish to be named, highlighted that the industry has been evolving from the jobs perspective. “Largely, employees look for a change in their role every one year or so and we have seen that sustaining employees at the junior level is tough as they move to different opportunities,” the HR head said.In November 2023, Reserve Bank of India (RBI) governor Shaktikanta Das expressed concerns over high attrition rates in certain private sector banks and emphasised the need for dedicated core teams to tackle this issue. Speaking at the annual BFSI Insight Summit of CNBC TV-18, Das highlighted changing career perspectives among the younger generation.\n       ",
    "Prabhudas Lilladher has come out with its first quarter (April - June’ 25) earnings estimates for the Banking sector. The brokerage house expects Axis Bank to report net profitat Rs. 6,644.1 crore up 14.6% year-on-year (down 6.8% quarter-on-quarter).Net Interest Income (NII) is expected to increase by 10.7 percent Y-o-Y (up 1.1 percent Q-o-Q) to Rs. 13,235.2 crore, according to Prabhudas Lilladher.Pre Provision Operating Profit (PPOP) is likely to rise by 14.1% Y-o-Y (down 4.6 percent Q-o-Q) to Rs. 10,055.9 crore.Disclaimer: The views and investment tips expressed by investment experts on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Prabhudas_Banking ",
    "",
    "Axis Bank stock saw a large trade with 0.55 percent equity stake in the private lender being sold for Rs 2,088.2 crore on June 21, reported CNBC-TV18. As many as 1.7 crore shares changed hands at Rs 1,226 per share. The details of buyers and sellers were not immediately known.Axis Bank stock was down about half a percent, in line with the fall in the banking index, and was trading at Rs 1,232.5 in the afternoon trade. Axis Bank share price has risen over 27 percent in the last one year, narrowly outperforming Nifty's 25 percent gains.In April this year, private equity firm Bain Capital exited Axis Bank shareholding by selling its remaining 1 percent stake for Rs 3,574 crore. The PE major had invested Rs 6,854 crore in Axis Bank back in November 2017.Earlier this week, Axis Bank hiked shareholding in Max Life to 19.99 percent from 19.02 percent by acquiring additional stake in the insurer for Rs 336 crore.Axis Bank and its two subsidiaries – Axis Capital Ltd and Axis Securities Ltd – were allowed to collectively own about 20 per cent in Max Life Insurance by the Insurance Regulatory and Development Authority of India (IRDAI). The stake was acquired as part of a deal closed in 2021 between Axis Bank and Max Life Insurance.Axis Bank is also in the middle of migrating Citibank credit cards to its own platform, which is expected to be completed by 15 July. The transition follows Axis Bank's acquisition of Citibank India's consumer business and its non-banking finance arm in March 2023 for Rs 11,603 crore.\n       ",
    "Axis Bank is communicating to Citibank cardholders about certain services getting disrupted in the coming days because of the migration of accounts. The migration of all Citi relationships— including card(s) from Citi to Axis Bank— will be completed by July 15, 2024.“The Citi-branded card(s) will continue to work seamlessly till you receive your new Axis Bank card(s) within a few months after the migration,” Sanjeev Moghe, President and Head, Cards and Payments, Axis Bank, told Moneycontrol.Let’s decode",
    "The benchmark indices closed mixed, with the Nifty 50 falling by 0.2 percent on June 19 after rising for five consecutive days. About 1,432 shares declined, and 890 shares advanced on the NSE. The index is expected to consolidate in the coming days, with support at 23,400 and resistance at 23,700. Here are some trading ideas for the near term:Jigar S Patel, Senior Manager - Equity Research at Angel OneUnited Spirits | CMP: Rs 1,272.85After peaking near the Rs 1,335 mark on June 11, United Spirits experienced a significant downturn, declining by around 7-8 percent. However, this week, United Spirits has shown resilience by avoiding further declines and reversing around the middle Bollinger Band, which coincides with the upper band of its previous breakout zone (now a support zone). Notably, in the previous trading session, there was significant buying activity at lower price levels, indicating strong investor interest in the stock at these levels. From a technical perspective, the weekly Stochastics indicator has formed a bullish cross, suggesting a potential shift in momentum and presenting an attractive buying opportunity. As a result, traders are advised to consider purchasing United Spirits within the range of Rs 1,255-1,270, with a target of Rs 1,350 and a stop-loss at Rs 1,218.Strategy: BuyTarget: Rs 1,350Stop-Loss: Rs 1,218Radico Khaitan | CMP: Rs 1,772.65After a period of consolidation within the approximate range of Rs 1,740-1,680, Radico Khaitan has successfully broken out and is sustaining above this range, indicating a strong upward movement. From an indicator perspective, the daily Stochastics has reversed from the 70 levels, which is a positive sign for potential gains. Based on this analysis, we recommend that traders and investors consider taking a long position in the range of Rs 1,765-1,780. The target is at Rs 1,875, with a stop-loss at Rs 1,720.Strategy: BuyTarget: Rs 1,875Stop-Loss: Rs 1,720IndusInd Bank | CMP: Rs 1,528.2For a couple of weeks, IndusInd Bank has maintained its support of Rs 1,500, which aligns with the weekly middle Bollinger Band. In the previous trading session, it took out its previous week's high of Rs 1,515, which looks lucrative. From an indicator perspective, the daily RSI (Relative Strength Index) has reversed near the 50 levels, which is a positive sign for potential gains. Based on this analysis, we recommend that traders and investors consider taking a long position in the range of Rs 1,525-1,530. The target is at Rs 1,640, with a stop-loss at Rs 1,480.Strategy: BuyTarget: Rs 1,640Stop-Loss: Rs 1,480Rupak De, Senior Technical Analyst, LKP SecuritiesAxis Bank | CMP: Rs 1,226.65Following a consolidation breakout, Axis Bank has moved up, registering its highest-ever closing. In the recent upward move, the price has mostly stayed above the critical 21-day exponential moving average (EMA). On the higher end, it might move towards Rs 1,330, while support is placed at Rs 1,174.Strategy: BuyTarget: Rs 1,330Stop-Loss: Rs 1,174IDFC First Bank | CMP: Rs 82.17IDFC First Bank has broken out of consolidation on the daily chart and is currently trading above its 21-day EMA, indicating strong upward momentum. Additionally, the RSI shows a bullish crossover, further supporting a positive outlook. Investors can consider buying the stock with a stop-loss set at Rs 78 and targets of Rs 86 and Rs 88.Strategy: BuyTarget: Rs 86, Rs 88Stop-Loss: Rs 78Vidnyan Sawant, Head of Research at GEPL CapitalIndus Towers | CMP: Rs 334Indus Towers has been in an upward trend since mid-2023, consistently maintaining higher tops and higher bottoms. Recently, the stock has exhibited a change in polarity, with the prior swing high of year 2021 acting as a support level, coinciding with the 20-week EMA, forming a strong base. On the daily scale, the stock has found support near the 50-day EMA and witnessed a block deal, which has attracted investors. The price stability near this mean indicates bullish sentiment.Furthermore, the ratio chart of Indus Towers against the Nifty showcased a breakout of the sloping trendline in January 2024, indicating strength development and readiness to demonstrate outperformance. Looking ahead, there is a potential upside for the stock, with a target of Rs 407. It's advisable to set a stop-loss at Rs 307 on a closing basis to manage risks effectively.Strategy: BuyTarget: Rs 407Stop-Loss: Rs 307Rashtriya Chemicals and Fertilisers | CMP: Rs 185.22On a monthly scale, RCF has been consistently sustaining above its 2008 swing high, forming higher tops and higher bottoms since 2020, which denotes a bullish trend. On the weekly scale, the stock has been moving within a rising channel since March 2021. Recently, it has reversed from the 50-week average, indicating a bullish mean reversion.On the daily scale, the stock has witnessed a bullish gap-up opening with significant volume, suggesting a continuation of its upward trajectory. Furthermore, the ratio chart of RCF against the Nifty has been forming higher tops and higher bottoms, indicating sustained outperformance. Looking ahead, there is potential upside for the stock with a target of Rs 223. To manage risks effectively, it's advisable to set a stop-loss at Rs 170 on a closing basis.Strategy: BuyTarget: Rs 223Stop-Loss: Rs 170Godfrey Phillips India | CMP: Rs 4,187.7Godfrey Phillips has shown a robust price structure, consistently forming higher tops and bottoms since September 2022. Momentum significantly increased after breaking out of a multi-year consolidation that began in 2015, accompanied by increased volumes. The stock remains well-sustained above key averages, such as the 12-EMA and 26-EMA, indicating a positive trend.The RSI study shows readings above 60, suggesting sustained momentum and reinforcing the bullish outlook for the stock. Additionally, the ratio chart of Godfrey Phillips against the Nifty has been forming higher tops and higher bottoms. It is currently witnessing a breakout of the multi-year swing high from 2015, indicating strong and continued outperformance going forward. Looking ahead, there is a potential upside for the stock, with a target of Rs 5,318. It's advisable to set a stop-loss at Rs 3,915 on a closing basis to manage risks effectively.Strategy: BuyTarget: Rs 5,318Stop-Loss: Rs 3,915Zomato | CMP: Rs 198.49Zomato has demonstrated robust momentum since January 2023, showcasing a clear uptrend and nearing its all-time high levels. Notably, the stock has experienced a change in polarity, with the prior swing high of year 2021 acting as support in recent weeks. The current week is also showing signs of resuming bullish momentum. Currently, Zomato is trading above key moving averages, such as the 12-week EMA and 26-week EMA, indicating a positive trend.Additionally, the stochastic study waving higher denotes momentum in line with the trend. Furthermore, the ratio chart of Zomato against the Nifty has been forming higher bottoms, indicating sustained outperformance. Looking ahead, there is a potential upside for the stock, with a target of Rs 237. It's advisable to set a stop-loss at Rs 182 on a closing basis to manage risks effectively.Strategy: BuyTarget: Rs 237Stop-Loss: Rs 182Shitij Gandhi, Senior Research Analyst (Technicals) at SMC Global SecuritiesDeepak Fertilizers and Petrochemicals Corporation | CMP: Rs 645.5After reaching its 52-week low of Rs 450 in March 2024, Deepak Fertilizers has experienced a steady recovery. Recently, it has gained fresh bullish momentum and is moving above its 200-day exponential moving average on the daily charts. The stock is now trading within a rising channel, characterized by the formation of higher lows. Last week, we observed a fresh breakout above the long-term bearish channel as well, indicating a significant bullish reversal from hereon. Therefore, one can buy/hold/accumulate the stock for the expected upside of Rs 745-750 levels with downside support zone of Rs 625-620 levels.Strategy: BuyTarget: Rs 745, Rs 750Stop-Loss: Rs 580Sunteck Realty | CMP: Rs 598.7For the past 6 to 7 months, Sunteck Realty has been consolidating within a broader range of Rs 380-520 and consistently holding well above its 200-day exponential moving average on the daily charts. Last week, the stock exhibited fresh momentum with a breakout from the prolonged consolidation, accompanied by a sudden spike in volumes. This price-volume action following the consolidation breakout indicates a potential upswing in prices. Therefore, one can buy/hold/accumulate the stock for the expected upside of Rs 745-750 levels with downside support zone of Rs 575-580 levels.Strategy: BuyTarget: Rs 745, Rs 750Stop-Loss: Rs 500Rico Auto Industries | CMP: Rs 144.2Rico Auto hit its 52-week high of Rs 157 in April 2024 but subsequently experienced a pullback due to profit-taking. Nevertheless, it has managed to find support at its 200-day exponential moving average on the daily chart and bounced sharply thereon, indicating potential signs of reversal from lower levels. The bullish momentum has been confirmed technically, as the stock recently gained fresh momentum by breaking above the descending channel on the short-term charts. Therefore, one can buy/hold/accumulate the stock for the expected upside of Rs 185-188 levels with downside support zone of Rs 135-140 levels.Strategy: BuyTarget: Rs 185, Rs 188Stop-Loss: Rs 120Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Axis Bank on Wednesday increased its holding in Max Life to 19.99 per cent for Rs 336 crore.The acquisitions, divestments and merger Committee of the board of directors of the bank at its meeting held on June 19, 2024, has approved a proposal for acquisition of additional equity shares of Max Life by the bank for an amount of up to Rs 336 crore, Axis Bank said in a regulatory filing.With this, the aggregate shareholding of Axis Entities increased from 19.02 per cent to 19.99 per cent, it said.The transaction is subject to receipt of all requisite regulatory approvals, as may be applicable, it said.Axis Bank and its two subsidiaries – Axis Capital Ltd and Axis Securities Ltd – were allowed to collectively own about 20 per cent in Max Life Insurance by the Insurance Regulatory and Development Authority of India (IRDAI).The stake was acquired as part of a deal closed in 2021 between Axis Bank and Max Life Insurance.Last year, Axis Bank entered into a revised agreement with Max Financial Services to acquire an additional 7 per cent stake in Max Life Insurance at fair market value using discounted cash flow method.The revision in agreement follows the guidance issued by the IRDAI in October 2022. \n       ",
    "Private sector lender Axis Bank on June 18 said that it is probing a possible hack into its official support handle on social media platform X.“We are currently investigating a possible hack of our support handle @AxisBankSupport. We are taking steps to resolve the issue at the earliest. Please ignore the following post and do not click on any unverified links,” the bank’s official handle tweeted on June 18.In the late hours of June 17, Axis Bank’s support handle was hacked by miscreants and started tweeting and posting news related to billionaire Elon Musk’s Tesla.The bank in a tweet also said that the bank does not ask for personal details. “Axis Bank does not ask for personal security details related to your Internet banking or phone banking passwords, OTP, PIN on email, phone or otherwise. We apologize for any inconvenience caused. We thank you for your understanding and support,” the bank said.\n       ",
    "The resignation of Axis Bank's Group Executive and Head of Retail Lending, Sumit Bali, comes just two months after top retail division executive Ravi Narayan stepped down in March. In light of this recent churn, analysts at Nomura remain cautious about the potential impact on the bank's medium-term outlook.\"We continue to monitor the changes in top management, especially in light of the recent churn in the retail banking division. Any impact on Axis’ medium-term growth outlook will also be a key to watch,\" Nomura said in a recent note, maintaining a 'buy' rating, with a target price of Rs 1,250 per share.The brokerage firm built a 14 percent loan CAGR and a 15 percent deposit CAGR for Axis Bank over FY24-26F.ALSO READ: Axis Bank's retail lending group executive Sumit Bali quits, rejig in senior managementIn March, Ravi Narayan, Group Executive and Head of Retail Liabilities, resigned, with Munish Sharda taking over his responsibilities. During Narayan and Bali's tenure in the retail banking division, other key executives included Arjun Chowdhry and Munish Sharda.Chowdhry, previously Country Head of Consumer Banking at Citibank India, joined Axis Bank following its acquisition of Citibank's Indian consumer banking business in March 2023. Sharda joined Axis in September 2021 from Future Generali India Life Insurance, where he was MD & CEO.Narayan and Bali joined the bank in 2019 and 2020, respectively, shortly after Amitabh Chaudhry became MD & CEO in January 2019.The bank also announced that Chief Compliance Officer Bimal Bhattacharyya will transition to a new role effective June 2024. He will be replaced by Anuranjan Kumar, currently Head of Operational Health and Control, who joined Axis Bank through the Citibank India acquisition.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Axis Bank’s group executive of retail lending Sumit Bali has stepped down from his position after a stint of four years, the private lender informed the stock exchanges on June 13.Bali, in his resignation letter dated June 12 said, “the time is right to embark on a new phase of career outside the bank.\" He had taken charge of the retail assets at the peak of the first Covid wave in 2020.Bali’s last working day at the bank will be August 16, 2024.Additionally, Anuranjan Kumar, head-operational health & control was appointed as the chief compliance officer at Axis Bank. Kumar is a senior banker with over three decades of experience. Before joining Axis Bank, Kumar worked with several domestic and global banks, including Citibank's India, Singapore and Bangladesh units in various capacities.Kumar will assume charge of his new role from June 14 for a period of three years, the bank said.The lender also said Bimal Bhattacharyya, who is the current chief compliance officer, will taking up another role within the bank.The lender in its Q4FY24  reported a net profit of Rs 7,130 crore as against a loss of Rs 5,762 crore in the year-ago period, after it bought Citi Bank's India consumer division.The private sector lender's net interest income (NII), the difference between the interest income it earned from lending activities and the interest paid to depositors, came in at Rs 13,089 crore, up 11.47 percent from the previous year's Rs 11,742 crore.The gross non-performing asset (NPA) stood at 1.43 percent, down from 2.02 percent from the year-ago period. Net NPAs were at 0.31 percent compared to 0.39 percent.\n       ",
    "Banking stocks were on a roll on June 3 as Bank of Baroda, SBI, PNB, Axis Bank, ICICI Bank, Kotak Bank, among others soared up to 12 percent. Bank Nifty, too, crossed 50,000 for the first-time ever, thanks to optimism surrounding Street over comfortable victory for NDA in 2024 elections.Several banking majors such as BoB, SBI, Axis Bank, ICICI Bank, Indian Bank, and Canara Bank also hit fresh 52-week highs on June 3. So far this year, these stocks have surged in the range of 10-46 percent, as against 5 percent climb in the Bank Nifty index.Catch all the market action on our LIVE blogAnalysts believe that the ruling government's reclaim to power in 2024 general election would imply policy continuity, sustained focus on capex, and fiscal consolidation. \"We remain overweight on financials such as SBI, BoB, ICICI Bank, LIC Housing Finance, Shriram Finance, HDFC AMC, ICICI Prudential, ICICI Lombard,\" said Morgan Stanley.Jefferies also remains positive on private financials such as HDFC Bank, IndusInd Bank, and Kotak Mahindra Bank, citing inexpensive valuations.ALSO READ: Kotak Bank's credit profile to improve over next 12 months: S&PEarlier, credit ratings agency S&P Global Ratings had revised its rating outlook on 6 Indian banks, including SBI and HDFC Bank to 'positive' from 'stable' amid good economic growth momentum. Other like Axis Bank, ICICI Bank, Kotak Mahindra Bank, and Indian Bank were also included.From a technical perspective, Santosh Meena, head of research at Swastika Investmart said that the Bank Nifty's break above 50,000 could propel it towards 51,000 and 52,000 levels. However, on the downside, if it slips below 48,000-mark, the next support levels would be 47,000 and 46,200.On an average, exit polls accorded 370 seats for NDA, with BJP set to win over 325 seats versus 303 seats in 2019. Street also anticipates BJP to inch closer to 40 percent vote share on its own compared to 37.3 percent in 2019, while NDA is expected to touch 47 percent vote share, as against 45 percent in 2019.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "The market continued its higher highs formation for the 11th straight session and reached a fresh record high above 23,100, but the bears pulled the Nifty 50 down below the 23,000 mark on a closing basis on May 27. The BSE Sensex and Nifty 50 closed moderately lower, forming a bearish candlestick pattern on the daily charts. Meanwhile, the market breadth was negative for another session as approximately 1,420 equity shares declined against 877 shares advancing on the NSE. The index is likely to be rangebound with resistance at 23,100-23,200 and support at 22,800 in the coming sessions, while volatility is expected to be elevated ahead of the Lok Sabha election results. Here are some trading ideas for the near term:Pravesh Gour, Senior Technical Analyst at Swastika InvestmartPrudent Corporate Advisory Services | CMP: Rs 1,730Prudent Corporate Advisory has broken out of a long consolidation period on the weekly chart. A breakout from this consolidation suggests a potential shift in market sentiment and an increased likelihood of a sustained move in the price. On the daily chart, the counter has experienced a V-shaped recovery from the last breakout level at Rs 1,500, and starts a new leg of the rally towards Rs 1,800.The overall structure of the counter is very lucrative, as it is trading above all its important moving averages. The momentum indicator RSI (relative strength index) is also positively poised, whereas MACD (moving average convergence divergence) is supporting the current strength.On the upside, Rs 1,800 is an important psychological level; above this, we can expect a move towards Rs 1,900+. On the downside, a cluster of moving averages around Rs 1,580 is a strong demand zone during any correction.Strategy: BuyTarget: Rs 1,944Stop-Loss: Rs 1,580Hindustan Petroleum Corporation | CMP: Rs 557HPCL appears to be emerging from a prolonged consolidation phase, marked by robust trading volumes and a breakout from a triangle pattern. Analysing its daily chart reveals a classical structure. The pattern indicates a primary target of Rs 580, with potential for further gains towards Rs 620.For downside protection, Rs 510 serves as an immediate support level. The MACD indicator reinforces the current bullish momentum, complemented by a positive positioning of the RSI indicator.Strategy : BuyTarget: Rs 624Stop-Loss: Rs 510Gravita India | CMP: Rs 1,139Gravita India has witnessed a breakout of a long trendline with strong volume and closed above Rs 1,100 levels. A cluster of moving averages formed a base at Rs 900 levels, making the counter lucrative on a long-term basis.On the higher side, Rs 1,200 acts as a susceptible level; above this, we can expect a long move towards Rs 1,280+ in the shorter to longer timeframe, while on the lower side, Rs 1,050 serves as an important support during any correction.Strategy: BuyTarget: Rs 1,284Stop-Loss: Rs 1,050Exide Industries | CMP: Rs 494On the daily chart, Exide has witnessed a breakout of a long consolidation formation with huge volume, while on the weekly chart, it has broken a Flag formation pattern. The counter has a classic structure because it is trading above all of its significant moving averages.On the upper side, Rs 500 is an immediate resistance; above this, we can expect a big move till Rs 540+ in the shorter time frame, while on the downside, Rs 460 is the demand zone for any correction. The momentum indicator RSI is also positively poised, whereas MACD is supporting the current strength.Strategy: BuyTarget: Rs 544Stop-Loss: Rs 460Jay Thakkar, Vice President & Head of Derivatives and Quant ResearchReliance Industries | CMP: Rs 2,932.5Reliance Industries seems to have completed a three-wave corrective fall in a downward sloping parallel channel. The stock has taken good support at the lower end of the channel and has started to form higher tops and higher bottoms. The momentum indicator has also reversed and provided a bullish crossover on the daily charts, thus indicating a short-term uptrend and higher probability of an upward breakout from the falling channel.In the event of an upward breakout, Reliance is likely to inch towards Rs 3,100 levels, whereas on the lower side, Rs 2,870 is now an immediate support. The stock has seen good short covering since mid-April; however, the long additions may come only once there is a strong breakout from the falling channel.Strategy: BuyTarget: Rs 3,100Stop-Loss: Rs 2,870UltraTech Cement | CMP: Rs 10,225.5UltraTech has provided a breakout from the falling channel and has provided a convincing close above the same. The momentum indicator MACD has also turned bullish and shown positive divergence, which is bullish in the short to medium term. On the upside, the stock is likely to surpass its all-time high levels and inch towards Rs 10,750 to Rs 11,000 levels.On the lower side, it has strong support at Rs 9,950 levels. The stock has witnessed good short covering from the lower end of the falling channel, and with this breakout, it has seen some long additions as well. Hence, until Rs 9,950 levels are not broken, the overall short to medium-term outlook remains positive on UltraTech Cement.Strategy: BuyTarget: Rs 10,750, 11,000Stop-Loss: Rs 9,950Axis Bank | CMP: Rs 1,187Axis Bank has once again formed a lifetime high, clearly indicating that the overall trend is bullish. The momentum indicator MACD has again come back into the buy mode, whereas it is already in the buy mode on the weekly chart. The stock is inching towards Rs 1,240/1,280 levels from here on. On the lower side, it has crucial support near Rs 1,140 levels, and till those levels are held, the overall trend remains bullish. After short covering in the April series, the stock has seen good long buildup in the May series.Strategy: BuyTarget: Rs 1,240, 1,280Stop-Loss: Rs 1,140Ashish Kyal, CMT, Founder / CEO of Waves Strategy AdvisorsJBM Auto | CMP: Rs 2,117JBM Auto has been moving higher and is intact in a strong uptrend. In the previous session, it closed with a massive gain of 7.67 percent. On the daily chart, in the previous session, prices formed a bullish candle. The price was moving in a rectangular range over the last few days, indicating accumulation in the stock. It has now closed above this trading range, resulting in a bullish breakout of the rectangular pattern.KST (know sure thing) has turned above the signal line and is also trading above the zero line, which is a positive sign. We can expect good momentum to continue in this stock. Support is placed at Rs 2,000.In short, the trend for this stock is positive. Use dips towards Rs 2,080-2,100 as a buying opportunity for a move towards Rs 2,370-2,400 levels as long as Rs 2,000 holds on the downside.Strategy: BuyTarget: Rs 2,370, 2,400Stop-Loss: Rs 2,000Automotive Stampings and Assemblies | CMP: Rs 896.55Automotive Stampings formed a large bullish candle in the previous session with a surge in volume. It closed the previous session on a positive note with a huge gain of 9.60 percent. On the chart, we can see that the prices have been consolidating between a range of Rs 802-920. Resistance as per this is near Rs 920 levels.Additionally, prices closed near the upper band of the Bollinger Bands. A sustainable close above the upper band will resume an uptrend. In short, the trend is positive. Any break above Rs 920 can lift prices higher towards Rs 1,030. On the downside, support is placed at Rs 865 levels.Strategy: BuyTarget: Rs 1,030Stop-Loss: Rs 865Paras Defence and Space Technologies | CMP: Rs 894.7Paras Defence has been moving higher recently and is intact in a strong uptrend. In the previous session, it closed with a gain of 4.14 percent. On the daily chart, prices formed a bullish candle in the previous session. Recently, prices have broken out of the consolidation range with huge volumes. We have shown the ADX (average directional index) indicator, which gives an indication if the stock is trending or in a trading range. The ADX of this stock is 25.18, indicating a trending market. Closest support is placed at Rs 840.In short, the trend for this stock is positive. Use dips towards Rs 880 as a buying opportunity for a move towards Rs 980 levels as long as Rs 840 holds on the downside.Strategy: BuyTarget: Rs 980Stop-Loss: Rs 840Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Disclosure: Moneycontrol is a part of the Network18 group. Network18 is controlled by Independent Media Trust, of which Reliance Industries is the sole beneficiary. ",
    "The market reported an intraday all-time high with the Nifty 50 surpassing the 23,000 mark for the first time but failed to sustain above it at close on May 24. The benchmark indices, the BSE Sensex and Nifty 50, closed flat with a negative bias, though they clocked 2 percent gains for the week, forming a strong bullish candlestick pattern on the weekly charts. However, market breadth remained in favour of the bears as approximately 1,374 equity shares declined against 884 shares advancing on the NSE. The 23,000 level is expected to play a key role in the Nifty's further direction, and sustaining this level can take the index towards the upper band of the Rising Channel (i.e., 23,100-23,200), followed by 23,500, with support at 22,800. Here are some trading ideas for the near term:Vinay Rajani, CMT, Senior Technical/Derivative Analyst at HDFC SecuritiesUltraTech Cement | CMP: Rs 10,231UltraTech has broken out from the downward sloping channel on the weekly charts. The price breakout is accompanied by a jump in volumes. Cement stocks have regained momentum, which is expected to continue. The stock is placed above all important moving averages, indicating a bullish trend across all time frames. Indicators and oscillators are showing strength in the current uptrend.Strategy: BuyTarget: Rs 11,000Stop-Loss: Rs 9,762Central Depository Services | CMP: Rs 2,145.55CDSL has been consolidating in a range for the last 5 weeks. The primary trend of the stock is bullish as it has been forming higher tops and higher bottoms on the weekly chart. It is placed above all important moving averages, indicating a bullish trend across all time frames.Strategy: BuyTarget: Rs 2,320Stop-Loss: Rs 2,000Axis Bank | CMP: Rs 1,174Axis Bank registered a running correction and now seems to have resumed its uptrend. The stock has taken support near its previous swing high on the daily chart. The primary trend of the stock has been bullish with higher tops and higher bottoms. It is placed above all important moving averages, indicating a bullish trend across all time frames.Strategy: BuyTarget: Rs 1,260Stop-Loss: Rs 1,117Rajesh Palviya, Senior Vice President Research (Head Technical Derivatives) at Axis SecuritiesAshok Leyland | CMP: Rs 210.70Ashok Leyland is in a strong uptrend across all time frames, forming a series of higher tops and bottoms, indicating a positive bias. It has registered an all-time high at Rs 219, indicating bullish sentiments. It is well placed above its 20, 50, 100, and 200-day SMAs (simple moving averages), and these averages are also inching up along with the price rise, reaffirming the bullish trend.The daily, weekly, and monthly strength indicators (RSI) are in positive terrain, which justifies the rising strength across all time frames. The weekly \"Bollinger Band\" buy signal shows increased momentum. Investors should buy, hold, and accumulate this stock with an expected upside of Rs 230-245, with a downside support zone of Rs 204-200 levels.Strategy: BuyTarget: Rs 230, 245Stop-Loss: Rs 204, 200ISGEC Heavy Engineering | CMP: Rs 1,188On the daily chart, ISGEC has confirmed a \"Cup & Handle\" formation breakout at Rs 1,150 levels on a closing basis. This breakout is accompanied by huge volumes, showing increased participation. The stock is well placed above its 20, 50, 100, and 200-day SMAs, and these averages are also inching up along with the price rise, reaffirming the bullish trend.The daily, weekly, and monthly strength indicators (RSI) are in positive terrain, which justifies the rising strength across all time frames. Investors should buy, hold, and accumulate this stock with an expected upside of Rs 1,285-1,380, with a downside support zone of Rs 1,100-1,050 levels.Strategy: BuyTarget: Rs 1,285, 1,380Stop-Loss: Rs 1,100, 1,050Bharat Electronics | CMP: Rs 297Bharat Electronics is in a strong uptrend across all time frames, forming a series of higher tops and bottoms, indicating a positive bias. It has registered an all-time high at Rs 299, indicating bullish sentiments. The stock is well placed above its 20, 50, 100, and 200-day SMAs, and these averages are also inching up along with the price rise, reaffirming the bullish trend.The daily, weekly, and monthly strength indicators (RSI) are in positive terrain, which justifies the rising strength across all time frames. The weekly \"Bollinger Band\" buy signal shows increased momentum. The huge rising volumes over the past three weeks signify increased participation in the rally. Investors should buy, hold, and accumulate this stock with an expected upside of Rs 313-345, with a downside support zone of Rs 280-265 levels.Strategy: BuyTarget: Rs 313, 345Stop-Loss: Rs 280, 265Rajesh Bhosale, Technical Analyst at Angel OneMetropolis Healthcare | CMP: Rs 1,970.75For the past two years, Metropolis prices have been consolidating within a range of Rs 1,200 to 1,900, forming a base. In the week ending May 24, prices finally broke out above this range, confirming a bullish \"Rounding Bottom\" reversal pattern. This upward movement has been supported by strong volumes, and on the daily chart, prices are comfortably trading in a \"higher top higher bottom\" formation, indicating that every dip is being bought.Additionally, prices are well above key averages, and oscillators are positively aligned, supporting a buy recommendation. Considering all the above factors, we have a strong bullish view on this counter. Hence, we recommend buying Metropolis around Rs 1,970 - 1,960, with a stop-loss at Rs 1,820 and a target of Rs 2,220 - 2,250.Strategy: BuyTarget: Rs 2,220, 2,250Stop-Loss: Rs 1,820Rashtriya Chemicals and Fertilisers | CMP: Rs 157Rashtriya Chemicals has achieved a significant bullish breakout by closing above the key resistance level of Rs 155, which has held for the past three months. By surpassing this hurdle, the prices have confirmed both an 'Inverse Head and Shoulders' and an 'Ascending Triangle' breakout on the daily chart. This breakout is supported by a surge in volumes and a large bullish candle.Prices have established a strong base on the 200 SMA and have now moved above the Super Trend indicator, indicating strong momentum in the near term. Given the buzz in this space, we expect this stock to take the lead. Hence, we recommend buying RCF around Rs 156 - 153, with a stop-loss at Rs 145 and a target of Rs 173.Strategy: BuyTarget: Rs 173Stop-Loss: Rs 145IRB Infrastructure Developers | CMP: Rs 72.55After reaching new highs around Rs 72 in February, IRB Infrastructure prices entered a correction phase where any rally towards Rs 72 was met with selling pressure. Now, after three months, this range has been broken with prices closing above this hurdle, confirming a continuation 'Cup and Handle' pattern breakout. The prices are now in uncharted territory, indicating strong bullish sentiment.Additionally, the volume activity has increased, and momentum, after a recent cooldown, is once again pointing upward, supporting the bullish outlook. Known for its momentum moves, we expect strong trending activity in this stock in the near term based on these formations. Hence, we recommend buying IRB around Rs 72 - 70, with a stop-loss at Rs 65.8 and a target of Rs 80.Strategy: BuyTarget: Rs 80Stop-Loss: Rs 65.8Jigar S Patel, Senior Manager - Equity Research at Anand RathiSumitomo Chemical India | CMP: Rs 440Sumitomo Chemical India has recently faced a significant decline in its stock price and is currently trading around Rs 418, which is close to its 200-day exponential moving average (DEMA). This proximity to the DEMA suggests that the stock might find support at this level, as the 200-day DEMA is commonly regarded as a crucial indicator of long-term trends and support. Additionally, technical analysis reveals that the daily Moving Average Convergence Divergence (MACD) indicator has formed a bullish crossover. This occurs when the MACD line crosses above the signal line, indicating a potential shift from a downward trend to an upward trend.Moreover, a bullish Bat pattern has appeared on the weekly chart. This harmonic pattern typically signifies a reversal in the market, suggesting that the recent downtrend may be nearing its end and an upward movement might be forthcoming. These combined indicators—the support level near the 200-day DEMA, the bullish MACD crossover, and the bullish Bat pattern—suggest a potentially favourable buying opportunity for investors.Based on these positive technical signals, we recommend that traders and investors consider entering long positions in Sumitomo Chemical within the price range of Rs 430-Rs 440. The target for this trade is Rs 495, which represents a substantial potential gain from the current levels. To manage risks effectively, we advise setting a stop-loss at Rs 405 on a daily closing basis.Strategy: BuyTarget: Rs 495Stop-Loss: Rs 405Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "YES Bank managing director and chief executive officer (CEO) Prashant Kumar on May 24 said the bank is handling almost 1.2 billion transactions on behalf of Paytm every month, after the recent partnership with the fintech company, which, early this year, faced regulatory wrath on its payments bank unit -- Paytm Payments Bank Ltd (PPBL) .“First, we feel happy that when there was a problem in the system, we were able to take care of that. That was one satisfaction for us. I think the entire flow of Paytm transactions is happening through us without any problem. We are handling almost 1.2 billion transactions on behalf of Paytm every month,” Kumar said in an exclusive interview with Moneycontrol.The RBI cracked the whip on PPBL on January 31, imposing severe business restrictions citing  a long history of non-compliance with prudential regulations by the company’s promoters.After this, on March 14, Paytm informed the exchanges that the National Payments Corporation of India (NPCI) has granted approval to One97 Communications Limited (OCL) to participate in UPI as a Third-Party Application Provider (TPAP) under the multi-bank model.Paytm further said four banks - Axis Bank, HDFC Bank, State Bank of India and  YES Bank - shall act as PSP (Payment System Provider) banks to OCL. “YES Bank shall also be acting as merchant acquiring bank for existing and new UPI merchants for OCL,” the exchange filing said.On March 15, Moneycontrol reported that Yes Bank and Axis Bank went live on Paytm app. Yes Bank has gone live with a closed user group of users with @ptyes handle and Axis Bank has gone with @ptaxis handle.Last month, Kumar, during a post-result press conference, said that the bank has registered around 5 million monthly transactions on Unified Payments Interface (UPI), since its partnership with Paytm.“Before the partnership with Paytm, we were seeing around 3.3 million UPI transactions and now we are seeing 5 million monthly transactions on UPI,” Kumar had said.The bank, Kumar said, has around 55 percent market share in UPI transactions by merchants. “Our market share in merchant UPI transactions is around 55 percent. This gives us an advantage on fee income and we may look at cross-selling products to them in future,” he said.The bank reported a net profit of Rs 451 crore for the January-March quarter of financial year 2023-24, which marks a 123 percent jump, compared to Rs 202 crore in the year-ago period.Yes Bank's gross non-performing asset (NPA) stood at 1.7 percent, down from 2.2 percent in the same quarter last year. On the other hand, net NPA for the quarter stood at 0.6 percent, improving from 0.80 percent on a year-on-year basis. Gross slippages for Q4FY24 stood at Rs 1,356 crore versus Rs 1,233 crore in Q3FY24.The net interest income (NII) of the lender came in at Rs 2,153 crore, increased marginally by 2 percent, compared to Rs 2,105 crore in the corresponding quarter of the previous fiscal.\n       ",
    "The benchmark indices recorded a new high on May 23 by showing a long bullish candlestick pattern on the daily charts. The BSE Sensex and Nifty 50 indices ended at a new all-time closing high, but with negative breadth as approximately 1,204 equity shares declined and 1,043 shares advanced on the NSE. The market has reached near the crucial resistance of 23,000 on the Nifty 50, and it needs to give a strong close above the same for further upward journey from hereon. However, below the same, it may consolidate. Here are some trading ideas for the near term.Amol Athawale, VP-Technical Research at Kotak SecuritiesInfosys | CMP: Rs 1,472.4Post its declining trend from the higher levels, Infosys is in consolidation mode, trading in a rectangle formation. However, the recent bullish activity near the demand zone indicates good strength. The gradual upward moves in the counter suggest a fresh leg of a bullish trend in the near term.Strategy: BuyTarget: Rs 1,575Stop-Loss: Rs 1,420IndusInd Bank | CMP: Rs 1,440.85After a short-term correction from the higher levels, IndusInd Bank was in the accumulation zone where it was trading in a rectangle formation. However, on the daily charts, there is a range breakout in the counter along with decent volume activity, which suggests upward momentum to persist in the coming horizon.Strategy: BuyTarget: Rs 1,540Stop-Loss: Rs 1,390Eicher Motors | CMP: Rs 4,852.85On the weekly charts, the counter is in a rising channel chart formation with a higher high and higher low series pattern. Additionally, technical indicators like ADX (average directional index) and RSI (relative strength index) are also indicating a further uptrend from current levels, which could boost the bullish momentum in the near future.Strategy: BuyTarget: Rs 5,200Stop-Loss: Rs 4,690Chandan Taparia, Head - Equity Derivatives & Technicals, Broking & Distribution at Motilal Oswal Financial ServicesBharti Airtel | CMP: Rs 1,374Bharti Airtel has given a range breakout on the daily chart and managed to close above the same. It has formed a bullish candle on the daily scale, and supports are gradually shifting higher. The momentum indicator, relative strength index (RSI), is positively placed, which may take prices higher.Strategy: BuyTarget: Rs 1,480Stop-Loss: Rs 1,310Mahindra and Mahindra | CMP: Rs 2,609M&M has been continuously forming higher highs and higher lows for the past three weeks. It has given an Inside Bar breakout on the daily scale and achieved its highest daily close ever.Strategy: BuyTarget: Rs 2,750Stop-Loss: Rs 2,520Axis Bank | CMP: Rs 1,165Axis Bank has retested the breakout and is inching higher. The overall trend is bullish, and every small decline is being bought into. Buying activity is visible across private banks, which may support the ongoing uptrend.Strategy: BuyTarget: Rs 1,250Stop-Loss: Rs 1,130State Bank of India | CMP: Rs 832SBI is in an overall uptrend and has given a consolidation breakout on the daily chart. The base is shifting higher, and a small follow-up can take it towards the Rs 880-900 zones.Strategy: BuyTarget: Rs 900Stop-Loss: Rs 790Mitesh Karwa, Technical Research Analyst at Bonanza PortfolioLarsen & Toubro | CMP: Rs 3,585.40L&T has seen a breakout of a downward sloping resistance trendline and is forming a bullish candlestick with above-average volumes after taking support from a crucial zone on the weekly timeframe. On the indicator front, the Supertrend indicator is indicating a bullish reversal on the daily timeframe, and the momentum oscillator RSI (14) is around 56 on the daily timeframe, indicating strength by sustaining above 50.Observation of the above factors indicates that a bullish move in L&T is possible with a target up to Rs 3,730. One can initiate a buy trade in the range of Rs 3,583-3,585, with a stop-loss of Rs 3,480 on a daily closing basis.Strategy: BuyTarget: Rs 3,730Stop-Loss: Rs 3,480Maruti Suzuki | CMP: Rs 12,934.9Maruti has seen a breakout of a triangle pattern with above-average volumes and a bullish candlestick on the daily timeframe. The Supertrend indicator is also indicating a bullish continuation, supporting the bullish view. The momentum oscillator RSI (14) is around 59 on the daily timeframe, indicating strength by sustaining above 50, and the Ichimoku Cloud is suggesting a bullish move as the price is trading above the conversion and baseline.Observation of the above factors indicates that a bullish move in Maruti is possible with a target up to Rs 13,330. One can initiate a buy trade in the range of Rs 12,930-12,934, with a stop-loss of Rs 12,750 on a daily closing basis.Strategy: BuyTarget: Rs 13,330Stop-Loss: Rs 12,750Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Equity benchmarks BSE Sensex and Nifty 50 continued their northward journey for the third straight session on May 18, while the Nifty Midcap 100 index rallied for seven days in a row, with approximately 1,582 shares advancing and 638 shares declining on the NSE. The upward move towards a record high is expected to be seen in the coming sessions. Here are some trading ideas for the near term.Rajesh Palviya, Senior Vice President Research (Head Technical Derivatives) at Axis SecuritiesAurobindo Pharma | CMP: Rs 1,202.4Aurobindo is in a strong uptrend across all time frames, forming a series of higher tops and bottoms, indicating a positive bias. It has registered an all-time high at Rs 1,212, indicating bullish sentiments. The stock has decisively broken out over the past five months' consolidation range (Rs 1,180-985) on a closing basis, indicating the resumption of the prior uptrend.The stock has been well placed above its 20, 50, 100, and 200-day SMA (simple moving average), and these averages are also inching up along with the price rise, which reaffirms the bullish trend. The daily, weekly, and monthly strength indicator RSI (relative strength index) is in positive terrain, justifying rising strength across all time frames.Investors should buy, hold, and accumulate this stock with an expected upside of Rs 1,285-1,330, with a downside support zone of Rs 1,165-1,145 levels.Strategy: BuyTarget: Rs 1,285, 1,330Stop-Loss: Rs 1,145TVS Motor Company | CMP: Rs 2,191.5With the past couple of sessions' up move, TVS has decisively broken out of the past couple of months' multiple resistance zone at Rs 2,180 levels, indicating a positive bias. Rising volumes over the past couple of weeks signify increased participation at breakout zones.The daily and weekly strength indicator RSI is in positive terrain, which justifies rising strength on short to medium-term time frames. Investors should buy, hold, and accumulate this stock with an expected upside of Rs 2,300-2,385, with a downside support zone of Rs 2,100-2,060 levels.Strategy: BuyTarget: Rs 2,300, 2,385Stop-Loss: Rs 2,060Indian Railway Finance Corporation | CMP: Rs 173.25Since the past three months, IRFC was consolidating within Rs 165-130 levels. However, with the current week's strong gains, the stock has witnessed a strong breakout at Rs 165 levels. This breakout is accompanied by huge volumes, indicating increased participation.The stock has been well placed above its 20, 50, 100, and 200-day SMA, and these averages are also inching up along with the price rise, which reaffirms the bullish trend. The daily, weekly, and monthly strength indicator RSI are in positive terrain, which justifies rising strength across all time frames.Investors should buy, hold, and accumulate this stock with an expected upside of Rs 197-218, with a downside support zone of Rs 164-155 levels.Strategy: BuyTarget: Rs 197-218Stop-Loss: Rs 155Osho Krishan, Senior Analyst - Technical & Derivative Research at Angel OneMTAR Technologies | CMP: Rs 2,042.3MTAR Technologies has seen a decent rebound in the last couple of trading sessions, soaring nearly 14 percent in the week ending May 18. Additionally, the counter substantially surpassed its major short-term EMAs (exponential moving averages) on the daily time frame chart, suggesting inherent strength.Simultaneously, with the recent move, the counter witnessed a ‘Symmetrical Triangle’ pattern breakout, indicating a bullish quotient in the counter. On the technical parameters, the MACD (moving average convergence divergence) has seen a positive crossover, adding robust development to the counter.Hence, we recommend buying MTAR Technologies around Rs 2,020-2,000, with a stop-loss at Rs 1,900, and a target at Rs 2,180-2,200.Strategy: BuyTarget: Rs 2,180, 2,200Stop-Loss: Rs 1,900Paras Defence and Space Technologies | CMP: Rs 774.85Paras witnessed a decisive spurt in price volume in the last couple of trading sessions, soaring over 10 percent on a WoW basis. The counter is in a cycle of higher highs, higher lows in the current financial year, hovering above all its major EMAs on the daily chart, adding a bullish undertone.From a technical standpoint, the counter has witnessed an ‘Inverted Head & Shoulder’ pattern breakout, backed by decent volumes. On the oscillator front, the 14-period RSI (relative strength index) and MACD both signal a continuation move, suggesting a potential upside journey in a comparable period.Hence, we recommend buying Paras around Rs 750-740, with a stop-loss at Rs 700 and a target at Rs 845-850.Strategy: BuyTarget: Rs 845-850Stop-Loss: Rs 700Tata Communications | CMP: Rs 1,807.60Tata Communications has nosedived from its lifetime high of the Rs 2,084 zone to below its 200 SMA on the daily chart, eroding almost 20 percent. However, after the correction, the counter stabilized near its previous consolidation zone and started retracting in the last couple of sessions. The stock price has seen a decent move to surpass the critical zone of the 200 SMA and is now eyeing a gradual reversal over a period of time.On the oscillator front, the 14-period RSI and MACD both signal a reversal from the oversold terrain, suggesting a potential upside journey in a comparable period.Hence, we recommend buying Tata Communications around Rs 1,800, with a stop-loss at Rs 1,700 and a target at Rs 1,960-2,000.Strategy: BuyTarget: Rs 1,960-2,000Stop-Loss: Rs 1,700Vinay Rajani, CMT, Senior Technical & Derivative Analyst at HDFC SecuritiesMishra Dhatu Nigam | CMP: Rs 476.55MIDHANI has broken out from the multiple top resistance of Rs 455 and has been sustaining above it. Resistance has been taken out with a jump in volumes, confirming the bullish trend. It has been forming higher tops and higher bottoms on the daily and weekly charts.It is placed above all important moving averages, indicating a bullish trend on all time frames. Indicators and oscillators have been showing strength in the current uptrend.Strategy: BuyTarget: Rs 525Stop-Loss: Rs 450Computer Age Management Services | CMP: Rs 3,316.95CAMS has been consolidating in the range for the last four consecutive weeks. The primary trend of the stock has been bullish as the stock is trading above all important moving averages. Indicators and oscillators like RSI and MACD have been showing strength in the current uptrend.Strategy: BuyTarget: Rs 3,600Stop-Loss: Rs 3140Tech Mahindra | CMP: Rs 1305.65On April 26th, Tech Mahindra broke out from the downward sloping trendline on the daily chart. The price rise was accompanied by a rise in volumes. Post-breakout, it witnessed a correction and reached a gap support on the daily chart.After taking support in the gap, the stock resumed its primary uptrend. Indicators and oscillators have turned bullish on the daily charts.Strategy: BuyTarget: Rs 1,380Stop-Loss: Rs 1,215Axis Bank | CMP: Rs 1,143.75Axis Bank registered a running correction and now seems to have resumed its uptrend. It has taken support near its previous swing high on the daily chart.The primary trend of the stock has been bullish with higher tops and higher bottoms. The stock is placed above all important moving averages, indicating a bullish trend on all time frames.Strategy: BuyTarget: Rs 1,210Stop-Loss: Rs 1,048Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "The stock market halted its downtrend on Friday and Nifty 50 managed to defend the 21,900 mark. As long as the index holds this level, the rangebound trade may continue, with attempts towards 22,200-22,300. If it closes below 21,900, Nifty 50 may then correct up to April lows of 21,776, according to experts.The 21,900 mark coincides with the rising support trendline, low of the big bearish candle on May 9 as well as the lower end of the Bollinger band.Overall, the trend is still in control of the bears. For the week ended May 10, the Nifty 50 fell 1.87 percent to 22,055 and formed a large bearish candlestick pattern on the weekly timeframe following Doji candlestick pattern formation in the previous session.\"Thursday's low coinciding with the 89EMA at 21,900 serves as immediate support, followed by previous swing lows in the 21,800 - 21,700 range,\" Rajesh Bhosale, technical analyst at Angel One.On the upside, the zone between the 20 and 50EMA, around 22,200 - 22,300 presents a formidable obstacle, he feels.Jigar S Patel, senior manager - equity research at Anand Rathi said the index is nearing the lower boundary of an upward channel, and a breach could signal deeper market concerns. \"Looking ahead, a drop below 21,900, the previous swing low of 21,777, may induce market panic.\"Conversely, the FIIs' long-short ratio in index futures at around 32 percent suggests an oversold market nearing a potential rebound. Hence, he feels the resistance is expected at 22,300, and closing above the same may be potentially confirming a bottom until election results.He advised traders to remain light from here on as the market is now approaching the final phases of the election.Moneycontrol collated a list of top 10 stock picks recommended by experts from a 3-4 week perspective. The stock price of May 10 is considered for the calculation of returns.Expert: Vinay Rajani, CMT, senior technical & derivative analyst at HDFC SecuritiesOil India: Buy | LTP: Rs 619 | Stop-Loss: Rs 590 | Target: Rs 725 | Return: 17 percentThe stock has been consolidating in the narrow range for last 6 sessions. Primary trend of the stock has been bullish as it has been forming higher tops and higher bottoms.The stock is placed above all important moving averages, indicating bullish trend on all time frames. Indicators and oscillators have been showing strength in the current uptrend.Tech Mahindra: Buy | LTP: Rs 1,264 | Stop-Loss: Rs 1,215 | Target: Rs 1,380 | Return: 9 percentOn April 26, the stock broke out from the downward sloping trendline on the daily chart and price rise was accompanied by higher volumes. Post breakout, stock witnessed correction and reached a gap support on the daily chart. After taking support in the gap, stock resumed its primary uptrend. Indicators and oscillators have turned bullish on the daily chart.Axis Bank: Buy | LTP: Rs 1,120 | Stop-Loss: Rs 1,048 | Target: Rs 1,210 | Return: 8 percentThe stock registered running correction and now seems to have resumed its uptrend. Stock has taken support near its previous swing high on the daily chart. Primary trend of the stock has been bullish with higher tops and higher bottoms. The stock is placed above all important moving averages, indicating bullish trend on all time frames.Expert: Amol Athawale, VP-technical research at Kotak SecuritiesIndus Towers: Buy | LTP: Rs 330.55 | Stop-Loss: Rs 320 | Target: Rs 355 | Return: 7 percentAfter the gradual decline in the counter from the higher levels, the downward momentum had stopped. On daily charts, the counter has found support and reversed its trend from its important retracement zone along with decent volume activity. The formation suggests a revival of the uptrend from the current levels.GSFC: Buy | LTP: Rs 223 | Stop-Loss: Rs 215 | Target: Rs 240 | Return: 7.6 percentAfter a short-term correction, Gujarat State Fertilizers & Chemicals (GSFC) stock reversed from its important support levels. The technical indicators like RSI (relative strength index) are also indicating further up trend from current levels, which could boost the bullish momentum in coming horizon, making it a favourable candidate on risk and reward basis.Expert: Riyank Arora, technical analyst at Mehta EquitiesIREDA: Buy | LTP: Rs 165 | Stop-Loss: Rs 157.50 | Target: Rs 192 | Return: 16 percentIndian Renewable Energy Development Agency (IREDA) stock has touched its major anchor VWAP (volume weighted average price) support mark of Rs 162.95 on its daily charts. With the RSI (14) being near 49, it is expected that the stock should pick up momentum in the upcoming few trading sessions.Contraction in price movement and volatility is indicating that we might see a surge in IREDA towards Rs 192 and above in a few days. A strict stop-loss should, however, be kept at the Rs 157.50 mark to manage risk well.National Aluminium Company: Buy | LTP: Rs 174 | Stop-Loss: Rs 164 | Target: Rs 195 | Return: 12 percentThe stock has re-tested its breakout mark of Rs 170.45 on its daily charts. With the RSI (14) being around 47 and witnessing a minor uptick and the overall trend being positive on the metal stocks, it is expected that National Aluminium should eventually head higher towards a target of Rs 195 and above.The stock has also made a Bullish Harami pattern on its daily charts, which is indicating the possibility of a good upside move in the stock. A strict stop-loss should, however, be kept around Rs 164 to manage risk well.BPCL: Buy | LTP: Rs 618.65 | Stop-Loss: Rs 590 | Target: Rs 650 | Return: 5 percentThe stock has formed a Bullish Harami candlestick pattern on its daily timeframe charts. With volumes being nearly 3 times its average (30 days) volume and the RSI (14) around 54 with a minor uptick, it is expected that the stock should head higher towards Rs 650 and above.A set stop-loss should be kept at Rs 590 mark to manage risk well on BPCL. The strong technical structure and bullish price action make the stock a good low-risk candidate at current levels.Expert: Om Mehra, technical analyst at Samco SecuritiesVedanta: Buy | LTP: Rs 411 | Stop-Loss: Rs 392 | Target: Rs 448 | Return: 9 percentVedanta stock is forming higher highs and higher lows indicating a sustained uptrend. The stock is placed well above its short-term (20-day) moving averages suggesting bulls are in total control.The RSI comfortably holding 67 levels is gradually inching higher indicating strength in the stock. The earlier resistance has now transitioned into a support level.Hence, based on the above technical structure, one can initiate a long position at CMP Rs 411 for a target price of Rs 448. The stop-loss can be kept at Rs 392.SAIL: Buy | LTP: Rs 157 | Stop-Loss: Rs 145 | Target: Rs 173 | Return: 10 percentSteel Authority of India (SAIL) stock has experienced a correction from its peak and has established strong support at the 38.2 percent Fibonacci retracement level. The RSI has stabilized, holding above 50 levels.Additionally, the stock continues to trade above the 50-day daily moving average (DMA).Hence, based on the above technical structure, one can initiate a long position at CMP Rs 157 for a target price of Rs 173. The stop-loss can be kept at Rs 145.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Fitch Ratings on Thursday affirmed the ratings of Axis Bank and ICICI Bank with a stable outlook citing supportive operating environment and large domestic franchise.Fitch Ratings has affirmed India-based Axis Bank and ICICI Bank's Long-Term Issuer Default Rating (IDR) at 'BB+', the global agency said in two separate rating commentaries.Fitch has also affirmed the banks' Government Support Rating (GSR) at 'bb+' and Viability Rating (VR) at 'bb'.Fitch said its IDR ratings reflect expectation of a moderate probability of extraordinary state support from the government relative to large state banks.The agency said its expectation of a supportive operative environment is on account of India's robust medium-term growth potential. Fitch expects GDP growth of 7 per cent in 2024 and 6.5 per cent in 2025, supported by investment prospects.\"The economy has been resilient as healthy business sentiment, steady financial markets and the government's capital spending buffered global economic headwinds and inflation. These factors are conducive for banks to sustain profitable business, provided risks are well-managed,\" Fitch said.With regard to Axis Bank, Fitch said the bank's appetite for growth is likely to remain above the sector average, albeit similar to other large private banks.\"We have revised the outlook on Axis' earnings and profitability score to stable, from positive, as we do not see a significant further upside to the core metric from current levels, despite remaining high relative to the years before FY23,\" it added.On ICICI Bank, Fitch said it maintains a positive outlook on its earnings and profitability score, as it expects profitability to remain elevated relative to prior years.On ICICI Bank's large domestic franchise, Fitch said the bank has a strong retail-focused domestic franchise as India's second-largest private bank.\"This, together with above-average capitalisation, should support sustained generation of revenue and business opportunities as well as market-share expansion through the cycle,\" it added.\n       ",
    "Axis Bank Ltd is on a lookout to hire Asian expatriates to help the lender win business from multinational companies.The bank, that recently overtook Kotak Mahindra Bank Ltd. to become the third largest private lender in India, is targeting mid-sized companies in this area, the fastest growing business in its corporate banking division. It sees this as an “under-served” market by global banks, according to Rajiv Anand, Axis’ deputy managing director.Axis is focused on companies from countries like South Korea, Japan, US, Germany, Italy and France that have good ties with India. Getting the inside track into South Korean and Japanese firms has proven tougher however, due to language and cultural barriers, according to Anand.The bank is seeking to bring on board expatriates who can help make connections with companies and their executives, Anand said. So far, it has hired a Korean expatriate, based in the southern city of Bangalore, and a Japanese, who was relocated to Mumbai.Financial firms in India have been on a hiring spree, though the country doesn’t have the depth of domestic talent that other more established markets do. Headhunters see the likes of investment banks seeking to bring professionals who carved out careers abroad back to India and Bloomberg Intelligence said finance professionals in the country may be in line for a 10% pay rise this year, outstripping rival locations in Asia.Axis is ranked second behind HDFC Bank Ltd. for arranging local currency loans in India so far this year, and fifth place for foreign currency loans, according to data compiled by Bloomberg.\n       ",
    "KR Choksey's research report on Axis BankAXSB’s Net Interest Income (NII) grew 11.5% YoY/ 4.4% QoQ to INR 130,890 Mn in Q4FY24. NII was 2.5% higher than our estimates. The Bank’s PPOP (Pre-Provisioning Operating Profit) for the quarter was INR 105,357 Mn, a growth of 14.9% YoY/ 15.3% QoQ led by a robust growth in non-interest. The PPOP was higher than our estimates driven by the higher non-interest income compared to our estimates. Net profit before exceptional items grew 17.4% QoQ/ 5.4% YoY to INR 71,297 Mn in Q4FY24, primarily led by higher operational income. The net profit deviation stood higher on the back of higher operating performance.OutlookConsidering the Bank's consistent performance and improved asset quality, we revise our target price to INR 1,345 per share (earlier INR 1,275), applying a 2.0x P/ABV multiple to its FY26E adj. book value. We reiterate our \"BUY\" rating for the AXSB share.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Axis Bank - 30042024 - kr ",
    "LKP Research's research report on Axis BankAxis Bank has reported strong results with several positive takeaways: 1) Accomplishing the aspiration of ROE of more than 18% for 4QFY24, 2) Healthy credit growth (14.2% YoY, 3.5% QoQ). 3) Strong other income growth (38.2% YoY, 21.8% QoQ) driven by treasury gains. 4) Lower C/I ratio of 46.9% compared to 49.5% in 3QFY24. 5) Increased disbursement in retail and SME loans. 6) Strong contingent provision buffer (1.3% of gross loans). 6) Sequential improvement in NPA (GNPA/NNPA ratio 1.43%/0.31%) driven by lower slippages. 7) Restructuring (14bps of GCA) squeezed further and at manageable levels with 20% coverage. Additionally, CDR ratio improved to 90.3% compared to 92.8% in the previous quarter. However, the negative aspect is the higher-than-expected provision expenses (₹11.8bn vs ₹10.3bn in 3QFY24). Furthermore, we believe the negatives are well provided for and anticipate growth to continue going forward.OutlookWe value the standalone bank with PBV of 2.2xFY26E Adj. BVPS of ₹575 and reach price target to ₹1,322. We recommend BUY rating with potential upside of 17% from current level.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Axis Bank - 26042024 - lkp "
]