[
    "Bharti Airtel reported on August 5 that its Q1 FY25 net profit swelled 158 percent year-on-year to Rs 4,160 crore from Rs 1,612 crore in the corresponding quarter last year, beating Street expectations. This was mainly helped by exceptional items. Consolidated net profit before exceptional items for the first quarter was Rs 2,925 crore.During the quarter ended June 30, 2024, the net exceptional gain of Rs 735 crore comprised a gain of Rs 1,399.1 crore on account of a favourable judgement by the Supreme Court of India regarding the waiver of interest on the tax treatment of adjusted revenue-linked variable license fee payable to DoT.The net exceptional gain also includes a gain of Rs 274 crore pertaining to the divestment of Airtel Lanka, offset by a charge on account of a foreign exchange loss of Rs 938.7 crore due to currency devaluation in its group subsidiaries. Airtel said that the net tax benefit on the above exceptional item is Rs 328 crore.The telecom major’s revenue for the April-June quarter rose 2.8 percent on-year to Rs 38,506 crore from Rs 37,440 crore, which the company said was limited due to currency devaluation in Africa.A Moneycontrol poll of 5 brokerage estimates pegged Bharti Airtel’s fiscal first quarter net profit at Rs 3,455 crore, and revenue at Rs 38,611 crore.The average revenue per user (ARPU) per month, an important metric used by telecom companies to measure revenue generation, increased 5.5 percent year-on-year to Rs 211, from Rs 200 a year ago.Kotak Institutional Equities expected ARPU to marginally increase to Rs 210 in Q1FY25 compared to Rs 209 in the previous quarter. However, the recent tariff hikes will take a couple of quarters to fully reflect on the realisation. Axis Securities expected a 15 percent ARPU gain in Q3FY25, with a combination of higher conversion and tariff hikes.Airtel's subscriber base reached 409 million in the quarter. The 4G/5G data customer base increased by 29.7 million year-on-year and 6.7 million QoQ, 73% of the overall mobile customer base.The postpaid net adds stood at 0.8 million. Mobile data consumption is up by 26.0% year-on-year, with consumption per customer at 23.7 GB per month.Earnings before interest, taxes, depreciation, and amortisation (EBITDA) for the quarter were Rs 19,944 crore, up 1 percent year-on-year. The EBITDA margin was 51.8 percent, shrinking by 90 basis points year over year. EBIT was Rs 9,355 crore, down 7.2 percent year-on-year.Capex for the quarter stood at Rs 6,781 crore, down 27 percent year-on-year. Capex for mobile services in India declined 38 percent at Rs 4,848 crore, but for home services it jumped 42 percent to Rs 707 crore.\"Our stringent focus on driving cost efficiencies is reflected in strong operating leverage. Africa continues to deliver strong underlying constant currency revenue growth,\" Gopal Vittal, MD of Airtel, said in a statement.He said that during the quarter, Airtel accelerated the pace of FWA services expansion across key towns, which would expand the addressable market.The homes business delivered a revenue growth of 17.6% YoY, driven by healthy customer additions. Airtel said its focus on digitization and acquiring high-value customers led to 348,000 customer additions in the quarter, bringing the total base to 8.0 million.\"We continue to expand our home-pass network through our own and asset-light local cable operator partnership model. Our WiFi services are now live in 1317 cities,\" Vittal said.Airtel Business delivered revenue growth of 8.3% YoY, led by growth in underlying domestic portfolio.Revenue from Digital TV remained stable, with a 16.3 million customer base at the end of the quarter.  Digital TV revenues up by 5.0% YoY, led by customer additions and rationalization improvementIn the recently concluded spectrum auction, Airtel renewed the spectrum expiring in 6 circles and further bolstered our sub-giga hertz and mid-band holding in key circles by investing Rs 6,857 crores.\"The industry saw much-needed action on tariff repair, which is positive for the industry’s financial health amid ongoing large network capex. We continue to believe that the industry needs over Rs 300 ARPU at the minimum for financial stability,\" Vittal added.\n       ",
    "Bharti Airtel, which is scheduled to report its Q1FY25 earnings on August 5, is expected to report a 2x increase in net profit year-on-year (YoY) to Rs 3455 crore.Bharti Airtel is expected to report a 3.1 percent increase YoY in revenue at Rs 38,611 crore in Q1FY25, as per mean estimates by five brokerage firms. Revenue is expected to increase largely due to recovery in Airtel Africa and steady growth in Indian businesses, say analysts.The most optimistic estimate sees Bharti Airtel's net profit jumping 114  percent YoY and the most pessimistic projection suggests that net profit will increase 36 percent on a YoY basis.Also read: Bharti Airtel starts re-farming of mid-band spectrum to accommodate growing demand on 5G networkFactors impacting earnings?Market shareBharti Airtel will retain its market share at 38 percent in the near term because of higher customer stickiness, said Axis Securities.ARPUKotak Institutional Equities expects ARPU to marginally increase to Rs 210 in Q1FY25 as compared to Rs 209 in the previous quarter. However, it will take a couple of quarters for the recent tariff hikes to fully reflect on the realization. Axis Securities is expecting a 15 percent ARPU gain in Q3FY25 with a combination of higher conversion and tariff hikes.Subscriber growth In Q1FY25, the subscriber base will increase by 4 million users to 356 million, said Prabhudas Lilladher.CapexBharti Airtel has completed the rollout of 5G telecom services in urban cities by March using non-standalone architecture, said Motilal Oswal Financial Services.Things to watch out for Analysts say that key monitorable to watch out for will be progress on 5G adoption, capex trajectory, pre-paid to post-paid conversion trends, traction in-home broadband, and updates on the partly-paid rights issues.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.  ",
    "Telecom major Bharti Airtel on Monday said it has started reallocating its existent mid-band spectrum to accommodate the exponential growth in 5G traffic.As data demand grows, Airtel is re-farming its existing spectrum at a faster pace to provide its customers with a brilliant 5G experience, it said.\"With more customers moving to the 5G network, Airtel is re-farming its mid-band spectrum to expand 5G services on its 1800, 2100, 2300 MHz bands across the country,\" it said in a statement.Airtel said its pilot on the SA and NSA switch conducted in Rewari, Chennai and Bhubaneswar showed encouraging results.This capability on the 5G network will enable Airtel to introduce new innovative applications, services and solutions through open APIs, differentiated connectivity and service-based architecture, it said.\"As more customers pivot to our 5G services, we have re-farmed our mid-band spectrum which was being used for 4G services. With this, we are also ready to launch stand-alone technology.\"This will mean that the Airtel network will be the first network in India to run on both standalone and non-standalone modes, allowing us to deliver the best experience in the market,\" Bharti Airtel CTO Randeep Sekhon said.\n       ",
    "Bharti Airtel's Africa unit Airtel Africa has reported a consolidated net profit of USD 7 million for the June 2024 quarter against a USD 170 million loss in the year-ago period.Its net profit was primarily impacted by the USD 80 million of exceptional derivative and foreign exchange losses (net of tax) and lower EBITDA due to significant currency devaluation across key markets, Airtel Africa said.It had reported a loss of USD 91 million for the fourth quarter ended March 2024 on account of tax impact and forex loss.\"Strong fundamentals and focussed execution continue to support operating performance despite challenging macro-economic environment,\" the company, which operates in 14 African countries, said.The company's consolidated revenue fell 16 per cent in Q1 FY25 to USD 1,156 million from USD 1,377 million a year ago.The decline in revenue reflects the impact of currency devaluation, particularly in Nigeria, the company said.\"We have initiated a comprehensive cost optimisation programme across the Group. We have already seen success in this project, with savings arising in network and distribution costs, and continued opportunities as contract renegotiations continue. We expect sustainable savings to continue as the year progresses,\" said Airtel Africa CEO Sunil Taldar.Airtel Africa has fully repaid the outstanding debt due at the HoldCo during Q1, he said, adding that the company is trying to further reduce foreign currency exposure to limit the impact of currency devaluation on the business.\"The growth opportunity across our markets remains compelling, and we continue to focus on margin improvement as indicated in our FY24 results,\" Taldar said.The company's EBITDA margins tanked to 45.3 per cent from 49.5 per cent in the year-ago period.\"Reported currency trends were clearly impacted by the FX headwinds across some of our markets, particularly in Nigeria and Malawi. This contributed to a reported Group revenue and EBITDA decline of 16.1 per cent and 23.3 per cent, respectively, in Q125,\" the company said.Its total customer base grew by 8.6 per cent to 155.4 million.\"Data customer penetration continues to rise, driving a 13.4 per cent increase in data customers to 64.4 million. Data usage per customer increased by 25.1 per cent to 6.2 GBs, with smartphone penetration increasing 4.7 per cent to reach 41.7 per cent,\" the company said.\n       ",
    "Here’s a quick look at stocks likely to be in focus in Thursday's trade, covering quarterly earnings, order wins, and fund raising announced by companies after market hours on Tuesday as well as Wednesday:Results TodayInfosys, L&T Technology Services, Tata Technologies, Persistent Systems, Dalmia Bharat, Ceat, Havells India, Central Bank of India, Andhra Cements, Ashapuri Gold Ornament, Bharat Bijlee, Choice International, CIE Automotive India, Gopal Snacks, Grindwell Norton, JSW Infrastructure, Mastek, Newgen Software Technologies, Polycab India, Premier Explosives, Rallis India, Reliance Industrial Infrastructure, Sagar Cements, Shoppers Stop, South Indian Bank, Swaraj Engines, Sterling and Wilson Renewable Energy, Tanla Platforms, Tata Communications, Trident Texofab, and Vraj Iron and Steel will announce quarterly earnings on July 18.Quarterly EarningsAsian Paints Q1 (Consolidated YoY)Net profit falls 24.6% to Rs 1,186.8 crore Vs Rs 1,574.8 croreRevenue declines 2.3% to Rs 8,969.7 crore Vs Rs 9,182.3 croreEBITDA drops 20.2% to Rs 1,693.8 crore Vs Rs 2,121.3 croreMargin sinks 420 bps to 18.9% Vs 23.1%LTI Mindtree Q1 (Consolidated QoQ)Net profit grows 3.1% to Rs 1,135.1 crore Vs Rs 1,100.7 croreRevenue rises 2.8% to Rs 9,142.6 crore Vs Rs 8,892.9 croreEBIT increases 4.8% to Rs 1,370.9 crore Vs Rs 1,308.7 croreEBIT margin expands to 15% Vs 14.7%Revenue in dollar terms up 2.5% at USD 1,096.2 million Vs USD 1,069.4 millionL&T Finance Q1 (Consolidated YoY)Net profit jumps 29.1% to Rs 685.5 crore Vs Rs 531 croreRevenue rises 17.4% to Rs 3,784.4 crore Vs Rs 3,223.3 croreNet interest income grows 23% to Rs 2,020 crore Vs Rs 1,644 croreConsolidated book size increases 13% to Rs 88,717 crore Vs Rs 78,566 croreNetwork18 Media and Investments Q1 (Consolidated YoY)Revenue falls 3% to Rs 3,141 crore Vs Rs 3,239 croreOperating EBITDA loss at Rs 148 crore Vs Rs 84 croreTV18 Broadcast Q1 (Consolidated YoY)Revenue drops 3% to Rs 3,069 crore Vs Rs 3,176 croreOperating EBITDA loss at Rs 109 crore Vs EBITDA loss at Rs 54 croreTV News EBITDA at Rs 40 crore Vs EBITDA loss at Rs 6 croreEntertainment business EBITDA loss at Rs 149 crore Vs EBITDA loss at Rs 49 croreAditya Birla Money Q1 (YoY)Net profit jumps 73.4% to Rs 16.4 crore Vs Rs 9.4 croreNet interest income increases 47.8% to Rs 88.5 crore Vs Rs 59.9 croreCompany appoints Ashok Suvarna as Chief Executive Officer, effective September 1, 2024Just Dial Q1 (YoY)Net profit spikes 69.3% to Rs 141.2 crore Vs Rs 83.4 croreRevenue grows 13.6% to Rs 280.5 crore Vs Rs 247 croreEBITDA surges 119.8% to Rs 80.6 crore Vs Rs 36.7 croreMargin expands to 28.7% Vs 14.9%Alok Industries Q1 (Consolidated YoY)Net loss narrows to Rs 206.9 crore Vs loss at Rs 226.1 croreRevenue drops 28.9% to Rs 1,006.3 crore Vs Rs 1,414.9 croreEBITDA spikes 68.6% to Rs 20.75 crore Vs Rs 12.3 croreMargin jumps to 2.06% Vs 0.87%Elecon Engineering Company Q1 (Consolidated YoY)Net profit increases 0.5% to Rs 73.4 crore Vs Rs 72.96 croreRevenue falls 5.3% to Rs 392.4 crore Vs Rs 414.3 croreHathway Cable & Datacom Q1 (Consolidated YoY)Net profit declines 18% to Rs 18.32 crore Vs Rs 22.4 croreRevenue rises 0.7% to Rs 502.6 crore Vs Rs 499.2 croreStocks To WatchAdani Green Energy Q1 Provisional Operational Update (YoY)Operational capacity increased by 31% to 10,934 MW with greenfield addition of 2,418 MW solar and 200 MW wind power plantsSale of energy increased by 22% at 7,356 million units backed by robust capacity additionSolar portfolio CUF (capacity utilisation factor) at 25.4% backed by 99.4% plant availabilityWind portfolio CUF at 36.2% backed by 96.8% plant availabilityConsistent high Hybrid portfolio CUF at 46.0% backed by 99.7% plant availabilityKolte-Patil Developers Q1 Operational Update (YoY)Collections grow 19% to Rs 612 crore Vs Rs 513 croreSales value rises 1% to Rs 711 crore Vs Rs 701 croreSales volume increases 3% to 0.96 million square feet Vs 0.93 million square feetOne 97 CommunicationsFlixBus announced a strategic partnership with Paytm to significantly enhance its distribution capabilities. This partnership will enable FlixBus to tap into Paytm's vast customer base and technological expertise.KEC InternationalThe RPG Group company has secured new orders worth Rs 1,100 crore for transmission & distribution (T&D) projects in India, the Middle East, Australia, and the Americas. These orders include 765 kV transmission line and 765 kV GIS substation orders in India from the Power Grid Corporation of India, and a 132 kV transmission line in the United Arab Emirates (UAE).Bharti AirtelThe telecom operator has added 12.50 lakh subscribers in May 2024, up 66.2% from the addition of 7.52 lakh users in the previous month. The company held a 33.17% market share of wireless subscribers as of May 2024.Reliance IndustriesSubsidiary Reliance Jio added 21.95 lakh users in May, compared to 26.87 lakh users added in the previous month. It had a 40.6% market share of wireless subscribers as of May 2024.Vodafone IdeaThe telecom operator lost 9.24 lakh subscribers in May this year, compared to a loss of 7.35 lakh users in the previous month. It had an 18.66% market share of wireless subscribers as of May 2024.Adani EnterprisesSirius Digitech, a joint venture between the Adani Group and Sirius International Holding (a subsidiary of International Holding Company (IHC)), signed binding agreements for the acquisition of Coredge.io, a sovereign AI and cloud platform company.Sarda Energy & MineralsThe board of directors will meet on August 3 to consider unaudited results for the first quarter of FY25 and seek shareholder consent for fundraising.ESAF Small Finance BankThe Reserve Bank of India has approved the reappointment of Kadambelil Paul Thomas as Managing Director & CEO of the bank for three years, effective October 1, 2024.Glenmark PharmaceuticalsThe pharma company has received final approval from the United States Food & Drug Administration (US FDA) for Topiramate capsules USP, 15 mg, and 25 mg. Topiramate is used in the treatment of epilepsy.TVS Motor CompanyThe company will invest 200 million pounds in its subsidiary Norton Motorcycles for international expansion, with an initial focus on the USA, Germany, France, Italy, and India.SpiceJetAshish Kumar has resigned as Head of Finance and Chief Financial Officer of the company to pursue other opportunities. The company has appointed Joyakesh Podder as the Head of Finance and designated him as the Deputy Chief Financial Officer, effective July 15.Bajaj FinanceThe Insurance Regulatory and Development Authority of India (IRDAI) has levied a penalty of Rs 2 crore on the company for violating provisions of IRDAI Regulations. IRDAI conducted an onsite inspection of Bajaj Finance during March 3 and March 5, 2021, for the period FY18 to FY20. IRDAI has also advised the company to comply with those directions in a time-bound manner.Oil and Natural Gas CorporationONGC has commenced production from its coal bed methane (CBM) block in Bokaro, Jharkhand. The initial production stands at 1,70,000 SCMD and is expected to ramp up to 3,00,000 SCMD by the end of the current financial year.Techno Electric & Engineering CompanyThe firm launched its Qualified Institutions Placement (QIP) issue on July 16 and fixed the floor price for QIP at Rs 1,506.58 per share.GMR Airports InfrastructurePassenger traffic in June this year grew by 8% YoY, with domestic traffic up 6.4% and international traffic up 12.8%. Aircraft movements increased by 6% YoY in June.Bajaj ElectricalsAnuj Poddar has resigned as Managing Director & CEO of the company, effective September 30, 2024, to explore an external opportunity.Zee Entertainment EnterprisesThe board has approved raising funds by issuing 5% foreign currency convertible bonds (FCCBs) up to USD 239 million (Rs 1,997.22 crore) maturing in 10 years on a private placement basis to proposed investors - Resonance Opportunities Fund, St. John’s Wood Fund, and Ebisu Global Opportunities Fund. The FCCB issue opened on July 16.Bulk DealsVijaya Diagnostic CentreForeign portfolio investor AL Mehwar Commercial Investments LLC sold a 0.58% stake in the diagnostic chain at an average price of Rs 775.03 per share.Indiabulls Housing FinancePlutus Wealth Management LLP bought 65,79,936 partly paid up shares in the housing finance company at an average price of Rs 68.16 per share, valuing at Rs 44.8 crore. Aalidhra Textool Engineers purchased 25 lakh shares in Indiabulls Housing at an average price of Rs 67.15 per share. However, Santosh Kumar Garg sold 23,42,587 shares at an average price of Rs 66.61 per share, and Vibgyor Investors Developers offloaded 25,41,557 shares at an average price of Rs 66.64 per share.Stocks Turn Ex-DividendAdvanced Enzyme Technologies, Amara Raja Energy & Mobility, Arvind SmartSpaces, ASM Technologies, Bliss GVS Pharma, Can Fin Homes, Golkunda Diamonds & Jewellery, GPT Healthcare, Kanoria Energy & Infrastructure, Nelcast, Newgen Software Technologies, Panasonic Energy India Company, Praj Industries, Tanla Platforms, Thangamayil Jewellery, Ultramarine & Pigments, UTI Asset Management CompanyStock Trades Ex-Date for SplitKPI Green EnergyF&O BanBalrampur Chini Mills, Piramal Enterprises, Vedanta, Chambal Fertilisers and Chemicals, GMR Airports Infrastructure, GNFC, Hindustan Copper, RBL BankStocks Removed From F&O BanAditya Birla Fashion & Retail, India Cements, Indus TowersDisclaimer: Moneycontrol is a part of the Network18 group. Network18 is controlled by Independent Media Trust, of which Reliance Industries is the sole beneficiary. ",
    "Brokerage firm Investec raised its price target for Bharti Airtel stock by a whopping 60.5 percent to Rs 1,560, while retaining its hold call as it sees the telecom major a steady path of deleveraging. This comes after Bharti Airtel, along with its rivals Reliance Jio and Vodafone Idea, recently announced tariff hikes of 20-25 percent, in a bid to boost their average revenue per user (ARPU) and profitability.Investec expects tariff hikes like these could become an annual affair for telcos for the next few years. These price hikes, according to Investec are slated to benefit the all players within the sector by improving ARPU and enhancing return on capital employed (RoCE), ultimately aiding in debt reduction.Analysts at BofA Securities seconded the view and stated that the recent round of tariff hikes would enhance cash flows and return ratios across the telecom sector. \"Vodafone Idea will be the biggest beneficiary of the tariff hike, as it is a pure-play mobile operator, followed by Bharti Airtel and then Reliance Jio,\" the brokerage said.Other analysts on the Street also share a similar view and see price hikes in a positive light. Previously, Morgan Stanley had estimated blended ARPU for Bharti Airtel and Reliance Jio to benefit 16-18 percent from these tariff hikes.Analysts at Bernstein also projected that the recent tariff hike will help Bharti Airtel's average revenue per user (ARPU) stabilise to over Rs 280 by FY26 and reach Rs 300 by FY27.Currently, Airtel boasts the highest ARPU in the market at Rs 209, followed by Jio at Rs 181.7 and Vodafone Idea at Rs 146, as of the end of Q4 of FY24.Follow our live blog for all the updatesBharti Airtel also stated the importance of its ARPU surpassing Rs 300 for the financial health of the telecom sector in India. \"We believe that this level of ARPU will enable the substantial investments required in network technology and spectrum and offer a modest return on capital,\" the telecom firm stated.Investec also feels the current market structure in the telecom industry appears better placed to drive improved pricing.In addition to Bharti Airtel, Investec also initiated coverage on Bharti Hexacom with a 'buy' call, assigning it a target price of Rs 1,240, implying an upside of around 18 percent from the previous closing price. The firm also believes the company is better placed to benefit from tariff hikes.Investec also lauded Reliance Jio's growth as it stands close to achieving its stated target of reaching 50 crore subscribers. However, the brokerage feels incremental growth for the company will be driven more by a spike in ARPUs rather than subscriber addition.Also Read | Airtel, Jio to see 16-18% ARPU benefit from tariff hikes, Vodafone Idea may gain most: AnalystsDisclosure: Moneycontrol is a part of the Network18 group. Network18 is controlled by Independent Media Trust, of which Reliance Industries is the sole beneficiary.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Telecom major Bharti Airtel has denied any breach of its security system, amid reports of a major data leak of customers belonging to the telecom player.“There has been a report alleging that Airtel customer data has been compromised. This is nothing short of a desperate attempt to tarnish Airtel’s reputation by vested interests. We have done a thorough investigation and can confirm that there has been no breach whatsoever from Airtel systems.” an Airtel spokesperson told Moneycontrol, clarifying on the reports of data breach that have been doing the round since yesterday.Unverified reports had suggested that details of 375 million Airtel customers, including their phone number, email, address and Aadhaar number were allegedly available for sale on the dark web. Moneycontrol has not been able to verify the authenticity of the data breach report. A threat actor identified as 'xenZen' had reportedly listed a database for sale on a dark web forum, and has sought $50,000 for the information.\n       ",
    "Singapore’s telecom major Singtel may divest more stake in India’s second-largest carrier Bharti Airtel, people familiar with the matter said. In March, it sold 0.8 per cent to GQG Partners for Rs 5,849 crore.Singtel's next round of share sales could see the Singapore telco sell equity worth as much as Rs 20,000 crore in one or more block deals.The people cited said that Singtel has a plan to bring down its stake in the carrier over time to the same level as the promoters, the Bharti Group. Bharti Group’s current effective stake stands at 24.57%.They added that Singtel is working with investment bank Morgan Stanley on the stake sale and while talks with prospective buyers were already ongoing, any block deal or deals are now likely to happen only after the company’s results for the first quarter of FY25, due to Sebi restrictions on share trading by promoters and key managerial people from the end of the quarter till 48 hours after the publishing of quarterly results.Queries sent to Airtel, Singtel and Morgan Stanley didn’t elicit any response.The GQG deal in March this year brought down the Singaporean telecommunications company's stake through direct and indirect holdings from 29.8 percent to 29 percent, currently worth an estimated S$33 billion.Singtel, which has been a strategic investor in Airtel since 2000, previously in 2022 sold a 3.3 percent direct stake in Airtel for Rs 12,895 crore to Bharti Telecom, Airtel’s holding company.Queries sent to Airtel, Singtel and Morgan Stanley didn’t elicit a response.On Singtel’s divestment plan, Bharti Enterprises chairman Sunil Bharti Mittal in February this year told Moneycontrol it was Singtel’s requirement to equalise its stake with Bharti promoters.“Bharti Telecom is 40 percent. I would want that to be the only vehicle holding all the stake in Airtel between us and Singtel. Singtel has some stake outside. We have some stake outside…The idea is to eventually bring it there or make some sales in the market so you do equalise. It’s their need, not ours,” he had said at that time.Bharti Telecom, which held 39.37 percent in Bharti Airtel, as on March 31, 2024, is 50.56 percent owned by the Mittal family, while Singtel has a 49.44 percent stake in the holding company.Singtel’s direct holding in Bharti Airtel stands at 9.56 percent, while the Mittal family owns a 4.53 percent direct stake through an entity called Indian Continent Investment Ltd.For Singtel, the stake sales are part of a strategy started in 2021 to reduce debt and provide more value to shareholders through dividends besides funding the growth of its data centre and IT services.By the end of September 2023, this approach has enabled Singtel to cut its net debt by S$3.2 billion and distribute S$0.8 billion in special dividends to shareholders from capital recycling.\n       ",
    "Prabhudas Lilladher's research report on Bharti AirtelBharti Airtel has announced a tariff hike of 10-20% across its various plans, effective from 3rd July, 2024. This move follows a similar increase by its major competitor, Reliance Jio, and is aimed at bolstering revenue and sustaining the company's investments in network expansion and quality improvement. Factoring in this hike, we estimate ARPU change of 13%/14% to Rs 236/269 for FY25/26E. We anticipate a subscriber addition of 16/20mn to 362/381 subs for FY25/26E.OutlookFactoring in this hike we build in a 13/14% hike in ARPU in FY25/26 to Rs236/269/month and 16/20mn subscriber addition to 362/381mn for the India mobile business. Given the much needed tariff hike undertaken by the company and acquisition of spectrum to enhance network coverage we remain positive on Airtel’s India business. Maintain Accumulate rating with a TP of Rs 1,620.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Prabhudas_bharti-28-6-24 ",
    "Shares of Bharti Airtel hit an all-time high while Vodafone Idea and Indus Towers stocks scaled 52-week peaks in morning deals on June 28 as leading telecom firms in India have started increasing mobile plan tariffs. The stocks, however, gave up gains later in the day and were trading up to 3 percent lower.According to Morgan Stanley, the tariff hikes are in line with market expectations in terms of timing and magnitude.Reliance Jio revised tariffs on Thursday, followed by Bharti Airtel, which hiked rates by 10 percent to 21 percent. Bharti Hexacom's circle rates have also been hiked.According to Taher Badshah of Invesco Mutual Fund, the hikes were expected within the industry.In an interview with CNBC TV18, he noted a cautious approach towards spending on spectrum acquisition, suggesting companies that have effectively executed their strategies and delivered strong results have experienced a re-rating in their valuations.Follow our market blog to catch all the live actionAnalysts at Morgan Stanley estimate a significant increase of 16-18 percent in blended Average Revenue Per User (ARPU) for both Bharti Airtel and Reliance Jio.Following Jio's tariff adjustments, Bharti Airtel's stock is projected to establish a new price floor in the range of Rs 1,000-Rs 1,050. Looking ahead, the brokerage foresees a potential upside of 11-15 percent assuming current valuation multiples are sustained over the next year based on conservative projections.CLSA noted that Bharti Airtel and Vodafone Idea tariffs were at a 20-25 percent premium to Jio. Meanwhile, Bernstein feels Vodafone Idea is expected to grow by 20-25 percent. According to JP Morgan, Jio's tariff revision has shifted focus from market share gains.Jefferies has maintained a Buy rating on Bharti Airtel with a target price of Rs 1,720 per share. The brokerage noted that Reliance Jio's tariff adjustment, excluding feature phone users, indicates a continued focus on expanding its subscriber base. Jio's new tariff plans underscores its heightened focus on monetization strategies.The international brokerage expects Reliance Jio to achieve 18 percent and 26 percent CAGRs in revenue and PAT respectively from FY24 to FY27. The willingness of Reliance Jio to revise tariffs is viewed positively for the revenue and margin outlooks of both Bharti Airtel and Jio, it added.Also Read | Bharti Airtel hikes mobile tariffs 10-21%; prices raised up to 70 paise per day on entry plansReliance Industries (RIL) stock hit a fresh record high of Rs 3,129.85 on NSE. Jefferies has issued a buy recommendation on the stock, raising its target price to Rs 3,580 per share following Jio's tariff adjustment.The brokerage has slightly adjusted Jio's estimates for FY25-27 by up to 3 percent, projecting revenue and profit after tax (PAT) compound annual growth rates (CAGRs) of 18 percent and 26 percent respectively from FY24 to FY27.Additionally, Jefferies made minor tweaks to Reliance Industries' FY25/26 EBITDA estimates, incorporating adjustments based on Jio's financial metrics.Meanwhile, shares of Indus Towers jumped around 4 percent to hit a 52-week high of Rs 384.80 on the National Stock Exchange (NSE).Earlier this month, as much as 20 percent equity stake in Indus Towers was sold in block deals, with UK's Vodafone Group selling around 18 percent of that stake. The deals, involving 53.30 crore shares of the mobile tower company was worth a total of Rs 17,065 crore.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Disclaimer: Moneycontrol is a part of the Network18 group. Network18 is controlled by Independent Media Trust, of which Reliance Industries is the sole beneficiary. ",
    "India's second largest telecom operator Bharti Airtel has announced a hike in mobile tariffs by as much as 10-21 percent, following Reliance Jio. Sunil Bharti Mittal's telecom firm said it will revise mobile tariffs from 3 July 2024, with a 'very modest' price increase of less than 70 paise per day on entry-level plans.Bharti Airtel maintained that the mobile telecom service Average Revenue per User (ARPU) needs to rise above Rs 300 for the financial health of the telecom businesses in India.\"We believe that this level of ARPU will enable the substantial investments required in network technology and spectrum and offer a modest return on capital,\" the telecom firm said in a statement.Further, Bharti Airtel said that the company welcomes the industry announcement to 'repair tariffs'.Earlier this week, Reliance Jio revised mobile tariffs, unveiling a series of new unlimited plans with effect from 3 July 2024. The new tariff plans range from Rs 189 for 2 GB per month to Rs 3,599 for 2.5 GB per day annual plan. These plans include unlimited 5G data for all plans with 2GB/day and above.Following this, a revision in mobile tariffs by Bharti Airtel and Vodafone Ideas were widely anticipated. Telecom firms in India have long advocated tariff increases as essential for sustainable growth.Bharti Airtel and its Chairman Sunil Mittal have repeatedly expressed the need to increase the current ARPU from about Rs 200 to Rs 300 or more. \"We need to be at the Rs 300 ARPU level. First pitstop was Rs 200. That’s taken five to six years,\" said Mittal in an interview to Moneycontrol in February this year. Bharti Airtel's ARPU topped Rs 200 (at Rs 208) in Q3 FY24.The last industry-wide tariff hike of about 20% was in December 2021. Before that, telcos hiked tariffs in December 2019, the first one after Jio launched its service in 2016.The 2019 hike increased the tariff by 20-40%, while the 2021 hike saw an increase of 20%, providing an ARPU uplift of Rs 30 and 36 over four quarters to Airtel, respectively.The earlier two hikes of 14-30 percent pushed ARPU up by 10-16 percent for Bharti Airtel and Jio, implying an ARPU transmission rate of 50-70 percent.\"We assume a similar transmission rate this time around. The full effect of this tariff hike will be visible in the December quarter,\" Axis Capital said in a note seen by Moneycontrol.\"We believe the Airtel's tariff hike announcement could give an immediate boost to stock sentiment, as seen in 2019 and 2021. However, we believe this tariff hike won’t necessarily lead to any material upgrade to our/ consensus EBITDA estimates,\" Morgan Stanley said in a separate note.Analysts expect the industry growth rate to accelerate in coming quarters, led by tariff hikes.BNP Paribas expects the Indian telecom industry’s revenue growth to remain in double digits over FY 24-26, led by tariff hikes and customers upgrading to bundled plans. \n       ",
    "Sharekhan's research report on Bharti AirtelCompany has continued to narrow the revenue market share (RMS) gap with industry leader Reliance Jio, improving its RMS to 37.9% up 35/139 bps on q-o-q and y-o-y basis respectively. We believe tariff hikes of 15-20% are imminent post the conclusion of telecom spectrum auction with subsequent frequent tariff hikes going forward to aid the needed tariff repair. After an elevated capex in FY24, a decline in capex intensity in FY25 and possible tariff hikes is likely to aid a meaningful uptick in FCF generation.OutlookWe reiterate a Buy on Bharti Airtel with a revised PT of Rs. 1680 owing to its industry leading ARPU, incremental revenue market share gains and as it is well placed to be a key beneficiary of the expected tariff hikes over FY25-26E.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Bharti Airtel - 27062024 - khan ",
    "Telecom stocks are in focus on June 27, a day after an auction of radiowaves that carry voice and data signals for mobile phones ended, garnering less than 12 percent of the Rs 96,238 crore minimum value that the government had estimated for the spectrum on offer. The auction concluded with the majority bids for renewals and some for capacity expansions.The participation in this spectrum auction was largely driven by the renewals of the expiring spectrum in the 900 MHz and 1800 MHz bands; coupled with some purchases in the 2100 MHz and 2500 MHz bands to strengthen the network. \"Apart from these, there was no activity in other bands,\" said Ankit Jain, Vice President and Sector Head - Corporate Ratings, ICRA.Bharti Airtel emerged as the top bidder in the recent spectrum auction, securing around 60 percent of the Rs 11,341 crore worth of radio waves sold. Airtel acquired airwaves worth Rs 6,856.76 crore.At 9:21 am, Bharti Airtel shares were trading half a percent down at Rs 1,452.85 apiece on the National Stock Exchange (NSE).Follow our market blog to catch all the live actionBharti Airtel and Vodafone Idea successfully renewed their expired spectrum in the 900 MHz and 1,800 MHz bands. Additionally, telcos acquired an extra 87.2 MHz worth Rs 6,164.88 crore to enhance their services.The unsold spectrum will be put up for auction again next time. Available spectrum in various bands including 800 MHz, 900 MHz, and others were offered in this auction.Reliance Jio obtained spectrum valued at Rs 973.62 crore. Shares of Jio parent Reliance Industries (RIL) were also down nearly half a percent at Rs 3,014.55 apiece on NSE. JPMorgan reiterated an overweight (OW) rating on RIL stock and raised the target price to Rs 3,320.Also Read | Bharti Airtel acquires 97 MHz spectrum through auction for Rs 6857 croreThe brokerage highlighted that expectations of a tariff increase are bolstering the telecom sector, which should now be factored into future forecasts.Analysts at JPMorgan anticipate that any upside following the upgrade in telecom expectations will necessitate a higher valuation for Reliance Retail. Additionally, it emphasised that a significant improvement in topline growth in the first quarter will be pivotal.Vodafone Idea secured spectrum worth Rs 3,510.4 crore. According to Motilal Oswal, Vodafone Idea can opt for either 20 equal installments (of Rs 350 crore each) or upfront payment of minimum of two years and then installments for the remaining 18 years.This can increase Vodafone Idea's debt by 1.4 percent to Rs 2.3 lakh crore. The annual installment (of Rs 350 crore) will be 2.7 percent of its Ebitda. The stock was trading 0.8 percent higher at Rs 18.17 on NSE.Also Read | Jio invests Rs 973.63 crore for spectrum expansion in Bihar, West BengalBharti Hexacom made an unexpected acquisition of spectrum valued at Rs 1,000 crore in ongoing auctions, a move expected to enhance its data services. Shares of the recently listed firm fell over 3 percent to Rs 1,216.50 on NSE. Jefferies has downgraded the stock to a hold rating with a target price of Rs 1,290.Analysts project a maintained revenue and EBITDA compound annual growth rate (CAGR) of 17 percent and 23 percent respectively for FY24-27. However, earnings estimates have been reduced by 4 percent to account for the spectrum acquisition costs. Despite doubling since its April IPO, the stock is currently trading at a multiple of 16x EV/EBITDA.Disclaimer: Moneycontrol is a part of the Network18 group. Network18 is controlled by Independent Media Trust, of which Reliance Industries is the sole beneficiary.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Telecom operators secured over Rs 11,300 crore worth of radio waves in the latest spectrum auction, the Union government said on June 26.Rs 11,340-crore revenue was received through auction of a total quantum of 141.4 MHz spectrum, said government in a press release.\"The Auction started on June 25, 2024 at 10 am and concluded on June 26, 2024 at 11:45 am after 7 rounds. As auction for 5G spectrum was held recently and 5G monetisation is still in progress, no bidding took place in 800 MHz, 2,300 MHz, 3,300 MHz and 26 GHz bands. A total quantum of 141.4 MHz (26.5%) was sold from the balance 533.6 MHz Spectrum. This is despite the fact that a very large amount of spectrum i.e., 51.2 Ghz of spectrum was sold in August 2022,\" said Ministry of Communications.The unsold spectrum will again be put to auction next time.Commenting on the development, Telecom Minister Jyotiraditya M. Scindia said: \"Spectrum auction 2024 was part of a continuous allocation process that is transparent, robust and progressive. TSPs have taken spectrum not only for continuity of service but for expanding their services but the volume is limited because already a large part of the spectrum required was auctioned only last year. We will continue the process with the clear objective of ensuring reliability and growth of telecom services in India.\"Bharti Airtel acquired spectrum worth Rs 6,857 crore while Reliance Jio and Vodafone Idea bought spectrum worth Rs 973.62 crore and Rs 3,510.4 crore, respectively.Airtel acquired 97 MHz spectrum in 900 MHz, 1,800 MHz and 2,100 MHzfrequency bands through the auction for Rs 6,857 crore while Jio acquired 14.4 MHz spectrum in 1,800 MHz for Rs 973.62 crore. Vodafone Idea acquired 30 MHz spectrum in 900 MHz, 1,800 MHz and 2,500 MHz for Rs 3,510.1 crore.\"Bharti Airtel and Vodafone Idea have successfully renewed their expired spectrum in 900 MHz and 1,800 MHz bands and further an additional quantum of 87.2 MHz worth Rs 6,164.88 crore has been acquired by telecom service providers to augment their services. The unsold spectrum will again be put to auction next time,\" said government.Disclosure: Moneycontrol is a part of the Network18 group. Network18 is controlled by Independent Media Trust, of which Reliance Industries is the sole beneficiary. ",
    "Bharti Airtel acquired 97 MHz spectrum in 900 MHz, 1800 MHz and 2100 MHz frequency bands through the auction concluded on June 26 for Rs 6,857 crore, sources familiar with the matter said.The spectrum has been secured for 20 years, they said.With this auction, Airtel successfully renewed spectrum that was expiring in 2024 along with additional spectrum purchase to bolster its mid band holding across the key circles, officials said, adding that the telco will now have the largest mid‐band spectrum pool in the country.Additionally, Bharti Hexacom Ltd has acquired 15 MHz with an outlay of Rs.1,001 crore out of the total.On June 26, telecom department's spectrum auction worth Rs 96,000 crore ended after seven rounds with bids worth over Rs 11,300 crore from Reliance Jio, Bharti Airtel and Vodafone Idea.Airtel emerged as the biggest spender in the 5G auction. The Sunil Mittal-led telco has spent Rs 8,000-Rs 9,000 to buy airwaves in the efficient sub-GHz 900 MHz band as well as those in the 1800 and 2100 MHz bands, sources said.Vodafone Idea (Vi) has possibly acquired spectrum in the 900 MHz, 1800 MHz and 2500MHz bands worth Rs 1200-Rs 1500 crore, they added.The telecom department has put over 10,500 Mhz spectrum in eight frequency bands - 800 MHz, 900 MHz, 1,800 MHz, 2,100 MHz, 2,300 MHz, 2,500 MHz, 3,300 MHz and 26 GHz, valued at Rs 96,238 crore at base price, for auction.\n       ",
    "After monetising its stake in telecom tower company Indus Towers Ltd, Vodafone Group Plc is looking to invest as much as Rs 3,000 crore of equity in its Indian telecom joint venture Vodafone Idea Ltd, according to people aware of the development.On June 19, Vodafone Group announced that it had sold an 18 percent stake in Indus Towers for €1.7 billion (Rs 15,300 crore, approximately). Indus Towers shares were sold by Vodafone Plc in the price range of Rs 315.99 to Rs 325 per share.The company said that it will use the major portion of the proceeds to repay a large part of the  €1.8 billion in outstanding bank borrowings secured against Indus Towers shares. It has not specified how much it will repay.On Monday, CNBC TV18 reported that Bharti Airtel is in talks with Vodafone Plc to buy an additional 3 percent stake in Indus Towers. Airtel had picked up a one percent stake in Indus last week in a block deal.According to the people cited, while the funds raised through the block deal were largely meant for repayment of loans taken against Indus shares as collateral, with further monetisation of its Indus stake, by way of the possible stake sale to Bharti Airtel, Vodafone Plc is planning to plough back a significant amount of capital into Vodafone Idea. If a transaction with Bharti Airtel is executed at the same price range as the block deal, Vodafone Group could garner a further Rs 2,500 crore.The persons cited added that Vodafone Group is looking to invest as much as Rs 3,000 crore in the telco, with a large part of it coming from the Indus stake. Further the telecom player may also raise some amount in the form of debt to fund the investment in Vodafone Idea.An email sent to Vodafone Group did not elicit a response till press time.Vodafone Group’s plans to invest equity into Vodafone Idea come on the back of a successful Rs 18,000 crore follow-on public offering by the telco in April, which saw participation from investors such as GQG Partners, Fidelity, HDFC MF, and Motilal Oswal MF, among others.The April fundraise is expected to help Vodafone Idea to fund the setting up of its 5G network, while also strengthening its 4G network coverage across key geographies in India.Also Read: How Vodafone Idea plans to spend its Rs 18,000 cr FPO proceedsLast week Moneycontrol reported that persistent pressure from lenders over an outstanding loan taken around five years ago were among the key reasons why the UK's Vodafone Group sold its stake in Indus Towers.Moneycontrol reported that matters came to a head after a group of foreign banks, led by BNP Paribas, HSBC and Bank of America among others, refused to extend the tenor of the loan and demanded full repayment. The loan had been raised against Vodafone Group’s 21.05 percent stake in Indus Towers for it to participate in Vodafone Idea’s rights issue in March 2019.Several domestic and foreign institutional investors, including Norges Bank, Jane Street, SBI Mutual Fund, and Millennium Funds, purchased shares of telecom towers operator Indus Towers from  Vodafone Group, according to data from stock exchanges and sources who spoke to Moneycontrol.\n       ",
    "Bharti Airtel is talks with Vodafone Plc to buy 3 percent additional stake in telecom towers company Indus Towers, reported CNBC TV18, citing unidentified sources. Bharti Airtel stock was little changed on June 24, trading at Rs 1,414.3 in the afternoon, marginally down from the previous close.Earlier, last week, Vodafone group had sold an 18 percent equity stake in Indus Towers in block deals for about Rs 15,300 crore. With this, Vodafone group is now left with a 3.1 percent shareholding in Indus Towers.Bharti Airtel had bought 1 percent additional stake in Indus Towers in the transaction, taking its holding in the towers company to  nearly 49 percent. The proposed additional stake acquisition would make Bharti Airtel the majority stakeholder in Indus Towers with a 52 percent shareholding.Airtel plans to Indus Towers with its data centre business Nxtra, reported CNBC TV18. Further, Indus Towers cash would be used for Nxtra expansion, said the report. Airtel aims to make its telecom business asset light via Nextra and Indus Towers merger.The merger would unlock value, and would also give exit to Carlyle from its investment. Private Equity major Carlyle had bought a 24 percent stake in Nxtra in 2020.Consolidation of the majority shareholding in Indus Towers, and then merging it with the data centre business is apparently part of Bharti Airtel's mega plan to of two-pronged strategy to capitalise on Indus Towers.On the other hand, Vodafone is likely to use stake sale proceeds to pay dues to Indus Towers. A recent Reuters report had said that Vodafone Group was looking to sell its entire $2.3 billion stake in Indus Towers as part of a strategic move to pare its hefty debt.The proceeds from this stake sale are earmarked for trimming down Vodafone's significant $42.17 billion net debt, the Reuters report added. Back in 2022, Vodafone announced intentions to offload its then-28 percent stake in Indus Towers, but progress had been slow till last week.\n       ",
    "Bharti Airtel said on June 19 that it has acquired 1 percent additional equity stake in Indus Towers, shortly after it was reported that UK's Vodafone group has sold as much as 20 percent shareholding in the towers company.Bharti Airtel said it has bought 2.695 crore shares in Indus Towers 'on-market'. Sunil Mittal-led telecom company had got the directors' approval for acquisition of upto 2.7 crore shares. Before this, Bharti Airtel held 47.95 percent equity stake in Indus Towers.Earlier today, Vodafone group reportedly sold as many as 53.3 crore shares in Indus Towers for Rs 17,065 crore. Private equity firms I Squared Capital and Stonepeak were also among the interested buyers for Vodafone's stake in Indus Towers.The sale is a move by Vodafone to streamline its financials. Vodafone Group had earlier announced in 2022 its intention to sell its then 28% stake, aiming to reduce its hefty $42.17 billion net debt. However, progress had been slow so far, with only a fraction of the stake sold.Analysts at JPMorgan have noted that the sale could generate a substantial cash influx, estimated at $2.3 billion. This would facilitate quicker debt repayments to vendors, including Indus Towers, and might even enable a special dividend for the shareholders of the Indian tower company.The block deal led to a 10 percent drop in Indus Towers' stock price to an intraday low of Rs 311.40 on the NSE, before paring losses and trading at Rs 331 in the afternoon.Bharti Airtel share price fell, and was trading down 1 percent at Rs 1,414 on June 19. \n       ",
    "Motilal Oswal Financial Services maintained a 'Buy' rating on Bharti Airtel and a 'Neutral' rating on Vodafone Idea following TRAI data showed that Bharti Airtel gained Adjusted Gross Revenue (AGR) market share from the latter. Meanwhile, the AGR of Reliance Jio (RJio) remained flat.Bharti Airtel's AGR grew by 2.9 percent QoQ, while Vodafone Idea's AGR declined by 0.6 percent QoQ. RJio reported QoQ AGR growth of 2 percent.At 9.55 AM, Bharti Airtel's shares traded up 0.25 percent at Rs 1,429.25 while that of Vodafone Idea were up 1 percent at Rs 16.Also Read | ‘It's like coming full circle': Jyotiraditya Scindia after taking charge as telecom ministerTRAI released its quarterly telecom financial data for Q4 FY24, highlighting key developments in the sector. The data showed that Bharti Airtel and RJio continue to lead industry AGR growth.The telecom sector saw AGR growth of 1.9 percent QoQ, slightly down from the 2.6 percent QoQ growth in Dec 2023. This growth was driven by a 1.2 percent increase in Average Revenue Per User (ARPU) and a 0.6 percent increase in subscribers.Consequently, Bharti Airtel gained 40 basis points QoQ to reach a 37.5 percent market share, RJio remained steady at 41.7 percent, the highest in the industry. Vodafone lost 40 basis points QoQ, dropping to 15.2 percent. The company has consistently lost an average of 40 basis points in market share each quarter over the last two years.Follow our live blog for all the market actionBharti Airtel's growth was primarily driven by ARPU improvement, whereas RJio's growth was led by steady subscriber increases.Motilal Oswal said that Bharti Airtel has the opportunity to grow its EBITDA by 40-50 percent and halve its net debt over the next 2-3 years. The company is well poised to benefit from sector tailwinds, including market share gains, improved ARPU driven by the premiumization of customers and tariff hikes as well as growth in non-wireless segments such as Home and Enterprise, the brokerage firm said.Reiterating its 'Neutral' rating on Vodafone Idea, Motilal Oswal pointed out a reduction in AGR liability, restriction in subscriber churn rate, and potential tariff hikes as key catalysts for the stock.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Bharti Airtel shares were trading flat on June 10 even after CLSA issued a 'buy' call on stock with a target price of Rs 1,540 per share, as the company has recently joined the $100 billion market cap club, driven by the success of its mobile business.Bharti Airtel's strong growth in the Indian mobile segment, supported by effective management execution, has propelled the company into the elite group of four Indian firms with market caps exceeding $100 billion, CLSA noted.After a decade of stagnation, Bharti Airtel's market capitalisation has expanded 3.3 times since 2017. CLSA attributes this growth to the company's high-growth scalable business, strong management, and competitive global edge.Follow our market blog to catch all the live actionBharti Airtel is expected to post its highest-ever return on capital invested this fiscal, according to Macquarie. The international brokerage and research firm estimates Airtel's ROCE (return on capital employed) to surge to 10-19 percent during FY25-28 from 2-6 percent in the last more than a decade, aided by tariff hikes, better subscriber mix and capex moderation.Airtel had invested $32 billion in FY24, generating a return of 8 percent. Over the next four years, while investments will drop to $28 billion per year, returns will likely more than double to 19 percent, Macquarie data showed.From its lows in FY19, Airtel's India mobile ARPU (average revenue per user) has improved to Rs 209 in the fourth quarter of FY24 (2x in five years), Airtel said in an investor update.Macquarie expects Airtel's India ARPU to reach Rs 275 per month in FY27, driven by a likely 15 percent rise in industry tariffs post the general elections this week, followed by ongoing mix improvements - data users, upgrades to 5G, strategic segmentation, and prepaid to postpaid conversions.Also Read | Mphasis sees Rs 7,066 cr block deal as Blackstone offloads 15.6% stakeAt 9:29 am, Airtel shares were trading marginally higher at Rs 1,429.25 on the National Stock Exchange (NSE). So far this year, the stock has soared 40 percent, outperforming benchmark Nifty 50 which has risen 7.6 percent during this period. In the last one year, Airtel shares have risen 70 percent.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "In the absence of bulls, bears further strengthened their grip on the market on May 30, the monthly F&O expiry day, and dragged the benchmark Nifty 50 below the 22,500 mark for the first time since May 17. The lower highs-lower lows formation continued with a negative bias in the momentum indicator Relative Strength Index (RSI). However, the positive point is that the index managed to sustain above 50 percent of the Fibonacci retracement level as well as the 20-day SMA (Simple Moving Average). The benchmark BSE Sensex plunged 0.83 percent, and the Nifty 50 slipped 0.95 percent, forming a bearish candlestick pattern on the daily charts. The market breadth remained negative, with 1,757 shares declining against 509 shares advancing on the NSE. The immediate support for the Nifty 50 is likely to be seen at 22,400, followed by 22,300. In case of a bounce back, the 22,600-22,700 levels are the immediate ones to watch. Here are some trading ideas for the near term:Shrikant Chouhan, Head Equity Research at Kotak SecuritiesBharti Airtel | CMP: Rs 1,377On the weekly charts, Bharti Airtel's counter is in a rising channel chart formation with a higher high-higher low series pattern. Additionally, the technical indicator Average Directional Index (ADX) indicates a further uptrend from current levels, which could boost the bullish momentum in the near future. As long as the stock is trading above Rs 1,330, the uptrend formation is likely to continue. Above this level, the counter could move up to Rs 1,480.Strategy: BuyTarget: Rs 1,480Stop-Loss: Rs 1,330Asian Paints | CMP: Rs 2,883.70Asian Paints stock is in the accumulation zone, trading in a rangebound mode for the past many sessions. The texture of the chart formation and technical indicator Relative Strength Index (RSI) indicate that the counter is in oversold territory. Therefore, it is very likely to rebound from current levels for a new leg of the up move in the coming horizon.Strategy: BuyTarget: Rs 3,100Stop-Loss: Rs 2,790ICICI Bank | CMP: Rs 1,113.7After a remarkable up move, ICICI Bank stock has been having a breather for the last few sessions. The consolidation in the rangebound structure suggests a bullish continuation chart formation. Moreover, the stock comfortably closed above its short-term moving average. Therefore, it is likely to resume its uptrend from the current levels.Strategy: BuyTarget: Rs 1,190Stop-Loss: Rs 1,080Virat Jagad, Technical Research Analyst at Bonanza PortfolioEmami | CMP: Rs 611.85Emami has given a breakout of the falling trendline in a weekly time frame, indicating an upward move. The rise in volume during the breakout indicates buyers' interest in the security. The price is trading above the 50 EMA (Exponential Moving Average), which indicates an uptrend in the security. The momentum indicator RSI is moving in the northern direction, supporting the price action.Strategy: BuyTarget: Rs 680, Rs 750Stop-Loss: Rs 580, Rs 570Page Industries | CMP: Rs 37,964.75Page Industries has given a breakout of the Double Bottom pattern, signaling a change in trend (i.e. positive). The increase in volume during the buying days and fall in volume during selling days indicates accumulation in the security. Volume increasing during the breakout indicates that buyers are purchasing the security at CMP and are expecting an upward move. The price is trading above the 21 EMA, indicating an uptrend in the security. The momentum indicator RSI trading in a higher range also indicates an uptrend in the security.Strategy: BuyTarget: Rs 39,800, Rs 41,350Stop-Loss: Rs 35,600, Rs 34,200EID Parry India | CMP: Rs 676.75On a weekly timeframe, EID Parry has given a breakout of an Ascending Triangle on the upside, indicating a continuation in the uptrend. The spurt in volume during the breakout indicates buyers' interest. The price has taken support at the 50 EMA and moved upward, indicating an up move in the security. The momentum indicator RSI, after cooling off, has started moving in the northern direction, supporting the price action.Strategy: BuyTarget: Rs 780, Rs 850Stop-Loss: Rs 613, Rs 560RHI Magnesita India | CMP: Rs 736.35RHIM has been able to settle above the 10-week close, indicating a bullish trend. Buyers have shown interest in the security, leading it to close above the resistance. The increase in volume indicates interest in the security. The price has been able to close above the 50 EMA, indicating a bullish trend. On the momentum front, RSI is making higher highs, supporting the price action.Strategy: BuyTarget: Rs 830, Rs 890Stop-Loss: Rs 650, Rs 590Chandan Taparia, Head - Equity Derivatives & Technicals, Broking & Distribution at Motilal Oswal Financial ServicesDixon Technologies | CMP: Rs 9,308Dixon Technologies is in an overall uptrend and holding gains at higher zones. It has given a consolidation breakout on a daily scale and is relatively outperforming within the IT space. The momentum indicator RSI is positively placed, which has bullish implications.Strategy: BuyTarget: Rs 10,000Stop-Loss: Rs 9,000Samvardhana Motherson International | CMP: Rs 151.7Motherson has given a trendline breakout on the weekly chart and achieved the highest daily close ever. The breakout is supported by a surge in volumes, which may support the ongoing up move. The momentum indicator RSI is positively placed, which has bullish implications.Strategy: BuyTarget: Rs 165Stop-Loss: Rs 145Bajaj Finance | CMP: Rs 6,616.45Bajaj Finance has given a support trendline breakout on a daily scale and closed below the same. The stock is in an overall downtrend and continuously forming lower top-lower bottom patterns on the daily chart.Strategy: SellTarget: Rs 6,100Stop-Loss: Rs 6,850Disclaimer: The views and investment tips expressed by experts on Moneycontrol are their own and not those of the website or its management. Moneycontrol advises users to check with certified experts before taking any investment decisions. "
]