[
    "KR Choksey's research report on CiplaThe Q4FY24 performance was a mixed bag with hits and misses across line items. The net income was higher by 7% vs. estimates. We increase our EPS estimates by 4%/3% for FY25E/FY26E on the back of strong products pipeline and market outpacing growth the company is able to exhibit in its key markets of India and South Africa and strong line up of peptide products likely be launched in North America in FY25E and gAbraxane in FY26E  Currently, the stock trades at 29.1x/23.5x/21.7x its FY24/FY25E/FY26E revised EPS estimates, respectively.OutlookWe apply 25.0x (unchanged) multiple on FY26E EPS of Rs. 65.3 (vs. earlier Rs. 63.7) and arrive at a target price of Rs 1,633/share and retain our rating of BUY (upside: 15.4%).For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.CIPLA - 15052024 - kr ",
    "Shares of Cipla soared 4 percent in opening trade on May 15, after three block deals in the counter took place on the exchanges. Around 2.04 crore shares, making up a 2.52 percent stake in drugmaker Cipla changed hands in the three block deals.The company later confirmed that its promoters, the Hamied family sold 2.5 percent stake in the drugmaker.CNBC-Awaaz had also reported on May 14 that the  promoter family and Okasa Pharma were looking to offload as much as 2.53 percent stake.Follow our market blog for live updatesThe promoter family were eyeing to earn Rs 2,637 crore from the stake sale, the CNBC-Awaaz report stated.The report also revealed that the block trade comes with a lock-in period of 90 days for the sellers. As per Cipla's latest shareholding data, the promoter family owned a 33.47 percent stake in the drugmaker.The promoter family, the Hamieds, also unloaded another 2.5 percent stake through open market transactions back in February 2020.Cipla board has three promoter family members - chairman Yusuf Hamied, younger brother MK Hamied and his daughter Samina - all of them in non-executive roles.Talks of Cipla's promoter family looking to sell-off their entire promoter holding as part of the company's succession plans made rounds in mid-2023.Several names including those of private equity (PE) firms like Blackstone and Baring Asia and another drugmaker Torrent Pharma submitting non-binding bids for Cipla's promoter stake surfaced. However, none of the deals have materialised so far.Moneycontrol had also reported in August 2023 that if Cipla promoter's exit plans does not move forward through the M&A route did not go through, then it is likely that they may sell part stake via block deals instead.The drugmaker also reported a healthy set of Q4 earnings last week. The company clocked a 79 percent on year growth in its net profit to Rs 939 crore in the January-March period. The net profit also topped Moneycontrol's estimate of Rs 891 crore.The sharp spike in bottomline was largely due to a low base as the company's net profit was impacted by one-time impairment charges in the year ago period.Conversely, revenue rose 13 percent year-on-year to Rs 6,163 crore, falling short of the expected Rs 6,224 crore. The topline was also impacted by the divestment of Cipla's Uganda-based subsidiary QCIL (Quality Chemical Industries), which was concluded in the preceding quarter.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Prabhudas Lilladher's research report on CiplaOur FY25/26E EPS estimates broadly stands increased by 3%. CIPLA’s Q4FY24 EBITDA (Rs13.2bn; 21.4% OPM) was in line with our estimates, aided by higher GMs (66.3%). Due to delay in some key launches like gAdvair and gAbraxane (pushed by atleast 2-3 quarters), timely launch of five peptide (guided for FY25) will be a key. We continue to remain positive on key segments growth including India & US given 1) strong traction in respiratory & other portfolios, 2) potential +10% growth in domestic formulations and 3) sustainability of current US revs. We expect 10% EPS CAGR over FY24-26E. At CMP, stock is trading 24x FY26E EPS adjusted for gRevlimid.OutlookWe maintain our ‘Accumulate’ with TP of Rs1,405/share. Any further FDA escalation to Indore unit and erosion in key products in US will be key risk to our call.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Cipla - 14052024 - prabhu ",
    "Cipla is likely to see a block trade of shares worth Rs 2,637 crore on May 15, with the promoter family and Okasa Pharma selling as much as 2.53 percent stake. CNBC-Awaaz was the first to report on the possible block trade on May 14.The price at which the Cipla block is expected to happen is between Rs 1289.50-1357.35 per share which turns out to be a discount of 5 percent at maximum. Kotak Securities is the sole broker of the block deal, according to sources. The block trade comes at a time when the shares have seen healthy returns, rising 44.8% in one year.CNBC-Awaaz also learns that there is a lock-in for sellers for a period of 90 days after the scheduled block trade. The promoter shareholding in the company is 33.47% at the end of March. Back in February 2022 too, Hamied family members had sold 2.5% of their holding through block deals. The Cipla board has three promoter family members - chairman Yusuf Hamied, younger brother MK Hamied and his daughter Samina - all of them in non-executive roles.Moneycontrol had reported in August 2023 that if the Cipla promoter exit plans via M&A does not move forward, then it is likely that they may sell part stake via block deals instead.Cipla reported its fourth quarter numbers just days ago, clocking a 79 percent on year rise in net profit at Rs 939 crore, beating Moneycontrol's estimate of Rs 891 crore. The sharp spike in bottomline was largely due to a low base as the company's net profit was impacted by one-time impairment charges in the year ago period.The drugmaker had expressed willingness to the possibility of marketing Eli Lilly’s weight loss drugs in India.For FY25, the key factor for Cipla will be its plan to launch four peptide assets in the US market.\n       ",
    "HighlightsCipla (CMP: Rs 1,340; Market Cap: Rs 1,08,155 crore) posted moderate growth in a seasonally weak quarter. While the company continues to do well on gross profit, operating margins were lower than expected due to higher operating expenses and a pick-up in R&D costs.That said, potentially lower contribution\n                                    ",
    "Drugmaker Cipla Ltd's healthy growth outlook, as it aims to diversify its complex offerings, coupled with hopes of easing regulatory struggles for the company have ushered optimism among brokerages.Shares of Cipla also reacted positively to the company's solid growth prospects and the management's positive commentary. At 09.30 am, shares of Cipla were trading around 6 percent higher at Rs 1,413.20 on the NSE, topping the list of gainers in the Nifty 50.Ensuring a smooth pipeline of drug launches",
    "Indian pharma major Cipla said that it is open to the possibility of marketing Eli Lilly’s weight loss drugs in India.“We currently have a very nice working relation with Eli Lilly for the insulin range. So we are always open” Umang Vohra, CEO, Cipla.Currently, Eli Lilly has a strategic partnership in India with Cipla to enhance the reach of Eli Lilly’s Diabetes products – Humalog [Insulin Lispro I.P. (rDNA Origin) injection] and Trulicity (Dulaglutide) from 2021.As a part of this agreement, Lilly had transfered its rights in India to sell, promote and distribute the two Lilly Diabetes products to Cipla.In February, Eli Lilly CEO David Ricks said that the company expects to launch Mounjaro, its blockbuster diabetes drug and wildly popular obesity treatment, in India as early as next year (2025) after it clears an ongoing regulatory review.Mounjaro (tirzepatide) injection, is a prescription medicine for adults with type 2 diabetes used along with diet and exercise to improve blood sugar (glucose).The management expects EBITDA margins to come at 25 percent for FY 25. EBITDA for FY24 came in at Rs 6233 crore and 24.5 percent EBITDA margin in the period.The company is also closer to the remediation of its plant in Indore for the US FDA inspection. The plant has been under scrutiny for some time due to regulatory lapses. Analysts at Jefferies had estimated that the Indore plant contributes around 30 percent to Cipla's US sales and 8 percent to overall sales in a November 26 report.Pharma major Cipla has reported a consolidated net profit of Rs 939 crore for the January to March period, up 79 percent year-on-year (YoY), compared with Rs 525.6 crore in the year-ago period.\n       ",
    "Shares of Cipla fell nearly 3 percent in trade on May 10 after the company reported lower-than-expected revenue and margin numbers for the March quarter of FY24.At 2.56 pm, shares of Cipla were trading at Rs 1,342.25 on the NSE.The company's net profit, however, surged 79 percent on year to Rs 939 crore, beating Moneycontrol's estimate of Rs 891 crore. It is worth noting that the sharp spike in Cipla bottomline for Q4 is largely due to a low base as the company's net profit was impacted by one-time impairment charges worth Rs 182.42 crore in the year ago period.On the other hand, revenue grew 13 percent year-on-year to Rs 6,163 crore, missing the expected Rs 6,224 crore. The revenue was also dragged lower by the divestment of Cipla's Uganda based subsidiary QCIL (Quality Chemical Industries), which was done in the previous quarter.Meanwhile, the lower-than-expected growth in the company's India business also resulted in the lag in topline for the January-March quarter. The company's India sales suffered from soft seasonal demand for its consumer business and reported just 7 percent on year growth against analyst expectations of a low-double-digit increase.Follow our market blog for live updatesThe drugmaker's US business, however, continued to remain the frontrunner in terms of growth as sales from the region grew 11 percent on year to $226 million, supported by continued growth in key differentiated assets as well as base portfolio.On the operational front, EBITDA margin swelled up 54 basis points to 21.4 percent but missed the 22 percent-mark guided by the management amid higher research and development spends.R&D spends in the quarter also rose 11 percent on year to Rs 444 crore or 7.2 percent of the total revenue.Cipla has also filed for five assets in the respiratory segment, which include generics of Symbicort and Qvar, with launches anticipated within the next 3 years. Additionally, the company is targeting the submission of 2 more respiratory assets within the next 12-15 months.In the peptides and complex generics category, Cipla has filed for 12 assets, aiming for launches within a horizon of 2-4 years. Furthermore, the company plans to launch 4 peptide assets during FY25.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Pharma major Cipla on May 10  reported a consolidated net profit of Rs 939 crore for the quarter ended March 2024, making a 78 percent spike over last year's Rs 525.6 crore.A Moneycontrol poll of eight brokerages pegged the net profit at Rs 891  crore.Consolidated revenue from operation for the quarter under review stood at Rs 6082 crore, up 4 percent as against Rs 5,793.3 crore in the corresponding period a year ago. A Moneycontrol poll of  brokerages pegged the revenue from operations at Rs 6,224  crore.At the operating level, EBITDA rose 12 percent to Rs 1316 crore as against Rs 1173 crore last fiscal. EBITDA margin stood at 21.3 percent as compared to 20.5 percent in the same period last fiscal.The India business grew 7 percent YoY backed by branded prescription and trade generics, the company said.  Revenue in North American region was at $ 226 million up 11 percent YoY supported by continued growth in key differentiated assets as well as base portfolio, the company said.The R&D expenses for the quarter are higher by 19 percent YoY at Rs 444 crore or 7.2 percent of the revenue, driven by product filing costs and developmental efforts. On a full year basis, the costs were Rs 1,571 crore or 6.2  percent of the revenue.During the year, cash outflow towards capital expenditure at Cipla was Rs 1,315 crore spent for growth and improving our capacities and capabilities.Incorporated in 1935, Cipla was promoted by the late Dr KA Hamied and is currently spearheaded by Dr YK Hamied. The promoter group holds a 33.40 percent equity stake in the company as on June 30, 2023. It is engaged in the manufacturing of formulations and APIs, with over 97 percent of the sales being contributed from the formulation segment in FY23.Cipla has a diversified product portfolio of more than 1,500 drugs, catering to various segments such as anti-infective, cardiac, gynaecology, and gastrointestinal, in over 80 markets across the world.Shares of the company reacted negatively to the results. Shares were down 1.18 percent in NSE at Rs 1341.90 at 2.56 pm on May 10.\n       ",
    "Pharmaceutical major Cipla Ltd is expected to report a healthy Q4 results, with revenue boosted by steady US sales, and profit growing over the previous year’s low base. The drugmaker is due to report its fiscal fourth quarter results on May 10.According to a poll of eight brokerages collated by Moneycontrol, Cipla’s Q4 FY24 net profit is likely to grow around 65 percent on-year to Rs 891 crore. In the previous year (base period) Cipla's net profit was impacted by one-time impairment charges worth Rs 182.42 crore due to an acquisition in Uganda and its assets in Yemen. Adjusted for the same, Cipla's bottomline is likely to grow 28 percent on-year. CIPLA Q4 FY24 PREVIEWRevenue is expected to grow 8.4 percent year-on-year to Rs 6,224 crore for the January-March quarter.The drugmaker's operating margins are also expected to remain steady and meet the management's guidance of 24 percent, both for Q4 and full FY24.Among the brokerages polled by Moneycontrol, Kotak Institutional Equities issued the most bullish estimates for Cipla while Prabhudas Lilladher estimated the lowest growth.Steady US salesThe company's US business is expected to aid its growth in Q4. The surge in US sales will be driven by the contribution from blockbuster cancer drug Revlimid, along with a stable market share in Albuterol (respiratory drug) and an expansion in Lanreotide (hormonal drug) and Brovana (inhalation drug). Axis Securities expects Cipla's base sales in the US business to come around $225 million (Rs 1,880 crore), primarily driven by these drugs.Brokerage firm Kotak Institutional Equities estimates Revlimid's contribution for Cipla to rise marginally to $28 million from $25 million in the previous quarter.Also Read | Cipla, Glenmark recall drugs from US market: USFDAOther marketsMeanwhile, the company's domestic business growth would likely be limited to high-single-digit or even low-double-digit due to weak seasonality. Nomura believes the drugmaker's acquisitions in the domestic market will aid its on-year growth in Q4.Meanwhile, the brokerage also estimated 3 percent year-on-year South Africa sales growth in constant currency terms, aided by the acquisition of Actor Pharma, to some extent. However, revenue growth from the segment in rupee terms will be lower due to the depreciation of South African Rand against the Indian rupee in the past year.That aside, investors will watch management's outlook for new drug launches, especially since two of the drugmaker's major launches -- respiratory drug Advair and chemotherapy drug Abraxane -- are delayed due to regulatory headwinds.On May 9 at 12:15 pm, Cipla's shares on BSE were trading 0.7 percent lower at Rs 1,375 apiece. The stock has gained nearly 10 percent since January this year, and about 47 percent in the last one year, outperforming benchmark Nifty index.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "By Jigar S Patel, senior manager - equity research at Anand RathiThe market dynamics in April were characterized by volatility, with both global and domestic factors influencing sentiment. Globally, geopolitical tensions and a downturn in US markets affected markets, while domestically, corrections in IT stocks and newsflow relating to banking added to the pressure. Despite reaching a peak of 22,794 on April 2, the Nifty 50 index faced hurdles around the 22,800 mark, failing to surpass it despite repeated attempts.The index displayed a bearish pattern after a heavy selloff from its all-time high on May 3, with technical analysis indicating it's trading within a rising channel, now aiming towards 22,900 – 22,950. However, the supply is expected in this zone, and the volatility index (VIX) bouncing back suggests challenges ahead. On the downside, a breach below 22,300 could lead to a slide towards 22,100 – 22,000.In the banking sector, while heavy supply impacted Kotak Mahindra Bank, stocks like ICICI Bank drove the Nifty Bank to new highs, surpassing 48,636 and aiming towards the milestone of 50,000. However, this level presents a significant hurdle, coinciding with resistance from a rising channel.Hurdles at 49,600 / 50,000 / 50,600 are expected, while breaching 48,500 could lead to further downside pressure on Nifty Bank. With elections results nearing, caution is advised as choppy momentum is anticipated in the coming weeks.Here are three buy calls for the next 2-3 weeks:Dr Reddy's Laboratories: Buy | LTP: Rs 6,349.55 | Stop-Loss: Rs 6,111 | Target: Rs 6,700 | Return: 5.5 percentDr Reddy's Labs shows a strong uptrend with higher highs and higher lows on a weekly scale, indicating sustained upward momentum and bullish sentiment. Recent trading saw support at the middle Bollinger band, suggesting a potential rebound.The stochastic oscillator remained resilient, avoiding oversold conditions, and showing a bullish crossover near 25 levels on the weekly scale. This alignment suggests a favourable moment for traders to consider long positions, with entry recommended between Rs 6,275-6,350 for a projected upside target of Rs 6,700. To manage downside risk, a stop-loss near Rs 6,111, based on daily closing prices, is advised.Piramal Enterprises: Buy | LTP: Rs 962 | Stop-Loss: Rs 902 | Target: Rs 1,060 | Return: 10 percentCurrently, PEL has found support at the 0.618 percent retracement level from its previous upward movement between April 3, 2023 and September 11, 2023. Before this, it consolidated within the range of Rs 820-900 for approximately a month.On the indicator side, weekly stochastics exhibit regular bullish divergence on a weekly scale, suggesting a favourable buying opportunity. Hence, initiating long positions within the range of Rs 945-965 with an upside target of Rs 1,060 is recommended. A stop-loss near Rs 902, based on daily closing prices, is advised to manage potential downside risk.NOTE: If the price is making lower lows (LL), but the oscillator is making higher lows (HL), this is regular bullish divergenceCipla: Buy | LTP: Rs 1,425 | Stop-Loss: Rs 1,345 | Target: Rs 1,555 | Return: 9 percentCipla demonstrates a robust uptrend, marked by higher highs and higher lows on a weekly scale, signalling sustained upward momentum and bullish sentiment. Recent trading sessions found support at the middle Bollinger band, hinting at a potential rebound.Additionally, the stochastic oscillator showed resilience and indicated hidden bullish divergence, along with a bullish crossover, further reinforcing the bullish outlook. This alignment presents a favourable opportunity for traders to consider long positions, with an entry suggested between Rs 1,400-1,430 and a projected upside target of Rs 1,555.To manage downside risk, a stop-loss near Rs 1,345, based on daily closing prices, is recommended.NOTE: If the price is making higher lows (HL) but the oscillator is making lower lows (LL), this is seen as a hidden bullish divergence.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Pharma major Cipla Ltd on Friday said it has been imposed a penalty of Rs 1.83 crore by the GST authority for claiming inadmissible transitional credit on education cess.The company has received an order from the Principal Commissioner of CGST & Central Excise, Mumbai, Maharashtra imposing a penalty of Rs 1,83,17,388 under applicable provisions of the Central Goods and Services Tax Act, 2017 and Maharashtra Goods and Services Tax Act, 2017, Cipla said in a regulatory filing.\"The order has been passed by the GST Authority on the contention that the company has claimed inadmissible transitional credit on education cess during the transition from excise regime to GST regime in FY 2017-18 and has ordered recovery of the same with penalty,” it added. Cipla further said that based on an assessment of facts and prevailing law, it will file necessary appeals with the appellate authority in this regard. There is no material impact on the company’s financials or operations due to the said order, it added.\n       ",
    "ICICI Securities has come out with its fourth quarter (January - March’ 24) earnings estimates for the PHARMA sector. The brokerage house expects Cipla to report net profit at Rs 869.4 crore down 24.9% year-on-year (up 49.9% quarter-on-quarter).Net Sales are expected to decrease by 4.7 percent Y-o-Y (up 9.6 percent Q-o-Q) to Rs 6,290.9 crore, according to ICICI Securities.Earnings before interest, tax, depreciation and amortisation (EBITDA) are likely to fall by 23.7 percent Y-o-Y (up 13.6 percent Q-o-Q) to Rs 1,333.7 crore.Disclaimer: The views and investment tips expressed by investment experts on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.ICICI_Pharma ",
    "Cipla share price was trading flat in early trade on April 16 after it was announced the company is going to acquire a business undertaking from Ivia Beaute Private Limited.At 09:20am, Cipla was quoting at Rs 1,381.65, up Rs 0.40, or 0.03 percent, on the BSE.Cipla Health Limited India, a wholly owned subsidiary of the company, signed a business transfer agreement (BTA) for purchase of the distribution and marketing business undertaking of cosmetics and personal care business from Ivia Beaute Private Limited India, through a slump sale arrangement on a going concern basis, Cipla said.The acquisition included Ivia’s brands namely Astaberry, Ikin, and Bhimsaini on a worldwide basis.Catch all market action in our live blogThe transaction is expected to be completed within 60 days from the signing of BTA or such other date mutually agreed between the parties in writing and shall be subject to successful completion/waiver of the conditions precedent and closing conditions as mentioned in such BTA.This transaction is expected to enhance CHL's consumer healthcare and wellness portfolio. Brands of Ivia complement CHL's offerings in the skin care segment and shall enrich the portfolio with trusted and effective solutions for consumers, the company added.The cost of acquisition is Rs 130 crore on closing date and Rs 110 crore contingent upon achievement of certain financial parameters (milestones) for next 3 years as mentioned in the BTA.A meeting of the board of directors of the company will be held on May 10, 2024 to consider and approve the standalone and consolidated audited financial results of the company for the quarter and year ended March 31, 2024 and recommend final dividend for the year ended March 31, 2024, if any.\n       ",
    "Cipla announced on April 15 that its wholly owned subsidiary and consumer healthcare arm of the company Cipla Health Limited (CHL) has signed a business transfer agreement for the purchase of the distribution and marketing business undertaking of cosmetics and personal care business of Ivia Beaute Private Limited including Ivia’s brands namely Astaberry, Ikin and Bhimsaini on a worldwide basis. The cost of acquisition will be Rs 130 crore on the closing date.In a regulatory filing, Cipla said the transaction is expected to be completed within 60 days from the signing of the business transfer agreement or such other date mutually agreed between the parties in writing and shall be subject to successful completion/waiver of the conditions precedent and closing conditions as mentioned in such business transfer agreement.\"Building on its strong presence through a cluster of brands in Tier 2-6 towns, CHL is strengthening its play in the fast-growing beauty and personal care sector catering to the aspirational consumer of India. The growing adoption of beauty and personal care products in Indian households signals a prominent trend, positioning the market as crucial for CHL’s expansion efforts,\" a statement from the company said.\"With a brand legacy of over 16 years, Astaberry caters to consumers through a wide range of unique products to help them address their skincare needs. These brands complement CHL's offerings in the skin care segment and enriches the portfolio with trusted and effective solutions for consumers,\" the statement further added.Shivam Puri, Chief Executive Officer and Whole Time Director of CHL said, “This move not only solidifies our presence in the expansive and dynamic beauty and personal care sector but also builds on our well-established footprint in Tier 2-6 cities. Our target consumer base is discerning and seeks variety, especially when it comes to new brands in personal care. Integrating Astaberry, Ikin and Bhimsaini into our portfolio seamlessly complements our existing offerings across key OTC/consumer healthcare categories, empowering us to deliver comprehensive solutions that cater effectively to the diverse everyday needs of our consumers.\"\n       ",
    "The benchmark Nifty ended just above 22,500, marking a flat weekly close, on April 12. While the weekly chart shows little change, reverting to the previous week's close, the daily chart reveals a notable hesitancy at higher levels.Prices have precisely retreated from the upper boundary of the 'rising channel' pattern, a formation we highlighted earlier during the week. Accompanied by a ' two-point negative divergence' on the RSI-smoothened indicator, a cautious approach is advisable for bulls camp at higher levels.Traders should refrain from chasing buying opportunities at elevated levels and are encouraged to consider profit-booking on any bounce back. Notably, the range of 22,700 to 22,800 presents significant resistance.Conversely, key indices hover slightly above their previous swing high, technically considered as a support level. For the Nifty, this lies within the range of 22,450 to 22,500, and a breach may trigger further profit-booking, potentially towards 22,300 and beyond in the near term. Traders should monitor these levels closely and adjust their trading strategies accordingly.Further, Friday's market weakness was largely attributed to geopolitical concerns, underscoring the importance of closely monitoring these developments as they could impact market dynamics.Here is one buy call and one sell idea for short term:CDSL: Buy | LTP: Rs 2,008 | Stop-Loss: Rs 1,909 | Target: Rs 2,185 | Return: 9 percentA few months back, the Central Depository Services (CDSL) prices witnessed a long-term bullish breakout, yet in recent weeks, it has been trading within a certain range. However, it's now showing signs of resuming its upward trend, as evidenced by closing above the recent congestion zone, affirming a breakout in the continuation channel pattern.Notably, there has been an increase in trading volumes during the period of up-move as compared to the volume of period during consolidation, suggesting strong accumulation.Even amid a weaker overall market, this particular stock showed strength on Friday. With prices comfortably above the key averages and oscillators indicating positive positions, the outlook for buying remains supported. Hence, we recommend buying CDSL around Rs 2,008 - 2,000, with a stop-loss of Rs 1,909 and target of Rs 2,185.Cipla: Sell | LTP: Rs 1,397 | Stop-Loss: Rs 1,440 | Target: Rs 1,320 | Return: 5.5 percentIn recent weeks, on the daily chart, stock prices have been moving within a defined range. However, by recently breaking below the lower boundary of this range, a distribution pattern breakdown known as a 'Double Top' has been confirmed. This pattern finds support in a negative divergence observed in the momentum indicator RSI (relative strength index), where prices reached new highs but the oscillator did not.The current downturn is further supported by increased trading volume, and prices have fallen below both the 20 and 50 EMA (exponential moving average), indicating a shift in momentum favoring the bears.Given these observations, we anticipate further weakness in this stock. Hence, we recommend selling Cipla around Rs 1,397 - 1,405, with a stop-loss of Rs 1,440 and target of Rs 1,320.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Cipla, a leading pharmaceutical company, has disclosed in a stock exchange filing on April 5 that its Board of Directors will convene on May 10, to discuss and approve standalone and consolidated audited financial results for Quarter 4 and the year ended March 31, 2024. Additionally, the drugmaker said the Board will deliberate on recommending a final dividend for the financial year 2023-24, if any.Cipla also stated that it would release Q4FY24 audited financial results on May 10.Cipla's dividend consistencyCipla has sustained its track record of consistent dividend declarations over the past many years, reflecting its commitment to rewarding shareholders.For the fiscal year ending March 2023, Cipla declared an equity dividend of 425%, equivalent to Rs 8.5 per share.In the preceding fiscal year 2021-22, Cipla declared an equity dividend of 250 percent, equivalent to Rs 5 per equity share, with a face value of Rs 2 per equity share.Cipla was in the news on April 5 as the US Food and Drug Administration (USFDA) issued a Form 483 with six inspectional observations for the drugmaker's manufacturing facility in Patalganga, Maharashtra.The pharmaceutical major Cipla reported a consolidated net profit of Rs 1,068.4 crore in the quarter ending December 2023, which is 32.25 percent higher as compared to the year-ago period.In the trading session on April 5, the scrip settled at Rs 1449.40 apiece at the NSE, which was 0.70 percent down (or Rs 10.15) as against the previous day's close.\n       ",
    "Troubles rose again for Cipla Ltd as the US Food and Drug Administration slapped a form 483 with six inspectional observations on the drugmaker's manufacturing facility at Patalganga in Maharashtra. The continued regulatory stress for the company sent its shares down 1.5 percent in early trade on April 5.At 9.19 am, shares of Cipla were trading at Rs 1,450.95 apiece on the NSE.Cipla's Patalganga plant manufactures active pharmaceutical ingredients (APIs), the key raw materials for medicines, as well as formulations. The US drug regulator had conducted a routine current Good Manufacturing Practices (cGMP) inspection of the unit in question between March 28-April 4.The company responded by stating its commitment to collaborating closely with the US FDA and ensuring that it addresses the observations within the specified timeframe.Follow our market blog to catch all the live updatesTwo of Cipla's other major units in Goa and Pithampur are already caught in regulatory issues, which has resulted in delay in launches of two blockbuster drugs for the company, namely respiratory medication Advair and chemotherapy medication Abraxane.The delay in launches of these two major drugs amid regulatory challenges at respective facilities responsible for their production has caused monetary loss for the drugmaker.On that account, regulatory issues at another facilities has weighed on investor sentiment even more.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Share prices of Cipla and Sanofi India were trading higher in the early trade on March 27 after the companies entered into distribution agreement for Sanofi's central nervous system product range.At 9.28am, Cipla was quoting at Rs 1,475.10, up Rs 3.40, or 0.23 percent, and Sanofi India was quoting at Rs 7,908.55, up Rs 197.70, or 2.56 percent, on the BSE.Sanofi India Limited and Sanofi Healthcare India Private Limited and Cipla Limited announced an exclusive partnership for distribution and promotion of Sanofi's Central Nervous System (CNS) product range in India.Cipla will be responsible for the distribution of Sanofi India’s six CNS brands including Frisium, a leading brand in the anti-epileptic medication category.While Sanofi India will continue to own, import, and manufacture its complete range of CNS products across plants in India and internationally, Cipla will leverage its capabilities and India-wide network of marketing and sales professionals, distributors, institutions, and market outreach programmes to expand access to these treatments for patients who need them.Catch all market action in our live blogNod to mergerCipla received the regulatory approval for the merger of Cipla Technologies LLC into Cipla USA Inc, wholly owned step down subsidiaries of the Indian company in the US. The merger will be effective from March 31.CipTec is engaged in development of specialty products in the US market and Cipla USA is engaged in the business of distribution of pharmaceutical products in USA.Rajeev Kumar Sinha, presently Global Head-Formulations Manufacturing, has been appointed senior management personnel and global chief manufacturing officer of the company effective April 1, Cipla said.\n       ",
    "Sharekhan's research report on CiplaWe reiterate a Buy call with a higher PT due to buoyancy in the US, as price erosion pressures ease, volume growth due to drug shortages and focus on complex products. Cipla’s growth in the IPM February 2024 stood at 8.1% (IPM growth of 9%) and 9.9% on MAT basis (IPM growth of 6.7% on a MAT basis). We expect EBITDA margins to rise to 26% by FY26E driven by higher chronic share in the domestic business, new product launches in the complex generics in the US and completion of acquisition of Actor Pharma in South Africa.OutlookStock trades at a P/E of 25x/ 21.2x its FY2025E/FY2026E EPS. Due to continuous healthy traction in both the US and India. We increase our ascribed multiple to 24x on FY26E to arrive at a PT of Rs. 1,700 (earlier PT Rs 1,600).For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Cipla - 15032024 - khan ",
    "Cipla shares surged 2.5 percent in trade on March 11 to touch a fresh lifetime high of Rs 1,519 apiece, extending its rally. So far, in 2024, shares of the pharma major have jumped over 20 percent, as against a 3 percent rise in the domestic benchmark index, Nifty 50.Nuvama Institutional Equities, a domestic brokerage, noted that currently, Cipla is aiming to transition from a pure-play pharma company to an integrated health player.\"It is increasingly engaging with start-up ecosystems to invest in different areas of oncology, obesity, mental health, wellness, genomics, etc. The company sees significant growth opportunities and is thinking beyond the pill by working on various aspects i.e. pill, nutrition, clinics and digital,\" said Nuvama. This is likely to provide a leg up to its consumer health business.Follow our market blog to catch all the live updatesAt 12 pm, shares of Cipla were quoting Rs 1,502 on the NSE, higher by 1.3 percent from the previous session's closing price.The brokerage added that Cipla’s focus on a differentiated portfolio has yielded results in the US (inhalers, peptides and gRevlimid); it expects to sustain a revenue run-rate of $1 billion. The confidence stems from upcoming five peptides launches in FY25E, complex products, and a robust pipeline of inhalers.Brokerage viewNuvama retained its 'buy' call on Cipla,  given its steady domestic franchise and robust US pipeline. The brokerage raised the price target to Rs 1,750 per share, up from Rs 1,600 apiece. This implies an upside of around 17.8 percent.On March 1, the United States Food and Drug Administration (USFDA) inspected a manufacturing facility of subsidiary Cipla (Jiangsu) Pharmaceutical in Qidong, Jiangsu Province, China, from February 26 to March 1. The inspection concluded with zero Form 483 observations, Cipla said.In a separate filing, the company told bourses that it has completed the transfer of its generics business. “The company has completed the transfer of Generics Business Undertaking as a going concern on a slump sale basis to Cipla Pharma and Life Sciences Limited, a wholly-owned subsidiary of the company on 1st March 2024,” Cipla said.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.\n       ",
    "Cipla stock gained 1.43 percent on March 2, just Rs 2 away from the 52-week high it hit in the previous session.The United States Food and Drug Administration (USFDA) inspected a manufacturing facility of subsidiary Cipla (Jiangsu) Pharmaceutical in Qidong, Jiangsu Province, China, from February 26 to March 1. The inspection concluded with zero Form 483 observations, Cipla said.In a separate filing, the company told bourses that it has completed the transfer of its generics business. “The company has completed the transfer of Generics Business Undertaking as a going concern on a slump sale basis to Cipla Pharma and Life Sciences Limited, a wholly-owned subsidiary of the company on 1st March 2024,” Cipla said.Check our live blog for all the market updatesThe transaction would help in capitalising on the high-growth potential business by increasing investments in new launches, deepening penetration in Tier 2-6 towns/cities and improving patient access through high-quality generic medicines, the company had said earlier.The stock has gained 67 percent in the past year and over 6 percent in the past month.FinancialsThe pharmaceutical major reported a consolidated net profit of Rs 1,068.4 crore in the quarter ending December 31, 2023, 32.25 percent higher as compared to the year-ago period. The net profit, in the third quarter of the previous fiscal year, had stood at Rs 807.8 crore.Consolidated revenue came in at Rs 6,603.81 crore, up 13.66 percent.Brokerage CallCipla has multiple growth drivers beyond limited gRevlimid cash flow. “Top-notch execution and sticky revenue call for a premium valuation. We are thus raising the core business multiple to 29x (from 27x). We are raising FY24E EPS by 6 percent; FY25 is largely unchanged. ‘BUY’ with a target price of Rs 1,600 (from Rs 1,350) along with a rollover to Dec-25E,” analysts at Nuvama Institutional Equities had said in a post results announcement.Disclaimer: The views and investment tips expressed by experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. "
]