[
    "HighlightsCoal India (CIL, CMP: Rs 496; Market capitalisation: Rs 305,794 crore; Rating: Overweight), the largest coal-producing company in the world that caters to ~80 percent of India’s coal requirement, plans to fully meet domestic demand.With this goal in view, the company announced\n                                    ",
    "In an effort to revive dormant coal mines and boost revenue, Coal India Limited has awarded 23 discontinued underground mines to successful private sector bidders, the state-run company said in a statement on June 19.The award has been given based on a revenue sharing model, according to the statement.The cumulative peak rated capacity is 34.14 million tonnes/year (MT/Y), while the total extractable reserves are estimated at 635 MT, the company said.The coal mining firm had identified 34 mines, which were not operational but had good quality coal reserves. However, these mines were financially not viable for Coal India, which decided to offer them to private players.Of the 34 identified mines, the West Bengal-based Eastern Coalfields Limited and Jharkhand-based Bharat Coking Coal Limited account for 10 each. Western Coalfields Limited has 5, South Eastern Coalfields Limited 4, Mahanadi Coalfields Limited 3 and Central Coalfields Limited’s two make up the rest, the company statement said.The statement further said that the contract is for a maximum period of 25 years with a minimum revenue of 4 percent to be shared. \n       ",
    "HighlightsOn the election verdict day, nearly all PSU stocks tumbled, and Coal India (CIL; CMP: Rs 441; Market capitalisation: Rs 2,72,330 crore; Rating: Overweight) was no exception.The stock fell ~14 percent on June 4, 2024. However, we think the sharp fall in this coal major doesn’t hold a\n                                    ",
    "Here's a quick look at which stocks will be in focus in trade on Monday, from significant investments and major deals to monthly auto sales volumes announced over the weekend:Monthly Sales Volumes Announced on June 1Maruti Suzuki India sales in May (YoY)Total sales down 2% at 1.74 lakh units Vs 1.78 lakh unitsTotal domestic sales rise 3.7% to 1.57 lakh units Vs 1.51 lakh unitsDomestic passenger vehicle sales up 0.2% at 1.44 lakh units Vs 1.43 lakh unitsTotal exports drop 34.4% to 17,367 units Vs 26,477 unitsTotal production increases 7.2% to 1.93 lakh units Vs 1.80 lakh unitsMaruti reduced prices of its auto gear shift variants across its models by Rs 5,000 per unit effective June 1Tata Motors sales in May (YoY)Total sales grow 2.4% to 76,766 units Vs 74,973 unitsDomestic sales up 2% at 75,173 units Vs 73,448 unitsCommercial vehicle sales rise 2% to 29,691 units Vs 28,989 unitsPassenger vehicle sales up 2% at 47,075 units Vs 45,984 unitsMahindra and Mahindra sales in May (YoY)Total sales volumes grow 16.7% to 71,682 units Vs 61,415 unitsPassenger vehicle sales up 31% at 43,218 units Vs 32,886 unitsTractor sales increase 9% to 37,109 units Vs 34,126 unitsTractor exports grow 85% to 1,872 units Vs 1,013 unitsTVS Motor Company sales in May (YoY)Total sales grow 12% to 3.70 lakh units Vs 3.30 lakh units2-wheelers sales up 13% at 3.59 lakh units Vs 3.19 lakh unitsElectric vehicle sales increase 4% to 18,674 units Vs 17,953 unitsExports jump 27% to 96,966 units Vs 76,607 units3-wheeler sales down 8.8% at 10,324 units Vs 11,314 unitsHero MotoCorp sales in May (YoY)Sales volume falls 4.1% to 4.98 lakh units Vs 5.19 lakh unitsDomestic sales declines 5.7% to 4.79 lakh units Vs 5.08 lakh unitsExports grow 67.3% to 18,673 units Vs 11,165 unitsEscorts Kubota sales in May (YoY)Tractor sales drop 6.1% to 8,612 units Vs 9,167 unitsDomestic tractor sales down 5.4% to 8,232 units Vs 8,704 unitsEicher Motors sales in May (YoY)Royal Enfield sales down 8% at 71,010 units Vs 77,461 unitsInternational Business (Royal Enfield) sales grow 12% to 7,479 units Vs 6,666 unitsTotal VECV sales up 9.7% at 6,901 units Vs 6,289 unitsSML Isuzu sales in May (YoY)Sales up 21.2% at 1,563 units Vs 1,290 unitsPassenger vehicles grow 19.3% to 1,245 units Vs 1,044 unitsAtul Auto sales in May (YoY)Total sales up 112% at 2,331 units Vs 1,101 unitsVST Tillers sales in May (YoY)Power tillers & tractors sales down 34.1% to 2,474 units Vs 3,756 unitsStocks To WatchCoal IndiaCoal production in May grew by 7.5% year-on-year to 64.4 million tonnes, and offtake increased by 7.2% year-on-year to 68.2 million tonnes.MOILThe manganese-ore mining company has increased prices of all ferro grades of manganese ore with manganese content of Mn-44% and above by 35%. It also hiked prices of all other ferro grades with manganese content below Mn-44% by 30%. Furthermore, it increased prices of all SGMR, fines, and chemical grades by 30%, effective from June 1.Adani Ports and Special Economic ZoneAdani International Ports Holdings Pte (AIPH), a wholly owned subsidiary of Adani Ports, has signed a 30-year concession agreement with the Tanzania Ports Authority to operate and manage Container Terminal 2 at the Dar es Salaam Port, Tanzania. The Adani Ports-led consortium will acquire the project company in Tanzania, which houses all port handling equipment and employees, for $39.5 million. Container Terminal 2 has a capacity of 1 million TEUs and handles approximately 83% of Tanzania’s container volume.Ashoka BuildconThe company has emerged as the lowest bidder for two projects worth Rs 2,153 crore from the Maharashtra State Road Development Corporation.Ahluwalia ContractsThe company has received a contract worth Rs 2,157 crore from India Jewellery Park, Mumbai. The contract involves design, engineering, procurement, and construction (EPC) for the construction and development of Gems & Jewellery Park in Mahape, Navi Mumbai. It also bagged a contract worth Rs 88.15 crore from Daffodil Hotel.NMDCThe company announced total iron ore production at 2.34 million tonnes in May 2024, down 37% from 3.71 million tonnes in the year-ago period. Iron ore sales fell 22% YoY to 2.82 million tonnes.Poonawalla FincorpThe NBFC company has achieved a milestone of gross NPA below 1% and net NPA below 0.5% as of May 31, 2024.Oil and Natural Gas CorporationThe state-owned oil & gas exploration company said K C Ramesh ceased to be Chief Financial Officer with effect from June 1, due to superannuation.PuravankaraThe real estate developer, through its subsidiary Purva Oak, has acquired 12.75 acres of land in Thane. The land has an estimated potential carpet area of 18.20 lakh square feet and a potential gross development value (GDV) of Rs 4,000 crore over the project lifecycle.Moschip TechnologiesThe Hyderabad-headquartered company has secured a Rs 509.37 crore contract from the Centre for Development of Advanced Computing (CDAC). The contract includes the design, development, and delivery of an HPC SoC based on 5nm technology.Shriram FinanceThe board has approved the re-appointment of Umesh Revankar as Executive Vice Chairman of the company for 5 years, with effect from October 26, 2024, to October 25, 2029. Further, the board approved the elevation and re-designation of Parag Sharma as Managing Director & CFO of the company, with effect from June 1, 2024. Parag Sharma was Joint Managing Director & Chief Financial Officer of the company.Endurance TechnologiesSubsidiary Endurance Overseas Srl, Italy, has acquired a 100% stake in Italy-based Ingenia Automation Srl for 3.6 million euros. Ingenia operates in the design, production, and installation of industrial automation systems.BSEThe country's oldest stock exchange has completed the acquisition of S&P Dow Jones Indices’ entire equity stake in Asia Index (AIPL), making AIPL a wholly-owned subsidiary of BSE. AIPL will continue to provide its services to clients who are subscribed to AIPL’s indices/data products. AIPL was a joint venture between S&P DJI and BSE and is best known for calculating and maintaining the popular index Sensex.RECThe state-run company has received approval from the board for raising funds up to Rs 1.45 lakh crore through the private placement of non-convertible debentures. Further, the board has approved the appointment of Harsh Baweja as Director (Finance) (as Additional Director) and Chief Financial Officer of the company, with effect from May 14, 2024.Canara BankThe bank has received approval for initiating the process of diluting a 14.50% stake in its subsidiary Canara HSBC Life Insurance Company by listing it on stock exchanges through an initial public offer (IPO). This will be subject to the approval of the Reserve Bank of India and the Government of India.PNC InfratechSubsidiary PNC Kanpur Highways has received Rs 390.62 crore from NHAI. This is part of the Settlement Agreement executed by the National Highways Authority of India and PNC Kanpur Highways due to a one-time settlement under the Vivad Se Vishwas II Scheme of the Government of India.Rossari BiotechThe company has incorporated its wholly-owned subsidiary Rossari Global DMCC in Dubai. DMCC is the Dubai Multi Commodities Centre.Punjab National BankThe public sector lender has increased its marginal cost of funds-based lending rate by 5 bps on 3-month to 3-year tenures, with effect from June 1.Indian BankThe state-run bank has raised its marginal cost of funds-based lending rate by 5 bps on its 3-month to 1-year tenures, with effect from June 3.Vilas TranscoreThe company will make its debut on the NSE Emerge on June 3. The issue price has been fixed at Rs 147 per share. Its equity shares will be available in the Trade-for-Trade Surveillance Segment.Cartrade TechForeign investor CMDB II sold 18,76,059 equity shares (equivalent to 4% of paid-up equity) in the company at an average price of Rs 900 per share. However, TT Emerging Markets Unconstrained Fund bought 5,46,012 equity shares (equivalent to 1.16% of paid-up equity) in Cartrade at the same price.\n       ",
    "Coal India recorded a significant 7.5 percent rise in production, with offtake rising 7.2 percent in May.According to a press statement released on June 1, coal production reached 64.5 million tonnes (MT), compared to 59.9 MT last year. Coal offtake increased to 68.2 MT from 63.7 MT in this period.The company also informed that executive director (L&R) Sanjay Khare has stepped down on reaching his retirement age on May 31.On May 20, the Coal Ministry revealed that India's total coal stockpile, both at pit-heads and in transit to thermal power plants (TPPs), zoomed 25 percent to 147 MT as of May 15, representing a significant increase from the 117 MT recorded last year. The stockpile at TPPs stood at 45 MT, reflecting a remarkable 29 percent surge from 34.83 MT last year.Coal India Limited boasted of a pithead stock of 85 MT. This figure marks a notable 30 percent rise from the previous year.\n       ",
    "State-owned Coal India on Tuesday announced the incorporation of a subsidiary firm, Bharat Coal Gasification and Chemicals Ltd (BCGCL) for undertaking a coal-to-chemicals business.Coal India (CIL) holds a majority 51 per cent stake in the new entity while the remaining 49 per cent is owned by BHEL, the coal behemoth informed the BSE. Coal India in February signed a joint venture agreement with Bharat Heavy Electricals Ltd (BHEL) for undertaking a coal-to-chemicals business.Clearance of NITI Aayog and the Department of Investment and Public Asset Management (DIPAM) has been received for the formation of the joint venture company between BHEL and CIL, the filing said. \"Bharat Coal Gasification & Chemicals Ltd has been incorporated…for coal to chemicals business to produce ammonia and nitric acid as intermediate products and ammonium nitrate as end product,\" the filing said.Meanwhile, CIL had signed a Memorandum of Understanding (MoU) with GAIL for setting up of coal-to-synthetic natural gas project at Sonepur Bazari area of Eastern Coalfields Limited (ECL) in Burdwan district at an estimated project cost of Rs 13,052 crore. Coal India accounts for over 80 per cent of domestic coal output.\n       ",
    "Equity benchmarks - Nifty 50 and BSE Sensex - outperformed the Bank Nifty and closed the session higher on May 22, with approximately 1,146 equity shares declining and 1,107 shares advancing on the NSE. Despite elevated volatility, the market is expected to maintain an upward journey in the coming sessions, along with intermittent consolidation. Here are some trading ideas for the near term.Vidnyan Sawant, HOD - Research at GEPL CapitalHEG | CMP: Rs 2,687HEG has displayed a robust price structure following a breakout from a 7-month congestion zone in April 2024. Since then, the stock has consistently shown upward movement. Recently, it witnessed a breakout from a 4-week inside bar pattern, continuing its upward trajectory.Despite current market turbulence, HEG has managed to sustain above its key 20-day EMA (exponential moving average), showcasing high relative strength.The stock is trading above key 12-week and 26-week moving averages, indicating a positive trend. Furthermore, the MACD (Moving Average Convergence Divergence) study shows rising momentum in positive territory, reinforcing the trend's strength.Looking ahead, we anticipate further upward movement in prices, targeting a level around Rs 3,282. However, it's essential to monitor the Rs 2,474 level closely; sustained price action below this point could invalidate the bullish outlook.Strategy: BuyTarget: Rs 3,282Stop-Loss: Rs 2,474Coal India | CMP: Rs 502Coal India's price structure displays resilience, with a clear uptrend since October 2020, consistently forming higher highs and higher lows.On a weekly scale, the stock demonstrates notable relative strength compared to the broader market. This week, it broke out of a 14-week consolidation, indicating a continuation of its rising trend.The stock has well sustained above key averages like the 12-week and 26-week EMA, denoting a bullish trend. The RSI shows a bullish cross and stands at 70, indicating robust bullish momentum.Looking forward, we anticipate further upward movement in prices, with a target level around Rs 586. However, it's essential to monitor Rs 461 levels closely; sustained price action below this point could invalidate the bullish outlook.Strategy: BuyTarget: Rs 586Stop-Loss: Rs 461Olectra Greentech | CMP: Rs 1,794Since its 2020 low, the stock has exhibited a classic technical uptrend, consistently forming a classical upward structure. Following each rally, the stock has undergone healthy retracements, and subsequent breakouts have continued to drive rising momentum.Zooming in on recent price action, the stock is on the verge of a triangular pattern breakout. Its recovery from a triple bottom formation on the daily chart indicates an improvement in the trend.On the weekly scale, the stock has been forming a base near the 34-week EMA. Additionally, the stochastic study shows a positive cross, denoting bullish momentum.Looking ahead, we anticipate continued upward movement in the stock, with a potential target price of Rs 2,160. To manage risk effectively, it's advisable to set a stop-loss at Rs 1,656 on a closing basis.Strategy: BuyTarget: Rs 2,160Stop-Loss: Rs 1,656General Insurance Corporation of India | CMP: Rs 379.3General Insurance Corporation of India (GICRE) has been in a significant uptrend since reaching a low in March 2023. The stock experienced a breakout from a saucer pattern, which had been forming since October 2019, with volume confirmation. It hit a multi-year high at Rs 467 in February 2024, followed by a correction to Rs 310, where it established a Change in Polarity (CIP) formation, signaling a strong bullish undertone for the medium to long term.In the most recent week, GICRE broke out of a ten-week consolidation and remained above its 20-week SMA, affirming the strength of the uptrend. Rising volumes on every positive move suggest strong participation in the bullish trend.Additionally, the momentum indicator, RSI, is sustaining above 60 and moving upward on the weekly charts, indicating a trend supported by momentum.Looking ahead, further upward movement in prices is anticipated, targeting around Rs 465. However, it's crucial to monitor Rs 320 levels closely, as sustained price action below this point could invalidate the bullish outlook.Strategy: BuyTarget: Rs 465Stop-Loss: Rs 320Shitij Gandhi, Senior Research Analyst (Technicals) at SMC GlobalCipla | CMP: Rs 1,482.3Cipla has been seen trading in a downward-sloping channel and managed to find support near its 200-day exponential moving average (DEMA) on daily charts. The stock formed a Double Bottom pattern around Rs 1,330 levels, indicating a resurgence of bullish momentum thereafter. At the current juncture, the stock has given a fresh breakout above its declining channel. The rise in volumes, along with price action, suggests further upside potential for the stock. Therefore, one can buy/hold/accumulate the stock for the expected upside target of Rs 1,580-1,600 levels, with a downside support zone of Rs 1,440-1,450 levels.Strategy: BuyTarget: Rs 1,580, 1,600Stop-Loss: Rs 1,380Cholamandalam Investment and Finance Company | CMP: Rs 1,270In the last three months, Cholamandalam Investment has staged an impressive recovery from its 52-week low, experiencing a remarkable rally from Rs 1,000 levels to reach a 52-week high of Rs 1,352.60 in a short span. However, it recently underwent a correction phase over the past two weeks, retracing to around Rs 1,230 levels due to profit booking.Nevertheless, there has been a recent breakout above the symmetrical triangle pattern on the daily charts, indicating renewed momentum. With rising volumes and positive divergences on secondary oscillators, the stock is poised for further upside. Therefore, one can buy/hold/accumulate the stock for the expected upside target of Rs 1,420-1,425 levels, with a downside support zone of Rs 1,240-1,230 levels.Strategy: BuyTarget: Rs 1,400, 1,425Stop-Loss: Rs 1,175Divi's Laboratories | CMP: Rs 4,058.55Following a bounce off its 200-day exponential moving average (DEMA) on the daily chart, Divis Labs displayed a notable resurgence, surging from Rs 3,650 to Rs 4,100 within a brief period. Nonetheless, profit-taking activities caused the stock to retrace towards the Rs 3,750 mark in recent times, initiating a consolidation phase.Presently, the stock has marked a fresh breakout above the symmetrical triangle pattern on the daily timeframe, complemented by positive divergences observed on secondary oscillators. Therefore, one can buy/hold/accumulate the stock for the expected upside target of Rs 4,450-4,500 levels, with a downside support zone of Rs 3,980-4,000 levels.Strategy: BuyTarget: Rs 4,450/4,500Stop-Loss: Rs 3,800Kunal Shah, Senior Technical & Derivative Analyst at LKP SecuritiesInfosys | CMP: Rs 1,454.8Infosys is on the verge of a breakout from a significant consolidation phase, with notable buying observed at lower levels within this phase. It has surpassed its short-term moving average of 20DMA with volumes, confirming a bullish undertone. The stock is likely to test its 20DMA, placed at Rs 1,500, and a sustained move above this level can open the gates for further upside.Strategy: BuyTarget: Rs 1480, 1,510Stop-Loss: Rs 1,420Emami | CMP: Rs 535Emami has formed a Bullish Flag and Pole pattern on the daily chart, confirming a bullish setup. The momentum indicator RSI has given a positive crossover above the level of 60, reinforcing the buy signal. Additionally, the stock has surpassed its 20DMA with increased volumes, indicating active and dominant buyers.Strategy: BuyTarget: Rs 560, 580Stop-Loss: Rs 500Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Motilal Oswal's research report on Coal India4QFY24 revenue stood at INR374b (-2% YoY/+4% QoQ), in line with our est. of INR376b. Blended ASP was INR1,699/t (-9% YoY/-2% QoQ), largely in line with our estimate. Adj. EBITDA (net of OBR) stood at INR98b (+14% YoY/-17% QoQ) in 4Q, in line with our est. of INR95b. EBITDA/t stood at INR488 (+6% YoY/-22% QoQ), vs. our est. of INR 472, as lower costs led to improvement in operating performance.OutlookCOAL supplies 90% of its production to the power sector (including CPPs) and thermal power accounts for +80% of total power generated in India. To meet the increasing coal requirements of the power sector, COAL has made a long-term commitment via FSA agreements and BLCs. It targets to achieve a production of 838mt in FY25, with dispatches under e-auction at 15% of total volumes. With a robust volume outlook, healthy e-auction premiums, and lower costs, the outlook for COAL remains positive. We maintain our revenue/EBITDA estimates for FY25/FY26. The stock is trading at 4.4x FY26E EV/EBTIDA. We reiterate our BUY rating with a revised TP of INR 530 per share, valuing the stock at 5.3x FY26E EV/EBITDA. COAL remains our top pick in the metals and mining sector.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Motilal_COAL080524 ",
    "Given the cautious mood after the consistent upward journey of the volatility index and Bearish Engulfing candlestick pattern formation on the daily charts, 22,300—the low of the big bullish candle of April 25—is expected to be a key level to watch for a further downside in the Nifty 50.On the higher side, in case there is a rebound, the index may face resistance at the 22,600-22,650 level, experts said.On May 3, the Nifty 50 fell 172 points to close at 22,476 after hitting an all-time high intraday. The BSE Sensex was down 733 points at 73,878, while the selling pressure was lower in the broader markets as the Nifty Midcap 100 and Smallcap 100 indices fell 0.4 percent and 0.5 percent, respectively.Stocks that bucked the market trend last Friday include Coal India, Blue Dart Express, and Grasim Industries. Coal India saw a decisive breakout of the consolidation seen in the previous four days as well as a breakout from the falling resistance trendline, with trading above all key moving averages, in a positive sign. The stock rallied 4.6 percent to Rs 474.60 on the NSE and formed a long bullish candlestick pattern on the daily charts with significantly higher volumes.Blue Dart Express has also seen a consolidation breakout, with trading above all key moving averages. It surged 9.3 percent to Rs 6,821.5, the highest closing level since January 24 this year. The stock has formed a robust bullish candlestick pattern on the daily charts with a multifold jump in volumes.Grasim Industries ended at a record closing high of Rs 2,481, up 1.81 percent, and formed a bullish candlestick pattern on the daily charts. Further, the stock traded above all key moving averages and continued its higher high, higher low formation with healthy volumes for three days in a row.Here's what Rajesh Palviya of Axis Securities recommends investors do with these stocks when the market resumes trading today:Coal IndiaWith three months of strong consolidation, the stock observed huge buying interest on May 3. It has surpassed the \"multiple resistance\" zone at the Rs 465 level along with huge volumes. This volume spurt signifies increased participation.The stock has recaptured the 20-day SMA (simple moving average: Rs 449) and 50-day SMA (Rs 443) and rebounded sharply, which reconfirms the short-term bullish trend.The daily, weekly and monthly strength indicator RSI (relative strength index) is in positive terrain, which signals rising strength. The daily \"Bollinger band\" buy signal indicates increased momentum.Investors should buy, hold and accumulate this stock with an expected upside of Rs 500-525, with the downside support zone at the Rs 460-450 level.Blue Dart ExpressOn the daily timeframe, the stock has decisively broken out of an \"Inverse Head & Shoulder'' trend reversal pattern around the Rs 6,500 level. The positive crossover of the 20- and 50-day SMA signifies a short and medium-term bullish trend. This breakout is being accompanied by huge volumes, indicating increased participation.The daily, weekly and monthly strength indicator RSI is in positive terrain, which justifies the rising strength across all the time frames. The daily \"Bollinger band\" buy signal indicates increased momentum.Investors should buy, hold and accumulate this stock with an expected upside of Rs 7,100-7,385, with the downside support zone at the Rs 6,500-6,400 level.Grasim IndustriesThe stock is in a strong uptrend across all the time frames, forming a series of higher tops and bottoms, indicating a positive bias. The stock is well placed above its 20-, 50-, 100- and 200-day SMA, and these averages are also inching up with the price rise, which reconfirms the bullish trend.The daily and weekly strength indicator RSI is in positive terrain, which signals rising strength. The daily and weekly \"Bollinger band\" buy signal indicates increased momentum.Rising volumes on each rally signify increased participation. The stock has also registered an all-time high at Rs 2,487, indicating bullish sentiments.Investors should buy, hold and accumulate this stock with an expected upside of Rs 2,600-2,720, with the downside support zone at the Rs 2,400-2,320 level.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "\"It would be very difficult for Nifty 50 to surpass Friday’s high of 22,795, in the coming week. Even if it does then we expect 22,900 – 22,950 to be a very strong hurdle,\" Mehul Kothari, DVP – Technical Research at Anand Rathi Shares & Stock Brokers, said in an interview to Moneycontrol.Along with the trendline breakout, Coal India has also confirmed an ascending triangle breakout above Rs 465 mark. Hence, the stock is poised for a new life high above Rs 482, he believes.Kothari, who has around 15 years of work experience in technical research, is bullish on Balrampur Chini Mills and DCM Shriram for the coming week.Technically are you bullish on Coal India that has seen a resistance trendline breakout?Along with the trendline breakout, Coal India has also confirmed an ascending triangle breakout above the Rs 465 mark. Hence, the stock seems to be poised for a new life high above Rs 482. However, the theoretical target for the pattern stands around Rs 500 and more whereas the support is placed at Rs 450.Do you expect BHEL to hit record high of around Rs 400 in the coming weeks?That would be too much to ask for in a short-term time frame. It is because BHEL has rallied non-stop over the past five quarters. Since the year 2023 the stock has rallied almost 5X from the low of Rs 66. Thus, we expect some profit booking post-election in this stock. For long term, the view remains positive.Do you think the Nifty is likely to give a breakout of current consolidation on the higher side and surpass the 23,000 mark next week?It would be very difficult for Nifty 50 to surpass Friday’s high of 22,795. Even if it does then we expect 22,900 – 22,950 to be a very strong hurdle since that is the higher end of rising channel, which Nifty is respecting for the last many months.Even the Nifty Bank index seems to have made a short-term top near that 50,000 milestone. Thus, without the participation of banking stocks it would be a real test for the bulls in the coming week. On the downside, immediate support is placed at Friday's low of 22,348 followed by the 22,200 mark.Is it better to stay away from Nifty IT index for the time being or is it the right time to take exposure to the space?The index has already corrected around 15 percent in past one and a half month and there is no confirmation as of now for a bounce.For the coming week, 31,900 can be the next support for the index which is a 78.6 percent retracement of the previous move. On the upside, bounce would get confirmed only above 34,300.Your top 2 bets for next week?Balrampur Chini MillsDuring the week there was an important range breakout in Balrampur Chini above the Rs 396 mark. Along with breaking the range, the stock also confirmed a trendline breakout above the placement of its 200 DEMA (days exponential moving average).Due to the selloff in the markets, the stock has again retested the breakout zone and looks lucrative for long with a short-term time frame.Thus, we advise traders to go long in the stock near Rs 390 with a stop-loss of Rs 379 for the upside target of Rs 412 in the coming week.DCM ShriramAs of now the stock is consolidating just above its 200 DEMA after a rally from Rs 900 levels. There will be a price breakout above Rs 982, which would confirm a bullish FLAG pattern.Above Rs 987, even an Inverse Head and Shoulder pattern would get confirmed.Thus, we advise traders to go long in the stock above Rs 982 with a stop-loss of Rs 950 for the upside target of Rs 1,045 in the coming one to three weeks.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Emkay Global Financial's research report on Coal IndiaCoal India’s headline EPS was ahead of our estimates owing to change in accounting policy for stripping activity that resulted in positive restatement of earnings. Excluding the effects of changes in stripping the accounting policy translates into softer than expected results for Q4. Net sales of Rs343bn are in line with our estimate of Rs346bn. e-Auction premiums for Q4 averaged at 65.7%, beating our expectations of 45-50%. However, full-year employee cost came in at Rs488bn, higher than Mgmt guidance.OutlookWith the premiums sustaining at ~65% levels, we expect concerns around declining premiums alleviating to some extent, and see potential for upgrades to consensus earnings. We maintain our estimates for now, as we sense that the market would seek more clarity on accounting treatment from the management. (BUY; TP: Rs550/sh).For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Coal India - 03052024 - emkay ",
    "Net Sales at Rs 37,410.39 crore in March 2024 down 1.94% from Rs. 38,152.34 crore in March 2023.Quarterly Net Profit at Rs. 8,682.20 crore in March 2024 up 56.91% from Rs. 5,533.23 crore in March 2023.EBITDA stands at Rs. 13,581.71 crore in March 2024 up 49.12% from Rs. 9,108.16 crore in March 2023.Coal India EPS has increased to Rs. 14.09 in March 2024 from Rs. 8.98 in March 2023.Coal India shares closed at 453.90 on May 02, 2024 (NSE) and has given 44.30% returns over the last 6 months and 92.25% over the last 12 months.",
    "Shares of Coal India Limited (CIL) gained over 2 percent on May 3 even as the company's earnings for the quarter ended March 2024 missed Street estimates.Despite the disappointing earnings, brokerages maintained 'buy' rating on the stock as they believe that coal remains the dominant fuel in the foreseeable future even as the world is trying to switch to renewable energy.However, target prices were cut on concerns around declining premiums.In Q4FY24, Coal India's net profit rose 26 percent YoY to Rs 8,640.5 crore due to cost efficiency and benefits from changes in accounting for stripping activities for open-cast mining. The state-run miner's revenue from operations rose 2 percent to Rs 37,410.4 crore.With Coal India's premiums sustaining at around 65 percent levels, analysts at Emkay expect concerns around declining premiums alleviating to some extent, see potential for upgrades to consensus earnings.Follow our market blog to catch all the live action\"We maintain our estimates for now, as we sense that the market would seek more clarity on accounting treatment from the management,\" said Emkay as it maintained 'buy' rating on the stock with a target price of Rs 550 per share.Amid disruption in supply of natural gas from Russia; the demand has shifted to coal as an alternative. Domestically, power demand is on the rise due to increased industrial activities, noted Nuvama. The brokerage expects Coal India's volume to increase at 5 percent CAGR of over FY24-26 to 831 mt.\"CIL is on its way to increasing its production and evacuation facilities to 1 bn tonnes by FY28. On account of sustained high coal demand, E-auction prices are likely to normalise in FY25,\" it said as it maintained 'buy' rating on the stock but cut the target price to Rs 537 per share.Jefferies also has a 'buy' rating on Coal India stock with a target price of Rs 520 per share.Also Read | Coal India Standalone March 2024 Net Sales at Rs 488.05 crore, down 4.12% Y-o-YAt 9:47 am, Coal India shares were trading marginally lower at Rs 453.40 on the National Stock Exchange (NSE). So far this year, the stock has risen 18 percent, outperforming benchmark Nifty 50 which has risen 4.7 percent during this period.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "HighlightsCoal India (CIL, CMP: Rs 454; Market capitalisation: Rs 279,726 crore; Rating: Overweight) has posted a modest drop in the top line in Q4FY24. However, the long-term story of the coal major remains intact as enhanced thermal power, to meet increased electricity demand, will support\n                                    ",
    "Net Sales at Rs 488.05 crore in March 2024 down 4.12% from Rs. 509.04 crore in March 2023.Quarterly Net Profit at Rs. 3,336.22 crore in March 2024 up 6.31% from Rs. 3,138.26 crore in March 2023.EBITDA stands at Rs. 3,437.12 crore in March 2024 up 5.24% from Rs. 3,266.05 crore in March 2023.Coal India EPS has increased to Rs. 5.41 in March 2024 from Rs. 5.09 in March 2023.Coal India shares closed at 453.90 on May 02, 2024 (NSE) and has given 44.30% returns over the last 6 months and 92.25% over the last 12 months.",
    "Coal India expects demand for coal to remain robust across all sectors as India's peak electricity demand is likely to touch 256.5 GW in 2024 from a record 243 GW in 2023.Coal India has set a target to produce 838 million tons (MT) of coal in the financial year 2024-25, of which 661 MT will be supplied to the power sector alone, the state-owned company's chairman and managing director (CMD) PM Prasad had said in February 2024.\"Earlier, the target for Coal India was 850 MT. But currently, there are huge coal stocks at thermal power plants (TPPs) because of which the ministry has revised our production target to 838 MT for FY25. That said, if the power demand increases substantially, Coal India will still be in a good position to produce more than the said target,\" Prasad said in a post- earnings conference call for the third quarter of FY24.ALSO READ: Coal India Q4 results: Sales volume grows 10% in FY24 to 773.64 MTOf the 838 MT, 661 MT will be for the power sector (regulated sector),while the balance 177 MT will go to the non-regulated sector.In April 2024, Coal India achieved production of 61.78 MT (provisional), registering a growth of 7.31 percent compared to the same period last year when it was 57.57 MT.Additionally, coal production by captive/others last month stood at 11.43 MT (provisional), showing a growth of 12.99 percent from the previous year, which was 10.12 MT.The country's coal dispatch in April rose to 85.10 MT (provisional) against 80.23 MT in April last fiscal year.Coal India accounts for over 80 percent of domestic coal output.India is stepping up coal-fired generation capacity as peak electricity demand is likely to touch 256.5 GW in 2024 from a record 243 GW in 2023. Government officials expect electricity demand to surge to a high of 384 GW in 2031-2032.To meet the sharp rise in India's power demand, the government has had to rely on imported coal so as to ease the pressure on domestic coal. On December 6, 2023, Singh said despite the country reeling under a shortage of domestic coal, widespread power cuts and blackouts were averted in September 2022 because of the government's mandate of using imported coal for blending at thermal power plants.On May 2, Coal India's shares on BSE closed trading 0.5 percent lower at Rs 452 apiece. \n       ",
    "The total consolidated sales volume of Coal India in the fiscal year 2023-24 climbed by 10 percent to 773.64 million tonnes, as per the data shared by the company with the stock exchanges on May 2.In FY23, the company's consolidated sales volume stood at 753.54 MT.Coal India also noted that its overall sales volume in the fourth quarter of FY24 came in at 241.75 MT, which was eight percent higher as compared to 201.65 MT recorded in the year-ago period.The Q4 numbers also mark a 21.5 percent sequential growth, as the total sales in the preceding quarter stood at 199 MT.The company’s coal supplies shot up to 201.6 MTs in the Q4 FY 2023-24, up by eight percent compared to 186.9 MTs of the corresponding quarter in FY 2023. This gave the heft to the company’s profitability.In February 2024, the state-owned company's Chairman and Managing Director (CMD) PM Prasad said that Coal India has set a target to produce 838 million tons (MT) of coal in the financial year 2024-25, of which 661 MT will be supplied to the power sector alone.India is stepping up coal-fired generation capacity as peak electricity demand is likely to touch 256.5 GW in 2024 from a record 243 GW in 2023. Government officials expect electricity demand to surge to a high of 384 GW in 2031-2032.To meet the sharp rise in India's power demand, the government has had to rely on imported coal so as to ease the pressure on domestic coal. On December 6, 2023, Singh said despite the country reeling under a shortage of domestic coal, widespread power cuts and blackouts were averted in September 2022 because of the government's mandate of using imported coal for blending at thermal power plants.On May 2, Coal India's shares on BSE closed trading 0.5 percent lower at Rs 452 apiece.The state-owned company also said that the board has declared its third interim dividend for financial year 2023-24 at Rs 5 per share.This was in addition to the interim dividend of Rs 20.50 per share CIL had already paid earlier in the fiscal. Thus, the total dividend for the fiscal climbs to Rs 25.50 per share, which is 255 percent of face value of a single share.Coal India on May 2 reported 26 percent rise in consolidated net profit at Rs 8,640.5 crore for the quarter ended March 31, 2024. The government-owned company had reported a net profit of Rs 6,869.5 crore in the year-ago period.There was rise in CIL's bottom line despite its revenue from operations falling nearly 2 percent to Rs 37,410.4 crore in the quarter under review from Rs 38,152.3 crore in the same quarter last year.Moreover, CIL’s consolidated sales also fell to Rs 39,654.4 crore in the January-March period from Rs 40,371.5 in the corresponding period of the previous fiscal year, a decrease of 1.8 percent.\n       ",
    "Coal India posted a 26 percent surge in net profit in the fourth quarter of FY24, slightly below estimates, as the company's revenue from operations fell nearly two percent in a seasonally weak January-March quarter.Despite the fall in its revenues, Coal India's net profit climbed to Rs 8,640.5 crore in the three months ended March 31 from Rs 6,869.5 crore a year earlier, beating estimates of Rs 7,617 crore.Here are the key highlights from the fourth quarter and full year results of Coal India:Q4 and FY24 numbers:Consolidated net sales at Rs 39,654.5 crore recorded a fall of 1.8 percent versus Rs 40,371.5 crore in the corresponding period of the previous yearProfit after tax was Rs 8,640.5 crore compared to Rs 6,869.5 crore in the corresponding period of the previous year, registering a rise ofnearly 26 percent.FY24 consolidated net sales was up 3.8 percent at Rs 1.5 lakh crore from Rs. nearly 1.45 lakh crore last year. FY24 profit after tax was Rs 37,369 crore, a jump of 18 percent as compared to Rs 31,723 crore in FY23.ProductionCoal India's production of raw coal during FY24 rose to 773.647 million tonnes, up 10 percent when compared to FY23.The Public Sector Undertakings' (PSU) offtake for FY24 stood at 753.541 million tonnes, up 8.5 percent when compared to FY23.Coal India has set a target to produce 838 million tons (MT) of coal in the financial year 2024-25, of which 661 MT will be supplied to the power sector alone, the state-owned company's Chairman and Managing Director (CMD) PM Prasad had said in February.Capacity Additions:India plans to continue expanding its coal production capacity beyond the stated target of doubling it by 2030, prioritising its needs over mounting global pressure to cut the use of fossil fuels.In an exclusive interview to Moneycontrol, Minister for Coal, Mines and Parliamentary Affairs, Pralhad Joshi, said the government will continue increasing coal production even beyond 2030 given the steep surge in the country’s power demand projected for the coming years.“There is no question of any reduction in coal production after 2030. For the next 40 years at least, coal is going to stay (as a key energy source) in India,” Joshi added.Coal accounts for about three-quarters of India’s power generation and its demand is seen to be rising despite the country’s renewables plans. India has seen spikes in peak demand for electricity in the last two years, even as it has struggled to add renewable energy capacity in line with its goal of 500 gigawatts (GW) of non-fossil fuel capacity by 2030.\n       ",
    "Coal India Ltd (CIL) on May 2 reported 26 percent rise in consolidated net profit at Rs 8,640.5 crore for the quarter ended March 31, 2024. The government-owned company had reported a net profit of Rs 6,869.5 crore in the year-ago period.There was rise in CIL's bottom line despite its revenue from operations falling nearly 2 percent to Rs 37,410.4 crore in the quarter under review from Rs 38,152.3 crore in the same quarter last year.Moreover, CIL’s consolidated sales also fell to Rs 39,654.4 crore in the January-March period from Rs 40,371.5 in the corresponding period of the previous fiscal year, a decrease of 1.8 percent.The state-owned company also said that the board has declared its third interim dividend for financial year 2023-24 at Rs 5 per share.This was in addition to the interim dividend of Rs 20.50 per share CIL had already paid earlier in the fiscal. Thus, the total dividend for the fiscal climbs to Rs 25.50 per share which is 255 percent of face value of a single share.According to consensus estimates of 11 brokerages, the Public sector undertakings' (PSU) revenue for Q4FY24 is expected to increase by 8.7 percent to Rs 38,152 crore as against Rs 35,092 crore in Q4FY23. PAT, on the other hand, is expected to increase by 27 percent to Rs 7,617 crore from Rs 5,533 crore in Q4FY23, but is expected to decline on a QoQ basis.Coal India slightly missed analyst expectations regarding its topline but surpassed expectations in terms of its bottom line in the January-March quarter.On May 2, Coal India's shares on BSE closed trading 0.5 percent lower at Rs 452 apiece.The company's earnings before interest, tax, depreciation, and amortisation (EBITDA) rose percent to Rs 13,656.1 crore in the fourth quarter of this fiscal year over Rs 11,624.1 crore in the year-ago period. The EBITDA margin stood at 36.5 percent in the reporting quarter compared to 30.5 percent in the corresponding period of the previous fiscal.Coal India Ltd accounts for over 80 percent of domestic coal output.The company said raw coal production was at 241.751 million tonnes during the quarter, up from 224.16 million tonnes in the comparable quarter last year.Offtake of raw coal stood at 201.665 million tonnes against 186.877 million tonnes in the year-ago quarter.Employee benefit expenses fell 20.3 percent YoY to Rs 13,536.2 crore compared to Rs 16983.82 crore a year ago. Contractual expenses jumped 15.7 percent from a year ago to Rs 8,145.6 crore up from Rs 7,039.5 crore. Finance cost advanced 19 percent YoY to Rs 232.2 crore from Rs 195.07 crore a year ago.Additionally, higher volume sales by 8.5 MTs despite lower average realization under FSA resulted in a net impact of around Rs 1,066.5 crores in Q4. FSA sales increased to 175.94 MTs in Q4 FY’24 compared to 167.45 MTs in the preceding fiscal’s Q4, with a realization per tonne of coal under FSA category of Rs. 1,535.5, a fall of 1 percent, compared to Rs 1,550 per tonne in Q4 FY’23. For FY24, the realization per tonne of coal under e-auction was Rs 2,545.01, which is a significant decrease from Rs 4,525.69 per tonne in corresponding quarter last year.\n       ",
    "Coal India will be announcing its Q4FY24 earnings on May 2. According to consensus estimates of 11 brokerages, the PSU firm's revenue for Q4FY24 is expected to increase by 8.7 percent to Rs 38,152 crore as against Rs 35,092 crore in Q4FY23. PAT, on the other hand, is expected to increase by 27 percent to Rs 7,617 crore from Rs 5,533 crore in Q4FY23, but is expected to decline on a QoQ basis. EBITDA for the reporting period is also expected to increase by around 45 percent YoY to Rs 10, 132 crore as against Rs 6,898 crore in Q4FY24, but decline on a QoQ basis by around 11 percent.Axis Securities analysts expect the higher total sales off take along with e-auction volumes to offset the drop from lower e-auction premiums, leading to higher revenue QoQ. Additionally, they expect adjusted EBITDA (excluding OBR) to increase by 26 percent YoY, driven by higher overall coal off-take. However, they expect adjusted EBITDA to decrease by 6.5 percent QoQ, due to slightly higher input costs in Q4FY24.In  March 5 report, Nuvama analysts said that while the stock price had recently corrected amid fears of e-auction prices cooling off, they infer that a rise in e-auction volume compensated for the fall in e-auction prices and as a result, profit from e-auction volume remained firm in the last four months, which is positive.ICICI Securities analysts expect the QoQ performance to be impacted by lower e-auction premium. But added there is likely to be an upside to their estimates as performance incentive in Q4FY24 might be higher than their estimate of Rs 7,000 crore. \"Expect manpower cost to remain stable,\" the brokerage added.Additionally, they believe that e-auction prices have bottomed out at 39 percent premium in February 2024. \"Coal India is on course to meet our volume estimate of 752mt in FY2024 and can possibly grow better-than-expected 5 percent YoY growth in FY2025E,\" the report added.Emkay Global, which initiated coverage on the stock on March 26 with a buy call, stated that Coal India was embarking on a multi-year value-creation journey with volume growth, strong margins, and free cash generation. \"We believe the company will succeed with sustained high returns on invested capital along with volume growth until the end of the decade and expect the stock to re-rate on a multi-year view,\" the report added.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "World's largest coal producer Coal India may be staring at a massive demand shortfall going forward, according to an internal assessment report prepared by the Coal Ministry, which has been seen by CNBC-Awaaz. Assessment report has pegged the demand for coal from existing buyers to sharply drop by as much as 20 to 58 percent after 2 years, as the captive coal blocks with buyers begin production. Commenting on the report a senior coal ministry official, on the condition of anonymity, says, \"it will be challenging for Coal India to sustain the momentum of coal demand in future\"According to the assessment report prepared by ministry of coal, Coal India supplies a total of 691.26 MT coal to its top top 50 power and top 50 non-power buyers, many of them possess rights to total 404.56 MT worth of coal capacity as captive mines.Commenting of the assessment report a senior Coal Ministry official says ''Few of them have started production from their captive coal block but after around two to three years coal production from their captive coal block will start to peak rated capacity (PRC).\"Report finds top 50 power sector buyers bought 614.24 million ton coal from Coal India in 2022-23. Out of these, 19 power buyers got their own captive coal block, which total PRC is 242.24 million ton. Its includes captive block of NTPC and its subsidiaries of toal 45.72 million ton PRC, Maharashtra state Power Generation Co's Gare Palma Sector-2 of 23.6 million ton PRC and Jindal Power's four block of Gare Palma and two block of Utkal of 42.62 million ton PRC.If we talk about top 50 buyers of Non Power sector they bought total 77.02 million ton coal from CIL in 2022-23. Out these top 50 buyers around 11 got their own captive coal blocks which includes Vedanta, Hindalco, Balco and other. These captive coal blocks have total PRC of 44.48 million ton, report says.\n       ",
    "Anand Rathi's research report on Coal IndiaThe largest pure-play coal producer globally, Coal India offers healthy volume assurance, catering to mounting coal demand from the power sector. Its focus on increasing FSA and e-auction volumes would be catalysts for a strong performance. The company has taken many costsaving measures, along with evacuation and infrastructure-improvement projects, expected to drive greater productivity.OutlookHence, with its focus on volume ramp-up and cost savings, we factor in 8.5%/13% sales volume/EBITDA CAGRs over FY24-26. The company has a prudent dividend policy and ahead a ~50% payout is expected. We, thus, initiate coverage on it with a Buy and a Rs.520 TP, 5.5x FY26e EV/ EBITDA.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Coal India - 22042024 - rec ",
    "Coal India Ltd is likely to report production of around 773.7 million tonnes (MT) for the 2023-24 fiscal, which will be close to a 10-per cent growth over last year, company sources said.However, it is expected to fall short of the target of 780 million tonnes. Coal offtake is expected to stay restricted to 753 million tonnes, nearly 90 per cent of the target of 780 million tonnes, they said. The miner will announce its production and offtake numbers later on Monday. The company’s dry fuel supplies to thermal power plants touched the 610.8-million tonne mark on Wednesday, surpassing the target for this sector.Coal India Chairman P M Prasad in a recent investor concall projected a shortfall in the wake of some land-related production hurdle in South Eastern Coalfields Ltd. All other subsidiaries, however, topped its targets. The largest coal producer in the world registered its highest-ever production of 703.2 MT in the 2022-23 fiscal.The target for the next fiscal year has been fixed at 838 MT, the sources said. According to projections, demand for coal is likely to go up from 1,180 million tonnes in 2023-24 to 1,464 million tonnes in 2029-30.\n       "
]