[
    "Shares of Divi's Labs surged 4.5 percent in the early trade on February 12 after the company reported an increase in its net profit and revenue for the third quarter along with an expansion in operating margins.Net profit rose 17 percent year-on-year to Rs 358 crore against Rs 306 crore in the same period last fiscal.Revenue also grew nearly 9 percent on-year to Rs 1,855 crore, up from Rs 1,708 crore in the year-ago period. The drugmaker's custom synthesis (CS) business has witnessed revival during the quarter, aided by two major contracts with innovator.However, its active pharmaceutical ingredient (API) business continues to be impacted by reduced pricing, which was offset higher volume off-take, brokerage firm Motilal Oswal Financial Services said in a note.At 10.25 am Divi's Labs was trading at Rs 3,725.70 on the NSE.Follow our market blog to catch all the live actionThe EBITDA margin also expanded to 26.4 percent against 24 percent in the base period.MOFSL also said the drugmaker is progressing well with respect to the CDMO opportunity for GLP-1 products. \"It is currently showcasing its capabilities to an innovator customer and also has capacity if required for this customer. Further, it is also working to add new molecules in API segment,\" the firm added.Despite that, MOFSL said the current valuation adequately captures any upside potential and hence maintains its “neutral” call on the stock with a price target of Rs 3,440.Nuvama Institutional Equities also acknowledges the promising opportunities (peptides, contrast media, custom synthesis projects, etc) and Kakinada expansion that could fuel Divi's future growth but also notes the uncertainty around it.The firm also seconded MOFSL's view on valuations pricing in the upside potential and hence retained its “reduce” call. However, Nuvama raised its price target for the stock by 4 percent to Rs 3,200 to factor in the Q3 earnings.Kotak Institutional Equities also said the risk of the pricing recovery in generic APIs being delayed, compared to its estimate of a revival in early FY25. On these elevated estimates, and rich valuations, Kotak maintained its “sell” call on the stock with a price target of Rs 3,025.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "The market ended in the negative territory but managed to recover from its intraday lows on January 2. The Nifty maintained its position above 21,600, while the Sensex experienced a decline of 379 points, closing at 71,892. The Nifty recorded a decrease of 82 points, settling at 21,660. The Nifty Bank lost 521 points to close at 47,713, and the Midcap Index slipped 73 points to 46,400.The Nifty is hovering near the resistance level at 21,800, with 21,550 serving as an immediate support. A drop below 21,550 could lead to profit-booking, targeting the 21,350 level. The market is anticipated to display sideways movement with increased volatility.In the case of Bank Nifty, it is encountering resistance at the 48,000 levels, while 47,400 acts as an immediate support. Further support levels include 47,200 and 47,000. On the upside, the immediate resistance area is 48,000–48,200, and surpassing this could lead to a target zone of 48,600.Here are three buy calls for short term:Divis Laboratories: Buy | LTP: Rs 4,030 | Stop-Loss: Rs 3,840 | Target: Rs 4,354 | Return: 8 percentThe counter has experienced a breakout of an Inverse Head and Shoulder pattern over a longer timeframe. The breakout is accompanied by significant trading volume and has closed above the breakout level, marking a significant milestone after a span of 16 months.The counter's overall structure is highly favorable, as it is currently trading above all its important moving averages. The RSI (relative strength index) shows positive momentum, and the MACD (moving average convergence divergence) supports the counter's current strength.On the higher side, Rs 4,200 is acting as an important psychological level; above this, we can expect a level of Rs 4,350+ in the near-short term. On the downside, if there is a correction, the major support level is identified at Rs 3,840.Shipping Corporation of India: Buy | LTP: Rs 174 | Stop-Loss: Rs 159 | Target: Rs 194 | Return: 12 percentThe counter is in a classical uptrend, and it has witnessed a breakout of a triangle formation to resume its uptrend. It retested its previous breakout level at Rs 155 and started a new leg of rally towards Rs 190. The breakout coincides with rising volume, and it manages to sustain itself above the breakout level.It is trading above its all-important moving averages, with a positive bias in momentum indicators.On the upside, Rs 180 is an immediate resistance area; above this, we can expect a run-up towards Rs 190+ levels in the near term. On the downside, Rs 159 levels will act as a strong support level. It is respecting its 9 and 20-DMA beautifully, which is a classic sign of trend strength.Paradeep Phosphates: Buy | LTP: Rs 76.80 | Stop-Loss: Rs 70 | Target: Rs 86 | Return: 12 percentThe counter has witnessed a breakout of a long consolidation pattern with strong volume on the weekly chart. It has also broken a Cup-and-Handle formation. The overall formation of the counter is very classical, as it is trading above its all-important moving averages with a positive bias in momentum indicators.On the upside, Rs 80 is an important psychological level; above this, we can expect a move towards Rs 86+. On the downside, a cluster of moving averages at around Rs 70 is a strong demand zone during any correction.Both the RSI (relative strength index) and MACD (moving average convergence divergence) indicators are supportive of the current strength of the stock's momentum.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "The market recorded 1.8 percent gains in the concluding week of 2023 and formed a long bullish candlestick pattern on the weekly charts after Doji sort of a candle formation in the previous week, indicating that bulls hold the strong position.Even the higher highs, higher lows continued week-after-week and the momentum indicators are showing positive bias, hence, experts expect the Nifty 50 to focus on 21,800-22,000 levels in the coming weeks after the ongoing consolidation, while taking support at 21,700-21,500 levels and advising buy-on-dips.The Nifty 50 ended at 21,731 on December 29, rising 8 percent for the month and 20 percent for the year.\"While maintaining a bullish outlook in the absence of weakness signs, it is advised not to adopt an aggressive stance. Instead, booking profits at higher levels is recommended. Any market dip should be viewed as a buying opportunity unless there are clear indications of a major price correction,\" Rajesh Bhosale, technical analyst at Angel One, said.He feels that immediate support is observed around 21,600, followed by 21,500, while strong support lies around the week's low around the 21,300 mark.Although prices are in an uncharted territory with no prominent resistance visible, 21,850 followed by 22,000 presents an immediate hurdle, considering the overbought conditions, he said.Jigar Patel, senior manager - equity research at Angel One, feels there may still be some room for further upside in the Nifty index, but it could potentially be the final phase of the rally, followed by heavy profit booking. He sees the next psychological hurdle for the Nifty at 22,000, followed by 22,400. \"These levels could indicate the beginning of a corrective move. Traders are advised to maintain a cautious approach with regards to long positions.\"Moneycontrol collated a list of top 10 stock ideas from experts with 3-4 weeks perspective. The closing price of December 29 is considered for calculation of stock return:Expert: Omkar Patil, technical & derivatives analyst - institutional equity at Ashika GroupIRCTC: Buy | LTP: Rs 887.5 | Stop-Loss: Rs 855 | Target: Rs 970 | Return: 9 percentIn mid-December, the IRCTC (Indian Railway Catering & Tourism Corporation) stock broke out of a long consolidation period that had been forming since April 2022. This breakout was accompanied by increased trading volumes, indicating strong interest in the stock.After a brief consolidation, the stock has started to move up again, with volumes picking up, suggesting a continuation of the upward trend. The short-term average (12-day EMA - exponential moving average) provides additional support to the current uptrend.Going ahead we expect the prices to move higher till the mark of Rs 970 where the stop-loss must be Rs 855 on a daily closing basis.Deepak Nitrite: Buy | LTP: Rs 2,481.20 | Stop-Loss: Rs 2,390 | Target: Rs 2,720 | Return: 9.6 percentDeepak Nitrite stock has broken out from a solid base that was established between Rs 2,380-1,800 levels over the past year. The breakout, accompanied by substantial trading volumes. Additionally, the MACD (moving average convergence divergence) indicator has experienced a positive crossover above the zero-line, signaling the presence of positive momentum in the trend.Going ahead we expect the prices to move higher till the mark of Rs 2m720 where the stop-loss must be Rs 2,390 on a daily closing basis.Godrej Consumer Products: Buy | LTP: Rs 1,131.20 | Stop-Loss: Rs 1,090 | Target: Rs 1,225 | Return: 8.3 percentGodrej Consumer Products is on an upward trend, moving within an Ascending channel. The stock has recently broken out of a Rounding bottom pattern, marked by a rising Gap and increased trading volumes, confirming the breakout. The MACD rising above the zero line indicates the presence of positive momentum in the upward trend.Going ahead we expect the prices to move higher till the mark of Rs 1,225, where the stop-loss must be Rs 1,090 on a daily closing basis.Expert: Nagaraj Shetti, senior technical research analyst at HDFC SecuritiesVedanta: Buy | LTP: Rs 258.55 | Stop-Loss: Rs 240 | Target: Rs 282-307 | Return: 19 percentAfter breaking above the cluster resistance of Rs 252-253 levels in week before last, the metal stock - Vedanta has shifted into a consolidation. The positive chart pattern like higher tops and bottoms is intact and present consolidation is expected to be a buy on dips opportunity. The upside breakout of Inverted Head and Shoulder pattern is still intact, volume and momentum indicators are showing positive signal.Buying can be initiated in Vedanta at CMP (Rs 258.55), add more on dips down to Rs 249, wait for the upside targets of Rs 282 and Rs 307 in the next 3-5 weeks. Place a stop-loss of Rs 240.Divis Laboratories: Buy | LTP: Rs 3,903.9 | Stop-Loss: Rs 3,680 | Targets: Rs 4,225-4,370 | Return: 12 percentThe stock price has witnessed a sustainable upside bounce this week, after showing a consolidation pattern in the last few weeks. Currently, the stock price is in an attempt of upside breakout of the hurdle at Rs 3,900 levels. Hence, a sustainable move above this hurdle is expected to be a decisive upside breakout of the hurdle for near term. Volume has started to expand and weekly RSI (relative strength index) shows positive indication.Buying can be initiated in Divis Labs at CMP (Rs 3,903.9), add more on dips down to Rs 3,800, wait for the upside targets of Rs 4,225 and Rs 4,370 in the next 3-5 weeks. Place a stop-loss of Rs 3,680.Expert: Om Mehra, technical analyst at SAMCO SecuritiesMarico: Buy | LTP: Rs 548.5 | Stop-Loss: Rs 532 | Target: Rs 580 | Return: 6 percentThe stock has recently emerged from a period of consolidation marked by higher volumes. Notably, the current price comfortably trades above the 20-day and 50-day moving averages, signaling a positive trend. The RSI is on an upward trajectory and is steady above the 60 level indicating sustained buying interest.Moreover, a Double Bottom pattern emerged confirming positive price action. Previously, the stock encountered strong resistance at Rs 547 levels and now it is exhibiting strength suggesting a potential breakout.Marico is trading at CMP Rs 548.5 and we anticipate that the stock to scale higher towards Rs 580. Stop-Loss can be kept at Rs 532.Torrent Power: Buy | LTP: Rs 933.85 | Stop-Loss: Rs 880 | Target: Rs 1,030 | Return: 10 percentThe stock has consistently formed higher highs and higher lows in the weekly timeframe indicating that the primary trend remains bullish. Following a minor pullback, the stock has resumed its upward movement, accompanied by significant trading volumes. The stock continues to trade above the critical Rs 915–920 support zone.The RSI is trading above 65 levels, and the moving average convergence divergence (MACD) has risen above the signal line providing bullish signals. Additionally, there has been a notable increase in delivery volume up by 32.37 percent compared to the 5-day average.Hence, based on the above technical structure, one can initiate a long position at CMP Rs 933.85 for a target price of Rs 1,030. Stop-loss can be kept at Rs 880.Expert: Shrikant Chouhan, head equity research at Kotak SecuritiesMahindra and Mahindra: Buy | LTP: Rs 1,729 | Stop-Loss: Rs 1,660 | Target: Rs 1,850 | Return: 7 percentOn the daily charts, the counter is into a bullish trend with higher high and higher low series formation. Additionally, the technical indicators like ADX (average directional index) and RSI is also indicating further up trend from current levels which could boost the bullish momentum in the near future.Tech Mahindra: Buy | LTP: Rs 1,272.65 | Stop-Loss: Rs 1,230 | Target: Rs 1,360 | Return: 7 percentOn the monthly scale, the counter is into a rising channel chart formation with higher high and higher low series pattern. After the uptrend rally, the counter closed above its breakout zone. Furthermore, the bullish continuation chart structure indicates up move to continue in the coming horizon.Granules India: Buy | LTP: Rs 405.5 | Stop-Loss: Rs 390 | Target: Rs 435 | Return: 7 percentThe counter has shown a robust rally from the lower levels in the recent weeks. Additionally, it is continuously trading in an ascending triangle chart formation along with decent volume activity. Therefore, the overall formation indicates a likely breakout for a new leg of up move from the current levels.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Equity benchmark is expected to trade in a rangebound manner until the Nifty 50 decisively surpasses its previous record high of 21,593 zone, with immediate support at 21,300-21,200 levels, while the rising volatility to fresh nine-month high may be signalling a discomfort for bulls, hence, overall the caution is warranted, experts said.On December 26, the Nifty 50 was up 92 points at 21,441, and the BSE Sensex rose 230 points to 71,337, while the market breadth was in favour of bulls as three shares advanced against two falling shares on the NSE. The Nifty Midcap 100 index climbed 0.65 percent and Smallcap 100 index was up 0.14 percent.Stocks that recorded healthy returns on Tuesday included Deepak Nitrite, Divis Laboratories, and Mazagon Dock Shipbuilders. Deepak Nitrite shares climbed to the highest closing level since January 21, 2022, rising nearly 4 percent to Rs 2,472 and formed long bullish candlestick pattern on the daily chart with robust volumes after breakout of long horizontal resistance trendline adjoining multiple touchpoints.Divis Laboratories has seen a breakout of downward sloping resistance trendline and formed strong bullish candlestick pattern on the daily timeframe with healthy volumes. The stock jumped 4.6 percent to Rs 3,863.5 and traded above all key moving averages (20, 50, 100 and 200-day EMA - exponential moving averages), which is a positive sign.Mazagon Dock Shipbuilders ended at record closing high of Rs 2,288, up nearly 8 percent and formed healthy bullish candlestick pattern on the daily charts with strong volumes. The stock has seen a breakout of falling resistance trendline as well as horizontal resistance trendline, and traded above all key moving averages, which is a positive sign.Here's what Omkar Patil of Ashika Group recommends investors should do with these stocks when the market resumes trading today:Deepak NitriteThe stock of Deepak Nitrite has successfully emerged from a substantial base ranging between Rs 2,380-1,800 levels, which formed over a year. Breaking out of an Ascending Triangle pattern with significant volumes, the stock has recently exhibited a surge in volumes, indicating a prolonged build-up in price.The MACD (moving average convergence divergence) has shown a positive crossover above the zero-line, reflecting the presence of positive momentum.Investors are encouraged to consider buying this stock with a target set at Rs 2,720, and the suggested stop-loss is at Rs 2,380 on a closing basis.Divis LaboratoriesDivis Laboratories is currently trading at its 52-week highs, indicative of its robust momentum. Recently, the stock broke out of the Inverse Head & Shoulder Pattern, indicating the continuation of the prior uptrend. The breakout has been accompanied by higher trading volumes, confirming the breakout.The MACD has shown a positive crossover above the zero-line, reflecting the presence of positive momentum.Investors can explore buying this stock with a target of Rs 4,200, and the recommended stop-loss is at Rs 3,740 on a closing basis.Mazagon Dock ShipbuildersMazagon's stock has shown a change in the polarity of its prices around the level of Rs 1,940, illustrating the positive undertone of the prices. The stock recently witnessed an upsurge in volumes with a breakout in prices, indicating the continuation of the prior uptrend. The stock above short-term moving averages confirms the presence of an uptrend.Investors can consider buying this stock with a target at Rs 2,500, and the suggested stop-loss is at Rs 2,210 on a closing basis.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Motilal Oswal's research report on Divi’s LaboratoriesDivis Lab (DIVI) delivered a miss on 2QYF24 earnings. While revenue was in line with estimates, profitability was lower than expectation, partly due to lower pricing in the generic API segment. We reduce our earnings estimate by 5%/3% for FY24/FY25, factoring in a) increased competition in the API segment, and b) higher tax rate, partly offset by improved growth momentum in the Nutraceutical business.OutlookWe value DIVI at 35x 12M forward earnings to arrive at a price target of INR3,330. We are building 25% earnings CAGR over FY23-25 (adjusting for COVID-led business in FY23). This is on the back of improved visibility for contracts in the custom synthesis segment as well as ramp-up in products in contrast media space. We believe the current valuation adequately factors the upside in earnings. We reiterate our Neutral stance on the stock.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Divi’s Laboratories - 05 - 10-2023 - moti ",
    "Prabhudas Lilladher's research report on Divi's LaboratoriesWe reduce our FY24/FY25E EPS estimates by 7/6%. Divi’s Laboratories (DIVI) Q2FY24 EBITDA was 14% below our estimate led by lower margins. GMs declined on the back of pricing pressure, rise in input costs and inventory write off. Mgmt. suggested that moderation of raw material prices with commencement of some CDMO and contrast media contracts, will continue to aid revenues and margins. However, recovery will be gradual and near-term growth is likely to remain muted. We expect 16% EBITDA CAGR and 14% PAT CAGR over FY23-26E. At CMP, stock is trading at expensive valuations of 44x FY25E EPS.OutlookMaintain ‘Reduce’ rating with revised TP of Rs3,150/share (Rs3,000 earlier), valuing at 35x Sept 2025E P/E as we roll forward. Any sharp recovery in margin is key risk to our call.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Divi's Laboratories - 05 - 10-2023 - prabhu ",
    "Net Sales at Rs 1,909.00 crore in September 2023 up 2.94% from Rs. 1,854.54 crore in September 2022.Quarterly Net Profit at Rs. 348.00 crore in September 2023 down 29.5% from Rs. 493.60 crore in September 2022.EBITDA stands at Rs. 565.00 crore in September 2023 down 19.41% from Rs. 701.12 crore in September 2022.Divis Labs EPS has decreased to Rs. 13.11 in September 2023 from Rs. 18.60 in September 2022.Divis Labs shares closed at 3,506.70 on November 06, 2023 (NSE) and has given 7.28% returns over the last 6 months and -7.27% over the last 12 months.",
    "Net Sales at Rs 1,868.00 crore in September 2023 up 2.45% from Rs. 1,823.38 crore in September 2022.Quarterly Net Profit at Rs. 342.00 crore in September 2023 down 29.75% from Rs. 486.85 crore in September 2022.EBITDA stands at Rs. 559.00 crore in September 2023 down 18.81% from Rs. 688.51 crore in September 2022.Divis Labs EPS has decreased to Rs. 12.89 in September 2023 from Rs. 18.34 in September 2022.Divis Labs shares closed at 3,506.70 on November 06, 2023 (NSE) and has given 7.28% returns over the last 6 months and -7.27% over the last 12 months.",
    "Pharmaceutical major Divi's Laboratories reported a weak set of earnings for the July-September quarter, marked by a sharp contraction in operating margins which have turned brokerages bearish on the stock.The company missed the Street estimate by recording a 29.50 percent year-on-year decline in consolidated net profit to Rs 348 crore in Q2, when its revenue increased a mere 3 percent.Operating margin also contracted sharply to 25.1 percent as against 33.5 percent in the base period, facing the heat of lower pricing in the generic API (active pharmaceutical ingredients) segment.While Divi's legacy molecules are reeling under pricing pressure, its optimum market share in the category restricts the scope of any further growth upside. Hence, Nuvama Institutional Equities believes future growth for Divi's to be heavily dependent on new growth drivers.The company too seems to be taking this into account as its plans for capacity expansion at its Kakinada plant which may help free up capacities in Unit 1 and Unit 2 to pursue newer growth opportunities.While Nuvama does acknowledge that the capacity expansion underway and promising opportunities for Divi's Labs in contrast to media and peptides could serve as its next leg of growth drivers, the brokerage is also mindful of the uncertainty over its performance.On that account, the brokerage feels its estimates for double-digit revenue and nearly 17 percent PAT CAGR (compounded annual growth rate) for Divi's over FY23–26 factors in growth from these opportunities. Likewise, Nuvama has a 'reduce' call on Divi's Labs, with a price target of Rs 3,070.Follow our live blog for all the market actionMotilal Oswal cut its earnings estimate for Divi's by 5 percent and 3 percent for FY24 and FY25, factoring in increased competition in the API segment, and higher tax rate, which are partly offset by improved growth momentum in the nutraceuticals business.The brokerage also believes that the current valuation adequately factors the upside in earnings and hence it maintains a 'neutral' call on the stock with a price target of Rs 3,330.Foreign brokerage firm Jefferies too cut its FY24-26 EPS (earnings-per-share) estimates for Divi's by 15-18 percent on the back of its weak Q2 show. In addition, Jefferies also downgraded the stock to a 'hold' while slashing its price target by over 18 percent to Rs 3,510.While the firm does expect some sequential pick-up in growth from Q3, it also feels that key growth drivers like scale-up in new capacities for contrast media still stand a year away.At 09.28 am, shares of Divi's Laboratories settled nearly a percent lower at Rs 3,475.15 on the NSE.Also Read | Divi's Lab Q2 results: Net profit down 29% to Rs 348 crore, misses estimatesDisclaimer: The views and investment tips expressed by investment experts on Moneycontrol are their own and not those of the website or its management. Moneycontrol advises users to check with certified experts before taking any investment decisions. ",
    "Pharma major Divi's Laboratories on November 6 reported a 29.50 percent year-on-year (YoY) decline in its consolidated net profit to Rs 348 crore for the July-September quarter of the current financial year, missing estimates.The company reported a profit of Rs 493.60 crore in the same period last year. The weak profit growth can be accounted to a higher base due to the stellar contribution from the COVID-19 drug Molnupiravir in the same period of the last fiscal.Revenue came in at Rs 1,909 crore up merely 3 percent from the year-ago quarter numbers of Rs 1,855 crore. A poll of eight brokerages collated by Moneycontrol had pegged net profit at Rs 423 crore and revenue at Rs 1,913.2 crore.Aside from an unfavourable base, analysts had also anticipated softening of overall active pharmaceutical ingredients (API) prices to weigh on the company's Q2 results.Operational performance also remained weak as the company's earnings before interest, taxes, depreciation and amortization (EBITDA) came in at Rs 479 crore, down around 23 percent from Rs 621 crore clocked in the year-ago period due to higher other expenses and lower currency gains. The EBITDA margin also contracted sharply to 25.1 percent against 33.5 percent in the base period.The compny's EPS (earnings-per-stock) stands at 13.11 as against 18.60 in the year-ago period.The management appeared optimistic in terms of its opportunities in its earnings call. Its two big custom synthesis projects have now gone full scale now.The management said that it sees an opportunity in complex amino acid products, as it is the only player outside of China. They said that they are the most backward integrated company. They added that volume trends in generic APIs is strong, but pricing pressure is keeping revenues muted.Shares of the drugmaker also reacted negatively to its earnings announcement as they were trading 1.3 lower at Rs 3,308.95 on the NSE as of 1.02 pm. Shares of Divi's Labs have dropped 11.5 percent in the past three months over the company's consistently weak performance.\n       ",
    "Pharma major Divi's Laboratories is expected to post a sequential improvement in its revenue and net profit for Q2 FY24. The drugmaker is scheduled to detail its July-September earnings on November 6. A year-on-year (YoY) growth comparison doesn't sit well for Divi's because of a high base due to the stellar contribution from the COVID-19 drug Molnupiravir last fiscal.According to a poll of brokerages collated by Moneycontrol, the drugmaker is expected to report a net profit of Rs 423 crore down by 14.3 percent from Rs 493.60 crore clocked in the year-ago period. Sequentially, net profit is seen up 8 percent from the previous quarter's Rs 1,778 crore.Revenue is seen rising a modest 3 percent YoY to Rs 1,913.20 crore compared to Rs 1,854.54 crore in the same quarter of the previous fiscal. On a sequential basis, however, the growth comes to around 8 percent. The expectations of moderate sequential growth are on account of lower export shipment data for August, Nuvama Institutional Equities pointed out.Meanwhile, much of the sales growth in Q2 is likely to be driven by generics and nutraceuticals, Kotak Institutional Equities believes. Some contribution is also expected from new non-COVID projects.Among the brokerages polled by Moneycontrol, Incred Equities had the lowest growth projections for Divi's Labs while Jefferies pegged the maximum growth.Incred Equities also believes that a sequential improvement is already factored in for Divi's Labs and a miss on this front could lead to a sharp cut in its earnings.The drugmaker is also expected to witness a sequential margin improvement on the back of a better product mix and higher gross margins, brokerage firm Prabhudas Lilladher highlighted in its report. KIE pegged a 20 basis point sequential expansion in gross margins for Q2 on the back of stabilising raw material prices.On that account, Nuvama expects EBITDA margin to recover gradually to ~30.2 percent (+200 basis points sequentially) but remain substantially lower than its historical run-rate of 34-35 percent.Aside from that, softening overall API (Active Pharmaceutical Ingredients) prices will also weigh on Divi's Q2 earnings.Prabhudas Lilladher also believes that the company's outlook on margins and growth in high-margin custom synthesis will remain the key monitorables for stakeholders.\n       ",
    "Marcellus Investment Managers believes that its ‘consistent compounders’, the likes of Asian Paints, Divi's, Bajaj Finance, will continue to maintain their dominance in the market amid heightened competition on the back of strong moats. Even with the threat of Grasim's big bang entry into paints segment looming large, star fund manager Saurabh Mukherjea is certain that Asian Paints will hold on to its market share.A note by Marcellus says that companies which are able to demonstrate the ability of strong moats over decades are the ones that have built and continuously strengthened their competitive positioning against its peers. While on the surface it may appear that a new competitor poses a credible threat to the market leader, making a judgment about this without really understanding how strong the leading company's moat is can be very risky.The note gives an example of a new IPL cricket team, backed by a wealthy owner, would pose a challenge to the champions who have dominated the league consistently over several years. However, it is difficult for the new team to defeat the leaders as the team needs brilliance and something more than just a large balance sheet.Talking about Asian Paints it says that the company’s moat comes from its paint dealers. Asian Paints has close relationship with paint dealers who make money by selling the company’s products because of its efficient logistics system. While it may appear that a new entrant can easily persuade a paint dealer to push its products through higher margins, such a strategy is unlikely to work without adversely impacting the new entrant’s financial position. “The win-win solutions adopted by the likes of Asian Paints takes decades to establish and unless the incumbent grows lethargic, such an incumbent is incredibly difficult to dislodge,” as per the note.In the context of Grasim’s entry in the paint industry, Marcellus says that spending money on factories doesn't necessarily guarantee sales or a big market share. If it was the case, multi-national paint players in India – who were never short of money to invest in creating capacities – would also be market leaders, said the note. While other paint companies are building capacities, Asian Paints has doubled its reach in rural areas and invested in making their paint cheaper.Talking about Divi’s Laboratories it said that the company has three strengths. The company is 100 percent IP compliant. It is a non-competing service provider to its clients which are the world’s largest pharma companies, and it has a high-quality manufacturing process which also scores highly on regulatory complianceDisclaimer: The views and investment tips expressed by experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Divi’s Laboratories and Dr Reddy’s Labs are two pharma companies that have seen a pessimistic outlook in Moneycontrol’s analyst call tracker. ‘Buy’ calls on Divi’s Laboratories stock fell to six from 14, while that on Dr Reddy’s Laboratories fell to 18 from 36, as valuations appear to have run ahead of the limited growth opportunities.Divi’s custom synthesis business While Divi’s stock has had a decent year with returns of 9.6 percent YTD, the company's revenues in the quarter ending June did not meet analysts’ expectations. The company’s Q1FY24 revenue fell 21.1 percent YoY to Rs 1,778 crore, with EBITDA falling 40.5 percent YoY to Rs 5,040 crore and the net profit falling 49.3 percent to Rs 356 crore. The on-year fall is from a high base formed by supply of molecules used for Covid treatment.Divi's Labs shares closed at Rs 3697.2 on October 5.Revenue from generic business fell 8.1 percent YoY to Rs 944 crore while custom business was down 45.1 percent YoY to Rs 656 crore. Custom synthesis makes up 40 percent of business sales while generic drugs make up the remaining 60 percent.According to Elara Capital, Divi’s Laboratories has an expensive valuation at 57.7x FY24E and 49.5x FY25E core earnings; this is significantly higher than pre-Covid range of 25-28x. The company’s EBITDA margin improved to 28.3 percent in Q1FY24, from the 23-25 percent range in H2FY23; but it is still below pre-Covid range of 33-38 percent. Elara Capital said that the company's new initiatives, such as using active pharmaceutical ingredients (API) used in imaging contrasts, and nutraceutical products along with new projects in the custom synthesis business, are not enough.“We reduce our FY24E core EPS by four percent, but maintain FY25E/26E estimates. The stock trades at 58.1x FY24E core EPS of Rs 61.5. We reiterate ‘sell’. We raise our target price to Rs 2,199 from Rs 1,980, which is 28x FY25E core EPS of Rs 71.6 plus cash per share of Rs 193.” said Elara in a note.Systematix institutional equities changed its rating from ‘hold’ to ‘sell’ with a price target of Rs 2,681 based on 30x FY25E EPS. The reasons for the change in recommendation were the changes in the macro environment where growth opportunity for custom synthesis business is getting reduced.Follow our live blog for all market actionDr Reddy's to face competition in core businessDr Reddy's stock has had a stellar year with 27.6 percent YTD return, with the company reporting strong April-June results driven by North American business sales. The company’s Q1FY24 consolidated revenue increased by 29.1 percent YoY to Rs 6,758 crore while profit increased 18.2 percent YoY to Rs 1,405 crore. gRevlimid, a drug used to treat myeloma - a type of blood cancer - made up the majority of the company’s North American sales.According to Antique Stock Broking’s estimates, four products - gVascepa, gCiprodex, gLexiscan, and gSuboxone will deliver 12-15 percent of core North American revenue in FY24. The broker expects tough competition in this category as other companies are gearing to launch similar products. Additionally, out of over 100 products listed as being in shortage by USFDA in America, the company has just five products with low estimated market value, so the company won’t have much gains in the North American business.Antique downgraded Dr Reddy's stock to ‘sell’ from ‘hold’ with a target of Rs 4,658 valuing the company at 19x on FY25 EPS.Elara Capital maintained its ‘Reduce’ rating on Dr Reddy's stock, but increased the target price to Rs 5,579 “based on 17x FY25E core earnings of Rs 299 plus cash per share of Rs 496”, the broker said. The broker also expects  little upside to the stock due to the recent rally.Shares of Dr Reddy's Laboratories closed at Rs 5407.25 on October 5, rising by 27.68 percent YTD.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol are their own and not those of the website or its management. Moneycontrol advises users to check with certified experts before taking any investment decisions ",
    "Motilal Oswal's research report on Divi’s LaboratoriesThe operational performance of Divi’s Laboratories (DIVI) missed our estimates marginally in 1QFY24, due to lower sales in generics and custom synthesis. However, EBITDA margin expanded sequentially owing to lower raw material/logistics costs. We reduce our earnings estimates for FY24/FY25 by 3%/5% to account for a gradual off-take in custom synthesis/nutraceutical sales in the near term and extended benefits of cost management activities. We value DIVI at 35x 12M forward earnings to arrive at a TP of INR3,430. DIVI continued to add capacity for product development/manufacturing and strengthen its capability in the contrast media space as one of the key levers of growth over the next 3-5 years. Further, being a leader in the core generic portfolio with the lowest cost, DIVI is in a good stead to see better growth than the market in respective molecules. However, we maintain our Neutral rating as we believe the valuation adequately factors in the earnings upside over the next two years. It is trading at 15%/48% premium to its 5- year/10-year average PE multiple.OutlookWe reduce our earnings estimate for FY24/FY25 by 3%/5%, factoring in a gradual off-take in custom synthesis/nutraceutical sales over the near term and extended benefits of cost management activities. We value DIVI at 35x 12M forward earnings to arrive at a TP of INR3,430.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Divi’s Laboratories - 21 -08 - 2023 - moti ",
    "Prabhudas Lilladher's research report on Divi's LaboratoriesDivi’s Laboratories (DIVI) Q1FY24 EBITDA was 12% below our estimate led by lower revenues (down 9% QoQ) across segments. Though GMs have improved and back to +61% vs 57% reported in H2FY23. Mgmt. suggested moderation of raw material prices and also commencement of some CDMO and contrast media contracts, will continue to aid revenues and margins. However, recovery will be gradual and near-term growth is likely to remain muted. Our FY24/FY25E EPS stands reduced by 3-8%. We expect 15% EBITDA CAGR and 12% PAT CAGR over FY23-25E.OutlookAt CMP, stock is trading at expensive valuations of 41x FY25E EPS. Downgrade stock to ‘Reduce’ from ‘HOLD’ rating on the stock with revised TP of Rs3,000/share (Rs2,700 earlier), valuing at 35x (30x earlier) FY25E P/E. Any sharp recovery in margin is key risk to our callFor all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Divi's Laboratories - 16 -08 - 2023 - prabhu ",
    "Divi's Laboratories, India's largest API (Active Pharmaceutical Ingredient) manufacturer, sits amid a changing landscape within the global pharmaceutical universe. The growth levers for Divi’s are plenty, and gaining market share from its Chinese rivals tops that list.The company competes with several Chinese firms and has emerged as a preferred partner by Western pharma companies for several molecules on the back of three pillars – its strong IP (Intellectual Property) compliance, non-competition with its own API clients by running a formulations business, and very efficient and cost-effective manufacturing processes.Marcellus Investment Managers highlighted that Divi's Labs is a global cost champion for many of its APIs such as naproxen, dextromethorphan and levetiracetam. \"Given the backdrop of the shift in API manufacturing to India, companies like Divi’s can win big,\" the firm believes.Over the years, Divi's has also made systematic investments towards ramping up its manufacturing efficiency and taking up projects towards backward integration, steps that make up the building blocks of strong future growth. What's more interesting is that its calculated capital expenditures over the years have managed to keep the company debt free.Also read: GMM Pfaudler: All set to shatter its glass ceiling and create a new oneA future of resilient growthTo set things straight, the drugmaker's financials has remained under pressure post the pandemic due to a high base from Covid-related sales and an inflationary environment for raw materials used in APIs.Despite the drag on earnings, the company has remained focused on setting up new triggers that can fuel its next leg of growth. Starting off is the company's foray into contrast media APIs, which have global sales of around $5 billion. The company has already completed client validation for the segment from one big pharma player and is in the process of closing the deal with another. With some of the world’s biggest pharma companies like Novartis, Sanofi, GSK, and Merck as its clients, it is only a matter of time before Divi's manages to scale up its newly ventured vertical, analysts believe.Along with that, the company's generics API portfolio is also set to expand over FY23-FY25 as many of the molecules targeted by Divi’s go off-patent over this duration, Marcellus Investment Managers noted. The market sales value of these molecules is around $20 billion.And lastly, the most critical growth multiplier for the company is the growing China+1 sentiment among big pharma players as they try to reduce their dependence on Chinese API firms. Divi's Labs presents itself as a perfect alternative to Chinese API giants thanks to its cost leadership, existing capacity, excellent regulatory track record, operational efficiency and laser-sharp focus on IP compliance.Additionally, Motilal Oswal Financial Services feels that Divi's stands to gain market share and improve profitability in the API generics segment on the back of its efforts towards low-cost manufacturing through backward integration. Likewise, the firm expects Divi's to post a 14 percent revenue CAGR (Compounded Annual Growth Rate) to Rs 4,300 crore over FY23-25.Also read: Demographic dividend to keep India growing for next 30 years: Commerce AS Rajesh AgrawalWhat about valuations?The stock has taken a sharp hit since the start of 2022, having slumped over 45 percent till March of this year. However, expectations of strong long-term growth and cheaper valuations helped the stock bounce back 10.5 percent in the past three months. As a result, the stock currently trades a valuation of 45.2 times its FY24 core earnings-per-stock estimates, which brokerages believe are a bit expensive.The pricey valuation of the stock is among the few negatives that have irked analysts. However, being a long-term growth story, the opportunity to be a part of Divi's journey will keep arising in an ever-evolving market.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol are their own and not those of the website or its management. Moneycontrol advises users to check with certified experts before taking any investment decisions.\n       ",
    "Pharmaceutical player Divi's Laboratories' lower-than-expected numbers have disappointed brokerages with some of them flagging valuation concerns, saying it limits the scope for a strong upside.The drug-maker recorded a 49.3 percent decline in consolidated net profit at Rs 356 crore in the April-June quarter, well below the Street's estimate of Rs 407.8 crore. It topline at Rs 1,778 crore was up 21.2 percent on year but was lower than analysts' expectation of Rs 2,038 crore.Several brokerages, including Goldman Sachs, Jefferies, HSBC, and Motilal Oswal Financial Services, have been disappointed by the performance. Shares of Divi's Labs also opened lower on August 16 and at 09.35 am, were trading 1.26 lower at Rs 3,683.45 on the NSE.A sequential improvement in operating profit margin, or the EBITDA margin, which was at 28.3 percent, up from 25 percent in the March quarter, was a saving grace for the company. The EBITDA margin, however, contracted by 930 basis points from the year-ago quarter.One basis point is one-hundredth of a percentage point.Brokerage viewsGoldman Sachs attributed the sequential improvement in margins to an uptick in gross margins. It also retained its “buy” call on the stock with a target price of Rs 3,885.Jefferies, too, has a “buy” call on the stock and raised the price target by over 19 percent to Rs 4,300. The firm sees a ramp-up of the project for manufacturing Sacubitril Valsartan (a drug used in heart failure) and other base business products as near-term growth triggers for Divi's. It also expects the company's new contrast media project to be online by the end of FY25.But not all brokerages share the optimism. HSBC, Nuvama Institutional Equities and MOSFL point to expensive valuations of the stock.Follow our live blog for all the market actionThe three brokerages believe that the valuation prices in the growth triggers, limiting the scope for a strong upside.On that account, Nuvama and HSBC have a “reduce” call on the stock, while MOFSL maintains a “neutral” rating. The three brokerages also have target prices for the stock in the range of Rs 2,890-3,430, reflecting a downside of 8-22.5 percent from the closing price on August 14.HSBC also sees a long road to recovery for Divi's, a view shared by Nuvama. \"We acknowledge the promising opportunities for Divi's arising from its contrast media business and custom synthesis project along with easing raw material prices which could serve as the next leg of growth drivers for the company, but also note the uncertainty around it,\" Nuvama said in its report.MOFSL is confident of a brighter future for Divi's because of its leadership position in select molecules but said current valuations adequately factor in the earnings upside over the next two years.Nuvama and MOFSL have cut their earnings estimates for FY24/FY25 by 3 percent/6 percent and 3 percent/5 percent, respectively.Also Read | Divi's Labs Q1 results: Net profit slumps 49% to Rs 356 crore, lags estimateDisclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Net Sales at Rs 1,778.00 crore in June 2023 down 21.14% from Rs. 2,254.52 crore in June 2022.Quarterly Net Profit at Rs. 356.00 crore in June 2023 down 49.29% from Rs. 702.01 crore in June 2022.EBITDA stands at Rs. 585.00 crore in June 2023 down 37.44% from Rs. 935.09 crore in June 2022.Divis Labs EPS has decreased to Rs. 13.41 in June 2023 from Rs. 26.44 in June 2022.Divis Labs shares closed at 3,679.15 on August 11, 2023 (NSE) and has given 31.79% returns over the last 6 months and -1.42% over the last 12 months.",
    "Net Sales at Rs 1,730.00 crore in June 2023 down 21.5% from Rs. 2,203.92 crore in June 2022.Quarterly Net Profit at Rs. 345.00 crore in June 2023 down 50.12% from Rs. 691.61 crore in June 2022.EBITDA stands at Rs. 571.00 crore in June 2023 down 38.44% from Rs. 927.57 crore in June 2022.Divis Labs EPS has decreased to Rs. 12.99 in June 2023 from Rs. 26.05 in June 2022.Divis Labs shares closed at 3,679.15 on August 11, 2023 (NSE) and has given 31.79% returns over the last 6 months and -1.42% over the last 12 months.",
    "Rupak De, senior technical analyst at LKP SecuritiesThe Nifty remained in sideways movement over the past two days, suggesting a lack of demand at higher levels. However, the overall trend remains strong, as the index continues to sit comfortably above critical moving averages, indicating absence of aggressive short positions at this time.On the higher end, the resistance is placed between 19,450 and 19,500 which the Nifty might face some difficulty in surpassing. Looking ahead, it is expected that the Nifty will likely continue to trade sideways, as long as it sustains within the range of 19,200 to 19,500, implying a range bound trades unless there is a directional breakout.The Bank Nifty recently experienced selling pressure from higher levels, but the bears were unable to break the support at 45,000. As a result, the index has been trading within a range of 45,000-45,500. A break on either side of this range will determine the next directional move for the index.If the index breaks below the support level of 45,000, it is likely to witness further downside towards 44,500 and potentially lower. On the other hand, if the index manages to surpass the level of 45,500 on a closing basis, it will indicate strength and may lead to further upside towards the 46,000 level.Here are three buy calls for next 2-3 weeks:Indiabulls Housing Finance: Buy | LTP: Rs 130.5 | Stop-Loss: Rs 124 | Target: Rs 145 | Return: 11 percentIndiabulls Housing Finance has experienced a Head and Shoulder breakout, indicating a potential upward trend. Additionally, the relative strength index (RSI) is showing a bullish crossover and rising, suggesting increasing buying momentum in the stock.Furthermore, the stock is sustaining above a critical moving average, which further supports the notion of a bullish outlook. These factors combined indicate positive market sentiment and the potential for further price appreciation in the stock.BHEL: Buy | LTP: Rs 93 | Stop-Loss: Rs 85 | Target: Rs 110 | Return: 18 percentBHEL has experienced swing high breakout on the daily chart accompanied by a sharp surge in volumes. This breakout is considered a bullish signal for the stock. The overall undertone for BHEL is extremely bullish, with the stock forming higher highs and higher lows, indicating a positive trend.The momentum indicator RSI has shown a positive crossover, further confirming the buy signal for BHEL. There is a strong support level at Rs 85, which coincides with the stock's 20-day moving average (20DMA).This support level is expected to act as a cushion for the bulls. In terms of potential upside, BHEL has a target range of Rs 110.Divis Laboratories: Buy | LTP: Rs 3,748 | Stop-Loss: Rs 3,620 | Target: Rs 4,100 | Return: 9.4 percentThe stock has recently experienced a consolidation breakout, indicating a potential shift in the price trend. This breakout suggests that the stock has broken out of a period of range-bound trading and may now be poised for an upward movement.Additionally, the RSI is displaying a bullish crossover and rising, indicating increased buying momentum and positive market sentiment. Furthermore, the stock is sustaining above a critical moving average, which further supports the notion of a bullish outlook.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Kotak Institutional Equities has reiterated its ‘sell’ rating on Divi’s Laboratories with a price target of Rs 2600, saying growth rates could be lower in future, making current valuations look expensive.“Unlike its global peers, in the absence of guidance and lack of disclosures around the order book, active projects, exact delivery model and customercount, Divi’s Custom Synthesis (CSM) segment stays a black box,” said the Kotak note to clients.“Giving Divi’s the benefit of doubt, the Street continues to lean on its optimism on new deal wins and the ongoing capex and is unwilling to look at the downside risks,” the note said.According to Kotak, Divi’s is working on three CSM projects, but there is no clarity on the quantum of benefit accruing to Divi’s.Kotak sees a risk of lower tonnage requirements for new chemical entities leading to lower long-term growth rates in CSM for Divi’s. Moreover, the company's lack of presence in the biologics segment could also limit its long-term growth, the Kotak note said.“We bake in a 17.5% overall sales CAGR over FY2023-26E, ex-Molnupiravir. Although the company remains positive about growth prospects across generic API (active pharmaceutical ingredients )and CSM in FY2024-26E, we expect a gradual traction,” the Kotak note said.Divi’s Laboratories’ revenue fell 10 percent to Rs 8112.2 crore year-on-year in FY23. The pharma company’s operating margin fell by 1359 basis points in FY23. Divi’s net profit fell 38 percent to Rs 1823 year-on-year crore for the same period.The stock ended 0.74 percent down at Rs 3558.40 on the NSE.\n       ",
    "Motilal Oswal's research report on Divi’s LaboratoriesDIVI delivered a better-than-expected performance in 4QFY23, driven by improved traction in the generic API segment. The Custom Synthesis (CS) business also reported a slow uptick in sales. We raise our earnings estimates for FY24/FY25 by 7%/6% to factor in 1) a scale-up in commercial contracts in the CS segment, 2) a reduction in the availability of high-cost raw materials, and 3) improvement in operating leverage.OutlookWe value divi at 30x 12M forward earnings to arrive at a TP of INR2,900.  While the outlook is improving across segments of CS and generic APIs on the back of new launches and sharp focus on cost minimization, the current valuation adequately factors in the earnings upside. Hence, we maintain our Neutral rating on the stock.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Divi’s Laboratories - 22 -05 - 2023 - moti ",
    "The market closed a rangebound session off the day's high because of selling pressure in last hour of trade on May 23, continuing the uptrend for the third straight day as buying was seen in metals, auto, pharma, and oil and gas stocks.The BSE Sensex gained 18 points to 61,982, and the Nifty50 34 points to 18,348, while the Nifty Midcap 100 index gained six-tenth of a percent and Smallcap 100 index stayed flat with a positive bias.Bank Nifty rebounded after a correction in the previous session, but failed to sustain the 44,000 mark. The index gained 69 points to 43,954.Stocks that were in action on Tuesday included Route Mobile which rallied 4 percent to Rs 1,468.35, the highest closing level since September 13 last year, and formed bullish candlestick pattern with long upper shadow on the daily scale with strong volumes.Bajaj Electricals shares gained 1 percent to Rs 1,212.60, the highest closing levels since December 30, and formed a small-bodied bullish candle with long upper shadow on the daily charts, indicating profit-booking at higher levels after hitting the highest levels on intraday basis since August last year.Divis Laboratories continued to see healthy volumes for yet another session. It jumped 3.7 percent to Rs 3,385.8, the highest closing level since May 10 and formed a long, bullish candlestick pattern on the daily scale for second consecutive session.Here's what Rohan Shah of Stoxbox recommends investors should do with these stocks when the market resumes trading today:Route MobileThe price action of Route Mobile supposedly took a breather by means of profit taking bouts after 282 percent run-up from the listing day. The price action corrected 56 percent from the all-time high and entered into a lateral trading range after losing the downside momentum.The current sideway trend not only hints at a more significant support level, but also that the ownership of stocks are potentially transferring from weak to strong hands.We thus reiterate going long in Route Mobile with entry in the range of Rs 1,475-1,435 with an upside move towards Rs 1,730-1,750 zone. On the flip side, Rs 1,377-1,360 to act key support area.Bajaj ElectricalsThe stock rallied almost more than 40 percent from the June 2022 low and post that stock turned sideways, trading in the channel which contained for more than 10 months.The stock staged a breakout from the said channel this week with strong volumes and supportive momentum. Thus going forward if breakout unfolds well on expected line, price is expected to head higher towards Rs 1,280-1,300 levels, whereas, Rs 1,190-1,170 shall provide key support zone.Divis LaboratoriesThe stock broke out of from descending resistance trendline in April 2023. After that stock went into consolidation mode for almost a month and now previous resistance zone acted as support for the stock.In last two days, the stock has been trading well above the support zone with good gains. However, 200 DEMA (day exponential moving average) has been another resistance point for stock on multiple instances. If stock closes above its 200 DEMA for the day, it will open up the targets of Rs 3,700 and Rs 3,900 respectively. On the other hand, the support will come at Rs 3,300 and Rs 3,240 levels.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Prabhudas Lilladher's research report on Divi's LaboratoriesDivi’s Laboratories (DIVI) reported weak performance in FY23 given high COVID base and higher COGS, resulting in weakest ever margins (OPM of 25% in H2FY23 vs +33-35% in preceding quarters). Before FY21/22, DIVI’s GMs were between 61-63% range vs 57% reported in H2, suggesting that H2 may be an aberration. Mgmt. suggested moderation of raw material prices and also commencement of some CDMO and contrast media contracts, which should aid revenues and margins, in our view.OutlookHowever, recovery will be gradual and near-term growth is likely to remain muted. We expect 17% EBITDA CAGR and 13% PAT CAGR over FY23-25E. At CMP, stock is trading at expensive valuations of 35x FY25E EPS. Retain ‘HOLD’ rating on the stock with TP of Rs2,700/share, valuing at 30x FY25E P/E.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Divi's Laboratories - 22 -05 - 2023 - prabhu "
]