[
    "Sharekhan's research report on Dr Reddy’s LaboratoriesWe reiterate our Buy rating on Dr. Reddy’s after interacting with the management of the company in our recent visit to Hyderabad where they are positive on growth momentum led by Horizon 1 and Horizon 2 strategy. North America to clock a 7% CAGR from FY24-26E driven by 25 new product launches in the generics segment (either FTFs or in the 1st wave), gRevlimid and biosimilar launches. India sales to grow in double digits led by internal restructuring of MRs leading to higher productivity, expanding into digital therapeutic and OTC/nutraceutical products.OutlookStock trades at attractive valuation of 18x and 16x its FY2025E and FY2026E estimates. The company is focusing on shifting its focus to pure generics company to Biosimilars, digital therapeutics, nutraceuticals, CDMO segment hence we maintain a Buy with a PT of Rs. 6,537.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Dr Reddy’s Laboratories - 02042024 - khan ",
    "Shares of Dr Reddy’s Laboratories traded in the green early on March 28 after the company entered into an exclusive partnership with Sanofi Healthcare India Private Limited (SHIPL).At 9:30am, Dr Reddy's Laboratories was quoting Rs 6,129.05, up Rs 81.45, or 1.35 percent, on the BSE.\"The company has entered into an exclusive partnership with Sanofi Healthcare India Private Limited (SHIPL) to promote and distribute Sanofi’s vaccine brands including well-established paediatric and adult vaccines in India,\" the company said in its release.Under the arrangement, Dr Reddy’s will have exclusive rights to promote and distribute Sanofi’s well-established and trusted paediatric and adult vaccine brands Hexaxim, Pentaxim, Tetraxim, Menactra, FluQuadri, Adacel and Avaxim 80U.Sanofi will continue to own, manufacture, and import these brands to the country. “We are happy to have the opportunity to leverage our strengths in promotion and distribution to considerably expand engagement with healthcare professionals and help widen access of Sanofi’s well-established and trusted vaccine brands in India. We continue our efforts to become the partner of choice in bringing novel, innovative and trusted drugs to patients in India through strategic collaborations,\" said MV Ramana, chief executive officer for branded markets (India and emerging markets) at Dr Reddy’s.\"The portfolio now gives Dr Reddy’s a strong presence in the vaccine segment, propelling us to the second position among vaccines players in India. Through each product and partnership, our aim is to serve over 1.5 billion patients by 2030,” he added.Catch all market action in our live blogA meeting of the board of directors of the company will be held on Tuesday, May 7, 2024, to consider and approve the audited standalone and consolidated financial results of the company for the quarter and financial year ending on March 31, 2024, and to recommend dividend, if any, for the financial year 2023-24.\n       ",
    "It appears that the week ended February 9 was characterised by significant volatility, with the India VIX reading again surpassing 15 and closing near 15.5 on a weekly scale. This suggests that market participants should brace for potentially heightened volatility in the week beginning February 12.Regarding the Nifty index, despite attempting to break the all-time high of around 22,126.80, the index failed to do so and reversed from approximately 22,053, closing below the 21,800 mark with a weekly loss of around 0.33 percent. This indicates some resistance at the all-time high level.Looking ahead to the current week, it's crucial for traders to closely monitor the 21,500 level, which is identified as a significant support level. A breach of this level could potentially trigger panic in the market.On the upside, if the Nifty index manages to sustain above 21,700, there's a possibility of it retesting the 22,000–22,100 levels. This suggests that traders should keep a close eye on the key support and resistance levels and remain flexible in their trading strategies.Bank NiftyIt seems that despite a significant rebound from the 200-day exponential moving average (DEMA), the Bank Nifty closed the week with a -0.73 percent loss, indicating some selling pressure. However, observing a bullish Bat pattern on a daily scale, suggesting potential upward momentum in the near term.The Bank Nifty needs to hold the support of 45,000 in the current week. If the index manages to sustain above 45,000, there's a possibility of it testing the 46,500 level, indicating further bullish movement.Conversely, a failure to maintain support at 45,000 could lead to additional selling pressure, potentially pushing the Bank Nifty down to the next support level of 44,500. The presence of a bullish trendline from the October 26, 2023, low of 42,800 further supports the idea of a potential upward trend in the Bank Nifty.Here are three buy calls for short term:Dr Reddy's Laboratories: Buy | LTP: Rs 6,156 | Stop-Loss: Rs 5,850 | Target: Rs 6,675 | Return: 8 percentThe past few months have been good for the pharma stocks since the index Nifty Pharma surged over 20 percent from the bottom of 14,600. Although most of the heavyweight pharma participated in this rally but Dr Reddy's Labs was consolidating since many weeks.Finally, the stock has now confirmed a breakout which resembles a bullish Cup and Handle pattern. Thus, traders are advised to buy the stock in the range of Rs 6,100-6,200 with a stop-loss of Rs 5,850 on closing basis for an upside target of Rs 6,675Aether Industries: Buy | LTP: Rs 866 | Stop-Loss: Rs 810 | Target: Rs 975 | Return: 13 percentSince a month or so, the said counter has gained massive momentum from the retracement levels of its previous up move (0.786 percent), thus making it a lucrative buy. Having said that, time and price retracement are falling at the same length, which is a strong indication of bottoming out. (Time retracement is 0.382 percent and price retracement is 0.786 percent).On the indicator front, the weekly RSI (relative strength index) has formed an impulsive structure near 30 levels, which further confirms our bullish stance on the counter. Thus, one can buy in the zone of Rs 855-870 for a target of Rs 975 and a stop-loss of Rs 810 on a daily closing basis.RAIN Industries: Buy | LTP: Rs 184 | Stop-Loss: Rs 160 | Target: Rs 220 | Return: 20 percentSince the last 2 months or so, the said counter has been consolidating between Rs 145 and Rs 155. Recently, it has given a breakout from the said range on a weekly closing basis, which is looking lucrative. Having said that, it has also formed a bullish GARTLEY pattern, which is 1.38 years old, thus making it more reliable.Also, it has violated a couple of trendlines. The best part about this bullish reversal is that every bottom has bought with huge volume bars, which indicates bullish bias in the counter.On the indicator front, the weekly RSI (relative strength index) has given a trendline violation, which further affirms our bullish stance on the counter. Thus, we advised traders and investors to go long in the range of Rs 175-185 with an upside target of Rs 220, and the stop-loss would be placed at Rs 160 on a daily close basis.Note: The Gartley pattern is a harmonic chart pattern, based on Fibonacci numbers and ratios, which help traders, identify reaction highs and lowsDisclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "KR Choksey's research report on Dr. Reddy’s LaboratoriesIn Q3FY24, Dr. Reddy’s posted a 6.6% Y-o-Y (+4.8% Q-o-Q) rise in revenue to Rs. 72,368 Mn (vs. our estimate of Rs. 71,872 Mn). The overall slower sales growth (Y-o-Y) for Q3FY24 was largely driven by improved market share for its existing products in the US, continued momentum in Europe, and contribution from new products; partially offset by price erosion in certain existing products. Including higher income from sale of non – core brands, the company posted an 11.9% Y-o-Y (-6.4% Q-o-Q) rise in adjusted PAT to Rs. 13,919 Mn and an 11.0% Y-o-Y (-6.8% Q-o-Q) rise in reported PAT to Rs. 13,809 Mn in Q3FY24 (vs. our estimate of Rs. 13,846 Mn).OutlookWe anticipate ~7.0% and ~9.9% CAGR rise in revenue and net income over FY23-FY26E. Currently, the stock is trading at 18.3x/16.3x/17.1x based on our FY24E/FY25E/FY26E EPS estimates, respectively. We introduce FY26E EPS estimates and roll forward our valuation basis to FY26 EPS while increase our target price to INR 6,460/share (earlier Rs. 5,826), applying an unchanged ~18.0x multiple on FY26 EPS and downgrade our rating to HOLD (upside: 5.5%) from ACCUMULATE.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Dr. Reddy’s Laboratories L - 02022024 - kr ",
    "",
    "Net Sales at Rs 4,103.00 crore in December 2023 up 5.27% from Rs. 3,897.60 crore in December 2022.Quarterly Net Profit at Rs. 475.20 crore in December 2023 up 46.4% from Rs. 324.60 crore in December 2022.EBITDA stands at Rs. 883.90 crore in December 2023 up 21.67% from Rs. 726.50 crore in December 2022.Dr Reddys Labs EPS has increased to Rs. 28.55 in December 2023 from Rs. 19.54 in December 2022.Dr Reddys Labs shares closed at 6,121.45 on January 31, 2024 (BSE) and has given 8.42% returns over the last 6 months and 41.33% over the last 12 months.",
    "Market experts expect Finance Minister Nirmala Sitharaman to focus on continuity in capital expenditure towards infrastructure, new tax regime, fiscal consolidation path and GDP growth numbers in the Budget 2024, especially ahead of general elections.The market clocked nearly one percent gains on January 31, and broader markets rallied more than 1.5 percent ahead of the budget day, thanks to banking stocks. Nifty 50 recouped almost all its previous day's gains in the rebound.On January 31, the BSE Sensex climbed over 600 points to 71,752, and the Nifty 50 jumped over 200 points to 21,726, while the Nifty Midcap 100 and Smallcap 100 indices gained 1.6 percent and 2.25 percent respectively.Moneycontrol collated a list of Budget stocks picks from experts with 3-4 weeks perspective. The closing price of January 31 is considered for stock return calculation.Expert: Jigar S Patel, Senior Manager - Equity Research at Anand RathiPetronet LNG: Buy | LTP: Rs 269 | Stop-Loss: Rs 235 | Target: Rs 320 | Return: 19 percentSince 2019 until 2023, Rs 240 levels have proved to be massive resistance. Fortunately, in January 2024, the said counter managed to clear its Rs 240 resistance very comfortably and is currently placed near Rs 270 zone.The breakout on the monthly chart looks genuine since it is accompanied by huge volume, with respective stochastics reversing from the 40 zone, which is looking lucrative at current levels.Thus, investors and traders can enter longs in the zone of Rs 255–270 with an upside target of Rs 320 and a stop-loss of Rs 235 on a daily closing basis.KPR Mill: Buy | LTP: Rs 790 | Stop-Loss: Rs 749 | Target: Rs 860 | Return: 9 percentAfter making the top near Rs 928 on November 22, 2023, the said counter gave a decent correction until Rs 732. In the previous trading session, it bounced back from the support zone of Rs 730, coincidentally, which is between 100 and 200 DEMA (day exponential moving average), and in the process, it also took out its bearish trendline (refer to the chart), thus making it attractive at current levels.On the indicator front, daily stochastics has given a bull divergence (refer to the chart), which further confirms our bullish stance on the counter. Thus, one can buy in the zone of Rs 780–795 with an upside target of Rs 860 and stop-loss orders would be placed on a daily closing basis around Rs 749.Maruti Suzuki India: Buy | LTP: Rs 10,187 | Stop-Loss: Rs 9,650 | Target: Rs 11,000 | Return: 8 percentAfter breaking down the psychological level of Rs 10,000 in the month of August 2023, the counter has retested Rs 10,000 again and reversed from that level, which confirms that the August 2023 breakout above Rs 10,000 was genuine. Also, volume was huge at the time of the reversal, which further confirms our bullish stance on the counter.Coincidentally, 200 DEMA, which comes around Rs 9,850, has been successfully tested (refer to the chart). On the indicator front, daily stochastics has shown a bull divergence (refer to the chart). Thus, one can buy in the zone of Rs 9,900–10,200 with an upside target of Rs 11,000 and stop-loss orders would be placed on a daily closing basis around Rs 9,650.Expert: Omkar Patil, technical & derivatives analyst - institutional equity at Ashika GroupTata Power: Buy | LTP: Rs 390 | Stop-Loss: Rs 370 | Target: Rs 435 | Return: 11 percentThe stock is presently trading at an all-time high, reflecting its strong momentum. The consistent up move from the lower levels of Rs 230 has found support on each dip at the 12-day EMA. Additionally, the MACD (moving average convergence divergence) on the daily timeframe has shown a positive crossover above the zero line, indicating the likelihood of the prices continuing to trend higher.Going ahead, we expect the prices to move higher till Rs 435 where the stop-loss on the downside must be kept at Rs 370 on closing basis.Bank of Baroda: Buy | LTP: Rs Rs 247.6 | Stop-Loss: Rs 235 | Target: Rs 275 | Return: 11 percentThe stock is in a robust uptrend, marked by higher highs and higher lows. The recent up move is accompanied by a surge in volumes, indicating a strong buildup in the trend.Additionally, the MACD on the daily timeframe has shown a positive crossover, confirming the presence of positive momentum in the stock.Going ahead, we expect the prices to move higher till Rs 275 where the stop-loss on the downside must be kept at Rs 235 on closing basis.National Aluminium Company: Buy | LTP: Rs 149 | Stop-Loss: Rs 144 | Target: Rs 165 | Return: 11 percentThe stock has recently surpassed its multi-year high around Rs 142, the highest since April 2008. The stock has broken out of the consolidation zone range of 122-140, indicating the continuation of the prior uptrend. The recent rise in volumes also reflects the enthusiasm in the trend.Going ahead, we expect the prices to move higher till Rs 165 where the stop-loss on the downside must be kept at Rs 144 on closing basis.Expert: Ruchit Jain, lead research at 5paisa.comColgate Palmolive: Buy | LTP: Rs 2,569 | Stop-Loss: Rs 2,480 | Target: Rs 2,730 | Return: 6 percentThe stock has seen an uptrend in last few months and has shown an outperformance to other stocks from the FMCG sector. In last few weeks, the stock consolidated in a range which just seemed to be a time-wise correction within an uptrend.The prices have now given breakout from this consolidation and the RSI (relative strength index) oscillator too has given a positive crossover which indicates a resumption of the uptrend.Traders can look to buy the stock around current market price of Rs 2,570 for potential target of Rs 2,730. The stop-loss on long positions should be placed below Rs 2,480.Dr Reddy's Laboratories: Buy | LTP: Rs 6,121 | Stop-Loss: Rs 5,920 | Target: Rs 6,470 | Return: 6 percentThe stock gave a breakout from its previous swing high resistance post the announcement of its quarterly results. The volumes on breakout were high which indicates a fresh buying interest in the stock and the RSI readings too are hinting at positive momentum.We advise traders to look for buying opportunities in the stock around current market price of Rs 6,120 and add on any dips towards the breakout zone of Rs 6,000. The potential targets for the stock are seen around Rs 6,320 and Rs 6,470 while stop-loss on long positions should be placed below Rs 5,920.HCL Technologies: Buy | LTP: Rs 1,576 | Stop-Loss: Rs 1,500 | Target: Rs 1,720 | Return: 9 percentThe stock has been forming a ‘higher top higher bottom’ structure since last few months and is thus in an uptrend. The 20 DEMA has been acting as a support on declines and it has formed a ‘Bullish Flag’ pattern on the daily charts.The price volumes structure is also bullish as the price up moves have been supported by good volumes, but the corrections have not seen any high volume sell-off.Hence, we advise short term traders to buy the stock in the range of Rs 1,580-1,570 for potential targets of Rs 1,660 and Rs 1,720. The stop-loss on long positions should be placed below Rs 1,500.Expert: Jatin Gedia, technical research analyst at Sharekhan by BNP ParibasGrasim Industries: Buy | LTP: Rs 2,175 | Stop-Loss: Rs 2,050 | Target: Rs 2,300-2,411 | Return: 11 percentGrasim was consolidating in a range and in process has retraced 38.2 percent of the rise from Rs 1,820 – Rs 2,166. In terms of price pattern it has formed and broken out a Bullish Flag pattern on the upside indicating resumption of the next leg of upmove.Daily momentum indicator has completed its pullback to the equilibrium line and triggered a positive crossover which indicates start of a new cycle.Prices are trading along the expanding upper Bollinger band indicating that the positive momentum is likely to continue. On the upside, the move can extend towards Rs 2,300 and above that it can extend towards Rs 2,411. Structure becomes weak below Rs 2,050.PFC: Buy | LTP: Rs 443 | Stop-Loss: Rs 410 | Target: Rs 479-495 | Return: 12 percentPower Finance Corporation (PFC) has been in a medium term uptrend. In the last two months, the stock has undergone a time wise correction where it has been trading within the broad range of Rs 380 – 430. The range has been broken out on the upside and suggests that the stock has resumed its next leg of upmove.Daily momentum indicator has a positive crossover which is a buy signal. Thus, both price and momentum indicator suggest that the stock has resumed its upmove after a two months consolidation.Targets on the upside are placed at Rs 479 which is the weekly upper Bollinger band and Rs 495 which is the range breakout target. The structure becomes weak below Rs 410.SBI: Buy | LTP: Rs 641 | Stop-Loss: Rs 616 | Target: Rs 670-700 | Return: 9 percentState Bank of India (SBI) underwent correction and retraced 50 percent of the rise it witnessed from Rs 555 to Rs 660. The correction halted around the 20-week moving average (Rs 602) and witnessed buying interest from the crucial support zone.The daily momentum indicator provided a positive crossover from below the equilibrium line which is a buy signal. On the price front the stock has broken out of a falling channel indicating resumption a fresh leg of upmove.We expect the stock to rise towards the recent swing high of Rs 670 and extend towards the psychological level of Rs 700 from short term perspective. Structure shall become weak below Rs 616.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Drugmaker Dr Reddy's Laboratories is expected to report marginal on-year growth in its revenue and a low double-digit increase in net profit for the October-December quarter. The pharmaceutical company is slated to release its third quarter (Q3) earnings on January 30.The drugmaker is expected to report a net profit of around Rs 1,383 crore, up 12 percent from Rs 1,237.90 crore recorded in the same quarter of the previous fiscal year, according to an average of estimates of nine brokerages.Revenue is expected to record a marginal 4 percent on-year rise to Rs 7,030.90 crore, dragged by weak sales from the domestic market and price erosion in other key products in the US. However, the contribution from the blockbuster cancer drug Revlimid is expected to remain stable, offsetting the loss of revenue from other segments.The pharma major had posted a topline of Rs 6,789.80 crore in the year-ago period.Among the brokerage estimates collated by Moneycontrol, JM Financial rolled out the most bearish growth projections for Dr Reddy's Q3 performance, while YES Securities was the most optimistic.Revlimid contribution remains steady, others not so muchThe generic version of the cancer drug Revlimid will continue to remain the star contributor to the drugmaker's US revenue for yet another quarter, with analysts estimating its contribution to come to around $100 million for Q3. However, lower sales of Ciprodex (used to treat ear infections) due to an unfavourable seasonality effect and Suboxone (used to treat opioid addiction) due to high price erosion are likely to weigh on the overall revenue growth in the US business.Also Read | Cipla shares rally 8% to hit 52-week high on strong Q3 earningsStill, JM Financial believes that a ramp-up of the company's recently acquired Mayne portfolio should support incremental growth in the drugmaker's base business in the US to reach $279 million in Q3.Tepid domestic growth may spoil moodThe company's India business is likely to report mid-single-digit on-year growth in Q3, adversely impacted by a sporadic acute season during the quarter. Brokerage firm Nuvama Institutional Equities predicts a mere 7 percent on-year growth in Dr Reddy's India business due to a weak acute season and lost sales from divested brands.Dr Reddy's had divested nine dermatology brands to Eris Lifesciences in the last quarter of FY23.Margins to remain stableWith a sustained contribution from the high-margin Revlimid, analysts expect Dr Reddy's operating margin in Q3 to remain stable year-on-year (YoY). On that account, Kotak Institutional Equities pegged 2 percent on-year growth in the company's consolidated earnings before interest, taxes, depreciation, and amortisation (EBITDA) at Rs 2,100 crore, with the EBITDA margin expanding 20 basis points (bps) sequentially to 29.1 percent.Going ahead, brokerages also believe that the drugmaker's commentary on its US base business and margin trend will remain the key monitorable, especially at a time when the contribution from Revlimid is expected to gradually taper off through the coming fiscal.Also Read | Cipla tumbles 3% after Samina Hamied steps down as VCDisclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.\n       ",
    "The market is largely expected to remain rangebound and consolidative in coming sessions as experts feel most of the negative news have already been priced in and the participants may await the FOMC interest rate decision scheduled next week. If the Nifty 50 gives a strong closing above 21,500, then there is a possibility of upward trend towards 21,700, with support at 21,300-21,200 area, they said.On January 25, the Nifty 50 rallied 215 points to 21,454, and formed a long bullish candlestick pattern on the daily charts, while the BSE Sensex was up 690 points at 71,060. The Nifty Midcap 100 and Smallcap 100 indices also participated in the run, rising 1.8 percent and 1.7 percent.Stocks that performed better than the benchmark indices and broader markets included Aditya Birla Fashion & Retail, Dr Reddy's Laboratories, and Borosil Renewables. Aditya Birla Fashion & Retail has seen a nice breakout of consolidation and maintained upward sloping support trendline. The stock rallied 5.66 percent to Rs 235.3 and formed strong bullish candlestick pattern on the daily charts with healthy volumes.Dr Reddy's Laboratories has been witnessing higher highs, higher lows formation on the daily charts, since the November lows, while holding the upward sloping support tredline. The stock climbed 4 percent to Rs 5,902 and formed strong bullish candlestick pattern on the daily timeframe with healthy volumes. It is 70 rupees away from its record high of August 24 last year.Borosil Renewables has maintained strong upward trend for yet another session. It has seen a breakout of downward sloping resistance trendline in previous session with a strong gap up opening and closed 11.6 percent higher in previous session, followed by 7.5 percent rally on January 24 with robust volumes on both days.Here's what Jigar S Patel of Anand Rathi Shares & Stock Brokers recommends investors should do with these stocks when the market resumes trading today:Aditya Birla Fashion & RetailSince the last few months, the counter has been respecting Rs 215 levels. Also, the correction from the recent top Rs 248 had very thin volume, which hints that bears are losing steam. In previous trading sessions, the said counter has gained momentum, which is looking lucrative.On indicator, hourly scale stochastics has managed to make bullish divergence, which further confirms the bullish stance in the counter. Thus, we advise going long in the range of Rs 230–238 with an upside target of Rs 265 and a stop-loss placed near Rs 219 on a daily close basis.Dr Reddy's LaboratoriesSince the last few months, the counter has been respecting Rs 5,500 levels. Also, the correction from the recent top Rs 5,970 had very thin volume (refer to the chart), which hints that bears are losing steam.In previous trading sessions, the said counter has gained momentum by clocking 4 percent gains, which is looking lucrative. On indicator, daily scale stochastics has managed to make bullish hidden divergence, which further confirms the bullish stance in the counter. Thus, we advise going long in the range of Rs 5,850-6,000 with an upside target of Rs 6,350 and a stop-loss placed near Rs 5,699 on a daily close basis.Note: Hidden Bullish Divergence is Once price makes a higher low (HL), look and see if the oscillator (stochastics in our case) does the same. If it doesn’t and makes a lower low (LL), then we’ve got some hidden divergence in our hands.Borosil RenewablesJanuary 2024 has been fabulous for the said counter as it has already given 38 percent return in just one month time. Having said that still lot of upside potential is seen. On monthly time frame it has taken out previous 7 months candle. Also, volume is very huge from lower levels which is making it as a lucrative buy.On Indicator front, monthly stochastics has given bull cross just above oversold zone which further confirms bullish stance in the counter. Thus, one can buy in small tranche in the range of Rs 590-615 and another tranche in the range of Rs 550-560 (if tested) for upside target of Rs 750 and stop-loss would be placed near Rs 499 on daily close basis. (view will be 2-3 months).Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Research & Development at Dr. Reddy’s is much more productive now because the company uses machine learning to learn how scale ups are done and how the products will behave in the patient, according to GV Prasad, co-chairman and managing director, Dr. Reddy’s Laboratories. He spoke to Moneycontrol on the sidelines of the World Economic Forum 2024 in Davos.Prasad noted that Artificial Intelligence will be a force multiplier, while adding that Dr. Reddy’s is collaborating with some major Chinese companies to bring their innovations to India and emerging markets.Prasad also noted that he doesn’t see major consolidation happening in the Indian pharma sector. “There will be some PE-driven companies which are going to be acquired by strategic players. I think that will continue. You will see 2-3-4 deals a year at most. But not a wave of large company consolidation.”Prasad said that China is target market for the company as a potential area because of the large population as well as the premium for innovation.“We are collaborating with some major Chinese companies and to bring their innovations to India and emerging markets,” he said.Watch video here ",
    "Sharekhan's research report on Dr. Reddy’s LaboratoriesDr Reddy’s Laboratories has entered into an agreement for the development and commercialisation of COYA 302, an investigational combination therapy for the treatment of Amyotrophic Lateral Sclerosis (ALS). Dr. Reddy’s will make a USD 7.5 million upfront payment to Coya. Coya is also eligible to receive sales-based milestone payments of up to USD 677.25 million linked to tiers of cumulative net sales achieved over several years (over the term of the agreement subject to product commercial exclusivity). Under the Agreement, Dr. Reddy’s will obtain commercialization rights for COYA 302 in the United States, Canada, the European Union and the United Kingdom for patients with ALS.OutlookManagement retains its strong guidance of over 25% EBITDA margin in the near term, driven by settled product agreements like gRevlimid and double-digit growth in the India business. The stock trades at an attractive valuation of 17.3x and 15.4x its FY2025E and FY2026E estimates vs. peers’ 26x and 22.1x, indicating attractive valuations. Hence we maintain BUY with PT of Rs. 6,373.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Dr. Reddy’s Laboratories - 08 - 11 - 2023 - khan ",
    "Shares of Dr Reddy's Laboratories Limited traded 2 percent higher to Rs 5,849 in morning trade on December 7 after the company announced that Dr.Reddy's Laboratories SA, a wholly-owned subsidiary, has entered into an exclusive collaboration for the development and commercialisation of COYA 302 for the treatment of amyotrophic lateral sclerosis (ALS). \"Under the Agreement, Dr. Reddy’s will obtain commercialization rights for COYA 302 in the United States, Canada, the European Union and the United Kingdom, for patients with ALS,\" the pharma major said in a regulatory filing on December 6.At 11:20 am, the counter was trading at Rs 5,801, up 1.3 percent from the previous close on the NSE.Follow our market blog for all the live actionCOYA 302 is a combination biologic under investigation for subcutaneous administration. The mechanism of action of COYA 302 aims to suppress chronic and sustained inflammation that underlies certain neurodegenerative diseases.As per the agreement, Dr Reddy’s will make an upfront payment of USD 7.5 million to Coya. Upon the first acceptance by the U.S. Food and Drug Administration (FDA) for the drug, Dr. Reddy’s will provide an additional USD 4.2 million. Another payment of USD 4.2 million will be made upon the dosing of the first patient in the first Phase 2 trial of COYA 302.ALS is a fatal motor neuron disease. It is characterised by progressive degeneration of nerve cells in the spinal cord and brain.This isn't the first time the two companies have collaborated. In early 2023, Coya entered into an in-licensing agreement with Dr Reddy’s to licenseits proposed biosimilar abatacept for the development and commercialisation of COYA 302.Disclaimer: The views and investment tips expressed by experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before making any investment decisions. ",
    "Dr Reddy’s Laboratories, Glenmark Pharma, and Zydus are recalling products in the US market for manufacturing issues, according to the US Food and Drug Administration (USFDA).In its latest enforcement report, the US health regulator said Princeton-based Dr Reddy’s Laboratories, Inc., a unit of the Hyderabad-based drug firm, is recalling 1,656 bottles of Montelukast sodium tablets.The product is indicated to prevent wheezing, breathing difficulty, chest tightness, and coughing caused by asthma in adults. As per the USFDA, the company is recalling the affected lot due to \"the presence of foreign tablets and capsules\".A foreign tablet was found in a bottle of Montelukast sodium tablets, USP 10mg, identified as metoprolol 25 mg, it added. The company initiated the Class II voluntary recall on October 13.The USFDA noted that Mahwah-based Glenmark Pharmaceuticals Inc, USA, a unit of Mumbai-based Glenmark Pharma, is recalling 5,856 bottles of Deferasirox tablets for oral suspension. The product is used to treat hemochromatosis, or iron overload in the blood. The company is recalling the affected lot due to \"failed dissolution specifications,\" the USFDA noted. The company initiated the Class II recall on October 20.Glenmark Pharmaceuticals Inc is also recalling 16,944 bottles of Ranolazine Extended-Release tablets, used to treat chronic chest pain, in the US due to \"failed dissolution specifications,\" the USFDA stated. The company initiated the Class II nationwide recall on October 23.The US health regulator noted that Zydus Pharmaceuticals (USA) Inc is recalling a certain number of Oxybutynin Chloride extended-release tablets in different strengths due to \"failed dissolution specifications-out-of-specification test results\".The affected lot was manufactured by Cadila Healthcare Ltd, Baddi, Himachal Pradesh, it added. The affected lot was manufactured by Cadila Healthcare Ltd, Baddi, Himachal Pradesh, it added. The company initiated the Class II recall on October 19 this year.As per the USFDA, a Class II recall is initiated in a situation in which the use of or exposure to a violative product may cause temporary or medically reversible adverse health consequences or where the probability of serious adverse health consequences is remote.\n       ",
    "Net Sales at Rs 6,902.60 crore in September 2023 up 9.01% from Rs. 6,331.80 crore in September 2022.Quarterly Net Profit at Rs. 1,482.20 crore in September 2023 up 33.03% from Rs. 1,114.20 crore in September 2022.EBITDA stands at Rs. 2,323.30 crore in September 2023 up 19.78% from Rs. 1,939.70 crore in September 2022.Dr Reddys Labs EPS has increased to Rs. 89.09 in September 2023 from Rs. 67.13 in September 2022.Dr Reddys Labs shares closed at 5,346.45 on November 01, 2023 (NSE) and has given 8.00% returns over the last 6 months and 20.59% over the last 12 months.",
    "Net Sales at Rs 4,838.70 crore in September 2023 down 0.85% from Rs. 4,880.30 crore in September 2022.Quarterly Net Profit at Rs. 1,192.60 crore in September 2023 up 6.84% from Rs. 1,116.30 crore in September 2022.EBITDA stands at Rs. 1,852.20 crore in September 2023 down 3.57% from Rs. 1,920.80 crore in September 2022.Dr Reddys Labs EPS has increased to Rs. 71.68 in September 2023 from Rs. 67.25 in September 2022.Dr Reddys Labs shares closed at 5,345.35 on October 30, 2023 (NSE) and has given 7.98% returns over the last 6 months and 20.56% over the last 12 months.",
    "Pharmaceutical major Dr Reddy’s Laboratories delivered better-than-expected Q2 results, backed by strong contribution from the blockbuster cancer drug Revlimid and higher other income from benefits from the government's production-linked incentives.However, brokerages see the drugmaker's high dependence on Revlimid, increased focus on inorganic growth and expensive valuations as major headwinds for Dr Reddy's.Brokerage firm Noumra attributed Dr Reddy's better-than-expected Q2 results to higher non-recurring income due to a litigation settlement income of Rs 98.4 crore, higher grants from the PLI scheme (at Rs 160 crore against a quarterly average of Rs 75 crore) along with better US revenues, thanks to resilient Revlimid sales. Nomura has a 'neutral' call on the drugmaker with a target price of Rs 5,802.Dr Reddy's reported its highest-ever net profit and revenue in Q2 at Rs 1,480 crore and  Rs 6,880.20 crore. Not just that, both the net profit as well as revenue also topped the Street's expectations of Rs 1,290.7 crore and Rs 6,830.2 crore. EBITDA margin also expanded to 31.7 percent in July-September as against 30.6 percent in the base period.However, much of the company's strong profitability in Q2 was on account of sales of high-margin Revlimid. \"Excluding it, margins are subpar at 20 percent. We identify the reserves that Revlimid can generate to fund inorganic growth and R&D, but that also exposes it to margin and return risks post-Revlimid,\" Nuvama Institutional Equities mentioned in a note.The drugmaker is also extensively exploring opportunities of inorganic growth to compensate for the loss of Revlimid contribution from FY26. But Nuvama believes that it might not be a smooth sail as Dr Reddy's core business remains under threat and runs the risk of returns tapering down.On that account, Nuvama has a 'reduce' call on Dr Reddy's with a price target of Rs 4,670.Follow our live blog for all the market actionInvestec also believes that increased investments depressed Dr Reddy's near-term EPS, excluding Revlimid. On the other side, Investec also sees the company generating significant cash flow from Revlimid sales which helps it to evaluate better inorganic opportunities that could possibly lead to higher growth in the long run. The brokerage has a 'buy' call on Dr Reddy's with a target price of Rs 6,520.Motilal Oswal Finacial Services also highlighted expectations of an earnings growth moderation for Dr Reddy's after a strong 31 percent earnings CAGR over FY21-23. \"We expect earnings growth momentum to moderate to 12 percent CAGR over FY23-25 due to the high base on account of Revlimid and gradual recovery in Emerging Markets/Pharmaceutical services sales,\" MOFSL said in a note.MOFSL also feels that the current stock valuation adequately factors any earnings upside for Dr Reddy's. Accordingly, the firm retained its 'neutral' call on the stock with a price target of Rs 5,400.Dr Reddy's formulations unit in Hyderabad was slapped with a form 483 along with 10 observations by the US Food and Drug Administration over the weekend. The inspection was conducted from October 19-27.At 9.41am, shares of Dr Reddy's were trading around 0.6 lower at Rs 5,365.60 on the NSE.Also Read | Dr Reddy's Q2 results: Net profit jumps 33% YoY to Rs 1,480 cr, tops estimateDisclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. \n       ",
    "Pharmaceutical major Dr Reddy's Laboratories is expected to report a healthy jump in net profit on the back of a decent sales growth when it announce its July-September quarter earnings on October 27.The Hyderabad-based company's revenue is expected to see high single-digit on-year growth as it continues to benefit from the robust sales of the blockbuster cancer drug Revlimid in the US.According to a poll of brokerages collated by Moneycontrol, Dr Reddy’s is likely to report a net profit of Rs 1,481.80 crore, up 34.7 percent from a year ago. Its revenue is expected to be at Rs 6,945.10 crore, rising 9.6 percent from the same quarter of the previous fiscal.Sequential, Dr Reddy’s is likely to see a cooling of Revlimid sales and weakness in the domestic market. The company delivered a topline of Rs 6,757.90 crore and a bottomline of Rs 1,400.70 crore in the previous quarter.US growth to hold up in Q2Growth in Dr Reddy's US business is expected to remain resilient as sales Revlimid remain strong when compared to peers despite some moderation. A ramp-up of Nuvaring, a contraception ring, constipation drug Amitiza, Suboxone, which is used to treat opioid use disorder, Vascepa that reduces the risk of heart attack and stroke and Remoduli, which is for treating pulmonary arterial hypertension, will also aid US sales.Brokerage firm Philip Capital has forecast strong US sales for Dr Reddy's at $355 million, led by the continued benefit of Revlimid, pegged at nearly $100 million, and integration of acquired Mayne Pharma's operation with sales of over $25 million.India business weak A slowdown in the domestic pharma market due lower offtake in acute sales on the back of a sporadic monsoon and slower uptick in viral infections is likely to weigh down Dr Reddy's growth in the domestic market.Brokerage firm Nuvama Institutional Equities sees Dr Reddy's India business delivering a mere 5 percent growth on-year due to a season of weak so-called acute season as well as lost sales from divested brands.Acute therapies are anti-infective drugs but because monsoon was sporadic and late this year, these infections didn't see a spike, impacting sale of acute drugs.Other markets like Europe and Russia are expected to deliver double-digit growth in Q2.Pressure on margins likelyThe moderation in sales of high-margin drug Revlimid and a change in product mix is expected to be a major drag on Dr Reddy's profitability sequentially.According to Kotak Institutional Equities, a sequential decline of 80 basis points (bps) in gross margins and 220 (bps) in the EBITDA margin is likely . The firm also expects consolidated EBITDA to grow 3 percent on year to Rs 1,950 crore.EBITDA is short for earnings before interest, taxes, depreciation, and amortisation. One basis points is one-hundredth of a percentage point.Aside from the earnings show, stakeholders will also be watching the management's commentary on margins and US sales excluding those of Revlimid. The drugmaker's pipeline and research and development costs will also be followed closely.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "The market resumed selling pressure after a day of rebound and fell below the 19,700 mark, which coincides with the 20-day EMA (exponential moving average), on October 18. Hence, if the correction persists and index decisively breaks the 50-day EMA of 19,600, which is expected to be the immediate support for the index in the next session, then 19,480, the low of the previous week, can't be ruled out, while 19,750-19,850 will remain hurdle for the index on higher side, experts said.The Nifty50 dropped 140 points to 19,671, and the BSE Sensex slipped more than 550 points to 65,877, while the breadth was in favour of bears in the 1:2 ratio.The broader markets were also supported by bears, as the Nifty Midcap 100 was down 0.9 percent and Smallcap 100 index fell third of a percent.Stocks that outperformed the broader markets included Dr Reddy's Laboratories, KPR Mill, and Sun TV Network. Dr Reddy's Laboratories has seen a breakout of falling resistance trendline on Wednesday after a consolidation and formed a long, bullish candlestick pattern on the daily charts with above average volumes. The stock gained 2.4 percent to Rs 5,677.5 and traded above all key moving averages (20, 50, 100 and 200-day EMAs), which is a positive sign.KPR Mill ended at a record closing high of Rs 820.3, up 3.4 percent with robust volumes. The stock has formed long bullish candlestick pattern on the daily charts, continuing uptrend of the last four sessions. The stock has taken a good support at 50-day EMA in the recent correction and got back decisively above the 20-day EMA in the current uptrend. It gained more momentum after breakout of falling resistance trendline in previous session.Sun TV Network traded at multi-year highs now, rising 3 percent to Rs 661.8, the highest closing level since November 1, 2018. The stock has formed long bullish candlestick pattern on the daily charts, with strong volumes, while on weekly scale, it has given horizontal resistance trendline breakout this week with above average volumes.Here's what Jigar S Patel of Anand Rathi Shares & Stock Brokers recommends investors should do with these stocks when the market resumes trading today:Dr Reddy's LaboratoriesSince the last 8–10 trading sessions, the said counter has been trading in the tight range (consolidating) of Rs 5,400–5,600. In the previous trading session, it took out the said range and is currently placed near Rs 5,700 mark.The best part about this consolidation is that it consolidated near 50 DEMA (the daily exponential moving average). On the indicator front, daily DMI’s (directional movement index) have turned positive, and the RSI (relative strength index) daily has reversed from 40 levels, which is looking lucrative.One can buy in the range of Rs 5,650–5,700, with a stop-loss of Rs 5,480 and a target of Rs 6,025.KPR MillThough KPR MIL looks attractive due to its recent rally, one needs to be cautious since it is in the process of making bear divergence on a daily scale. Where price action is making higher highs, RSI is not complementing it.Also, volume at the top is huge, which is a sign of exhaustion according to volume at price analysis. Thus, we advise you to avoid fresh longs and try to book profits in the zone of Rs 820–840.Sun TV NetworkSun TV Network has given a stellar return of 58 percent in just 3 months’ time. At the current juncture, maintaining a cautious approach would be the need of the hour due to the following reasons:> The current price action on the weekly chart is way above the Ichimoku cloud, which is a matter of concern.> Rs 662 levels will be stiff resistance since it is the 0.618 retracement point of the 2018 January high of 888.> The weekly ADX (average directional index) line is way above both DMI's, which might call for some booking at the counter.Thus, book profit in the zone of Rs 660–675 and avoid fresh longs.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Bears ruled the trade as the Nifty witnessed selling pressure throughout the day on October 18. The index found resistance at 19,850, which led to a fall towards 19,650.Going forward, the index may witness a rangebound move until it breaks out in either direction. A fall below 19,650 might give bears more strength and the Nifty might fall towards 19,250. On the higher end, a decisive move above 19,850 might open the way towards 20,200.The Bank Nifty index experienced a bearish phase, encountering strong resistance at 44,500, where the highest open interest is concentrated. The weak undertone in the market suggests a preference for selling on price rallies, and a breach of the 43,800 support level is expected to lead to further selling pressure.The index's position below the 20-DMA reinforces the bearish sentiment in the near term.Here are two buy calls and one sell call for short term:Ujjivan Small Finance Bank: Buy | LTP: Rs 57.15 | Stop-Loss: Rs 54.8 | Target: Rs 62 | Return: 8.5 percentUjjivan Small Finance Bank has experienced a rounding bottom pattern breakout on the 30-minute chart, indicating an increase in optimism. The stock found support around the 20-SMA (Rs 55.24) before recovering towards higher levels.According to the current setup, the stock might move towards Rs 62 in the near term. On the lower end, support is positioned at Rs 54.80.Dr Reddy's Laboratories: Buy | LTP: Rs 5,677 | Stop-Loss: Rs 5,580 | Target: Rs 5,900 | Return: 4 percentDr Reddy's Labs stock has broken out of a falling trendline with strong volume support, confirming a bullish sentiment. The positive RSI (relative strength index) crossover suggests increasing upward momentum. The stock has support at Rs 5,580, and potential upside targets are in the range of Rs 5,800 to Rs 5,900.Bajaj Finserv: Sell | LTP: Rs 1,628 | Stop-Loss: Rs 1,680 | Target: Rs 1,500 | Return: 8 percentBajaj Finserv has fallen following a double top formation on the daily chart. Additionally, the stock has formed a Bearish Engulfing pattern, and the RSI is showing bearish divergence.Over the short term, the stock might decline towards Rs 1,500. The resistance is located at Rs 1,680.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Shares of Dr Reddy’s Laboratories traded 1.2 percent lower on October 10 after the pharma major and a host of drug makers were named as defendants in an antitrust complaint regarding cancer drug Revlimid filed in the US.As of 11.20am, the shares of Dr Reddy’s were trading at Rs 5,449.15, down 0.83 percent on the NSE.The complaint, filed by Mayo Clinic, asserted claims under America’s federal and state antitrust laws and other state laws. Mayo Clinic alleged that the defendants improperly restrained competition and maintained a shared monopoly in the sale of brand and generic Revlimid through their respective settlements of patent litigation.Follow our market blog for all the live action“The complaint alleges that the challenged agreements improperly delayed generic entry entirely until 2022 and then improperly limited generic competition through 2026. The complaint seeks damages for purported overpayments and equitable relief,” Dr Reddy’s said in a statement.The company reiterated that the allegations lacked merit and it would vigorously defend the litigation.Shareholding patterns, technical indicatorsShares of the firm gained 14.49 percent in the past six months, but surged 24.5 percent over the past year. Compared to Dr Reddy's, the benchmark Nifty 50 climbed 12.7 percent in this period. The pharma major boasted of a market capitalisation of Rs 90,854.4 crore.The scrip sees very low volatility, indicated by its one-year beta of 0.49. The RSI is mid-range, at 46.1, as the stock is neither overbought nor oversold.According to the June quarter shareholding data, the promoters have a 26.7 percent stake in the company, while FIIs held 27 percent, DIIs 34.5 percent, and the public owned 11.6 percent in Dr Reddy's.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Divi’s Laboratories and Dr Reddy’s Labs are two pharma companies that have seen a pessimistic outlook in Moneycontrol’s analyst call tracker. ‘Buy’ calls on Divi’s Laboratories stock fell to six from 14, while that on Dr Reddy’s Laboratories fell to 18 from 36, as valuations appear to have run ahead of the limited growth opportunities.Divi’s custom synthesis business While Divi’s stock has had a decent year with returns of 9.6 percent YTD, the company's revenues in the quarter ending June did not meet analysts’ expectations. The company’s Q1FY24 revenue fell 21.1 percent YoY to Rs 1,778 crore, with EBITDA falling 40.5 percent YoY to Rs 5,040 crore and the net profit falling 49.3 percent to Rs 356 crore. The on-year fall is from a high base formed by supply of molecules used for Covid treatment.Divi's Labs shares closed at Rs 3697.2 on October 5.Revenue from generic business fell 8.1 percent YoY to Rs 944 crore while custom business was down 45.1 percent YoY to Rs 656 crore. Custom synthesis makes up 40 percent of business sales while generic drugs make up the remaining 60 percent.According to Elara Capital, Divi’s Laboratories has an expensive valuation at 57.7x FY24E and 49.5x FY25E core earnings; this is significantly higher than pre-Covid range of 25-28x. The company’s EBITDA margin improved to 28.3 percent in Q1FY24, from the 23-25 percent range in H2FY23; but it is still below pre-Covid range of 33-38 percent. Elara Capital said that the company's new initiatives, such as using active pharmaceutical ingredients (API) used in imaging contrasts, and nutraceutical products along with new projects in the custom synthesis business, are not enough.“We reduce our FY24E core EPS by four percent, but maintain FY25E/26E estimates. The stock trades at 58.1x FY24E core EPS of Rs 61.5. We reiterate ‘sell’. We raise our target price to Rs 2,199 from Rs 1,980, which is 28x FY25E core EPS of Rs 71.6 plus cash per share of Rs 193.” said Elara in a note.Systematix institutional equities changed its rating from ‘hold’ to ‘sell’ with a price target of Rs 2,681 based on 30x FY25E EPS. The reasons for the change in recommendation were the changes in the macro environment where growth opportunity for custom synthesis business is getting reduced.Follow our live blog for all market actionDr Reddy's to face competition in core businessDr Reddy's stock has had a stellar year with 27.6 percent YTD return, with the company reporting strong April-June results driven by North American business sales. The company’s Q1FY24 consolidated revenue increased by 29.1 percent YoY to Rs 6,758 crore while profit increased 18.2 percent YoY to Rs 1,405 crore. gRevlimid, a drug used to treat myeloma - a type of blood cancer - made up the majority of the company’s North American sales.According to Antique Stock Broking’s estimates, four products - gVascepa, gCiprodex, gLexiscan, and gSuboxone will deliver 12-15 percent of core North American revenue in FY24. The broker expects tough competition in this category as other companies are gearing to launch similar products. Additionally, out of over 100 products listed as being in shortage by USFDA in America, the company has just five products with low estimated market value, so the company won’t have much gains in the North American business.Antique downgraded Dr Reddy's stock to ‘sell’ from ‘hold’ with a target of Rs 4,658 valuing the company at 19x on FY25 EPS.Elara Capital maintained its ‘Reduce’ rating on Dr Reddy's stock, but increased the target price to Rs 5,579 “based on 17x FY25E core earnings of Rs 299 plus cash per share of Rs 496”, the broker said. The broker also expects  little upside to the stock due to the recent rally.Shares of Dr Reddy's Laboratories closed at Rs 5407.25 on October 5, rising by 27.68 percent YTD.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol are their own and not those of the website or its management. Moneycontrol advises users to check with certified experts before taking any investment decisions ",
    "With Cipla's promoters, the Hamieds, looking out for potential buyers to divest their stake, one of the biggest India Inc takeovers is brewing.Cipla's peers and private equity firms, including Blackstone and Baring Asia, are said to be jostling for the pharma jewel. While Torrent Pharma, a smaller rival, has emerged as a frontrunner, on the other side, Dr Reddy's Labs was reportedly approached by Bain Capital to make a joint bid for Cipla.The promoters currently own a 33.47 percent stake in Cipla, which means acquiring their stake would trigger a mandatory open offer for an additional 26 percent stake, potentially resulting in the buyer holding majority ownership of up to 59.47 percent in Cipla. Considering Cipla's current market capitalisation, this transaction would carry a substantial value of over $7 billion, making it the biggest deal in the Indian pharmaceutical sector.The news of the acquisition has also set in motion a slew of speculations over who could win the battle and what the future may look like for Cipla.Given that the deal will likely take place at Cipla's current market price (CMP), analysts at Kotak Institutional Equities (KIE) feel that the ability of PE investors to derive a healthy internal rate of return (IRR) could be constrained. Hence, they see a higher possibility of a strategic investor acquiring Cipla is higher at its CMP.Brushing aside the idea of PE investors taking over Cipla leaves two candidates in the race — Torrent Pharma and Dr Reddy's.How will the economics work out for Torrent Pharma and Dr Reddy's?The fact that Torrent Pharma is eyeing a majority stake in a company, which is 2.5 times its size in sales, is remarkable and daunting at the same time. While Torrent does have an impeccable track record of acquisitions in the recent past, like that of Elder Pharma, Unichem Labs and most recently, Curatio Healthcare, some analysts also have concerns about the risks that the debt burden may bring for the company.A common thread tying together Torrent Pharma and Dr Reddy's in their quest to take over Cipla is the consequent rise in their near-term debt levels. Assuming the deal happens at CMP, the buyer would need $7.3 billion to acquire Cipla promoters’ entire stake and complete the 26 percent open offer (assuming 100 percent subscription).If Torrent wins the race, foreign brokerage Jefferies believes that the company will be used as a vehicle to acquire Cipla rather than the former's promoters buying out the latter's promoters stake. KIE also does not consider the possibility of Torrent's or Dr Reddy's promoters directly acquiring Cipla as that would significantly limit any synergy benefits.With the assumption that Torrent Pharma can raise equity from promoters, PE or other equity investors worth $2.8-2.9 billion to the extent that their promoter stake dilutes to 51 percent from the current 71 percent, it will still need to raise debt to fulfil the remaining $4 billion. This would take Torrent's debt-to-EBITDA to 3.5 times.As for Dr Reddy's, the debt-to-EBITDA is likely to come around 1.5 times, based on the same calculations. Based on these assumptions, KIE expects a 7 percent and 4 percent earnings-per-stock dilution in FY25 earnings for Torrent Pharma and Dr Reddy's, respectively, if either acquires Cipla.Irrespective of which firm manages to gain control over Cipla, Jefferies believes that the combined entity will generate considerable free cash flows, and hence, both companies in the race should be able to handle the stretched balance sheet.Some pockets in the market also have a contrarian take on this. YES Securities for example believes that the Cipla deal would be an upfront negative for Torrent's ROCE (Return on Capital Employed)/ROE (Return on Equity), which coupled with the debt burden would have a bearing on their view if at all it becomes a reality.Also Read | Cipla’s stake change: different scenarios for the investor Regardless, analysts at KIE feel that a higher promoter shareholding in Torrent Pharma (71.25 percent as against 26.7 percent in Dr Reddy's) provides the company with a higher flexibility as it gives another avenue for fundraising for the promoters.With that said, culturally, it is Cipla and Dr Reddy's that are more aligned with each other. \"Unlike Cipla and Dr Reddy's, where the involvement of promoters in day-to-day operations is limited, the promoter family is actively involved in the day-to-day operations of Torrent Pharma,\" KIE noted.Nonetheless, the takeover of Cipla by either of the two companies will lead to the emergence of a merged entity that will be a market leader in the domestic pharma market.Limited portfolio overlaps, a trigger for future growthAnother common thread tying Torrent Pharma and Dr Reddy's is the limited overlap of less than 3 percent and 7 percent market share with Cipla, respectively, in their domestic portfolios. KIE noted that the combined market shares of brands in an overlapping molecule are in the range of 1-18 percent and 1-22 percent for Torrent Pharma and Dr Reddy's, respectively, which limits the risk of divestments.The India business was the biggest contributor for both Cipla and Torrent in FY23, while the North American market seized the deal for Dr Reddy's.Coming to the international market, there is barely any overlap in the portfolios of Cipla and Torrent Pharma. However, there is a slightly higher overlap for Dr Reddy's, especially within international markets, specifically in US generics, which brokerages believe is unlikely to yield meaningful synergies.Cipla and Torrent Pharma — what are the synergies?Cipla's robust presence in South Africa complements Torrent Pharma's strong presence in Brazil, KIE highlighted. In emerging markets, getting product registrations and establishing an 'on the ground' presence is difficult and hence, Jefferies believes that for the combined entity cross-selling of products in target emerging markets can lead to faster scale-up of operations.In the domestic market, Torrent has a strong presence in cardiac, neuro, vitamins and minerals while Cipla is well-oiled in respiratory and anti-infective segments. Cipla also has a well-established trade in the generics segment (about 20 percent of India sales) and a recently established Consumer Health division.YES Securities seconded the view as it believes Cipla and Torrent's complementary presence would also bring a larger US business into the latter's fold, a not-so-keen geography for its management.According to brokerage firm IIFL Securities, Cipla’s acquisition would make a great strategic fit for Torrent as it would catapult the merged entity to a numero uno position in the Indian market, strengthen its acute portfolio, particularly in therapies of respiratory and anti-infectives, and also provide access to Cipla’s diversified US pipeline of inhalation and complex injectables.Cipla and Dr Reddy's — what does the merged entity look like?The case is completely different for Dr Reddy's as it has a slightly higher domestic and international overlap with Cipla. However, unlike Torrent Pharma, where there is a meaningful difference in scale, KIE does not expect any major operational challenges for Dr Reddy's in managing Cipla’s US operations, considering its US business is about 1.7 times that of Cipla’s in the segment.As for other geographies, Dr Reddy's has a prominent presence in Russia and the Commonwealth of Independent States (CIS). However, Cipla has a negligible presence in this region. Both these companies are active in Europe, which could provide some scope for rationalisation in the region, KIE believes.Moreover, there is one space where neither Dr Reddy's nor Cipla have a marked presence, that is biosimilars and specialty, where peer Sun Pharma leads. Based on that, KIE feels the combined entity will have a higher ability to pursue biosimilars and specialty forays in developed markets.Also, Cipla’s acquisition would propel Dr Reddy's into a leader in the domestic pharma market, aligned with its stated ambition of being among the top five players in India.Overall, KIE sees synergies for both Torrent and Dr Reddy's with Cipla, driven by the rationalisation of Medical Representative costs, marketing and promotional expenses, as well as the optimisation of corporate and manufacturing overheads.Despite the various permutations and combinations being put out, the deal is yet to reach its course. And the ball can land in anyone's court.Also Read | Why PE firms may find Cipla acquisition a different ball gameDisclaimer: The views and investment tips expressed by experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Shares of Cipla opened over 2 percent higher on September 5 as reports said that private equity firm Bain Capital was in talks with Dr Reddy's Laboratories to explore a joint bid to buy out the promoter's stake in the drugmaker.At 09.31 am, shares of Cipla were trading 1.5 percent higher at Rs 1,258 on the NSE, while those of Dr Reddy's Labs were down 0.6 percent at Rs 5,627.30.With the possible entry of Bain Capital and Dr Reddy's in the race to buyout the promoters stake in Cipla, the competition has now intensified as bidders like Torrent Pharma and PE firm Blackstone have already placed their bids for the same.The report by Economic Times said senior leadership from Dr Reddy's and Bain Capital met along with their advisors to discuss and formalise a strategy. If the deal with Dr Reddy's fructifies, the merged entity would become the largest pharma company not just in India, but also in the US and other emerging markets.Follow our live blog for all the market actionIn response to the news, Dr Reddy's said in an exchange filing that it does not comment on market speculations and that there is currently no such event or information which requires a disclosure.On September 4, a media report said Torrent Pharmaceuticals was currently the frontrunner in the race, having placed a non-binding offer that’s more than 30 percent higher than PE giant Blackstone’s bid.Meanwhile, another positive that will like play out for Cipla in today's session is the drugmaker's acquisition of South Africa based consumer health and generic medicine company, Actor Pharma. The acquisition will cost Cipla $48.6 million and will be done through its wholly-owned subsidiary in South Africa.Also Read: Why PE firms may find Cipla acquisition a different ball gameThe company has called this move as a 'strategic acquisition', highlighting its intention to capitalise on cost synergies within the South African market. Given Actor Pharma's concentration on the consumer-driven market and its upcoming product launches, Cipla anticipates a significant increase in its over-the-counter (OTC) revenue as a result of this acquisition.\"This is in line with our strategy of strengthening our OTC and wellness portfolio. We believe this is an excellent opportunity to leverage our existing marketing capabilities, unlock future growth opportunities and optimise the performance of our pipeline\" said Umang Vohra, global managing director and chief executive officer at Cipla.On September 4, shares of Cipla had settled 0.5 percent lower at Rs 1,238.85 on the National Stock Exchange.Also Read: Cipla to acquire South Africa-based Actor PharmaDisclaimer: The views and investment tips expressed by experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. "
]