[
    "Riding on an increase in sales volumes, higher average selling price (ASP), new launches, and benign commodity costs, Eicher Motors Limited (EML) reported an 18.2 percent increase in net profit at Rs 1,070 crore during the fourth quarter of this financial year. The Royal Enfield maker’s Profit After Tax (PAT) during Q4 FY23 stood at Rs 906 crore.The company’s revenue from operations jumped 11.87 percent Year-On-Year (YOY) to Rs 4,256 crore. The company's topline during the same period last year was Rs 3,804 crore.The results were in line with analysts’ expectations as the average estimates of eight brokerage firms forecasted the company’s net profit to grow to Rs 1,013 crore, up 12 percent from the year-ago period. Revenue from operations was projected to jump 9 percent on-year to Rs 4,166 crore, as per the same estimates.EML’s  Earnings Before Interest Tax Depreciation and Amortisation (EBITDA) was Rs 1,129 crore, up 20.88 percent as compared to Rs 934 crore in the same quarter of the previous financial year.During the quarter, Royal Enfield recorded sales of 227,925 motorcycles, up by 6.17 percent from 214,685 motorcycles sold during the same period in FY 2022-23.For the financial year ended March 31, 2024, EML’s total revenue from operations was at Rs 16,536 crore up by 14.50 percent as compared to Rs 14,442 crore recorded for FY 2022-23.The Siddhartha Lal-led company's EBITDA was Rs 4,327 crore, up by 25.65 percent as compared to Rs 3,444 crore in FY23, and PAT was recorded at Rs 4,001 crore, up by 37.31 percent as compared to Rs 2,914 crore for the same period last year.Siddhartha Lal, Managing Director & CEO, EML said, “We have reported exceptional performance across both Royal Enfield and VE Commercial Vehicles. In the motorcycle business, last year was an action-packed one as the middleweight segment in the industry witnessed a considerable number of launches by international brands in partnership with Indian OEMs.\"Its CV arm- Volvo Eicher VECV’s revenue from operations was Rs 21,868 crore, up by 15.38 percent over the previous year’s revenue of Rs 18,952 crore. EBITDA for FY 2023-24 was Rs 1,715 crore, 25.27 percent higher than Rs 1,369 crore last year.VECV's PAT  stood at Rs 823 crore, up 42.06 percent from Rs 579 crore last year. VECV recorded sales of 85,560 vehicles for FY 2023-24, marking a growth of 7.46 percent over 79,623 vehicles in FY 2022-23.\"We also made tremendous progress on EV vehicles with commencement of sales of EV trucks and the global unveil of the new electric-first Small Commercial Vehicle (SCV). With an expanding product range, backed by cutting-edge connected and efficient solutions, we are quite upbeat for the growth potential for VECV,\" added Lal.The Board of Directors of the company declared a final dividend of Rs 51 per share for FY24 with a payout of Rs 1,396.4 crore.Eicher Motors’ stock price ended at Rs 4,670 per share on NSE, up by over two percent from the previous day's close. \n       ",
    "Eicher Motors Ltd is expected to report a robust set of Q4 results, riding on increase in sales volumes, higher average selling price (ASP), new launches and benign commodity costs.The Royal Enfield maker is expected to see its fiscal fourth-quarter net profit rise to Rs 1,013 crore, up 12 percent from the year-ago period, according to a Moneycontrol poll of eight brokerage estimates. Revenue from operations is expected to jump 9 percent on-year to Rs 4,166 crore.ALSO READ: Nifty closes below 22,000, Sensex tanks over 1,000 pts; 5 factors dragging indices lower\"Total Royal Enfield revenue expected to increase by 8.4 percent YoY in Q4FY24, led by 4 percent increase in volumes and increase in ASPs due to price increases taken in the last one year,\" Axis Securities said in a note.Eicher Motors' EBITDA for January-March quarter is expected to expand 20 percent on-year to Rs 1,132 crore. EBITDA is earnings before interest, tax, depreciation and amortisation. The impressive EBITDA growth would be led by improved product mix and stable raw material prices, analysts at Prabhudas Lilladher said.READ MORE: SBI Q4 net profit rises 24% to Rs 20,698 cr, GNPA lowest in 10 yearsAs for sales volumes, Eicher Motors sold 2.28 lakh units during the quarter, up 4.2 percent on-year. During the same period last year, the automobile major sold 2.19 lakh units, data showed.BNP Paribas, in a recent note on the automobile sector, said that with its growth strategy, Royal Enfield is evolving into a company with a varied product range and customer base, similar to Triumph, while also fostering a brand-centric culture.However, both Triumph and Harley Davidson have opted to enter RE's market with aggressive pricing, challenging RE's longstanding dominance in the premium motorcycle segment. There are concerns that RE's selling, general, and administrative (SG&A) expenses may increase to counter this competition, potentially impacting its margins.Eicher Motors shares closed at Rs 4,569, down almost a percent from the previous close on the NSE. The share price has rallied nearly 20 percent in the last three months.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "HighlightsA sharp sequential decline in demand for CVsWith the Lok Sabha election underway,\n                                    ",
    "In line with the correction in global markets on account of a surge in the dollar index, bond yields and crude prices, the benchmark Nifty index too showed some weakness, making a lower-top-lower-bottom formation in the last four trading sessions and correcting almost 700 points after forming a peak at the 22,775 levels.After the formation of a shooting star candlestick pattern on weekly charts in the previous week and making negative divergence visible in the RSI (relative strength index), the index has seen acceleration in profit-booking and has breached its short-moving averages of 10-day EMA and 20-day EMA (exponential moving average) on the daily timeframe.Going forward, we expect the index to continue displaying weakness and slide into a period of consolidation with negative bias. Hence, we advise investors to prioritise the large-cap stocks and quality mid-cap stocks for the coming few weeks as they offer a better risk-reward proposition along with a higher degree of safety around the elections.Talking about levels, the 10-day as well as 20-day EMA zone of 22,380-22,430 will act as crucial resistance on the upside. Any sustainable rebound rally could be seen only on cross-over above the 22,430 levels on the Nifty Spot. Above 22,430, the Nifty may once again rally up to the 22,750-22,800 levels. On the downside, immediate support zones are placed at 21,950, followed by the 21,750-21,700 zone.Here are three buy calls for short term:Amara Raja Energy & Mobility: Buy | LTP: Rs 968 | Stop-Loss: Rs 900 | Target: Rs 1,070/1,100 | Return: 14 percentOn Tuesday, the stock of Amara Raja Energy & Mobility has given major long-term downward sloping trendline breakout. This breakout was accompanied by a noteworthy surge in trading volume, reaching nearly 13 times the 50-day average volume. Tuesday’s total volume of 113.24 lakh far exceeded the last 50-day average volume of 8.85 lakh. The stock showed a sizeable bullish candle on the breakout day, reinforcing the strength of this upward movement.The stock is consistently trading above its 21, 50 and 100-day EMA on daily as well as weekly timeframe underscoring robust bullish momentum. Key technical indicators, including the relative strength index (RSI), are showing optimistic readings above 65 across daily, weekly, and monthly time frames, indicating favourable momentum conditions. Moreover, the other volume-based indicators like OBV (on-balance volume) and Money Flow Index are also very strong.The trend strength is extremely high. The average directional index (ADX), which shows trend strength, is as high as 27.45 on a daily chart and 26.96 on a weekly chart. Usually, the above-25 level is considered a strong trend. In both time frames, the stock is meeting the criteria.In a nutshell, the stock has registered an eight-year-strong breakout along with volume confirmation. Hence, we recommend to accumulate the stock in the zone of Rs 970-940 level with the stop loss of Rs 900. On the upside, it is likely to test the level of Rs 1,070, followed by Rs 1,100 in short-term.CDSL: Buy | LTP: Rs 1,976 | Stop-Loss: Rs 1,890 | Target: Rs 2,120/2,170 | Return: 10 percentPost testing a low of Rs 880 in March 2023, Central Depository Services (CDSL) started marking the sequence of higher tops and higher bottoms on monthly charts uptill November 2023 and within just 45 weeks, it soared by over 130 percent. However, a notable event occurred in the first week of February when a High Wave-like candle formed and thereafter it slid into the period of consolidation with subdued trading volume during this consolidation period, suggesting that it is just a routine correction following a substantial upward surge.This correction halted in the zone of Rs 1,640-1,620 levels, which is the confluence of 34-week EMA and 38.2 per cent Fibonacci retracement level of its prior upward rally (Rs 880-2,067). This support zone served as a springboard for a notable rebound in the stock's price, which was further validated by a notable increase in trading volume over the period of past 3 weeks.The stock is consistently sustaining above its 21, 50 & 100-day EMA on daily as well as weekly timeframe underscoring robust bullish momentum.The momentum indicators and oscillators are also supporting the overall bullish chart structure. The daily, weekly and monthly RSI is in bullish territory with strong reading above 60 levels. The trend strength indicator, ADX is quoting at 21.82 level and it is in rising trajectory. Further, the directional indicators continue in buy mode as +DI continues above –DI.Hence, we recommend to accumulate the stocks in the zone of Rs 1,975-1,950 level with the stop-loss of Rs 1,890. On the upside, it is likely to test the level of Rs 2,120, followed by Rs 2,170 in short-term.Eicher Motors: Buy | LTP: Rs 4,356 | Stop-Loss: Rs 4,160 | Target: Rs 4,840 | Return: 11 percentNifty Auto has been exhibiting notable strength compared to the broader market indices in recent weeks. The ratio chart of Nifty Auto to Nifty has surged to a fresh 52-week high on Tuesday and is currently at its highest level in 69 months. Among the constituents of Nifty Auto, 60 percent stocks were trading above their 20-day EMA. While, 73 per cent stocks were trading above their 50-day EMA level, highlighting the robust internal strength of the index.The stock of Eicher Motor is strongly outperforming the Nifty Auto index and it has recently given Stage-2 Cup pattern breakout on weekly scale. The depth of the cup formation is 15 percent and length is 18-weeks. This breakout is supported by significant trading volume, indicating strong buying interest from market participants. Moreover, the breakout is reinforced by the formation of a substantial bullish candle on the breakout week, highlighting the conviction behind the upward movement. Furthermore, the continued buying activity in the current week suggests that the breakout has potential sustainability.As the stock is trading at all-time high level, all the moving averages and momentum-based indicators are suggesting strong bullish momentum in stock. The weekly and daily RSI is in bullish zone as per RSI range shift rules. The daily and weekly MACD (moving average convergence divergence) stays bullish as it is quoting above its zero line and signal line. The daily MACD histogram is suggesting pickup in upside momentum.These technical factors are aligned in favor of bulls. Hence, we recommend to accumulate the stock in the zone of Rs 4,360-4,320 level with the stop loss of Rs 4,160 level. As per the measure rule of Cup pattern, the upside target is placed at Rs 4,840 in short-term.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "The week started with the bulls charging the benchmark indices to their fresh record highs on April 8. Given the positive momentum in the market, experts expect the Nifty to hit 22,800 in the immediate term and then 23,000 in the following sessions, while 22,500 is expected to act as a support, followed by 22,300 as a key support.On April 8, The BSE Sensex rallied 494 points to 74,743, while the Nifty 50 climbed 153 points to 22,666 and formed a bullish candlestick pattern on the daily charts after opening gap-up.The broader markets ended higher but underperformed the benchmark indices. The Nifty Midcap 100 index was up 0.04 percent and Smallcap 100 index gained 0.3 percent.Stocks that were among the top gainers in the Nifty500 index on April 8 included Exide Industries, GAIL India, and Eicher Motors. Exide Industries decisively surpassed its previous record high of February 5 and recorded a 17.2 percent rally to end at a new closing high of Rs 377. The stock has formed a robust bullish candlestick pattern on the daily charts with significantly higher volumes, while it traded above all key moving averages.GAIL India also saw new all-time closing high of Rs 200.75, up 5.2 percent on the NSE and formed a long bullish candlestick pattern on the daily charts with strong volumes. The stock traded above all key moving averages, which is a positive sign.Eicher Motors, too, ended at new closing high of Rs 4,205.75 after breakout of falling resistance trendline adjoining highs of December 4 and December 29 last year, and formed strong bullish candlestick pattern on the daily timeframe with healthy volumes.Here's what Ashish Kyal of Waves Strategy Advisors recommends investors should do with these stocks when the market resumes trading today:Eicher MotorsAuto sector continued to outperform, wherein, Eicher Motors showed strength in the previous session and was in the top gainers list in Nifty50.Overall momentum is increasing, as the ADX (average directional index) is at 29, indicating a trending market. In addition, prices recently closed above the previous swing high, which was near Rs 4,200 levels. Along with this, increase in volumes acting as a double confirmation.The stock has potential to move upside from current levels. However, for the better risk reward it would be wiser to use buy on dips approach.In short, Eicher Motors looks bullish. Use dips as a buying opportunity with the target of Rs 4,350 as long as Rs 4,070 holds on the downside.GAIL IndiaGAIL has been rising lately, continuing its strong upward trend. On the daily chart, in the previous session prices formed a bullish candle.Price has closed above Rs 196.50 level which confirms breakout of the rounding bottom pattern. Price is trading above the Ichimoku cloud which indicates that the short-term bias is bullish.In short, trend for this stock is positive. Use dips towards Rs 197-199 as a buying opportunity for a move towards Rs 222-225 levels as long as Rs 190 holds on the downside.Exide IndustriesOn the daily chart, the stock has given a close above its important resistance of Rs 354 levels which is a positive sign. In the previous session, prices made a new lifetime high at Rs 383.5 levels. Additionally, the Bollinger Bands have also started expanding giving us hints of possible up move in coming sessions.While the RSI (relative strength index) is trading at an overbought zone so chances of profit booking cannot be ruled out. One can use this as a buying opportunity to ride the trend.In short, the overall technical outlook for Exide Industries is bullish. After a sharp rise, buy on dips will be a prudent strategy for better risk reward with the target of Rs 390 as long as Rs 363 holds on the downside.Follow Ashish Kyal on Twitter - @kyalashishDisclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "HighlightsThe automotive sector put up a mixed performance in March with notable increases in demand for commercial vehicles (CVs) and tractors on a sequential basis, while other areas experienced a subdued performance.HighlightsPick-up in demand for commercial vehicles (CVs)While the commercial vehicle segment experienced a year-on-year decline in\n                                    ",
    "The Nifty 50 had a strong finish for the monthly F&O expiry session, climbing above the falling resistance trendline from record-high levels. This has raised hopes for a promising start to the April series, which begins on Monday, April 1. As long as the index remains above 22,300, experts predict that it is likely to reach a new record high in the coming days. The key support level to watch out for is 22,000. On March 28, the Nifty 50 rose by 203 points to reach 22,327, and the BSE Sensex gained 655 points, with the broader markets underperforming the benchmark indices. The Nifty Midcap 100 index increased by half a percent, while the Smallcap 100 index rose by 0.04 percent.Stocks that were among the biggest gainers and outperformed benchmarks included Canara Bank, Bajaj Finance, and Eicher Motors. Canara Bank rallied 3 percent to Rs 581 after recent consolidation and climbed above all key moving averages. The stock has formed a bullish candlestick pattern on the daily charts with above-average volumes.Bajaj Finance extended an uptrend for the seventh consecutive session, rising 3 percent to Rs 7,245 on the NSE. With last Thursday's strong run, the stock firmly got back above all key moving averages and formed long bullish candlestick pattern on the daily timeframe with robust volumes. The volumes have been on the rise for more than a week now.Eicher Motors also gained nearly 3 percent to close at Rs 4,019 and formed a long bullish candlestick pattern on the daily scale with healthy volumes. The stock traded above all key moving averages and is now 181 rupees away from its record high of Rs 4,200 seen on December 4, 2023.Here's what Shrikant Chouhan of Kotak Securities recommends investors should do with these stocks when the market resumes trading today:Canara BankPost-short-term correction, the counter was in a consolidation mode in a triangle formation. However, it has given a breakout of its Symmetrical Triangle chart pattern with a strong bullish candlestick pattern.Moreover, on the daily charts, it has formed a higher bottom formation, therefore the structure of the counter indicates further bullish momentum from the current levels. Unless it is trading below Rs 560, positional traders can retain an optimistic stance and look for a target of Rs 620.Bajaj FinanceOn the daily scale, the counter is into a rising channel chart formation with higher high and higher low series pattern. The technical indicators like ADX (average directional index) is also indicating further up trend from current levels, which could boost the bullish momentum in coming horizon.As long as the stock is trading above Rs 6,980 the uptrend formation is likely to continue. Above which, the counter could move up to Rs 7,750. On the flip side, fresh sell-off possible only after dismissal of Rs 6,980.Eicher MotorsAfter short-term correction from the higher levels, the counter was trading in a rectangle formation. However, on the daily and weekly charts there is a range breakout in the counter along with decent volume activity, which suggest a new leg of bullish trend in the near term.Unless it is trading below Rs 3,880 positional traders can retain an optimistic stance and look for a target of Rs 4,300.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Even after a three-day run-up, the Nifty 50 has to give a decisive close above 22,300 level to get into a strong bullish mood, till then the consolidation may continue with immediate support at 21,900 and a key support at 21,700, the low of the recent downtrend tested last week, experts said.On March 22, a day before the long weekend, the benchmark indices extended the uptrend for three straight sessions. The Nifty 50 climbed 85 points to 22,097, and formed a bullish candlestick pattern on the daily charts, while the BSE Sensex was up 191 points to 72,832.The Nifty Midcap 100 and Smallcap 100 indices outperformed the frontline indices, rising 0.6 percent each on positive breadth.Stocks that recorded better performance compared to the broader markets included Eicher Motors, Symphony, and Apollo Hospitals Enterprise. Eicher Motors extended northward journey for the fourth straight session, rising 1.8 percent to Rs 3,988 on the NSE and formed a bullish candlestick pattern with long lower shadow on the daily charts, indicating buying interest at lower levels. Now, the stock traded above all key moving averages, which is a positive sign.Symphony has seen a decisive breakout of consolidation seen in the past several sessions after downtrend and recorded 5 percent rally to Rs 868. The stock formed robust bullish candlestick pattern on the daily timeframe with significantly higher volumes and climbed back above 10 and 21-day EMAs (exponential moving averages).Apollo Hospitals Enterprise has also seen a strong consolidation breakout and jumped 3 percent to Rs 6,376, formed long bullish candlestick pattern on the daily charts with above average volumes. The stock traded above all key moving averages.Here's what Ashish Kyal of Waves Strategy Advisors recommends investors should do with these stocks when the market resumes trading today:Eicher MotorsOn the daily chart, we can see that stock has formed consolidation pattern. A close above Rs 4,015 level will confirm breakout of the said pattern. After which we can expect a good rise in this stock.On the below chart, we have also shown Bollinger Bands. Wherein, we can see that prices are currently trading close to the upper bands. Hence buying may emerge if prices close above the upper bands.In short, overall tone for Eicher Motors is bullish. Any close above Rs 4,015 is must for further bullish momentum to continue with the target of Rs 4,200. While on the downside, Rs 3,860 is the key support level.Apollo Hospitals EnterpriseOn the daily chart, we can see the stock showed impulsive rise as per Elliott wave and now completed wave 2 near Rs 6,000 level. The up move can be wave 3 which can be strong and powerful. Also the stock has given a breakout from the consolidation pattern.On the below chart, we have shown MACD (moving average convergence divergence) indicator, wherein, MACD line crossed above the MACD signal line and further break above 0 line will indicate rising momentum on upside.In short, trend for Apollo Hospitals is positive. We can expect a move to Rs 6,800 and probably higher as long as Rs 6,100 holds on the downside.SymphonyIn the previous session, prices have given a close at the mid of Bollinger bands. A close above it with follow up action is must for further bullish momentum to continue. Also, volumes are picking up, which is a good signal.In short, the trend for Symphony is positive. A daily close above Rs 870 will confirm about positive trend reversal and then we can expect a rise towards Rs 895 levels. On the downside, Rs 820 remains the crucial support level.Follow Ashish Kyal on Twitter - @kyalashishDisclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Volatile trade ruled the market through the week ended March 22 with a slight positive note of 0.3 percent rise in Nifty at the time of settling down a tad below 22,100 levels.There has been a strong show of tug-of-war between the counterparties to exhibit their presence, though no conducive settlement was seen, portraying tentativeness in the market. The Nifty still hovers within the 20-day and 50-day exponential moving average (DEMA) on the daily chart, indicating uncertainty. However, the recent low signifies a lower low formation on the daily timeframe, and a further correction below the same could indicate the inception of a bearish trend in the markets.For now, 21,900-21,850 is likely to cushion any short-term blip, with major focus on a swing low of 21,700, breaching which disruption on chart structure could be seen in the current truncated week. On the higher end, 22,200-22,250 is expected to act as an intermediate hurdle, and an authoritative closure above the same could only bring some mojo back into the market.As we head for a truncated week with just three trading sessions and monthly expiry, it would be crucial to track global developments to have an immediate effect on the markets. Also, a spike in volatility is anticipated, keeping expiry in view. Hence, it is advisable to maintain caution and stay fussy with stock selection for an outperformance in the market.Here are three buy calls for the short term:Apollo Hospitals Enterprise: Buy | LTP: Rs 6,375.90 | Stop-Loss: Rs 6,100 | Target: Rs 6,650-6,770 | Return: 6 percentApollo Hospitals has witnessed a decent correction of over 13 percent in the recent period from the lifetime high zone, retracting towards the neckline of the breakout on the weekly time frame. After a couple of weeks of consolidation, the stock has regained strength and reverted towards the primary trend on the back of notable volumes, indicating an opportunity to go long.The technical indicators are very much in line with the bullish development, adding a strong undertone to the counter. Hence, we recommend buying Apollo Hospitals around Rs 6,370-6,350, with a stop-loss of Rs 6,100 and target of Rs 6,650-6,770.Eicher Motors: Buy | LTP: Rs 3,988.40 | Stop-Loss: Rs 3,800 | Target: Rs 4,180-4,200 | Return: 5 percentEicher Motors witnessed a strong spurt in price-volume in the last trading week from the cluster of its significant EMAs and made a strong runaway gap. Also, on the daily time frame, the counter has witnessed a sloping trendline breakout and made a strong weekly closure above its immediate swing high.From a technical standpoint, the 14-period RSI (relative strength index) and MACD (moving average convergence divergence) both signal a positive crossover, suggesting the counter looks poised to reclaim its lifetime high zone in a comparable period.Hence, we recommend buying Eicher Motors around Rs 3,970-3,950, with a stop-loss of Rs 3,800 and target of Rs 4,180-4,200.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Shares of Eicher Motors Limited jumped over percent 4 percent in the morning trade on March 20 after global brokerage UBS upgraded its rating to 'buy' with as much as 35 percent upside, citing the company's new launches, and lacklustre performance from peers.At 9.50 am, Eicher Motors stock was at Rs 3,863, up 4 percent from the previous close. UBS analysts have raised their price target on Eicher Motors stock to Rs 5,000, implying an upside of 34.5 percent from the last close.Despite being aggressively priced, the launches by Harley Davidson and Bajaj Auto's triumph failed to increase volume significantly. As of February 2024, Harley and Triumph's cumulative volume of the models launched stood at around 4,000 units, well below the expected guidance.Follow our live blog for all the market actionUBS believes that even as competitors have entered the market aiming to challenge Eichers' dominance, none of them have been able to make a significant impact on customers. Rivals have also attempted to outdo Royal Enfield with better specifications and aggressive pricing but haven't been able to match Royal Enfield's qualitative and emotive edge. \"These aspects are challenging for competitors to replicate.\"As per SIAM data, the company's market share in the premium motorcycle segment has risen despite competition. Figures show that its market share in Q2FY23 stood at 42 percent and increased to 45 percent in Q3FY24.Not just that, the company is also planning to launch a new bike -- Roadster. Analysts believe that the launch will bridge the performance gap previously seen when compared to the likes of Harley Davidson and Triumph. This new model offers industry-leading performance, especially featuring Royal Enfield's first liquid-cooled engine, anticipated to address concerns regarding engine heating in hot conditions and heavy traffic. \"We believe the upcoming 450cc roadster, potentially followed by additional body forms, will stimulate replacement demand among Royal Enfield's 350cc customers.\", UBS said in a note.On exports, the brokerage anticipates a strong rebound in exports for FY25-FY26, led by the ramp-up of the Himalayan 450, the introduction of additional 650cc models, and a recovery in demand across specific end-markets. UBS projections indicate a 25 percent growth in export demand during FY25-26, contrasting with the 23 percent decline observed in FY24.\"We expect Eicher Motors to outperform the industry on volume growth over the medium term. It continues to have a strong launch pipeline, while most key competitors have already launched products,\" UBS said. It is also expected that Eichers' average selling price will outpace the industry when considering the launch of its new 450cc platform (which could be at a 20-30 percent premium to 350cc series motorcycles) and multiple 650cc launches.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.  ",
    "",
    "Prabhudas Lilladher's research report on Eicher MotorsEicher Motors’ (EIM) 3QFY24 consol. EBITDA margin at 26.1% came ~20bps above consensus and above PLe (23.5%); margins contracted ~30bps QoQ led by higher other opex given multiple launches and higher marketing and advertising spends in 3Q. However, good stride made on the RM side was a surprise to us. On CV side, VECV would benefit from profitable growth as peers work towards lowering discounts in the industry. Increase in competition has marred EIM’s medium term growth prospects and could chip away from RE’s growth. Domestic volume growth in 9MFY24 was lower than 125cc+ motorcycle industry and exports volume is expected to remain weak over next 6 months. However, (1) ASP growth from new launches, (2) focus on growing export mix, (3) higher mix of merchandise and spare should aid both revenue and margin. We roll over by one quarter and value the stock at 23x Mar-26E standalone EPS and 11x EV/EBITDA for VECV in-line with Ashok Leyland. Upgrade to ‘Accumulate’ rating.OutlookWe increase our FY24/FY25/FY26 consol. EPS estimates by 7%/4%/3% to factor in 3Q beat along with management commentary and upgrade the rating to ‘Accumulate’ from ‘Hold’ with revised SoTP based TP of Rs 4,100 (previous Rs. 3,870).For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Eicher Motors - 14022024 - prabhu ",
    "Net Sales at Rs 4,054.19 crore in December 2023 up 12.93% from Rs. 3,590.16 crore in December 2022.Quarterly Net Profit at Rs. 913.73 crore in December 2023 up 34.23% from Rs. 680.70 crore in December 2022.EBITDA stands at Rs. 1,364.33 crore in December 2023 up 30.19% from Rs. 1,047.93 crore in December 2022.Eicher Motors EPS has increased to Rs. 33.38 in December 2023 from Rs. 24.89 in December 2022.Eicher Motors shares closed at 3,901.55 on February 14, 2024 (NSE) and has given 16.86% returns over the last 6 months and 22.86% over the last 12 months.",
    "Highlights:Eicher Motors Ltd (EML; CMP: Rs 3,872.3; M Cap: Rs 1,05,598 crore; Rating: Overweight) is maintaining its robust financial performance, fuelled primarily by new products in the higher engine-capacity segment.The company's prospects look promising because\n                                    ",
    "Shares of Eicher Motors Limited traded over 3 lower to Rs 3,726 on February 14 despite better-than-expected Q3 results, as brokerages issued caution calls and muted the target prices, citing persistent competition in the premium segment.The stock closed at Rs 3,854, up o.4 percent, on February 13. In the last three months, it has given a return of about 6 percent to the exchanges.In the third quarter, the maker of the Royal Enfield bikes reported a 34.43 percent year-on-year surge in consolidated net profit, reaching Rs 995.97 crore, largely aided by a combination of higher volumes and price hikes across its product lines. The company's revenue from operations grew 12.28 percent to Rs 4,179 crore in the third quarter of FY24, while operating margins surged to 26.08 percent from 23.03 percent.Follow our market blog for all the live actionWhat should you do with the stock?Global brokerage firm Morgan Stanley is 'underweight' on the counter and has assigned a target price of Rs 3,209. This implies a downside potential of 17 percent from the last close of Rs 3,854. \"The company posted a good set of numbers, slowing growth and rising competitive pressures keeps us underweight,\" it said in a report.Nomura has assigned a 'neutral' call on the Eicher stock and a price target of Rs 3,769. That's a downside of about 2 percent from the last close. \"Slowing retail and rising competition could impact more in FY25,\" analysts at the firm said. Nomura further added that the success of new launches can drive up the average selling prices further.On the other hand, Jefferies has issued a 'buy' call and a price target of Rs 4,900, an upside potential of over 27 percent. \"The company should benefit from potential two-wheeler demand recovery and premiumisation,\" the brokerage firm said. However, Jefferies also said that it sees an impact from Hero MotoCorp's Harley Davidson and Bajaj Auto's Triumph.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Eicher Motors Limited (EML) on February 13 reported 34.43 percent YoY increase in consolidated net profit at Rs 995.97 crore for the quarter ended December 31, 2023, helped by higher volumes and price increases of its product lines.The company’s Profit after Tax (PAT) during Q3 FY23 was Rs 741 crore.The Gurgaon-based automaker’s revenue from operations increased 12.28 percent to Rs 4,179 crore in Q3FY24, up 12 percent compared to Rs 3,721 crore in the corresponding quarter of FY 2022-23.EML's results have exceeded Moneycontrol’s estimates of Rs 959.28 crore.  As per the average of five brokerage estimates, Eicher Motors was expected to announce a 29.49 percent YoY increase in consolidated net profit at Rs 959.28 crore. Revenue was expected to jump by 8.24 percent to Rs 4,027.74 crore, as per the same estimates.Eicher Motors' EBITDA was Rs 1,090 crore, up 27 percent compared to Rs 857 crore in the same quarter of the previous financial year. Its operating margin stood at 26.08 percent vis-a-vis 23.03 percent last year.The company's bike-making arm Royal Enfield sold 229,214 motorcycles in the quarter, an increase of four percent compared to 219,898 motorcycles sold over the same period in FY 2022-23.While talking about the company’s performance in the quarter gone by, Siddhartha Lal, Managing Director, EML, said, “It has been a good quarter for us at Eicher Motors, as we recorded solid business and financial performance across the board. We have strengthened our portfolio and further built on our success as we launched two new motorcycles.”EML’s commercial vehicle arm VECV recorded its highest ever Q3 sales at 20,706 units. As of December 2023, Year-to-Date (YTD) sales reached 59,828 units, marking a 12.4 percent increase from the previous year’s 53,247 units.“At VE Commercials Vehicles, we recorded our best third quarter ever, with strong sales and improved market share across all business segments. We have recently announced our entry into the growing Small Commercial Vehicle segment with an Electric-First offer which will be available from 2025,” added Lal.Shares of Eicher Motors ended 0.39 percent lower on the BSE at Rs 3,857.10.\n       ",
    "Eicher Motors is expected to post robust Q3 FY24 results, with solid double-digit net profit growth and high single-digit revenue growth, aided by strong sales volumes in Royal Enfield bikes and its commercial vehicles portfolio. Eicher Motors will announce its fiscal third-quarter results on Tuesday, February 13.According to an average of five brokerage estimates, Eicher Motors is expected to announce a 29.49 percent YoY increase in consolidated net profit to Rs 959.28 crore. Revenue may jump by 8.24 percent to Rs 4027.74 crore. EBITDA margin is also expected to rise by 319 bps to 26.19 percent.In Q3, Eicher Motors’ total sales volume rose 3.8 percent YoY to 248,779 units. Royal Enfield volumes were up 3 percent YoY to 228,073 units while total commercial vehicle sales rose 14 percent to 20,706 units.Brokerages expect the surge in Royal Enfield volumes to support revenue growth. Nomura expects the revenue to be up 12 percent supported by 3 percent growth in Royal Enfield volumes. According to Nuvama, better volume and realisation will support revenue growth. Prabhudas Lilladher points out that Royal Enfield's volume growth is due to increased domestic demand and a good festive season.Also read: Eicher Motors extends losses after CLSA too downgrades the stockAnalysts also said the commercial vehicle segment by the subsidiary VE Commercial Vehicle will contribute more to the profit. Nomura expects VECV revenues to be up 20 percent YoY while Nuvama says profit growth will be robust “due to higher share of profits from CV subsidiary (VECV)”. While Margins are expected to grow in the quarter, they may contract on QoQ basis like the revenue and profits due to flat volumes and decline in exports.According to Prabhudas Lilladher, “EBITDA margins should be flat at 23.5% due to lower export mix, advertisement spends on new launches and reversal of finished goods inventory.” Emkay Global also said the EBITDA margin would dip slightly on a quarterly basis due to flat volumes and “expenses related to the new 450cc platform launch”.Motilal Oswal said the weaker mix with low contribution from the exports market could hurt the margins. The export volumes for Eicher Motors declined by 24 percent YoY.Disclaimer: The views and investment tips expressed by experts on Moneycontrol are their own and not those of the website or its management. Moneycontrol advises users to check with certified experts before taking any investment decisions.  ",
    "Highlights: The automobile industry put up a mixed performance in January this year. While the two-wheeler (2W) and the passenger vehicle (PV) segments recorded growth, commercial vehicles and tractors experienced a decline on a year-on-year (YoY) basis.Strong Preference for Utility Vehicles (UVs)Consumers showed preference for mid- to high-range utility vehicles (UVs) within the passenger car segment. This resulted\n                                    ",
    "Automobile major Eicher Motors fell 3 percent to Rs 3,815 in morning trade on February 2, snapping its four-day gaining streak on the bourses, after investors rushed to book profits on the counter.At 9:57am, the stock was trading at Rs 3,855, down 2 percent from the previous close on the NSE. In the last four days, the stock had surged nearly 9 percent, and over 15 percent in the last three months.Follow our market blog for all the live actionIn January 2024, Eicher Motors reported a 2 percent on-year growth in total vehicle sales, reaching 76,187 units. This compares to the 74,746 motorcycles sold a year back. Models with engine capacity up to 350cc declined a marginal 1 percent to 67,620 units from 68,183 in January 2023.Models with the engine capacity exceeding 350cc segment saw a 31 percent increase 31 percent to 8,657 units from 6,563 sold during the same month last year.On January 17, CLSA downgraded the stock to 'sell' from an 'underperform' rating amid valuation concerns. Analysts said the stock is overvalued after the recent rally, as valuations are pricing in double-digit volume growth over the next few years, which seems unlikely.It was the second brokerage to downgrade Eicher in two days. On January 16, Morgan Stanley downgraded the stock to 'underweight' from 'equal-weight' and cut the target price.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "The market almost negated the lower highs, lower lows formation and looked ready for a rally towards 21,850-21,900 area as it has taken a support at 10-day as well as 21-day EMAs in the last couple of sessions despite volatility.If that comes true, then the Nifty 50 may enter the big downside gap created on January 17 and further if it manages to bridge it, then a record high can't be ruled out, as long as it holds 21,500 as a support, experts said.On February 1, the budget day, the Nifty 50 fell 28 points to 21,698 amid consolidation and the BSE Sensex lost 107 points to 71,645, while the market breadth was slightly in favour of declines. On the broader markets front, the Nifty Midcap 100 index was down six-tenth of a percent and Smallcap 100 index gained 0.6 percent, while the India VIX fell 10 percent after the FOMC meet outcome and interim budget, which may support the bulls.Stocks that outperformed the benchmarks and the broader markets included Canara Bank, Eicher Motors and BEML. Canara Bank rallied 4 percent to hit multi-year high of Rs 501.5 and formed long bullish candlestick pattern on the daily timeframe with healthy volumes. The stock continued to trade above all key moving averages (21, 50, 100 and 200-day EMA - exponential moving averages), which is a positive sign.Eicher Motors sustained its upward journey since the start of this week and the volumes were also on the higher side, especially after taking a good support at 200-day EMA in the past week. Now the stock traded above all key moving averages and rallied 2.4 percent to Rs 3,933.BEML jumped 8.5 percent to end at record closing high of Rs 3,805 and formed long bullish candlestick pattern on the daily timeframe with above average volumes, while the stock traded well above all key moving averages. Further it has been in higher highs, higher lows formation since after October lows.Here's what Shrikant Chouhan of Kotak Securities recommends investors should do with these stocks when the market resumes trading today:Canara BankOn the weekly scale, the counter is into a rising channel chart formation with higher high and higher low series pattern. The technical indicators like ADX (average directional index) is also indicating further up trend from current levels, which could boost the bullish momentum in coming horizon.For the traders, Rs 485 would be the key support level to watch out. Above which the uptrend structure should continue until Rs 540.Eicher MotorsAfter the remarkable up move of the last few weeks, the stock witnessed short-term correction from the higher levels. However, the counter has reversed its trend from its important retracement zone.The technical formation suggests a revival of the uptrend from the current levels. As long as the counter is trading above Rs 3,780, the bullish formation is likely to continue. Above which, the counter could move up to Rs 4,200.BEMLAfter the robust rally on the weekly scale, the stock went into the consolidation mode. However, the recent breakout in the stock is representing a bullish continuation pattern signifying a new leg of up move from the current levels.For positional traders, Rs 3,710 would be the trend decider level. Trading above the same uptrend formation will continue till Rs 4,120. However, if it closes below Rs 3,710 traders may prefer to exit from trading long positions.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Shares of Eicher Motors Limited traded almost 2 percent lower at Rs 3,720 on January 17, extending losses for the second day after CLSA downgraded the stock to \"sell\" from an \"underperform\" rating amid valuation concerns, the second brokerage firm to do so in as many days.CLSA analysts said the stock is overvalued after the recent rally, as valuations are pricing in double-digit volume growth over the next few years, which seems unlikely.At 11.28 am, the stock was trading at Rs 3,761, down 0.8 percent from the previous close on the NSE. In the last year, the stock has gained 18 percent, slower than the Nifty's 21 percent during the period.Follow our market blog for all the live actionThe company lowered the target price to Rs 3,716 from Rs 4,129. Stiff competition from players such as Hero Motocorp and Bajaj Auto could impact Royal Enfield figures, it said.Also read: Eicher faces a Himalayan challenge in H2; Hero MotoCorp, Bajaj Auto set to zip fastCLSA is the second brokerage to downgrade Eicher in two days. On January 16, Morgan Stanley downgraded the stock to \"underweight\" from \"equal-weight\" and cut the target price.Also Read: Analyst Call Tracker | Why Tata Motors dazzled in 2023 but Eicher dimmed out?Morgan Stanley highlighted growth and market share challenges, limited margin upside and high valuations as the key reasons for the downgrade.\"While RE (Royal Enfield) has faced competition in the past also, this time it is different as the competition is coming from (1) global iconic brands and (2) The products would be supported by experienced and established mass market players which have both financial and distribution muscles,\" analysts at Dolat Capital said in an earlier report.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. "
]