[
    "Net Sales at Rs 6,400.25 crore in December 2023 up 3.3% from Rs. 6,195.60 crore in December 2022.Quarterly Net Profit at Rs. 236.31 crore in December 2023 down 8.18% from Rs. 257.36 crore in December 2022.EBITDA stands at Rs. 642.66 crore in December 2023 up 10.86% from Rs. 579.71 crore in December 2022.Grasim EPS has decreased to Rs. 3.61 in December 2023 from Rs. 3.93 in December 2022.Grasim shares closed at 2,057.30 on February 08, 2024 (NSE) and has given 11.54% returns over the last 6 months and 25.71% over the last 12 months.",
    "Aditya Birla Group-owned Grasim Industries reported consolidated net profit for the quarter ended December 31, 2023 at Rs 1514 crore, registering a growth of 48 percent from the comparable net profit of Rs 1,024 crore a year ago. The company said that the net profit was adjusted for net of fair value gain accounted by Aditya Birla Capital Limited post-acquisition of 9.99% stake by ADIA entities in Aditya Birla Health Insurance.Shares of the cement maker was up 4.65% at Rs 2,155 in the afternoon trading on Friday.  Profit growth on comparable basis was driven by strong demand for the building material amid heavy infrastructure spending.The reported net profit of the company, however, declined 40 per cent from Rs 2,515.78 crore amid weakness in chemicals unit.Consolidated revenue came in at Rs 31,965 crore, up 11.6 percent from Rs 28,638  crore in the corresponding quarter last fiscal, Grasim Industries  said in an exchange notification.Standalone revenue stood at Rs 6,400 crore and EBITDA at Rs 643 crore, up by 3.2 percent and 11 percent YoY, respectively. \"Lower realisations in Caustic Soda business impacted the overall standalone performance,\" Grasim said.Cement sales are likely to rise amid increased government spending on infrastructure, rural development and rising demand from the housing sector. India’s cement demand is expected to grow by 6 percent to 8 percent over the next few years, Fitch Ratings said in a report in September 2023.Demand for cement slowed in December due to elections in four states, flooding in some southern states and a ban on construction to curb air pollution. Although the prices dipped in the October-December quarter, lower fuel and raw material prices helped the cement maker to protect margins.Last month, Aditya Birla-owned UltraTech Cement  posted a  a 67 percent surge in net profit in the third quarter of FY24, beating expectations, riding on the back of robust demand for the building materials and lower operating costs.Grasim's capex for the quarter stood at Rs 1,425 crore, of which Rs 1,088 crore was for the paints business.Viscose BusinessViscose business reported revenue of Rs 3,715 crore and EBITDA of Rs 402 crore for Q3FY24 up 17% and 535% YoY respectively, though sequentially down by 4% and 14% respectively.  EBITDA margins improved YoY on the back of higher sales volume and a reduction in input prices.\"China VSF Inventory levels have reduced to 10 days in Q3FY24 compared to 12 days in the previous quarter reflecting a marginal increase in demand. However global demand remained weak from the major consuming markets in US/Europe leading to decrease in prices of the fibre basket,\" the company said.Chemicals BusinessRevenue at its second-largest segment, the chemicals business, came at Rs 1,996 crore, was flat on QoQ basis and down 23% YoY.  EBITDA for the quarter was up 12% QoQ to Rs 264 crore (down 46% YoY) on the back of improved performance of chlorine derivatives business.Caustic Soda spot prices improved to ~$488/ton in Oct’23 but the quarter exit prices were at ~$423/ton, the company said.In the second quarter, Grasim's results took a hit amid declining prices in the chemicals business. The company noted oversupply in the domestic market of caustic soda and lower realisations in line with sharp decline in global prices impacted the overall standalone performance.(The copy was revised to add the reported net profit.) ",
    "Market experts expect Finance Minister Nirmala Sitharaman to focus on continuity in capital expenditure towards infrastructure, new tax regime, fiscal consolidation path and GDP growth numbers in the Budget 2024, especially ahead of general elections.The market clocked nearly one percent gains on January 31, and broader markets rallied more than 1.5 percent ahead of the budget day, thanks to banking stocks. Nifty 50 recouped almost all its previous day's gains in the rebound.On January 31, the BSE Sensex climbed over 600 points to 71,752, and the Nifty 50 jumped over 200 points to 21,726, while the Nifty Midcap 100 and Smallcap 100 indices gained 1.6 percent and 2.25 percent respectively.Moneycontrol collated a list of Budget stocks picks from experts with 3-4 weeks perspective. The closing price of January 31 is considered for stock return calculation.Expert: Jigar S Patel, Senior Manager - Equity Research at Anand RathiPetronet LNG: Buy | LTP: Rs 269 | Stop-Loss: Rs 235 | Target: Rs 320 | Return: 19 percentSince 2019 until 2023, Rs 240 levels have proved to be massive resistance. Fortunately, in January 2024, the said counter managed to clear its Rs 240 resistance very comfortably and is currently placed near Rs 270 zone.The breakout on the monthly chart looks genuine since it is accompanied by huge volume, with respective stochastics reversing from the 40 zone, which is looking lucrative at current levels.Thus, investors and traders can enter longs in the zone of Rs 255–270 with an upside target of Rs 320 and a stop-loss of Rs 235 on a daily closing basis.KPR Mill: Buy | LTP: Rs 790 | Stop-Loss: Rs 749 | Target: Rs 860 | Return: 9 percentAfter making the top near Rs 928 on November 22, 2023, the said counter gave a decent correction until Rs 732. In the previous trading session, it bounced back from the support zone of Rs 730, coincidentally, which is between 100 and 200 DEMA (day exponential moving average), and in the process, it also took out its bearish trendline (refer to the chart), thus making it attractive at current levels.On the indicator front, daily stochastics has given a bull divergence (refer to the chart), which further confirms our bullish stance on the counter. Thus, one can buy in the zone of Rs 780–795 with an upside target of Rs 860 and stop-loss orders would be placed on a daily closing basis around Rs 749.Maruti Suzuki India: Buy | LTP: Rs 10,187 | Stop-Loss: Rs 9,650 | Target: Rs 11,000 | Return: 8 percentAfter breaking down the psychological level of Rs 10,000 in the month of August 2023, the counter has retested Rs 10,000 again and reversed from that level, which confirms that the August 2023 breakout above Rs 10,000 was genuine. Also, volume was huge at the time of the reversal, which further confirms our bullish stance on the counter.Coincidentally, 200 DEMA, which comes around Rs 9,850, has been successfully tested (refer to the chart). On the indicator front, daily stochastics has shown a bull divergence (refer to the chart). Thus, one can buy in the zone of Rs 9,900–10,200 with an upside target of Rs 11,000 and stop-loss orders would be placed on a daily closing basis around Rs 9,650.Expert: Omkar Patil, technical & derivatives analyst - institutional equity at Ashika GroupTata Power: Buy | LTP: Rs 390 | Stop-Loss: Rs 370 | Target: Rs 435 | Return: 11 percentThe stock is presently trading at an all-time high, reflecting its strong momentum. The consistent up move from the lower levels of Rs 230 has found support on each dip at the 12-day EMA. Additionally, the MACD (moving average convergence divergence) on the daily timeframe has shown a positive crossover above the zero line, indicating the likelihood of the prices continuing to trend higher.Going ahead, we expect the prices to move higher till Rs 435 where the stop-loss on the downside must be kept at Rs 370 on closing basis.Bank of Baroda: Buy | LTP: Rs Rs 247.6 | Stop-Loss: Rs 235 | Target: Rs 275 | Return: 11 percentThe stock is in a robust uptrend, marked by higher highs and higher lows. The recent up move is accompanied by a surge in volumes, indicating a strong buildup in the trend.Additionally, the MACD on the daily timeframe has shown a positive crossover, confirming the presence of positive momentum in the stock.Going ahead, we expect the prices to move higher till Rs 275 where the stop-loss on the downside must be kept at Rs 235 on closing basis.National Aluminium Company: Buy | LTP: Rs 149 | Stop-Loss: Rs 144 | Target: Rs 165 | Return: 11 percentThe stock has recently surpassed its multi-year high around Rs 142, the highest since April 2008. The stock has broken out of the consolidation zone range of 122-140, indicating the continuation of the prior uptrend. The recent rise in volumes also reflects the enthusiasm in the trend.Going ahead, we expect the prices to move higher till Rs 165 where the stop-loss on the downside must be kept at Rs 144 on closing basis.Expert: Ruchit Jain, lead research at 5paisa.comColgate Palmolive: Buy | LTP: Rs 2,569 | Stop-Loss: Rs 2,480 | Target: Rs 2,730 | Return: 6 percentThe stock has seen an uptrend in last few months and has shown an outperformance to other stocks from the FMCG sector. In last few weeks, the stock consolidated in a range which just seemed to be a time-wise correction within an uptrend.The prices have now given breakout from this consolidation and the RSI (relative strength index) oscillator too has given a positive crossover which indicates a resumption of the uptrend.Traders can look to buy the stock around current market price of Rs 2,570 for potential target of Rs 2,730. The stop-loss on long positions should be placed below Rs 2,480.Dr Reddy's Laboratories: Buy | LTP: Rs 6,121 | Stop-Loss: Rs 5,920 | Target: Rs 6,470 | Return: 6 percentThe stock gave a breakout from its previous swing high resistance post the announcement of its quarterly results. The volumes on breakout were high which indicates a fresh buying interest in the stock and the RSI readings too are hinting at positive momentum.We advise traders to look for buying opportunities in the stock around current market price of Rs 6,120 and add on any dips towards the breakout zone of Rs 6,000. The potential targets for the stock are seen around Rs 6,320 and Rs 6,470 while stop-loss on long positions should be placed below Rs 5,920.HCL Technologies: Buy | LTP: Rs 1,576 | Stop-Loss: Rs 1,500 | Target: Rs 1,720 | Return: 9 percentThe stock has been forming a ‘higher top higher bottom’ structure since last few months and is thus in an uptrend. The 20 DEMA has been acting as a support on declines and it has formed a ‘Bullish Flag’ pattern on the daily charts.The price volumes structure is also bullish as the price up moves have been supported by good volumes, but the corrections have not seen any high volume sell-off.Hence, we advise short term traders to buy the stock in the range of Rs 1,580-1,570 for potential targets of Rs 1,660 and Rs 1,720. The stop-loss on long positions should be placed below Rs 1,500.Expert: Jatin Gedia, technical research analyst at Sharekhan by BNP ParibasGrasim Industries: Buy | LTP: Rs 2,175 | Stop-Loss: Rs 2,050 | Target: Rs 2,300-2,411 | Return: 11 percentGrasim was consolidating in a range and in process has retraced 38.2 percent of the rise from Rs 1,820 – Rs 2,166. In terms of price pattern it has formed and broken out a Bullish Flag pattern on the upside indicating resumption of the next leg of upmove.Daily momentum indicator has completed its pullback to the equilibrium line and triggered a positive crossover which indicates start of a new cycle.Prices are trading along the expanding upper Bollinger band indicating that the positive momentum is likely to continue. On the upside, the move can extend towards Rs 2,300 and above that it can extend towards Rs 2,411. Structure becomes weak below Rs 2,050.PFC: Buy | LTP: Rs 443 | Stop-Loss: Rs 410 | Target: Rs 479-495 | Return: 12 percentPower Finance Corporation (PFC) has been in a medium term uptrend. In the last two months, the stock has undergone a time wise correction where it has been trading within the broad range of Rs 380 – 430. The range has been broken out on the upside and suggests that the stock has resumed its next leg of upmove.Daily momentum indicator has a positive crossover which is a buy signal. Thus, both price and momentum indicator suggest that the stock has resumed its upmove after a two months consolidation.Targets on the upside are placed at Rs 479 which is the weekly upper Bollinger band and Rs 495 which is the range breakout target. The structure becomes weak below Rs 410.SBI: Buy | LTP: Rs 641 | Stop-Loss: Rs 616 | Target: Rs 670-700 | Return: 9 percentState Bank of India (SBI) underwent correction and retraced 50 percent of the rise it witnessed from Rs 555 to Rs 660. The correction halted around the 20-week moving average (Rs 602) and witnessed buying interest from the crucial support zone.The daily momentum indicator provided a positive crossover from below the equilibrium line which is a buy signal. On the price front the stock has broken out of a falling channel indicating resumption a fresh leg of upmove.We expect the stock to rise towards the recent swing high of Rs 670 and extend towards the psychological level of Rs 700 from short term perspective. Structure shall become weak below Rs 616.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "As shares of Medi Assist Health Services got listed at an 11 percent premium over its issue price, the stock saw strong activity in terms of bulk deals. Medi Assist stock closed at Rs 464.1 apiece.Canara Robeco Mutual Fund and Goldman Sachs India Equity Portfolio Fund were the most active buyers as they bought 2.91 percent and 2.23 percent stake in the company, respectively.Canara bought 20.01 lakh shares in the company at an average price of Rs 489.02, while Goldman Sachs India Equity Portfolio Fund bought 15.34 lakh shares at Rs 468.65 per share.Nomura India Investment Mother Fund, BNP Paribas Arbitrage and  Whiteoak Capital Mutual Fund were the other buyers in the company.Rajasthan Global Securities sold 3.94 lakh shares at Rs 460 per share in Medi Assist Health Services.Apart from Medi Assist Health Services, the rights entitlement (RE) shares of Grasim Industries also drew huge attention among the market in terms of bulk deals.Pilani Investment and Industries Corporation picked up 6.03 lakh shares at an average price of Rs 318.12 whereas, Vanguard Moderate Growth Fund sold 5.09 lakh shares at Rs 315.44 per share.Societe Generale bought 1.36 lakh shares at Rs 316.6 per share and then sold 303 shares at Rs 317.06. Bofa Securities Europe Sa were the other seller in the company’s RE.Grasim Industries RE shares closed at Rs 335 on January 23, 0.59 percent higher than previous day’s close on the NSE.\n       ",
    "Grasim Industries saw continued activity in selling as Citibank NA sold 2.87 lakh shares of the company at an average price of Rs 310.89 on January 18. On the previous day, Citibank had sold another 2.87 lakh shares in the company. The value of today’s stake is Rs 8.93 crore.Grasim Industries closed flat at Rs 2,065.95 on the NSE on January 18.Another scrip which saw extended selling was Tourism Finance Corporation. Alpana Mundra who sold 7.69 lakh shares in the previous day further sold 6.25 lakh shares at Rs 172.93 per share in the exchanges.Tourism Finance Corporation stock closed 0.97 percent up from previous day’s close at Rs 171.In Indian Energy Exchange, foreign portfolio investor Indus India Fund (Mauritius) sold 0.56 percent stake, or 50.17 lakh shares, at an average price of Rs 138.28. Indus India sold Rs 69.28 crore worth of stake in IEX. The fund held 1.55 percent stake in the company as of December 2023.Shares of IEX fell 6.79 percent to Rs 137.25 in the bourses today.Sanghi Industries saw buying activity as Rajasthan Global Securities picked up 0.86 percent stake or 22.15 lakh shares at Rs 121 per share. Rajasthan Global Securities holds a 1.62 percent stake in the company as of December 2023. The value of the stake bought is Rs 26.80 crore.Sanghi Industries stock fell 9.69 percent to Rs 120.65.Lancer Containers Lines is another stock where an investor bought the company’s stake. Eriska Investment Fund bought 0.55 percent or 12.50 lakh shares in Lancer Containers at an average price of Rs 97.47.Shares of Lancer Container Lines rose 1.31 percent to Rs 98.08 in the bourses.\n       ",
    "Citibank NA sold 2.87 lakh shares in Grasim Industries through bulk deals on January 17, offloading Rs 9.99 crore worth of stake in the textiles and chemicals company.The sale happened at an average price of Rs 347.3 per share. Citibank held 3.91 percent stake in Grasim Industries as per shareholding pattern till September 2023.Grasim Industries stock fell 2.09 percent to Rs 2,070.9.Meanwhile, FPI Cresta Fund pared their stake in Jindal Saw, and sold 0.56 percent or 18 lakh shares at Rs 519 per share. Cresta Fund previously owned 1.43 percent stake until December 2023 and the stake sale was worth Rs 93.42 crore.Pricol saw a lot of activity as it gained 3.35 percent to Rs 380.5. Minda Corporation offloaded 15.69 percent stake in Pricol through two block deals in the exchanges. Total value of Minda’s sale was Rs 657.04 crore.Pricol’s shares saw huge buying interest as Goldman Sachs India, Aditya Birla Sun Life Insurance, ICICI Prudential Mutual Fund, Tata Mutual Fund, Trustee of Nomura India Stock Mother Fund, Fidelity India Focused Fund and Employees Provident Fund picked up stake.The shares were exchanged at an average price of Rs 343.5, while Minda sold the second block at an average price of Rs 345.98.In Tourism Finance Corporation, resident investor Alpana Mundra and NRI investor Vivek Mundra reduced their stake in the company. Alpana Mundra sold 7.69 lakh shares at an average price of Rs 169.32. Vivek Mundra offloaded 9.34 lakh shares at Rs 172 per share.Tourism Finance Corporation’s shares fell 4.62 percent to Rs 170.15.\n       ",
    "The strong comeback of bulls driven by super run in technology stocks after a long time helped the market hit a new high in the week ended January 12. In fact, the Nifty 50 comes closer to the much-awaited psychological 22,000 mark. Given the strong optimism, the bulls are likely to take the Nifty 50 to the 22,000-22,200 zone in near term with an immediate support at 21,800-21,700 levels, followed by crucial support at 21,500 mark, experts said, but they expect some consolidation post the achievement of said target zone.During the last week, the Nifty 50 climbed 0.85 percent to end at new closing high of 21,894.55 and formed bullish candlestick pattern with long lower shadow on the daily charts, continuing higher highs for seventh consecutive week.\"At the current juncture, the milestone of 22,000 is just a step away and with the structural setup, 22,100-22,150 is the next potential target for the current week starting from January 15,\" Osho Krishan, senior analyst - technical & derivative research at Angel One said.On the lower end, he feels 21,800-21,750 should now act as a cushion for any short-term blip, while strong support lies around the 21,600-21,500 zone.Jigar Patel, senior manager - equity research at Anand Rathi looks more bullish than Osho, saying the rally above 22,000 could move towards 22,200-22,400 in the current week.He feels the reading of long-short ratio of FII index futures suggests that Nifty still has some upside potential, but this could be the final stage of the rally, after which the market could see strong profit-taking in the market.Meanwhile, the experts' stance remains bullish, but they advised that one needs to stay light on positions.Moneycontrol collated a list of top 10 stock ideas for healthy return with the next 3-4 weeks perspective. The closing price of January 12 considered for the stock return calculation.Expert: Omkar Patil, technical & derivatives analyst - institutional equity at Ashika GroupGodrej Properties: Buy | LTP: Rs 2,274 | Stop-Loss: Rs 2,185 | Target: Rs 2,500 | Return: 10 percentThe stock of Godrej Properties is exhibiting a distinct uptrend characterized by the formation of higher highs and higher lows. This upward movement is supported by increasing trading volumes, indicating a long build up.Furthermore, the stock has consistently remained above its 12-day exponential moving average (EMA), providing further confirmation of the prevailing uptrend.Going ahead, we expect the prices to move higher till the mark of Rs 2,500 where the stop-loss must be Rs 2,185 on a daily closing basis.Mahanagar Gas: Buy | LTP: Rs 1,264 | Stop-Loss: Rs 1,210 | Target: Rs 1,375 | Return: 9 percentMGL stock has successfully broken out of a significant consolidation phase within the range of Rs 1,000-1,150. The recent upward movement in its price was accompanied by a notable increase in trading volumes.Additionally, the Relative Strength Index (RSI) on the daily timeframe has shown a hidden bullish divergence, reflecting presence of positive momentum.Going ahead, we expect the prices to move higher till the mark of Rs 1,375 where the stop-loss must be Rs 1,210 on a daily closing basis.Grasim Industries: Buy | LTP: Rs 2,111.55 | Stop-Loss: Rs 2,030 | Target: Rs 2,300 | Return: 9 percentGrasim stock trend as accelerated as the steepness in the trend has started to rise. Notably, around Rs 2,050 level, the stock has undergone a change in polarity, emphasizing an overall positive sentiment in its trend.Furthermore, the RSI reading above the 50 mark signals an increasing momentum in the ongoing trend.Going ahead, we expect the prices to move higher till the mark of Rs 2,300, where the stop-loss must be Rs 2,030 on a daily closing basis.Expert: Nandish Shah, research analyst (technical and derivative) at HDFC SecuritiesPower Mech Projects: Buy | LTP: Rs 4,734 | Stop-Loss: Rs 4,380 | Target: Rs 5,150-5,350 | Return: 13 percentThe stock price has broken out on the weekly line chart to see all-time closing high with higher volumes. Stock price has been forming bullish higher top higher bottom formation on the weekly chart. Momentum Indicators and oscillators are showing strength in the stock.Suprajit Engineering: Buy | LTP: Rs 406 | Stop-Loss: Rs 380 | Target: Rs 435-455 | Return: 12 percentThe stock price has broken out from the downward sloping trendline on the weekly chart, adjoining the highs of week ending July 28, 2023 and September 8, 2023. Primary trend of the stock is positive as stock price is trading above important medium and long term moving averages.Momentum indicators and oscillators like RSI and MFI (money flow index) are in rising mode and placed above 60 on the weekly chart. After breaking out from the downward sloping trendline, stock price has been consolidating for past two weeks which we believe is a buying opportunity.Shipping Corporation of India: Buy | LTP: Rs 172.5 | Stop-Loss: Rs 160 | Target: Rs 186-198 | Return: 15 percentThe stock price has broken out on the weekly chart by surpassing the multiple top resistance of Rs 164 odd levels. Stock price has been forming bullish higher top higher bottom formation on the monthly chart. Primary trend of the stock is positive as stock price is trading above its important long-term moving averages.Expert: Shrikant Chouhan, head – equity research at Kotak SecuritiesPunjab National Bank: Buy | LTP: Rs 97.72 | Stop-Loss: Rs 94 | Target: Rs 105 | Return: 7.4 percentPost decline from the higher levels, the counter rebounded from its demand zone and witnessed a steady recovery from the lower levels. Additionally, on the daily charts, the counter has given a breakout from its sloping channel formation.The upmoves in the counter suggest a new leg of bullish trend from the current levels.L&T Finance Holdings: Buy | LTP: Rs 167.55 | Stop-Loss: Rs 160 | Target: Rs 180 | Return: 7.4 percentAfter the remarkable up move, the stock is having a breather from last few sessions. The consolidation in the rangebound structure suggest bullish continuation chart formation.Moreover, the stock comfortably closed above its short term moving average. Therefore, the stock is likely to resume its uptrend from the current levels.Hindalco Industries: Buy | LTP: Rs 582 | Stop-Loss: Rs 560 | Target: Rs 625 | Return: 7.4 percentAfter the recent selloff in the counter from the higher levels, the downward momentum had stopped. On daily charts, the counter has found support and reversed its trend from its important support zone along with decent volume activity.The formation suggests at further bullish movement from the current levels.Expert: Ashwin Ramani, derivatives analyst at SAMCO SecuritiesInfosys: Buy | LTP: Rs 1,613 | Stop-Loss: Rs 1,550 | Target: Rs 1,750 | Return: 8.5 percentThe IT major has been moving in a higher high higher low formation since making a low of Rs 1,185 on April 17, 2023. The stock with a current market price (CMP) of Rs 1,613, had multiple resistance around Rs 1,600 levels, having failed to sustain above the same since April 2022. The maximum Call open interest, which is the resistance for the stock, is placed at 1,600 strike.The Future open interest (OI) indicated buildup of fresh long positions in Index futures supported by a spike in volumes. Short covering coupled with strong Put writing at 1,600 strike can fuel the fresh leg of rally in this stock.A follow up buying from the current levels can lead to the price moving higher until Rs 1,750 levels in the next one month. The level of Rs 1,550 on the downside is expected to act as a support for the stock. It is advisable to buy at the current level with a stop-loss of Rs 1,550 and a target of Rs 1,750.Just Dial: Buy | LTP: Rs 873 | Stop-Loss: Rs 840 | Target: Rs 1,050 | Return: 20 percentJust Dial hit a 52-week high of Rs 944 on the daily chart on January 11, 2024 supported by a huge surge in volumes. With this, it also moved past and closed above its previous swing high of Rs 879 made on July 17, 2023. A Cup and Handle pattern is visible on the daily chart with multiple resistance around Rs 950 levels.The price has been moving in a higher high higher low formation, indicating uptrend, since taking Fibonacci retracement support of 70.7 percent around Rs 513 levels on July 20, 2022, drawn from the low of Rs 250 made on March 23, 2020 to the high of Rs 1,138 made on July 14, 2021.It is advisable to buy at the current level with a stop-loss of Rs 840 for an immediate upside target until the previous swing high of Rs 1,050 levels.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Sharekhan's research report on Grasim IndustriesThe company announced terms for Rs. 4,000 crore rights issue at an issue price of Rs. 1,812 per share, entailing 3.4% equity dilution in-line with street’s expectations. Repayment of debt from the rights issue along with funding balance capex for paints of over Rs. 5,200 crore via a mix of D/E would keep standalone leverage under check and under management’s stated guidance. It remains on track to set up six units with an aggregate capacity of 1332 MLPA by Q4FY2025 with three units to commence operations from Q4FY2024. We expect the paints business to be earnings accretive from FY2026.OutlookWe retain Buy on Grasim with an unchanged PT of Rs. 2,300, considering a healthy growth outlook for its key subsidiaries and standalone businesses.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Grasim Industries - 08 - 01 - 2024 - khan ",
    "Grasim Industries witnessed a marginal increase in its shares on January 5 after the company's board approved a rights issue worth Rs 3,999.80 crore.At 09:18 hrs, Grasim Industries was trading at Rs 2,077.05, up by Rs 8.45 or 0.41 percent, on the BSE.However, it failed to hold the opening gains and slipped into the red territory trading nearly 0.1 percent lower at 09.35 hrs.The board, in its meeting held on January 4, 2024, approved a rights issue of 2,20,73,935 equity shares of the company, each on partly-paid basis, for an amount aggregating to Rs 3,999.80 crore.The rights issue price has been set at Rs 1,812 per equity share when fully paid-up (including a premium of Rs 1,810 per rights equity share).The rights issue will remain open from January 17, 2024, to January 29, 2024. The record date for determining the shareholders eligible for the rights issue is January 10.Catch all market action in our live blogAs of the record date, 6 rights equity shares will be issued for every 179 fully paid-up equity shares of the company held by the eligible equity shareholders of the company.Earlier this month, the company announced the expansion of its advanced materials capacity at the Gujarat unit.The chemical division of the company has successfully commissioned an additional 123,000 tons’ annual capacity of Advanced Materials (Epoxy Resins and Formulation) manufacturing capacity at Vilayat, Dist. Bharuch, Gujarat.\n       ",
    " ",
    "The share price of Grasim Industries went up 1 percent to a 52-week high of Rs 2,163.30 in the opening trade on January 1 after the company expanded its advanced materials capacity at the Gujarat unit.At 9:24am, Grasim Industries was quoting at Rs 2,159.15, up Rs 24.75, or 1.16 percent, on the BSE.\"The chemical division of the company has successfully commissioned additional 123,000 tons’ annual capacity of Advanced Materials (Epoxy Resins and Formulation) manufacturing capacity at Vilayat, Dist. Bharuch, Gujarat,\" the company said in its release.With this expansion, the total capacity of advanced materials stands at 246,000 tonnes a year.Catch all market action in our live blogA meeting of the board of directors of the company is scheduled to be held on January 4, 2024, to consider, discuss, and decide various matters in connection with the rights issue, including the specific terms of the issue, such as the determination of the price and related payment mechanism, rights entitlement ratio, the record date and timing of the rights issue.The company board in its meeting held on October 16, had approved raising of funds by way of issue of equity shares of face value of Rs 2 each through rights issue for an amount not exceeding Rs 4,000 crore to the eligible equity shareholders of the company.\n       ",
    "The Nifty 50 closed with just a 0.53 percent loss on December 22 near 21,350. Although this marked the end of a seven-week winning streak, the closing doesn’t suggest any major setback, portraying it as a breather after a recent marathon run.The bounce from lower levels indicates strong support around the 21,000 - 20,950 zone, which is technically significant with a bullish gap on the daily chart. Going ahead, this zone may act as an immediate base, and only a break below it could trigger a market correction.On the positive side, the Nifty tested the 200 percent reciprocal retracement in the October fall to around 21,600, considered a pattern target. After -testing this level, a broad-based profit-booking occurred on Wednesday. Cautious traders are advised to remain vigilant around this zone, suggesting potential market tentativeness at higher levels.Despite a positive undertone, the market appears to be in a corridor of uncertainty, and trading within the mentioned broad range is expected in the truncated week ahead of the next calendar year. Traders are cautioned to monitor these levels and adjust their trading strategies accordingly.Here is one buy call and one sell call for short term:Wipro: Buy | LTP: Rs 462.65 | Stop-Loss: Rs 433 | Target: Rs 498 | Return: 7.6 percentThe entire IT space is on a roll in the recent past and in fact, it provided the much-needed helping hand on Friday to maintain the sturdy posture of our benchmark index. Wipro has been participating with less conviction but on Friday, we witnessed first sign of real strength in the counter.Pricewise, the daily chart exhibits a massive upsurge with gargantuan volumes to come out of the long slumber phase. With this development, Wipro has confirmed a breakout from 16 months consolidation phase to trigger a new leg of the rally.We recommend buying on a decline around Rs 456 for a trading target of Rs 498. The stop-loss can be placed at Rs 433.Grasim Industries: Sell | LTP: Rs 2,046.20 | Stop-Loss: Rs 2,097 | Target: Rs 1,990 | Return: 3 percentThis counter has been in a strong multi-year bull run for the last few years. Although the major undertone remains bullish, we are observing some signs of fatigue at higher levels. Taking a glance at the daily time frame chart, we can see prices sliding below the ’20-day EMA’ (exponential moving average) for the first time in recent past.With this, the weekly chart now depicts a ‘Bearish Engulfing’ pattern, indicating some weakness in the near term. Taking all these evidences in mind, traders can look to short around Rs 2,060 for a near-term target of Rs 1,990. The strict stop-loss needs to be placed at Rs 2,097.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Shares of Grasim Industries fell 0.43 percent at the open on December 19, a day after it was reported that Grasim Industries' clean energy arm was in advanced talks with Qatar's Nebras Power for investment in the renewable energy business. At 9:40 am, the stock was trading at Rs 2,100.60.Follow our market blog for live updatesOn December 18, Moneycontrol reported that Kumar Mangalam Birla-led Aditya Birla Group has entered advanced stage negotiations with Middle Eastern firm Nebras Power to scale up its renewable resources business (Aditya Birla Renewables) which is a part of Grasim Industries.Also read: Grasim Industries’s clean energy arm in advanced talks with Qatar’s Nebras Power for investmentAccording to reports, this development comes as the conglomerate is looking to induct a strategic investor and scale up its renewable energy business. Nebras Power plans to invest around $400 million as part of a proposed 51:49 JV between the two parties, sources have said.In Q2FY24, Grasim Industries reported a net profit of  Rs 1,163.75 crore, a 15.31 percent increase from Rs 1,009.17 crore in Q2FY23. Revenue for the same period grew 9.95 percent to Rs 30,220.68 crore from Rs 27,485.54 crore in the previous fiscal. EBITDA for the reporting quarter was Rs 4,509 crore, a 19 percent YoY increase from the previous fiscal. In August 2023, Aditya Birla Group chairman Kumar Mangalam Birla had said that Aditya Birla Group will treble its power generation capacity by the end of this financial year.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.  ",
    "Grasim Industries broke out of a seven-day consolidation pattern on the daily scale on November 29.\"Along with this breakout, the stock is witnessing above 50-days average volume, indicating accumulation by smart investors,\" Sudeep Shah, head of technical and derivative research at SBI Securities.As of 10:41am on November 30, Grasim Industries is trading at Rs 2,011.05, up by 8.50 points or 0.42 percent.Momentum IndicatorsThe technical chart of Grasim Industries illustrates a consolidation breakout. The stock is trading above its short and long-term moving averages. \"These averages are in a rising trajectory, which is a bullish sign. The momentum indicators and oscillators also suggest bullish momentum. The daily Relative Strength Index (RSI) is in a super bullish zone, as per RSI range shift rules. The daily Moving Average Convergence Divergence (MACD) stays bullish as it is quoting above its zero line and signal line. On the daily timeframe, Average Directional Index (ADX) is quoting below 10, suggesting that the trend is yet to be fully developed. Directional indicators continue in the ‘buy’ mode as positive Directional Indicator (+DI) remains above negative Directional Indicator (-DI),\" added Shah. Technical Chart of Grasim Industries showing consolidation breakout | Source: SBI SecuritiesDerivative Data AnalysisOn the derivative front, Shah highlights that long build-up is visible, as the November futures have surged by nearly 3 percent in the last two trading sessions. Meanwhile, the cumulative Open Interest (OI) of the current, next, and far series has surged by nearly 2 percent in the last two trading sessions. Discussing the option chain, the 2100 Call (CE) has the highest OI, while on the put side, the 1940 strike has the highest OI.Based on the above observations, Shah expects the stock to continue its upward movement and test levels of Rs 2,100, followed by Rs 2,140 in the short-to-medium term. A stop-loss can be maintained at Rs 1940 on a closing basis.\n       ",
    "Net Sales at Rs 6,442.02 crore in September 2023 down 4.5% from Rs. 6,745.24 crore in September 2022.Quarterly Net Profit at Rs. 794.74 crore in September 2023 down 17.58% from Rs. 964.30 crore in September 2022.EBITDA stands at Rs. 1,353.91 crore in September 2023 down 20.92% from Rs. 1,712.12 crore in September 2022.Grasim EPS has decreased to Rs. 12.10 in September 2023 from Rs. 14.68 in September 2022.Grasim shares closed at 1,928.85 on November 13, 2023 (NSE) and has given 11.28% returns over the last 6 months and 10.31% over the last 12 months.",
    "Net Sales at Rs 30,220.68 crore in September 2023 up 9.95% from Rs. 27,485.54 crore in September 2022.Quarterly Net Profit at Rs. 1,163.75 crore in September 2023 up 15.32% from Rs. 1,009.17 crore in September 2022.EBITDA stands at Rs. 4,509.40 crore in September 2023 up 19.2% from Rs. 3,783.03 crore in September 2022.Grasim EPS has increased to Rs. 17.73 in September 2023 from Rs. 15.37 in September 2022.Grasim shares closed at 1,928.85 on November 13, 2023 (NSE) and has given 11.28% returns over the last 6 months and 10.31% over the last 12 months.",
    "Grasim Industries on November 13 reported consolidated net profit for the quarter ended September 30, 2023 at Rs 1,163.75 crore, registering a growth of 15.31 percent from Rs 1,009.17 crore in the same quarter last year.Its revenue from operations came in at Rs 30,220.68 crore, up 9.95 percent from Rs 27,485.54 crore in the corresponding quarter last fiscal, the company said in an exchange notification.EBITDA of the company rose by 19 percent YoY to Rs 4,509 crore thanks to contribution from key subsidiaries UltraTech Cement and Aditya Birla Capital.Standalone revenue stood at Rs 6,442 crore and EBITDA at Rs 1,354 crore, down by 4 percent and 21 percent YoY, respectively. The company noted that pent up festive demand resulted in volume improvement in VSF business while oversupply in the domestic market of caustic soda and lower realisations in line with sharp decline in global prices impacted the overall standalone performance.For its viscose business, festive demand and inventory replenishment in the domestic value chain resulted in volume growth while export demand for the value chain remained weak from major overseas markets.In textile segment, elevated input prices impacted the performance in the linen sub-segment, the company said, whereas, in chemicals business, caustic soda sales volume increased by 3 percent YoY and 5 percent QoQ.\n       ",
    "Grasim Industries was trading 2.4 percent higher on October 17 morning, a day after the Aditya Birla Group company said it would raise up to Rs 4,000 crore through a rights issue, a move analysts say would also help improve debt ratios.In an exchange filing on October 16, Grasim Industries said the proposed fundraise is subject to regulatory approvals. The record date of rights issue shall be determined in due course.Analysts said that the promoters group has committed to fully subscribe to its entitlements. Promoters extended to cover any unsubscribed portion, too, if applicable.The fundraise comes after Grasim Industries announced plans to get into the paints business.ALSO READ: Spending on factories doesn't guarantee a big market share: Saurabh Mukherjea's Marcellus on Grasim's entryThe company intends to invest around Rs 10,000 crore to set up its paint business, rivaling market leader Asian Paints, which has half of India’s market share.In the June quarter, the company invested around Rs 3,640 crore. The management has outlined a capex of Rs 5,700 crore for FY24, which includes Rs 4,280 crore for the paints business.Follow live blog for all the market actionBrokerages viewAnalysts at Morgan Stanley have an “overweight” call on the counter, with a target price of Rs 1,985.The global brokerage firm said the Rs 4,000-crore rights issue would imply 3.1 percent dilution in the current market.“The management highlighted that the fundraise would be used for ongoing capex and repayment of existing debt. This fundraise announcement reaffirms management’s focus on organic growth,” it said.ALSO READ: Cash Market | Grasim shows a classic breakout-pullback patternIt would help the management to arrest debt ratios to more comfortable levels.As of June 2023, net debt of Grasim Industries stood at Rs 3,500 crore.Motilal Oswal expects the fundaise to be earnings accretive, which would eventually result in earnings per share (EPS) increase of 0.6/0.9 percent for FY24/25E.“Post this equity issue, we expect net debt to be 66 percent/47 percent lower than our earlier estimates in FY24/25E. Net debt/Ebitda will be at 1.5 times (x) in FY25E versus our earlier estimate of 2.7x,” the brokerage firm said.It reiterated a “buy” call on the counter, with a target price of Rs 2,380 a share.At 10 am, the stock was trading at Rs 1,980.80 on BSE, up 0.45 percent from the previous close.In the past three months, the textile-to-cement manufacturer has surged 10 percent against a 0.6 percent decline in the Sensex. The stock touched its 52-week high of Rs 2,021 on October 12, 2023.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. \n       ",
    "Grasim Industries on October 16 said its Board of Directors at its meeting approved to raise Rs 4,000 crore via rights issue. The record date for the same will be announced later.The board “inter-alia approved the raising of funds by way of issue of equity shares of face value of Rs 2 each through rights issue for an amount not exceeding Rs 4,000 crore to the eligible equity shareholders of the company as on the record date (to be determined in due course), subject to receipt of regulatory/statutory approvals,” Grasim Industries said in a regulatory filing.A rights issue by a company is offered to existing shareholders to purchase more shares of the company. Usually, such shares are offered at a discount to the market price and thus makes an attractive proposition for shareholders to acquire more stake.Grasim Industries did not announce the price of the issue at this point in time.“The board or a duly constituted Committee of the Board shall decide all other terms and conditions of the rights issue, including but not limited to the Issue price, rights entitlement ratio, record date, timing, terms of payment as may be required from time to time,” said the company.\n       ",
    "The board of directors of the Aditya Birla Group-controlled Grasim Industries will meet on October 16 to take a call on raising funds through a rights issue, or a preferential issue, or a qualified institutional placement (QIP).“A meeting of the board of directors of Grasim Industries Limited is scheduled to be held on Monday, October 16… to consider the proposal for raising of funds by way of equity shares or other securities through rights issue, qualified institutions placement, preferential issue or any other method, as may be permitted under the applicable law, subject to such regulatory and statutory approvals as may be required,\" the company said in an exchange filing on October 12.The board meeting comes at a time when the leading textile manufacturer plans to make its debut in the paints space with its new paint vertical by the fourth quarter of fiscal 2024. The paint vertical, under the brand name Birla Opus, has an estimated project cost of Rs 10,000 crore.Grasim, in a press release last month, stated that it has piloted the first-of-its-kind painting services in key metros, as well as introduced a range of imported wood finishes.According to Aditya Birla Group Chairman Kumar Mangalam Birla, the company is aims to be the No 2 player in the coming years. \"Announcing our brand name is the first of many steps that will follow in this direction,” he said. “Our foray into decorative paints is a strategic choice that enables us to tap a high-growth market and expand our presence in the vibrant Indian consumer landscape,\" he had at the launch of Grasim's pain vertical.Grasim Industries shares have gained 21.4 percent over one year compared to the Nifty 50's one-year performance at 16.5 percent. The company's market capitalisation to Rs 1.31 lakh crore.As per June's shareholding records, the company's promoters hold 42.75 percent of the shares. FIIs own 12.29 percent, while DIIs account for 20.7 percent. Of this, insurance major LIC has a 9.3 percent stake in the firm. The public has a 23.95 percent stake in Grasim.\n       ",
    "Aditya Birla Group-controlled Grasim Industries recorded a 2 percent rally in the share price on October 12 to hit a fresh 52-week high. The company’s board of directors will meet to consider raising funds through either a rights issue, or a preferential issue, or a qualified institutions placement (QIP).As of 11am, shares of the company were trading at Rs 2,000.40, up 1.06 percent on the BSE.Follow our live blog for all the market action“A meeting of the board of directors of Grasim Industries Limited is scheduled to be held on Monday, October 16… to consider the proposal for raising of funds by way of equity shares or other securities through rights issue, qualified institutions placement, preferential issue or any other method, as may be permitted under the applicable law, subject to such regulatory / statutory approvals as may be required,” Grasim said in a filing with the exchanges.Technical analyst Manish Shah said the price action in Grasim shows the presence of a strong underlying trend with a well-defined pattern of higher highs and higher lows.“The zone at 1,860-1,870 was earlier a support area, and now it has become a support zone. It is a classic breakout-pullback pattern. We are also seeing a flag trend continuation pattern taking place. Buy around 1,920 for a target of 2,050 and above that to 2,150. Keep a stop-loss below 1,850. Hold for several weeks,” he said.Grasim Industries technical indicators, shareholding patternGrasim Industries shares have gained 21.4 percent over one year compared to the Nifty 50's one-year performance at 16.5 percent. The company's market capitalisation to Rs 1.31 lakh crore.The stock's RSI is at 63.8, indicating the counter is neither in the oversold, nor in the overbought zone. With a one-year beta of 0.97, the stock exhibits average volatility and is also trading above all its crucial moving averages.As per June's shareholding records, the company's promoters hold 42.75 percent of the shares. FIIs own 12.29 percent, while DIIs account for 20.7 percent. Of this, insurance major LIC has a 9.3 percent stake in the firm. The public has a 23.95 percent stake in Grasim.Disclaimer: The views and investment tips expressed by experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before making any investment decisions. ",
    "Grasim Industries on October 11 said its board of directors will hold a meeting on October 16 to consider and approve a proposal to raise funds via either a rights issue, preferential issue or qualified institutions placement (QIP).“A meeting of the Board of Directors of Grasim Industries Limited is scheduled to be held on Monday, October 16, 2023, in terms of the provisions of the Companies Act, 2013 read with Companies (Meetings of Board and its Powers) Rules, 2014, as amended, inter-alia to consider the proposal for raising of funds by way of equity shares or other securities through a rights issue, qualified institutions placement, preferential issue or any other method as may be permitted under the applicable law, subject to such regulatory/statutory approvals as may be required” the company said in a regulatory filing.Earlier in the day, the stock closed at Rs 1979.50, rising 3.16 percent on BSE. The stock is up 16 percent in the last six months.Technical analyst Manish Shah said the price action in Grasim shows the presence of a strong underlying trend with a well-defined pattern of higher highs and higher lows. Price declines towards the support of a rising trendline and at the support of a rising 50-day moving average and reverses with a bullish \"Morning Star\" pattern.“The zone at 1,860-1,870 was earlier a support area, and now it has become a support zone. It is a classic breakout-pullback pattern. We are also seeing a flag trend continuation pattern taking place. Buy around 1,920 for a target of 2,050 and above that to 2,150. Keep a stop loss below 1,850. Hold for several weeks,” he said.Disclaimer: The views and investment tips expressed by experts are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before making any investment decisions. ",
    "Grasim Industries shares were trading marginally up in the morning trade on September 25th after the company reported the temporary closure of a carbon di-sulphide refining section in its subsidiary Century Rayon’s Shahad plant in compliance with a government order.This comes in the aftermath of a third-party tanker’s explosion in the plant’s premises on September 23rd that caused the death of two persons. Subsequently, the company was served an order from the Department of Industrial Safety and Health’s Kalyan office.“The management has initiated the necessary steps to comply with the conditions stipulated in the said order. Further this is not likely to have a material impact on the company’s profitability,” the Aditya Birla Group company said in a regulatory filing.At 10.30 am on the NSE, the Grasim Industries stock which had opened in red was quoting at Rs 1,924.55 apiece, up Rs 12.60, or 0.66 percent.Follow our live blog for all the market actionIn its results for the April-June quarter, the company reported a 10.78 percent YoY (year-on-year) increase in revenue from operations at Rs 31,065 crore. Net profit for the quarter was down 6.63 percent YoY at Rs 2,576 crore. The operating profit margins for the quarter contracted by 100 basis points on a yearly basis to 20 percent.Grasim Industries and its subsidiaries are engaged in the business of manufacturing a wide range of products including textiles, chemicals, cement, and metals.Disclaimer: The views and investment tips expressed by experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. "
]