[
    "ICICI Securities's research report on HCL TechnologiesHCLT reported revenue growth and EBIT margin in line with our estimates. IT and business services grew 4% QoQ CC and Engineering R&D was down 1.6%. Software business was down 18.5% QoQ CC on seasonal weakness. Geography-wise growth was led by North America, at 4.2%. TCV was robust at USD 2.29bn, with 13 out of 21 large deal wins originating from services. However, FY25 growth guidance of 3–5% was lower than our/ Street’s estimate of 4-7%. This guidance includes a soft Q1FY25 impacted by offshore transition in large contact and a soft Q2FY25 impacted by State Street JV divesture. This implies a weak CQGR of -0.2% to +0.6% QoQ through FY25. Factoring this in, we reduce FY25E/26E EPS by 3–7%.OutlookWe value HCLT on an SoTP-basis – Services (IT and ER&D) at 20x and Products at 16x on FY26E EPS to arrive at a TP of INR 1,330. Retain REDUCE on soft H1FY25 and unexciting EBIT margin guidance of 18-19%.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.HCL Technologies_29042024_ICICI Securities ",
    "Prabhudas Lilladher's research report on HCL TechnologiesHCLT reported revenue of USD3.43b, up 0.3% QoQ in CC and 0.4% in reported terms, tad above consensus of flat CC, that translates to FY24 revenue growth of 5.0% YoY CC (lower end of the guidance). The growth was partly aided by further progress in mega deal within Telecom, otherwise the growth was board-based (ex-Retail). The margin impact was meaningful, down 210bps QoQ (vs consensus of 130bps decline). The decline was led by normalizing high-margin P&P business coupled with compensation revision that was long due for the mid and senior-level leadership team. The deal TCV wins were healthy at USD2.3b (+10.4% YoY), which takes FY24 TCV to USD9.75b (BTB 1.0x). Despite this strong wins, the full year revenue guidance (3.0-5.0%) was a little disappointing, which bakes in early volatility as it enters into FY25.OutlookThe stock is currently trading at 21x FY26e, we are assigning PE of 22x to FY26e with a target price of INR 1,550. With that we assume coverage on HCL Tech with an “ACCUMULATE” rating.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.HCL Technologies - 29042024 - prabhu ",
    "Motilal Oswal's research report on HCL TechnologiesHCL Technologies (HCLT) reported weak 4QFY24 performance with 0.3% QoQ CC consolidated revenue growth, below our estimate of 0.9% QoQ CC.The weak performance was due to the seasonality in HCL Software (-18.5% QoQ CC) coupled with weakness in ERS (1.6% QoQ CC), while ITBS posted an impressive 4% QoQ growth in CC. Services grew 3.0% QoQ in CC, above our estimate of +2.7% QoQ. The new deal TCV was healthy at USD2.3b (+18.8% QoQ/10.4% YoY) in 4QFY23. HCLT announced disappointing revenue growth guidance of 3-5% CC for FY25, amid weak 1QFY25 expectations (-2% QoQ). The weak expectations are led by the offshoring of a large deal and the transfer of productivity benefits to clients. EBIT margin came in lower than expected at 17.6% (-220bp QoQ; missing our estimate of 18.5%) due to the HCL Software seasonality. Services margin contracted 70bp QoQ. Management retained its EBIT margin guidance band of 18-19% for FY25.Outlookwe expect HCLT to emerge stronger on the back of healthy demand for these services in the medium term. The stock is trading at ~20x FY26E EPS, which offers a margin of safety. Our TP of INR1,700 is based on 23x FY26E EPS. We reiterate our BUY rating on the stock.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.HCL Technologies_29042024_Motilal Oswal ",
    "Religare Retail Research report on HCL TechnologiesHCL Tech Q4FY24 revenue in constant currency (CC) grew by 0.3% QoQ and 6% YoY while its dollar revenue grew by 0.4% QoQ and 6% YoY to USD 3,430mn. Its revenue in rupee was at Rs 28,499cr, up by 0.2% QoQ and 7.1% YoY. The growth was largely led by the service segment (contributes 90.5% of revenue) as it grew by 2.9% & 7.9% YoY to Rs 25,792cr while in CC terms it was up by 3% QoQ and 6.7% YoY. Amongst segments, in CC terms, telecommunication & Media led the growth with 39% YoY & 21.6% QoQ followed by manufacturing, retail & Financial services with 14.3% YoY, 9.4% YoY and 8.6% YoY. Amongst geographies, both America and Europe performed well with America gaining 9.2% YoY & 4.2% in CC while Europe gained 5.7% YoY & 2.3% QoQ in CC. For FY24, CC revenue was up by 5% YoY, revenue in dollar grew by 5.4% YoY to USD 13,270mn and rupee revenue up by 8.3% YoY to Rs 109,913cr. The growth was driven by both America & Europe regions while amongst verticals growth except for technology all the verticals specially financials services witnessed decent growth.OutlookAdditionally, their capabilities, expertise and increasing client base would bode well for the growth ahead. On the financial front, we estimate its revenue/EBIT to grow by CAGR of 7.6%/10.7% over FY24 -26E and continue to maintain our Buy rating with the target price of Rs 1,777.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.HCL Technologies - 29042024 - reli ",
    "Net Sales at Rs 12,077.00 crore in March 2024 up 3.78% from Rs. 11,637.00 crore in March 2023.Quarterly Net Profit at Rs. 2,763.00 crore in March 2024 down 2.85% from Rs. 2,844.00 crore in March 2023.EBITDA stands at Rs. 4,344.00 crore in March 2024 up 3.63% from Rs. 4,192.00 crore in March 2023.HCL Tech EPS has decreased to Rs. 10.20 in March 2024 from Rs. 10.50 in March 2023.HCL Tech shares closed at 1,473.85 on April 26, 2024 (NSE) and has given 19.65% returns over the last 6 months and 38.32% over the last 12 months.",
    "Net Sales at Rs 28,499.00 crore in March 2024 up 7.11% from Rs. 26,606.00 crore in March 2023.Quarterly Net Profit at Rs. 3,986.00 crore in March 2024 up 0.08% from Rs. 3,983.00 crore in March 2023.EBITDA stands at Rs. 6,533.00 crore in March 2024 up 3.44% from Rs. 6,316.00 crore in March 2023.HCL Tech EPS has increased to Rs. 14.72 in March 2024 from Rs. 14.71 in March 2023.HCL Tech shares closed at 1,473.85 on April 26, 2024 (NSE) and has given 19.65% returns over the last 6 months and 38.32% over the last 12 months.",
    "Information technology (IT) major HCL Technologies is expected to report a tepid Q4, with flattish revenues quarter-on-quarter (QoQ). Its products and platforms (P&P) business is expected to drag down its earnings, even as the services business is expected to provide some succour. The fall in the high-margin P&P business would also hit HCLTech's fourth quarter net profit. The company is scheduled to announce its January-March financial results on April 26.HCL Technologies is expected to report a net profit of Rs 4,054.71 crore  in Q4 FY24, down 6.78 percent QoQ, according to the average estimate of seven brokerages. The company is expected to clock revenues of Rs 28,552.64 crore, up only 0.37 percent QoQ. Its EBIT margin may fall  152 basis points (bps) QoQ, to 18.18 percent. HCLTech Q4 Results PreviewRevenue growth will be driven by the services business, which was boosted by the Verizon deal. In August 2023, HCLTech signed a $2.1 billion deal with Verizon to provide managed network solutions to its global enterprise customers.“HCLTech's revenue shall grow 0.3 percent QoQ in CC (constant currency) and 0.7 percent QoQ in USD, due to Services (+2.4 percent QoQ) and P&P  (-15 percent QoQ, seasonality impact). Services growth shall be driven by the Verizon deal and reversal of furloughs,” said Nuvama Wealth. Motilal Oswal expects its Services revenue to grow 2.7 percent QoQ in CC terms.The P&P business is expected to decline due to seasonality. According to Motilal Oswal, “The decline in the high-margin P&P business should result in a 120-bps QoQ decrease in profitability during Q4.” ICICI Securities predicts a 12 percent contraction in the P&P business due to a “lack of positive seasonality from Q3FY24.”Philip Capital noted that margins will be affected by “P&P seasonality, partial wage hikes, and the Verizon deal  impact.”Nuvama expects the company to give a guidance of 4-6 percent YoY growth in CC terms in the Services segment in FY25 , and a margin guidance of 18-19 percent. Motilal Oswal expects a revenue guidance of around 10 percent for FY25.Disclaimer: The views and investment tips expressed by experts on Moneycontrol are their own and not those of the website or its management. Moneycontrol advises users to check with certified experts before taking any investment decisions.  ",
    "The market on April 5 ended the first week of the new fiscal year 2024-25 in the green, marking yet another week of rise, surpassing the previous record high to trade beyond 22,600 during the week.The benchmark Nifty index managed to settle the last two sessions above 22,500 amid consolidation and saw higher highs, higher lows formation for the second consecutive week, making experts hopeful of further uptrend towards 22,700-22,800 in the coming sessions, with support at 22,300-22,200 levels, and the volatility index diving to November 2023 lows.The Nifty 50 gained 0.84 percent to settle at a record closing high of 22,513.70 for the week, and formed a small bullish candlestick pattern with long upper and lower shadows, which resemble High Wave kind of candlestick pattern on the daily charts, indicating indecisiveness among bulls and bears about future market trend.From a technical standpoint, as the Nifty index heads into an uncharted territory, it becomes difficult to surface the intermediate resistance, but looking at the recent developments, another leg of 200-300 point (22,700-22,800) rally could be seen on the cards under favourable scenarios, Osho Krishan, senior analyst for technical and derivative research at Angel One, said.On the lower end, he feels strong support is expected around 22,350-22,300, which certainly has proved its mettle in the previous week, followed by the sacrosanct support at 22,200.Jigar S Patel, senior manager of equity research at Anand Rathi, also sees support at similar levels, with hurdle on the higher side at 22,600-22,800.Osho advised traders to refrain from complacency and maintain a pragmatic approach with a stock-centric view for an outperformance.Moneycontrol collated a list of top 10 stock ideas from experts, with 3-4 weeks perspective. The closing price of April 5 is considered for calculation of stock price return:Expert: Vinay Rajani, CMT, senior technical & derivative analyst at HDFC SecuritiesRedington: Buy | LTP: Rs 222.80 | Stop-Loss: Rs 208 | Target: Rs 244 | Return: 9.5 percentThe stock price has broken out from the consolidation, which held for last 6 weeks. Price rise is accompanied by rise in volumes. Primary trend of the stock has been bullish with higher tops and higher bottoms on the weekly chart.The stock is placed above all important moving averages, indicating bullish trend on all time frames. Indicators and oscillators have been showing strength in the current uptrend.Finolex Industries: Buy | LTP: Rs 255 | Stop-Loss: Rs 240 | Target: Rs 278 | Return: 9 percentThe stock has broken out from the symmetrical triangle on the weekly chart. Price breakout is accompanied by jump in volumes.Primary trend of the stock has been bullish with higher tops and higher bottoms on the weekly chart. Stock is placed above all important moving averages, indicating bullish trend on all time frames.Graphite India: Buy | LTP: Rs 659 | Stop-Loss: Rs 628 | Target: Rs 710 | Return: 8 percentThe stock price has broken out from the narrow consolidation, which held in last 5 weeks. Breakout is accompanied by jump in volumes.The stock price has also broken out from downward sloping trend line on the monthly chart. Stock is placed above all important moving averages, indicating bullish trend on all time frames.Expert: Shrikant Chouhan, head equity research at Kotak SecuritiesUltraTech Cement: Buy | LTP: Rs 9,824 | Stop-Loss: Rs 9,490 | Target: Rs 10,500 | Return: 7 percentAfter the remarkable up move of the last few weeks, the counter witnessed short-term correction from the higher levels. However, closing above the important retracement levels suggest bullish continuation chart formation.Therefore, the counter is likely to resume its uptrend from the current levels in the near term.HCL Technologies: Buy | LTP: Rs 1,545 | Stop-Loss: Rs 1,490 | Target: Rs 1,650 | Return: 7 percentThe counter is in the accumulation zone where it is trading in a rangebound mode for the past few sessions. The texture of the chart formation and technical indicator RSI (relative strength index) is indicating that the counter is very likely to breakout from rectangle formation for a new leg of the up move in the coming horizon.GAIL India: Buy | LTP: Rs 190.75 | Stop-Loss: Rs 183 | Target: Rs 205 | Return: 7.5 percentOn the weekly charts, the counter is into a rising channel chart formation with higher high and higher low series pattern. Additionally, the technical indicators like ADX (average directional index) and RSI are also indicating further up trend from current levels which could boost the bullish momentum in the near future.Expert: Riyank Arora, technical analyst at Mehta EquitiesVarroc Engineering: Buy | LTP: Rs 537.85 | Stop-Loss: Rs 512 | Target: Rs 610 | Return: 13 percentThe stock has given a good breakout above its anchor VWAP (volume-weighted average price) resistance mark of Rs 530 and managed to close above the same. With the price retesting its support zone and offering a good risk-to-reward opportunity at current levels, along with the RSI on daily charts being around 58, the momentum still appears strong.The stock seems like a good buy with a strict stop-loss of 512 for potential upside targets of Rs 610 and above.Bajel Projects: Buy | LTP: Rs 226.50 | Stop-Loss: Rs 209 | Target: Rs 250 | Return: 10 percentThe stock has given a good breakout above its recent 6-day consolidation phase, which formed after the trendline breakout on its daily charts. With the major trend being positive and the anchor VWAP showing good demand in the stock, along with major support at Rs 175 levels, the stock looks like a good buy with a small stop-loss at Rs 209 for potential upside target of Rs 250 and above.The RSI (14) on daily charts at 62.20 and in a rising trend show strong momentum in the stock.Chambal Fertilisers and Chemicals: Buy | LTP: Rs 380.75 | Stop-Loss: Rs 372 | Target: Rs 402.50 | Return: 6 percentThe stock has given a good breakout above its recent swing high mark of rs 378.40 and successfully managed to close above the same. With the RSI (14) on daily charts near 65.04, the momentum looks strong for potential upside target of Rs 402.50 and above, with a strict stop-loss at Rs 372 mark.Overall, a strong technical structure for most of the fertilizer stocks and an interesting risk-reward ratio on Chambal makes the stock an intriguing candidate.Expert: Om Mehra, technical analyst at Samco SecuritiesSyngene International: Buy | LTP: Rs 729.5 | Stop-Loss: Rs 708 | Target: Rs 775 | Return: 6 percentThe stock has bounced back after forming a double bottom pattern in a daily time frame with significant volumes. The stock appears to be strongly placed above the middle Bollinger band and RSI holds above 60 levels.If the stock manages to close above Rs 736 level, it could move higher further. Hence, based on the above technical structure, one can initiate a long position at CMP Rs 729.5 for a target price of Rs 775. The stop-loss can be kept at Rs 708.Raymond: Buy | LTP: Rs 1,913.6 | Stop-Loss: Rs 1,850 | Target: Rs 2,090 | Return: 9 percentThe stock is forming higher highs and higher lows indicating a sustained uptrend. A Bullish momentum is evident as the 9-day simple moving average (SMA) has crossed above the 20 SMA, signifying a strengthening trend. The stock is on the verge of a potential breakout.Hence, based on the above technical structure, one can initiate a long position at CMP Rs 1,913.6 for a target price of Rs 2,090. The stop-loss can be kept at Rs 1,850.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Technically, the Nifty 50 is almost on the verge of an upward sloping long support trendline. Hence, the index may try to defend the trendline. In case the index breaks the same, then 21,500 is expected to be an immediate support, but on the higher side, if the index holds above the trendline, then 21,700-21,800 can be a resistance zone, experts said.On February 12, the Nifty 50 plummeted 167 points to 21,616 and formed long bearish candlestick pattern on the daily charts, while the BSE Sensex was down more than 500 points to 71,072. The broader markets hit hard as the Nifty Midcap 100 index tanked 2.5 percent and Smallcap 100 index plunged 4 percent.Stocks that bucked the trend included Zydus Lifesciences, HCL Technologies, and Apollo Hospitals Enterprises. Zydus Lifesciences rallied 6.4 percent to end at record closing high of Rs 857 and formed strong bullish candlestick pattern on the daily charts, with robust volumes, while on the monthly basis, it has continued run up for fourth consecutive month.HCL Technologies, too, ended at new closing high of Rs 1,667, up 2.2 percent and formed bullish candlestick pattern on the daily timeframe with above average volumes. On the monthly charts, the stock maintained upward journey for seventh consecutive month.Apollo Hospitals Enterprises, also, saw record closing high of Rs 6,614.5, rising 2.75 percent and formed long bullish candlestick pattern on the daily charts. The stock maintained upward bias for third days in a row, with strong volumes.Here's what Ashish Kyal of Waves Strategy Advisors recommends investors should do with these stocks when the market resumes trading today:Zydus LifesciencesPharma sector continued to shine. Amongst the pharma companies, Zydus Life is outperforming. Currently, the stock is trading at the life time high.On the daily chart, prices which were moving in an upward sloping channel has given a breakout of it, which is a positive sign. Also, base line (red) of the Ichimoku cloud has acted as a brilliant support which is near Rs 775 levels. So, as long as price holds above mentioned level, medium-term trend is likely to remain positive.In short, trend for Zydus Life remains positive. Since RSI (relative strength index) is in overbought territory, so buy on dips looks prudent strategy with the targets of Rs 875 as long as Rs 820 holds on the downside.Apollo Hospitals EnterprisesApollo Hospitals Enterprises has shown strong upside momentum since past few months. We have used Supertrend indicator on the daily chart. The Supertrend is acting as a reliable support.In addition, it has consistently offered support which can be seen in the below chart. This indicates that, as long as this line is protected, one should follow the current trend. Along with this, ADX (average directional index) is also suggesting that good momentum is likely to continue as it is showing reading of 48 which is above 25.In short, trend for Apollo Hospitals is bullish. Use dips as a buying opportunity for a move towards Rs 6,700 as long as Rs 6,160 holds on the downside.HCL TechnologiesHCL Technologies is currently trading at the record high. Middle Bollinger bands is acting as a strong support which is near Rs 1,585 levels. Adding to the positive outlook, the MACD (moving average convergence divergence) indicator recently showed a bullish crossover, signaling that bullish momentum can continue in the next few trading sessions.In short, outlook for HCL Tech is bullish. Dips can be used as buying opportunity for a move to Rs 1,750 levels as long as Rs 1,585 holds on the downside.Follow Ashish Kyal on Twitter - @kyalashishDisclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "After a firm opening, the Nifty gave up the early morning gains and remained under pressure throughout the session on February 12. The Nifty 50 lost 166 points to close at 21,616. Declining shares outnumbered the advancing shares as the advance-decline ratio stood at 0.33 on the BSE, lowest since January 23.The Nifty closed on a weak note below its 11 and 20 DMA (day moving average). In the derivatives, we have seen aggressive Call writing at 21,800-22,000 strikes. Moreover, we have seen the index forming multiple tops around 22,000 mark during the last few days, suggesting that on the upside, the 21,800-22,000 levels would act as a strong resistance. Therefore, traders are advised to remain cautious till the benchmark closes above 22,000.Immediate support for the Nifty is seen at 21,448 and 21,137, derived from the previous swing lows.The broader market indices like Midcap and Smallcap have started underperforming, compared to the Nifty, having lost 4.2 percent and 6.5 percent from their recent tops as against a 2.3 percent fall in the Nifty.Short-term trend of the Midcap/Smallcap Indices turned bearish after many weeks as they closed below its important moving averages. Our advice for the traders is to remain cautious for the Midcap/Small cap space for the near term.Here are two buy calls and one sell call for the next 3-4 weeks:KEC International: Buy | LTP: Rs 655 | Stop-Loss: Rs 603 | Target: Rs 714-740 | Return: 13 percentAfter breaking out on the weekly chart from the downward sloping trendline, the stock price is consolidating in a narrow range which we believe is a buying opportunity.Primary trend of the stock is positive as it is trading above its important moving averages.HCL Technologies: Buy | LTP: Rs 1,667 | Stop-Loss: Rs 1,575 | Target: Rs 1,770-1,850 | Return: 11 percentThe stock price has been forming bullish higher top higher bottom formation on the weekly chart. Momentum Indicators and Oscillators like RSI and MFI are in rising mode and placed above 60 on the daily chart, indicating strength in the stock.IT stocks are expected to continue their outperformance in the coming weeks.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "The market is expected to lack a direction in trading this week as well, unless the Nifty 50 gives a strong closing above 22,000 or sinks below 21,500, where the sacrosanct support is seen. This is likely to be a range for the index, experts said.The Nifty 50 shed a third of a percent amid volatility and closed at 21,783. The index has formed a bearish candlestick pattern with higher and lower shadows on the weekly scale.\"The time-wise correction phase continued with intermediate support at 21,680 (20 DEMA - day exponential moving average), followed by the sacrosanct support of 21,500 for the current week. On the flip side, the 21,900-22,000 zone remains a daunting task for the bulls, followed by the sturdy hurdle of 22,100,\" Sameet Chavan, research head for technical and derivatives at Angel One, said.A decisive breakthrough beyond the mentioned support or resistance zone could only trigger the next leg of the rally in the market, he feels. Chavan advises to have a pragmatic approach while keeping the zone in mind.Looking ahead to the next week, Jigar S Patel, senior manager of equity research at Anand Rathi, also feels that it's crucial for traders to closely monitor the 21,500 level, which is identified as a significant support level. A breach of this level could potentially trigger panic in the market, he said.Traders should keep a close eye on key support and resistance levels (22,000–22,100) and remain flexible in their trading strategies, he advised.It appears that the past week was indeed characterised by significant volatility, with the India VIX surpassing 15 level again and closing at 15.45 level on a weekly scale. This suggests that market participants should brace themselves for potentially heightened volatility in the coming week, Jigar said.Moneycontrol collated a list of top 10 stock ideas from experts with 3-4 weeks perspective. The closing price of February 9 is considered for stock price return calculation.Expert: Vinay Rajani, senior technical/derivative research analyst at HDFC SecuritiesCastrol India: Buy | LTP: Rs 201.6 | Stop-Loss: Rs 182 | Target: Rs 235 | Return: 17 percentThe stock price has shown resilient move against the recent correction of the benchmark indices. Stock has been consolidating in the narrow range for last 5 trading sessions.Primary trend of the stock has been bullish with higher tops and higher bottoms on the weekly chart. Stock price is placed above all important moving averages, indicating bullish trend on all time frames.UTI AMC: Buy | LTP: Rs 918.5 | Stop-Loss: Rs 850 | Target: Rs 1,025 | Return: 12 percentThe stock has been in to consolidation phase for last 8 trading sessions. Primary trend of the stock is bullish as it is placed above all important moving averages.The stock recently surpassed the crucial swing high resistance of Rs 894 and has been sustaining above it. Indicators and oscillators like DMI (directional movement index) and RSI (relative strength index) have turned bullish on the daily charts.Bank of Maharashtra: Buy | LTP: Rs 61.56 | Stop-Loss: Rs 56 | Target: Rs 70 | Return: 14 percentAfter registering stellar rally, the stock witnessed some profit booking from higher levels. It has come down to Rs 61 odd levels from recent swing high of Rs 69.Considering the primary uptrend, the recent correction should be utilized as a buying opportunity. PSU Bank sector has started outperforming and the same is expected to continue.Expert: Shrikant Chouhan, head – equity research at Kotak SecuritiesBharat Forge: Buy | LTP: Rs 1,314 | Stop-Loss: Rs 1,270 | Target: Rs 1,410 | Return: 7 percentThe counter has shown a robust rally from the lower levels in the recent sessions. Moreover, there is a fresh breakout along with incremental volume from the ascending triangle chart formation on the daily scale. As a result, the comfortable close above its breakout zone suggest upward momentum to persist in the coming horizon.Punjab National Bank: Buy | LTP: Rs 123.9 | Stop-Loss: Rs 119 | Target: Rs 133 | Return: 7 percentAfter the remarkable up move, the stock is having a breather from last few sessions. The consolidation in the rangebound structure suggests bullish continuation chart formation.Moreover, the stock comfortably closed above its short term moving average. Therefore, the stock is likely to resume its uptrend from the current levels.HCL Technologies: Buy | LTP: Rs 1,630.6 | Stop-Loss: Rs 1,570 | Target: Rs 1,740 | Return: 7 percentOn the weekly charts, the counter is into a rising channel chart formation with higher high and higher low series pattern. Additionally, the technical indicator RSI is also indicating further up trend from current levels which could boost the bullish momentum in the near future.Expert: Apurva Sheth, head of market perspectives & research at SAMCO SecuritiesDLF: Buy | LTP: Rs 834.4 | Stop-Loss: Rs 795 | Target: Rs 885 | Return: 6 percentOn the daily chart, the stock is moving in a higher high and higher low formation. It is trading above 20 and 50 DMA (day moving average), indicating strength in price action. The stock surged significantly in volume when it broke through its previous resistance of Rs 815 and is currently trading above this level.The stock has strong support at Rs 800 level, which corresponds to middle line of Bollinger band. Also, the positive crossover is indicated in the MACD (moving average convergence divergence) indicator while the RSI stands at 59 level.Hence, based on the above technical structure, one can initiate a long position at CMP Rs 834.4, for a target price of Rs 885. The stop-loss can be kept at Rs 795.Ambuja Cements: Buy | LTP: Rs 576.2 | Stop-Loss: Rs 552 | Target: Rs 615 | Return: 7 percentAmbuja Cements maintained a robust upward trend within a positive rising channel. The short-term moving averages of 20 and 50 affirm this bullish momentum, indicating favourable momentum.Despite a significant 40 percent surge in the past month, it might continue its primary trend. Volume participation has remained strong aligns with the rising price indicates strength. Additionally VWAP is rising upwards confirm the bullish trend.Hence, based on the above technical structure, one can initiate a long position at CMP of Rs 576.20 for a target price of Rs 615. The stop-loss can be kept at Rs 552.Expert: Avdhut Bagkar, derivatives & technical analyst at StoxBoxACC: Buy | LTP: Rs 2,628 | Stop-Loss: Rs 2,450 | Target: Rs 2,900 | Return: 10 percentThe “higher high, higher low” formation is witnessing bullish momentum as it approaches its all-time high placed at Rs 2,740. The price action is resilient, implying that a strong trend in play. The support of Rs 2,450 acts as a stop-loss for any long trade.The negative divergence prevents selling pressure from dominate the fragile bias.We advocate buying ACC shares in the range of Rs 2,620 -2,580 range, holding Rs 2,450 as stop-loss. The target for the optimistic trade appears at Rs 2,900.Vaibhav Global: Buy | LTP: Rs 458.8 | Stop-Loss: Rs 420 | Target: Rs 550 | Return: 20 percentThe monthly chart denotes a breakout of “Inverse Head and Shoulder”, post surpassing the key hurdle of Rs 460 on a decisive note. The trend is optimistic, and heading in the direction of Rs 550.The relative strength Index (RSI) is still far from reaching the overbought region, signaling enough for an up move. The volumes on the breakout suggest bullish participation, which could assist price to aim for higher levels.We recommend to buy around Rs 460-450 levels, holding Rs 420 as a support levels, and aiming to reach Rs 510 - 550 levels.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Market experts expect Finance Minister Nirmala Sitharaman to focus on continuity in capital expenditure towards infrastructure, new tax regime, fiscal consolidation path and GDP growth numbers in the Budget 2024, especially ahead of general elections.The market clocked nearly one percent gains on January 31, and broader markets rallied more than 1.5 percent ahead of the budget day, thanks to banking stocks. Nifty 50 recouped almost all its previous day's gains in the rebound.On January 31, the BSE Sensex climbed over 600 points to 71,752, and the Nifty 50 jumped over 200 points to 21,726, while the Nifty Midcap 100 and Smallcap 100 indices gained 1.6 percent and 2.25 percent respectively.Moneycontrol collated a list of Budget stocks picks from experts with 3-4 weeks perspective. The closing price of January 31 is considered for stock return calculation.Expert: Jigar S Patel, Senior Manager - Equity Research at Anand RathiPetronet LNG: Buy | LTP: Rs 269 | Stop-Loss: Rs 235 | Target: Rs 320 | Return: 19 percentSince 2019 until 2023, Rs 240 levels have proved to be massive resistance. Fortunately, in January 2024, the said counter managed to clear its Rs 240 resistance very comfortably and is currently placed near Rs 270 zone.The breakout on the monthly chart looks genuine since it is accompanied by huge volume, with respective stochastics reversing from the 40 zone, which is looking lucrative at current levels.Thus, investors and traders can enter longs in the zone of Rs 255–270 with an upside target of Rs 320 and a stop-loss of Rs 235 on a daily closing basis.KPR Mill: Buy | LTP: Rs 790 | Stop-Loss: Rs 749 | Target: Rs 860 | Return: 9 percentAfter making the top near Rs 928 on November 22, 2023, the said counter gave a decent correction until Rs 732. In the previous trading session, it bounced back from the support zone of Rs 730, coincidentally, which is between 100 and 200 DEMA (day exponential moving average), and in the process, it also took out its bearish trendline (refer to the chart), thus making it attractive at current levels.On the indicator front, daily stochastics has given a bull divergence (refer to the chart), which further confirms our bullish stance on the counter. Thus, one can buy in the zone of Rs 780–795 with an upside target of Rs 860 and stop-loss orders would be placed on a daily closing basis around Rs 749.Maruti Suzuki India: Buy | LTP: Rs 10,187 | Stop-Loss: Rs 9,650 | Target: Rs 11,000 | Return: 8 percentAfter breaking down the psychological level of Rs 10,000 in the month of August 2023, the counter has retested Rs 10,000 again and reversed from that level, which confirms that the August 2023 breakout above Rs 10,000 was genuine. Also, volume was huge at the time of the reversal, which further confirms our bullish stance on the counter.Coincidentally, 200 DEMA, which comes around Rs 9,850, has been successfully tested (refer to the chart). On the indicator front, daily stochastics has shown a bull divergence (refer to the chart). Thus, one can buy in the zone of Rs 9,900–10,200 with an upside target of Rs 11,000 and stop-loss orders would be placed on a daily closing basis around Rs 9,650.Expert: Omkar Patil, technical & derivatives analyst - institutional equity at Ashika GroupTata Power: Buy | LTP: Rs 390 | Stop-Loss: Rs 370 | Target: Rs 435 | Return: 11 percentThe stock is presently trading at an all-time high, reflecting its strong momentum. The consistent up move from the lower levels of Rs 230 has found support on each dip at the 12-day EMA. Additionally, the MACD (moving average convergence divergence) on the daily timeframe has shown a positive crossover above the zero line, indicating the likelihood of the prices continuing to trend higher.Going ahead, we expect the prices to move higher till Rs 435 where the stop-loss on the downside must be kept at Rs 370 on closing basis.Bank of Baroda: Buy | LTP: Rs Rs 247.6 | Stop-Loss: Rs 235 | Target: Rs 275 | Return: 11 percentThe stock is in a robust uptrend, marked by higher highs and higher lows. The recent up move is accompanied by a surge in volumes, indicating a strong buildup in the trend.Additionally, the MACD on the daily timeframe has shown a positive crossover, confirming the presence of positive momentum in the stock.Going ahead, we expect the prices to move higher till Rs 275 where the stop-loss on the downside must be kept at Rs 235 on closing basis.National Aluminium Company: Buy | LTP: Rs 149 | Stop-Loss: Rs 144 | Target: Rs 165 | Return: 11 percentThe stock has recently surpassed its multi-year high around Rs 142, the highest since April 2008. The stock has broken out of the consolidation zone range of 122-140, indicating the continuation of the prior uptrend. The recent rise in volumes also reflects the enthusiasm in the trend.Going ahead, we expect the prices to move higher till Rs 165 where the stop-loss on the downside must be kept at Rs 144 on closing basis.Expert: Ruchit Jain, lead research at 5paisa.comColgate Palmolive: Buy | LTP: Rs 2,569 | Stop-Loss: Rs 2,480 | Target: Rs 2,730 | Return: 6 percentThe stock has seen an uptrend in last few months and has shown an outperformance to other stocks from the FMCG sector. In last few weeks, the stock consolidated in a range which just seemed to be a time-wise correction within an uptrend.The prices have now given breakout from this consolidation and the RSI (relative strength index) oscillator too has given a positive crossover which indicates a resumption of the uptrend.Traders can look to buy the stock around current market price of Rs 2,570 for potential target of Rs 2,730. The stop-loss on long positions should be placed below Rs 2,480.Dr Reddy's Laboratories: Buy | LTP: Rs 6,121 | Stop-Loss: Rs 5,920 | Target: Rs 6,470 | Return: 6 percentThe stock gave a breakout from its previous swing high resistance post the announcement of its quarterly results. The volumes on breakout were high which indicates a fresh buying interest in the stock and the RSI readings too are hinting at positive momentum.We advise traders to look for buying opportunities in the stock around current market price of Rs 6,120 and add on any dips towards the breakout zone of Rs 6,000. The potential targets for the stock are seen around Rs 6,320 and Rs 6,470 while stop-loss on long positions should be placed below Rs 5,920.HCL Technologies: Buy | LTP: Rs 1,576 | Stop-Loss: Rs 1,500 | Target: Rs 1,720 | Return: 9 percentThe stock has been forming a ‘higher top higher bottom’ structure since last few months and is thus in an uptrend. The 20 DEMA has been acting as a support on declines and it has formed a ‘Bullish Flag’ pattern on the daily charts.The price volumes structure is also bullish as the price up moves have been supported by good volumes, but the corrections have not seen any high volume sell-off.Hence, we advise short term traders to buy the stock in the range of Rs 1,580-1,570 for potential targets of Rs 1,660 and Rs 1,720. The stop-loss on long positions should be placed below Rs 1,500.Expert: Jatin Gedia, technical research analyst at Sharekhan by BNP ParibasGrasim Industries: Buy | LTP: Rs 2,175 | Stop-Loss: Rs 2,050 | Target: Rs 2,300-2,411 | Return: 11 percentGrasim was consolidating in a range and in process has retraced 38.2 percent of the rise from Rs 1,820 – Rs 2,166. In terms of price pattern it has formed and broken out a Bullish Flag pattern on the upside indicating resumption of the next leg of upmove.Daily momentum indicator has completed its pullback to the equilibrium line and triggered a positive crossover which indicates start of a new cycle.Prices are trading along the expanding upper Bollinger band indicating that the positive momentum is likely to continue. On the upside, the move can extend towards Rs 2,300 and above that it can extend towards Rs 2,411. Structure becomes weak below Rs 2,050.PFC: Buy | LTP: Rs 443 | Stop-Loss: Rs 410 | Target: Rs 479-495 | Return: 12 percentPower Finance Corporation (PFC) has been in a medium term uptrend. In the last two months, the stock has undergone a time wise correction where it has been trading within the broad range of Rs 380 – 430. The range has been broken out on the upside and suggests that the stock has resumed its next leg of upmove.Daily momentum indicator has a positive crossover which is a buy signal. Thus, both price and momentum indicator suggest that the stock has resumed its upmove after a two months consolidation.Targets on the upside are placed at Rs 479 which is the weekly upper Bollinger band and Rs 495 which is the range breakout target. The structure becomes weak below Rs 410.SBI: Buy | LTP: Rs 641 | Stop-Loss: Rs 616 | Target: Rs 670-700 | Return: 9 percentState Bank of India (SBI) underwent correction and retraced 50 percent of the rise it witnessed from Rs 555 to Rs 660. The correction halted around the 20-week moving average (Rs 602) and witnessed buying interest from the crucial support zone.The daily momentum indicator provided a positive crossover from below the equilibrium line which is a buy signal. On the price front the stock has broken out of a falling channel indicating resumption a fresh leg of upmove.We expect the stock to rise towards the recent swing high of Rs 670 and extend towards the psychological level of Rs 700 from short term perspective. Structure shall become weak below Rs 616.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Geojit's research report on HCL TechnologiesHCL Technologies Ltd (HCL) is into software development and business process outsourcing, as well as providing IT infrastructure services. It has operations in 60 countries, with a client base that includes Fortune 500 and Global 2000 companies. As of end-Q3FY24, the employee count was 224,756. The company delivered muted performance in Q3FY24, with slight increase in topline and margins amid a challenging macroeconomic environment. Consolidated sales grew 6.5% YoY to Rs. 28,446cr (4.3% YoY in constant currency terms), owing to increase in recurring revenue in its software business. EBITDA margin widened 10bps YoY to 23.9%, due to lower discretionary spends and furloughs. In Q3FY24, Company performed far better amongst its top competitors in the IT industry. Order pipeline rose at a tepid pace and remain optimistic on improving margin in the medium term.OutlookHence, we upgrade our rating on the stock from HOLD to BUY, with a roll forward target price of Rs. 1,760 based on 23.5x FY26E adjusted EPS.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.HCL Technologies - 18012024 - geo ",
    "Net Sales at Rs 28,446.00 crore in December 2023 up 6.54% from Rs. 26,700.00 crore in December 2022.Quarterly Net Profit at Rs. 4,350.00 crore in December 2023 up 6.2% from Rs. 4,096.00 crore in December 2022.EBITDA stands at Rs. 7,157.00 crore in December 2023 up 8.03% from Rs. 6,625.00 crore in December 2022.HCL Tech EPS has increased to Rs. 16.06 in December 2023 from Rs. 15.13 in December 2022.HCL Tech shares closed at 1,555.45 on January 16, 2024 (NSE) and has given 34.82% returns over the last 6 months and 42.22% over the last 12 months.",
    "Net Sales at Rs 12,531.00 crore in December 2023 up 1.07% from Rs. 12,398.00 crore in December 2022.Quarterly Net Profit at Rs. 3,349.00 crore in December 2023 up 4.79% from Rs. 3,196.00 crore in December 2022.EBITDA stands at Rs. 5,098.00 crore in December 2023 up 5.24% from Rs. 4,844.00 crore in December 2022.HCL Tech EPS has increased to Rs. 12.37 in December 2023 from Rs. 11.80 in December 2022.HCL Tech shares closed at 1,555.45 on January 16, 2024 (NSE) and has given 34.82% returns over the last 6 months and 42.22% over the last 12 months.",
    "Sharekhan's research report on HCL TechnologiesHCL Tech reported strong revenues of $3,415 million, up 6% q-o-q/4.3% y-o-y in constant currency (CC) terms beating our estimates of 4.4% q-o-q CC led by ERS, HCL Software and IT services, which grew 8.7%/32% and 1.9%, q-o-q respectively in CC terms. EBIT margins improved ~130 bps q-o-q to 19.8% owing to outperformance from the software (180 bps) that was offset by services margin (50 Bps) despite wage hike and furloughs. New deal win TCVs stood at $1,927 million, down 51%/18% on a q-o-q and y-o-y basis, respectively. FY24 CC revenue growth (including ASAP acquisition) guidance narrowed to 5-5.5% at company level as well as for Services segment. Ask rate for Q4FY24 at 0.3 to 2.1%, and 1.6 to 3.5% at services level.OutlookWe believe HCL Tech is well-equipped to maintain its growth leadership among large peers in the medium term given the diversified portfolio that is well-aligned to growth areas and strong execution. Hence, we maintain Buy with revised price target (PT) of Rs 1,780. At CMP the stock trades at 22.5/19.1x its FY25/26E EPS.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.HCL Technologies - 15012024 - khan ",
    "Considering the impressive rally led by technology stocks in the market last Friday (January 12), experts suggest that the market is poised to reach the 22,000-22,100 zone in the coming days before potentially entering a consolidation phase. Support is expected to move slightly higher to the 21,800-21,700 area, while the crucial support level remains at 21,500.area while the crucial support remains at 21,500 levels, experts said.On January 12, the benchmark indices achieved a record closing high, with the Nifty 50 gaining 247 points to reach 21,894.5. The daily charts exhibited a bullish candlestick pattern, indicating a formation of higher highs and higher lows for yet another session.The BSE Sensex climbed 847 points to 72,568, but the broader markets underperformed frontline indices as the Nifty Midcap 100 and Smallcap 100 indices gained 0.4 percent each.Stocks that recorded healthy gains and better than benchmarks & broader markets included HCL Technologies, Firstsource Solutions, and IRFC. HCL Technologies has seen a decisive breakout of horizontal resistance trendline and climbed 3.8 percent to end at record closing high of Rs 1,540.8. The stock has formed long bullish candlestick pattern on the daily charts with strong volumes, while the stock traded way above all key moving averages (20, 50, 100 and 200-day EMA - exponential moving average), which is a positive sign.Firstsource Solutions also participated in the IT rally, rising 10.4 percent to Rs 210, the highest closing level since October 19, 2021, and formed robust bullish candlestick pattern on the daily charts with significantly higher volumes.IRFC extended uptrend for third consecutive session with healthy bullish candlestick pattern on the daily charts and the volume remained above average for yet another session. The stock jumped 6 percent to end at record closing high of Rs 113.4.Here's what Rajesh Palviya of Axis Securities recommends investors should do with these stocks when the market resumes trading today:Indian Railway Finance CorporationOn the weekly chart, the IRFC broke above the 'Rounded Bottom' pattern at Rs 92 in mid-December 2023 and consolidated for the past three weeks. Last week, it surpassed the small consolidation range between Rs 105-94, signalling a continuation of the uptrend post-breakout.The daily and weekly RSI (relative strength index) indicators are in a bullish mode, indicating rising strength.Investors should buy, hold and accumulate this stock with an expected upside of Rs 123-130 with downside support zone of Rs 108-103 levels.Firstsource SolutionsOn the weekly chart, FSL broke above the 'multi-year resistance' level at Rs 192, a barrier in place since January 2022. This breakout is accompanied by an increase in volume activity, indicating an influx of market participation.The prior resistance zone around Rs 192 is expected to function as a support zone, aligning with the \"Principle of Change in Polarity\" in technical analysis.Additionally, the weekly RSI strength indicators are in a bullish mode, holding above their reference line, indicating rising strength.Investors should buy, hold and accumulate this stock with an expected upside of Rs 230-250 with downside support zone of Rs 197-190 levels.HCL TechnologiesOn the weekly chart, HCLTECH broke above the 'Bullish Flag' pattern at Rs 1,490 with a strong bullish candle, signalling the continuation of an uptrend. The breakout is accompanied by an increase in volume activity, suggesting a surge in market participation.The stock is establishing higher highs and higher lows, maintaining its position above the medium-term upward-sloping trendline, indicating a continued uptrend.The weekly strength indicator RSI is in a bullish mode and holding above its reference line, suggesting a positive bias.Investors should buy, hold and accumulate this stock with an expected upside of Rs 1,630-1,700 and downside support zone of Rs 1,490-1,450 levels.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Shares of HCL Technologies opened 4 percent higher on January 15, extending gains for a second day in a row, with brokerages raising FY24, FY25 and FY26 earnings estimates for the company following a solid beat in Q3 FY24 numbers. At 9:17 am, the stock was quoting at Rs 1,603.70 on the NSE, higher by 4.1 percent from previous close.For the December quarter, the HCL Tech reported a 6.23 percent year-on-year (YoY) growth in net profit at Rs 4,351 crore and 6.54 percent YoY in consolidated revenue at Rs 28,446 crore. Both numbers beat Moneycontrol estimates.Before the results were announced on January 12, the stock had gained 4 percent in anticipation of strong results on the back of ASAP acquisition and Verizon deal.Also Read: Jio Financial Services Q3 results on Jan 15: Here's all you need to knowWhile December quarter is a seasonally weak quarter for Indian IT services companies, HCL Tech is an exception due to its products vertical, as per analysts.\"The growth in revenue was driven by seasonal gains in HCL Software (products and platform), which rose 34 percent sequentially,\" said analysts at Motilal Oswal Financial Services.Meanwhile, the company has slightly reduced its revenue growth guidance for FY24 from 5-6 percent YoY in constant currency terms to now 5-5.5 percent, though it has maintained its margin guidance of 18-19 percent.Also Read: Avenue Supermarts Q3: D-Mart operator's net profit rises 17% to Rs 690 crore, revenue up 17.3%EPS upgradesAfter the strong Q3 results and beat, Motilal Oswal has raised FY24-26E EPS by 3-4 percent. \"We reiterate our BUY rating with a target price of Rs 1,880. HCLT remains our top pick in the IT Services coverage for 2024. The stock is trading at ~20x FY26E EPS, which offers a margin of safety,\" it said.Nuvama Institutional Equities has also upgraded FY24, FY25 and FY26 EPS by 2 percent, 0.6 percent and 2.7 percent, respectively.\"We continue to value HCL at 23x FY26 PE yielding a target price of Rs 1,780 (earlier Rs 1,700). Retain BUY,\" Nuvama's analysts Vibhor Singhal and Nikhil Choudhary wrote in a note.Analysts at Morgan Stanley maintained an Equalweight call but raised the target to Rs 1,600 per share from Rs 1,470, highlighting the company's superior Q3 performance and notable beats in services business and EBIT margins. On the other hand, CLSA downgraded HCLTech to Underperform from Outperform, despite raising the target to Rs 1,536 per share.Also Read: HCLTech bucks industry trend, headcount up by 3,617 in Q3FY24Key takeaways from concallAnalysts cheered that the management aspired to achieve and sustain a 20 percent margin trajectory in the longer term. Going ahead, the company is betting big on GenAI.A key takeaway from the call, as per Emkay Global, is that GenAI holds immense potential and near-term programs in this segment are likely to be small, albeit expected to become sizable in the next 2-3 quarters. HCL Tech has signed 31 deals in Gen AI, most of which are valued at sub-$1 million.Also Read: Dalal Street Week Ahead: Q3 earnings, Red Sea, China GDP, Europe inflation among 10 key factors to watchManagement does not see an uptick in discretionary spend yet. However, cloud, analytics remains strong, noted Nuvama. \"HCL Tech does not see any meaningful change in the demand environment in IT Services while seeing growth momentum in the ER&D (Engineering and R&D) business,\" it said.Over the past one year, HCL Tech stock has outperformed most of its large peers and has gained over 42 percent.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Motilal Oswal's research report on HCL TechnologiesHCL Technologies (HCLT) delivered a robust 3QFY24 performance, with a 6.0% QoQ revenue growth in constant currency (CC) terms, ahead of our estimate of +4.4%. This growth was driven by seasonal gains in HCL Software (P&P), which rose 34% QoQ. HCLT’s Services grew 3.1% QoQ in CC terms (110bp ahead of MOFSLe), with healthy growth in both the IT and ER&D verticals. The TCV was at USD1.9b, down from 2Q’s high base of USD4.0b. HCLT narrowed its FY24 USD revenue growth guidance to 5.0%-5.5% YoY in CC (vs. 5.0-6.0% YoY earlier, including ASAP) for both consolidated and Services segment. The EBIT margin also exceeded expectations at 19.8% (+130bp QoQ), led by HCL Software, which achieved 32.9% margin. The Services margin contracted 50bp QoQ though. HCLT retained its EBIT margin guidance band of 18-19%.OutlookAfter the strong 3Q results and beat, we have raised our FY24-26E EPS by 3- 4%. We reiterate our BUY rating with a TP of INR1,880, as we roll forward our P/E-based valuation to FY26 and assign a multiple of 24x.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.HCL Technologies - 14012024 - moti ",
    "IT services major HCL Technologies traded flat at Rs 1,500 per share on December 20 morning deals after the company faced a ransomware incident within a restricted cloud environment associated with one of its projects.\"HCLTech has become aware of a ransomware incident in an isolated cloud environment for one of its projects. There has been no impact observed due to this incident on the overall HCLTech network,\" the IT company said in a stock exchange filing on December 20.Cybersecurity and data protection is a top priority for HCLTech. A detailed investigation is underway in consultation with relevant stakeholders to assess the root cause and take remedial action as necessary, it added.Follow our market blog to catch all the live updatesFollowing a significant 10 percent increase in the span of three trading sessions, HCL Technologies has been downgraded by Kotak Institutional Equities on December 19. The brokerage firm has taken this step due to its perception of limited potential for further gains. Furthermore, Kotak has revised its rating on HCL Technologies, downgrading it from 'Buy' to 'Add'.Last week, HCL Technologies, India's No. 3 software-services exporter, entered an exclusive group of companies with a market capitalisation (market-cap) of Rs 4 lakh crore.In a filing to the stock exchange on December 14, HCL Technologies announced that it has secured a contract from the Department of Transport and Planning in Victoria, Australia. The agreement involves the development and support of a Concessions Entitlement Validation Platform (CEVP).The platform aims to automate the concession entitlement process for public transport users, providing instant proof of concession entitlement and a passenger interface for applying for and managing concession entitlement. The financial details of the deal were not disclosed.HCL Technologies cut its revenue forecast for the current financial year in October, attributing the adjustment to weaker-than-expected discretionary spending by its clients in the first half of the year. The company expects organic revenue growth for fiscal 2024 to fall in the range of 4 percent to 5 percent in constant currency terms. This is a revision from its earlier projection, which had indicated an increase between 6 percent and 8 percent.HCL Technologies' consolidated net profit increased by 9.8 percent to Rs 3,832 crore ($460.35 million) for the second quarter ended September 30.\n       ",
    "Bulls of Dalal Street charged the market to hit the much-awaited psychological 21,000 level and record the highest weekly gains since July 2022, but it failed to hold the level as some consolidation kicked in. The phase of consolidation may last as long as the index trades below the 21,000 mark, with immediate support at 20,850 and crucial support at the 20,500-20,300 levels, but if the index decisively closes above 21,000, then 21,500 could be the possibility, experts said.The Nifty50 has seen a strong gap-up opening in the week ended December 8, and jumped 3.46 percent to end at a record closing high of 20,969, forming a healthy bullish candlestick pattern on the daily charts with higher-high-higher-low formation for yet another week.\"In the upcoming week, 20,850 is viewed as an immediate support, and sustained trading below this level could trigger a price correction, potentially bringing prices towards the next support at 20,700,\" Sameet Chavan, research head for technical and derivatives at Angel One, said.He further said the primary support zone remained the bullish gap created last week, ranging from 20,500 to 20,300, and as long as it holds, the secular bull run is expected to persist and any type of correction would be considered healthy for primary uptrend.On the other hand, identifying key resistance is challenging in uncharted territory, but the 21,100 levels, representing a reciprocal golden (161.8 percent) retracement of the recent fall, holds technical significance, he added.Ajit Mishra, SVP of technical research at Religare Broking, also said the Nifty has the potential to test the 21,200-21,500 zone and expects the index to hold the 20,300-20,550 zone in case investors decide to take some money off table.He maintains a positive view on the market, despite the overbought conditions and suggests participants to look for buying opportunities on dips, while Sameet advised traders to focus on thematic movements for potentially outperforming trades while remaining vigilant in the dynamic market environment.Moneycontrol collated the list of 10 stock picks from experts, which can generate healthy returns in the coming 3-4 weeks, from the closing price December 8:Subash Gangadharan, senior technical and derivative analyst at HDFC SecuritiesKotak Mahindra Bank: Buy | LTP: Rs 1,838 | Stop-Loss: Rs 1,750 | Target: Rs 2,000 | Return: 9 percentKotak Bank has shown relative strength last week. While the Nifty has gained 3.47 percent, the stock has gained 5 percent. In the process, the stock has closed above its recent trading range on the back of above average volumes, which augurs well for the uptrend to continue.Technical indicators are giving positive signals as the stock is trading above the 20 and 50-day SMA (simple moving average). Momentum readings like the 14-week RSI (relative strength index) too are in rising mode and not overbought, which implies potential for further upsides.With the intermediate technical setup too looking attractive, we expect the stock to move up towards its previous intermediate highs in the coming weeks. Buy between Rs 1,830-1,850 levels. Stop-loss is at Rs 1,750 while target is at Rs 2,000.EIH: Buy | LTP: Rs 247 | Stop-Loss: Rs 237 | Target: Rs 265 | Return: 7 percentAfter correcting from an intermediate high of Rs 275 tested in September 2023, EIH found support around Rs 205 levels in October 2023. These are strong supports as they also roughly coincide with the previous intermediate lows.The stock has since then bounced back and made higher tops and higher bottoms over the last few weeks. The stock has broken out of its recent trading range this week on the back of healthy volumes. This indicates it is set to move higher in the coming weeks.Technical indicators, too, are giving positive signals as the stock is trading above the 20 and 50-day SMA. Momentum readings like the 14-day RSI too are in rising mode and not overbought, which implies potential for further upsides.With the intermediate technical setup too looking attractive, we expect the stock to move up towards its previous intermediate highs in the coming weeks. Buy in the Rs 245-250 levels. Stop-loss is at Rs 237 while target is at Rs 265.Indiabulls Real Estate: Buy | LTP: Rs 90 | Stop-Loss: Rs 80 | Target: Rs 105 | Return: 17 percentAfter correcting from an intermediate high of Rs 196 tested in November 2021, Indiabulls Real Estate found support around Rs 46 levels in March 2023. These are strong supports as they also roughly coincide with the previous intermediate lows.The stock has since then bounced back and made higher tops and higher bottoms over the last few weeks. This week, the stock has broken out of its recent trading range on the back of huge volumes. This indicates significant accumulation has happened in this counter, which augurs well for the uptrend to continue.Technical indicators too are giving positive signals as there has been a positive moving average crossover. The 20-week SMA has recently moved above the 50 week SMA. Momentum readings like the 14-week RSI too are in rising mode and not overbought, which implies potential for further upsides.With the intermediate technical setup too looking attractive, we expect the stock to move up towards its previous intermediate highs in the coming weeks. Buy between Rs 87-91 levels. Stop-loss is at Rs 80 while target is at Rs 105.Mehul Kothari, DVP – Technical Research at Anand RathiIRCTC: Buy | LTP: Rs 750 | Stop-Loss: Rs 715 | Target: Rs 795 | Return: 6 percentIn the past few months, we witnessed an exceptional rally in the railway stocks but IRCTC (Indian Railway Catering & Tourism Corporation) was the one which was lagging behind. A couple of sessions back, IRCTC confirmed a range breakout, and the price structure resembles a bullish Inverse Head and Shoulder pattern.The price action is accompanied with the bullish placement of weekly ADX (average directional index) which is above 25. This might result in a strong upside momentum.Thus, traders are advised to buy Rs IRCTC in the range of Rs 750 - 740, with a stop-loss of Rs 715 on closing basis for an upside target of Rs 795 in coming 1–2 months.Jigar S Patel, Senior Manager - Equity Research at Anand RathiJubilant Foodworks: Buy | LTP: Rs 559.75 | Stop-Loss: Rs 499 | Target: Rs 645 | Return: 15 percentOn a daily scale, the said counter has taken out the previous swing high of Rs 556. On a weekly scale, price action is sustaining above all major exponential averages, which is a sign of bullishness.On the indicator front, the daily RSI has taken out its previous swing high, along with the daily DMI’s bullish cross, which further confirms our bullish stance in the counter.On a daily close basis, one can buy in the zone of Rs 550-560 with an upside target of Rs 645 and a stop-loss of around Rs 499 on a daily close basis.Shrikant Chouhan, head equity research at Kotak SecuritiesHCL Technologies: Buy | LTP: Rs 1,364 | Stop-Loss: Rs 1,315 | Target: Rs 1,460 | Return: 7 percentOn daily and weekly charts, the stock is consistently forming higher high and higher low formation which is largely positive. On last Friday, the stock successfully cleared the short-term resistance of Rs 1,350 and succeeded to close above the same.It also formed bullish candle on daily charts, which supports further uptrend from the current levels. We are of the view that, as long as the stock is trading above Rs 1,315 the bullish formation is likely to continue. Above which, the stock could continue the positive momentum till Rs 1,430/1,460.Bank of Baroda: Buy | LTP: Rs 212 | Stop-Loss: Rs 204 | Target: Rs 227 | Return: 7 percentIn the past week, the stock rallied over 5 percent. After a long time the stock successfully, trading above 50-day SMA. A bullish candle on weekly charts and uptrend continuation formation on daily and intraday charts supports further uptrend from the current levels.For the trend following traders now, Rs 204 would act as a trend decider level, above the same, the stock could rally till Rs 222-227.HDFC Life Insurance Company: Buy | LTP: Rs 671 | Stop-Loss: Rs 660 | Target: Rs 725 | Return: 8 percentAfter a promising uptrend, the stock was witnessing some profit booking at higher levels. However, the short-term texture of the stock is still in to the positive side.We are of the view that, the stock has completed one leg of correction and now. If it sustained above 20-day SMA or Rs 660 level then it could move up till Rs 710. Further upside may also continue which could lift the stock till Rs 725.Omkar Patil, Technical & Derivative Analyst at Ashika Stock BrokingUltraTech Cement: Buy | LTP: Rs 9,414 | Stop-Loss: Rs 9,075 | Target: Rs 10,400 | Return: 10 percentUltraTech is currently experiencing a robust uptrend, characterized by a healthy correction from June 2023 to November 2023. Notably, this correction maintained a positive structure by avoiding lower lows and lower highs.Having emerged from consolidation, the stock is now showing an uptick in volumes, indicating potential price acceleration. Furthermore, prices are positioned above short-term averages, and the RSI stands above the mark of 60 on both daily and weekly timeframes, affirming the presence of positive momentum.We expect the prices to move higher till the mark of Rs 10,400 where the stop-loss must be Rs 9,075 on daily closing basis.NOCIL: Buy | LTP: Rs 258.45 | Stop-Loss: Rs 250 | Target: Rs 290 | Return: 12 percentNOCIL's stock underwent a year-long consolidation, fluctuating between Rs 255 on the higher end and Rs 200 on the lower side. A notable development occurred as the stock recently broke out of this range with a rising gap, highlighting robust demand fueling the breakout.The surge in volume accompanying the breakout further validates its strength. Additionally, the RSI on the daily timeframe is above the 60 mark, indicating a rising momentum in prices.We expect the prices to move higher till the mark of Rs 290 where the stoploss must be Rs 250 on daily closing basis.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Shares of HCL Technologies  slipped 1 percent to Rs 1,320 per share on December 5 after its UK-arm is set to offload entire 49 percent stake in US-based State Street joint venture (JV).In the past three months, the stock of this IT major jumped 8.5 percent as against 5 percent rise in the benchmark Sensex.Follow live blog for all the market actionHCL Tech Investments UK, the step-down wholly-owned subsidiary of HCL Tech signed a memorandum of understanding (MoU) with its joint venture partner State Street International Holdings for selling entire 49 percent stake in the JV to State Street for $170 million plus net book value.Analysts at Morgan Stanley shared an 'overweight' rating with a target price of Rs 1,400 per share. \"The transaction is expected to complete by second quarter of fiscal year 2023-24 (Q2FY24) or Q1FY25. State Street has a revenue base of $97 million and net worth of $94 million. State Street would own 49 percent of voting rights in the JV and 100 percent of dividend rights,\" the brokerage firm said.Nomura, however, shared a 'neutral' call on HCL Tech post this deal, with a target price of Rs 1,200 per share. They believe that HCL Tech would lose $97 million of revenues or 80 basis points (bps) of its current revenues post this divesture.\"As part of this divesture, HCL Tech would receive $170 million plus net book value on date of closing. The arrangement is expected to be effective from Q1FY25 onwards,\" analysts added.ALSO READ: Accumulate HCL Technologies; target of Rs 1374: KR ChokseyState Street Corporation is a US-based financial services provider to institutional investors including investment servicing, investment management and investment research and trading.\"Bringing the State Street HCL Services capabilities and expertise in-house will create a more simplified model to facilitate faster decision making and a more effective and efficient experience for its clients,\" HCL Tech said in an exchange filing dated December 4, 2023.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. \n       ",
    "The market achieved a fresh milestone on December 1, the first day of the last monthly series of the current calendar year, with the Nifty50 exceeding  its previous record high after two-and-a-half months to hit 20,285 points.Renewed buying by foreign institutional investors (FIIs), raging hopes that the US Federal Reserve has stopped raising the rates and a reversal is on the cards backed by strong fundamentals, and robust economic growth back home in India have been the main growth drivers for the record rally in the equity market.Technically, the Nifty50 looks on course to reach another milestone of 20,500 points soon, considering the healthy bullish candlestick pattern on the daily charts with continuation of higher-highs-higher-lows for four days in a row and staying above all key moving averages, while 20,000 is expected to be a crucial support from here on, experts said.Historically, December has been the best month for the Nifty50 with more than 3 percent average return, if we were to consider the monthly performance data for the last 29 years. So, the probability of the Indian markets continuing its upward journey this month looks high, said Vinay Rajani, CMT, senior technical and derivative analyst at HDFC Securities.The Nifty50 jumped 136 points or 0.7 percent to 20,269 at 1:22pm after the end of uncertainty related to exit poll in five state elections, taking the total gains to 7.7 percent from the October low of 18,837.85. All the sectors supported the market, barring IT.Also read: Why Sensex lags behind Nifty in race to new highs? Blame it on these top gainers BSE index lacks\"The sentiment remains strong as long as it stays above the 20,000 mark and also continued buy-on-dips strategy. On the higher side, the index could potentially move towards 20,450-20,500,\" Rupak De, senior technical analyst at LKP Securities, said.The broader markets also maintained the upward move, with the Nifty Midcap 100 index gaining 1.15 percent and Nifty Smallcap 100 index rising 0.7 percent, while India VIX stayed below 13.The BSE Sensex, which traded 494 points higher at 67,482, is yet to surpass its previous record high of 67,927.23 reached on September 15.Let's take a look at the top 10 trading ideas from experts for the next three-four weeks. Returns are based on the November 30 closing prices.Expert: Ashish Kyal, CMT, Founder and CEO of Waves Strategy AdvisorsAU Small Finance Bank: Buy | LTP: Rs 741.4 | Stop-Loss: Rs 720 | Target: Rs 780 | Return: 5 percentDespite the index rallying, AU Small Finance Bank saw some profit-booking in the previous session. The chart shows that prices have just closed above the cloud, keeping the overall tone positive. Wave b appears to be completed on the downside, as prices have retraced nearly 78.6 percent of the previous leg.We used Supertrend on the hourly chart. It has served as a strong support and resistance, and prices are taking support at the moment. We can now expect an upward bounce. Furthermore, the entire sector is up, so the overall outlook remains positive.Overall, the trend for AU Small Finance Bank looks positive. Any break above Rs 755 will take the stock towards Rs 780 levels, whereas on the downside Rs 720 can act as a nearest support.Gufic Biosciences: Buy | LTP: Rs 334.25 | Stop-Loss: Rs 315 | Target: Rs 350 | Return: 5 percentGufic Biosciences has been moving higher recently and intact in strong uptrend. On the daily chart, in the previous session prices formed a bullish candle. Price has closed above Rs 333 which confirm breakout of the rounding bottom pattern.We have shown ADX (average directional index) indicator which gives an indication if the stock is trending or in a trading range. The low readings of ADX indicates that the stock is in a range. The ADX of this stock is 42.91 giving an indication of a trending market. The reading above 25 means strong directional strength.As shown on the hourly chart, price has recently bounced from the Ichimoku cloud which can act as near-term support zone. Closest support is placed at Rs 315.In short, trend for this stock is positive. Use dips towards Rs 325 as a buying opportunity for a move towards Rs 350 levels as long as Rs 315 holds on the downside.Expert: Jigar S Patel, Senior Manager - Equity Research at Anand RathiHindustan Unilever: Buy | LTP: Rs 2,545.55 | Stop-Loss: Rs 2,490 | Target: Rs 2,700 | Return: 6 percentAfter consolidating for 8–10 weeks, HUL gave a breakout from its previous trading range along with a bear trendline violation, which is looking lucrative at current levels.On the indicator front, weekly RSI (relative strength index) is consistently above 50 levels, along with weekly DMI's (directional movement index) that are positive, thus adding further confirmation of bullish bias.One can buy in the zone of Rs 2,550–2,570, and the target would be Rs 2,700, and the stop-loss would be Rs 2,490 on a daily close basis.Jubilant Foodworks: Buy | LTP: Rs 560.85 | Stop-Loss: Rs 520 | Target: Rs 655 | Return: 17 percentOn a daily scale, the said counter has taken out the previous swing high of Rs 556. On a weekly scale, price action is sustaining above all major exponential averages, which is a sign of bullishness.On the indicator front, the daily RSI has taken out its previous swing high, along with the daily DMI’s bullish cross, which further confirms our bullish stance in the counter.On a daily close basis, one can buy in the zone of Rs 560–570 with an upside target of Rs 655 and a stop-loss of around Rs 520 on a daily close basis.Chambal Fertilisers and Chemicals: Buy | LTP: Rs 318.25 | Stop-Loss: Rs 285 | Target: Rs 365 | Return: 15 percentChambal Fertilisers has been consolidating for some time on the weekly chart. Recently, it had a breakout with huge volume. On the indicator front, weekly RSI is about to enter the 70 zone, along with weekly DMI, which has turned positive, thus looking lucrative.Thus, we advise traders to go long in the stock in the range of Rs 315-320 with a stop-loss of Rs 285 and target of Rs 365Expert: Om Mehra, technical analyst at SAMCO SecuritiesSAIL: Buy | LTP: Rs 92.30 | Stop-Loss: Rs 87 | Target: Rs 102 | Return: 10.5 percentSteel Authority of India stock is trading above 20 and 50 simple moving averages (SMA), ratifying the support in price action. Also, Inverse Head and Shoulder formation is indicated in the daily chart. The price has been trading above Ichimoku Cloud & positive crossover is indicated in MACD (moving average convergence divergence) indicator indicating the continuity of the ongoing trend.There is minor resistance around Rs 94 levels once it sustains above these levels strong traction is expected.Hence, based on the above technical structure one can initiate a long position at Rs 92.7. However, on the safer side nearby Rs 91-92 levels would be a better range to enter. Closing and sustaining above Rs 94 would lead toward Rs 102 levels in the coming days. Stop-loss can be kept as Rs 87.Britannia Industries: Buy | LTP: Rs 4,852.65 | Stop-Loss: Rs 4,748 | Target: Rs 5,200 | Return: 7 percentOn a weekly chart, the stock has been trading with the support of a middle Bollinger band which suggests a positive bias. Additionally, the stock has formed a strong base around Rs 4,700 levels and is sustaining above these levels.Stochastic, a daily momentum indicator shows a positive crossover which adds more bullishness to the price.Hence, based on the above technical structure one can initiate a long position at current market price. Closing and sustaining above Rs 4,920 will lead towards Rs 5,150-5,200 levels in the coming days. Stop-loss can be kept as Rs 4,748.Canara Bank: Buy | LTP: Rs 403 | Stop-Loss: Rs 397 | Target: Rs 440 | Return: 9 percentThe stock is forming higher high and higher low formation in the daily chart. Stock is trading above 20 and 50 DMA, indicating strength in price action. Also positive crossover is indicated in MACD while RSI stands at 70 levels.Price is sustaining above Rs 405 levels with decent volumes, pointing out buying interest among the short-term traders.Hence, based on the above technical structure one can initiate a long position at current market price. However, on the safer side nearby Rs 410 levels would be a better range to enter for the target price of Rs 440. The stop-loss can be kept as Rs 397.Expert: Vidnyan Sawant, HOD - Research at GEPL CapitalSun Pharmaceutical Industries: Buy | LTP: Rs 1,226 | Stop-Loss: Rs 1,170 | Target: Rs 1,350 | Return: 10 percentSun Pharma's stock has recently surged to its all-time high, surpassing the previous peak of Rs 1,200 in April 2015.Following a 15-week consolidation period from July to November 2023, marked by a rectangle pattern, the stock has broken out of this range, signaling the end of the consolidation phase and indicating a continuation of the prior uptrend.During the consolidation, the stock found consistent support around the 12-week exponential moving average (EMA), which played a crucial role as a dynamic support level for the prices.Additionally, the relative strength index (RSI) is noteworthy, quoting above the 60 mark on higher time frames. This reflects the presence of positive momentum in the stock.Moving forward, we expect the prices to ascend further towards Rs 1,350 mark. It is advised to place the stop-loss at Rs 1,170, strictly based on the closing basis.HCL Technologies: Buy | LTP: Rs 1,340.90 | Stop-Loss: Rs 1,290 | Target: Rs 1,475 | Return: 10 percentThe stock is currently experiencing a robust uptrend, reaching an all-time high. The absence of lower lows and lower highs underscores the stock's healthy trend.After a breakout, the stock retested the neckline of a rounding pattern, signifying a continuation of the upward trajectory and the initiation of an upward trend.On the weekly charts, prices have consistently adhered to short-term averages, affirming the prevailing uptrend. Additionally, the RSI on both weekly and daily charts is above the 60 mark, indicating the presence of positive momentum in the stock.Looking ahead, we anticipate further upward movement in prices, targeting Rs 1,475 levels. It is recommended to set a stop-loss at Rs 1,290 based on closing values.Hero MotoCorp: Buy | LTP: Rs 3,819 | Stop-Loss: Rs 3,630 | Target: Rs 4,284 | Return: 12 percentThe stock under consideration is currently demonstrating a robust upward trend characterized by a pattern of higher highs and higher lows. Notably, the stock is trading at its all-time highs, indicating a strong buying interest and an optimistic market sentiment.Furthermore, key breakout points in August 2017 and February 2021 are significant milestones in the stock's trajectory. The fact that the current week's trading surpasses the high of the breakout candle provides confirmation of the continued upward momentum.The stock is trading above its 200-week exponential moving average (EMA), a long-term trend indicator. This, coupled with supportive trading volumes, reinforces the positive trend.In addition to the stock's individual performance, its relative strength against the Nifty, as depicted in the ratio chart, is noteworthy. The breakout from a downward-sloping trend line since August 2017 indicates that the stock is not only performing well in absolute terms but is also outpacing the broader market.Looking ahead, we anticipate further upward movement in prices, targeting Rs 4,284 levels. It is recommended to set a stop-loss at Rs 3,630 based on closing values.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Following a 6 percent correction from its all-time high in 2022, the index experienced a notable swing low at 18,837, closely aligned with the polarity level observed in December 2022. From this point, the index resumed its upward trajectory, consistently forming higher highs and higher lows.After a period of steady rise, the index entered a brief consolidation phase, remaining within a range for a week. This phase concluded with a breakout at 19,850, propelling the index's upward movement. Notably, this surge was fuelled by short-covering, enabling the index to surpass the psychologically significant level of 20,000.Approaching its all-time highs, the index's upside potential could extend to 20,200, followed by 20,400.On the downside, key support levels are anticipated at 19,900 and 19,850. This analysis suggests a positive outlook for the index, with the potential for further gains in the near term.Here are three buy calls for short term:Sun Pharmaceutical Industries: Buy | LTP: Rs 1,226 | Stop-Loss: Rs 1,170 | Target: Rs 1,350 | Return: 10 percentSun Pharma's stock has recently surged to its all-time high, surpassing the previous peak of Rs 1,200 in April 2015.Following a 15-week consolidation period from July to November 2023, marked by a rectangle pattern, the stock has broken out of this range, signaling the end of the consolidation phase and indicating a continuation of the prior uptrend.During the consolidation, the stock found consistent support around the 12-week exponential moving average (EMA), which played a crucial role as a dynamic support level for the prices.Additionally, the relative strength index (RSI) is noteworthy, quoting above the 60 mark on higher time frames. This reflects the presence of positive momentum in the stock.Moving forward, we anticipate the prices to ascend further towards Rs 1,350 mark. It is advised to place the stop-loss at Rs 1,170, strictly based on the closing basis.HCL Technologies: Buy | LTP: Rs 1,340.90 | Stop-Loss: Rs 1,290 | Target: Rs 1,475 | Return: 10 percentThe stock is currently experiencing a robust uptrend, reaching an all-time high. The absence of lower lows and lower highs underscores the stock's healthy trend.After a breakout, the stock retested the neckline of a rounding pattern, signifying a continuation of the upward trajectory and the initiation of an upward trend.On the weekly charts, prices have consistently adhered to short-term averages, affirming the prevailing uptrend. Additionally, the RSI on both weekly and daily charts is above the 60 mark, indicating the presence of positive momentum in the stock.Looking ahead, we anticipate further upward movement in prices, targeting Rs 1,475 levels. It is recommended to set a stop-loss at Rs 1,290 based on closing values.Hero MotoCorp: Buy | LTP: Rs 3,819 | Stop-Loss: Rs 3,630 | Target: Rs 4,284 | Return: 12 percentThe stock under consideration is currently demonstrating a robust upward trend characterized by a pattern of higher highs and higher lows. Notably, the stock is trading at its all-time highs, indicating a strong buying interest and an optimistic market sentiment.Furthermore, key breakout points in August 2017 and February 2021 are significant milestones in the stock's trajectory. The fact that the current week's trading surpasses the high of the breakout candle provides confirmation of the continued upward momentum.The stock is trading above its 200-week exponential moving average (EMA), a long-term trend indicator. This, coupled with supportive trading volumes, reinforces the positive trend.In addition to the stock's individual performance, its relative strength against the Nifty, as depicted in the ratio chart, is noteworthy. The breakout from a downward-sloping trend line since August 2017 indicates that the stock is not only performing well in absolute terms but is also outpacing the broader market.Looking ahead, we anticipate further upward movement in prices, targeting Rs 4,284 levels. It is recommended to set a stop-loss at Rs 3,630 based on closing values.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "KR Choksey's research report on HCL TechnologiesDuring the quarter, HCL Tech reported revenue of INR 2,66,720 mn, registering a growth of 8.05% on a YoY basis from INR 2,46,860 mn and on a QoQ basis it grew by 1.43% from INR 2,62,960 mn. The EBIT for Q2FY24 stood at INR 49,340, registering a growth of 11.45% on a YoY basis and on a sequential basis it grew by 10.63%. The operating margin stood at 18.50%, which showed an improvement by 154 bps on a QoQ basis and 57 bps on a YoY basis. Net profit for the quarter stood at INR 38,330 mn, registering a growth of 9.92% on a YoY basis and 8.55% on a sequential basis. The PAT margin stood at 14.37%, which expanded by 94 bps sequentially and 25 bps on a YoY basis. The EPS for the quarter stood at INR 14.13 as against INR 12.88 YoY and 13.03 QoQ.OutlookThe company is currently trading at a PE multiple of 17.5. We have revised the target price to INR 1374 from the previous target price of INR 1,206; with a P/E multiple of 19x to the FY25 estimated EPS of INR 72.3, an upside of 8.3% over the CMP. Accordingly, we revised our rating to “ACCUMULATE” to the stock.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.HCL Technologies - 28 - 10-2023 - kr "
]