[
    "ICICI Bank Ltd on June 25 became only the sixth Indian firm to hit a market capitalisation of $100 billion (~Rs 8.4 lakh crore) as the private sector bank’s share price gained over 2 percent intraday. The stock was at Rs 1,196.45 in the afternoon trade, up 2.25 percent from the previous close. ICICI Bank is the second largest bank in India by market capitalisation, trailing HDFC Bank.With today’s gain, ICICI Bank stock has risen nearly 12 percent from the lows of June 4 -- the day of the general election results. It has beaten the Nifty’s 8 percent return during the same period, and has matched the gains made by the sector index Bank Nifty.Over the last one year, ICICI Bank share price has risen nearly 29 percent, beating the 27 percent gains made by the NSE Nifty 50, and 20 percent gain in Bank Nifty.The other Indian companies to have crossed $100 billion in market capitalisation are Reliance Industries Ltd, Tata Consultancy Services, HDFC Bank and Bharti Airtel. IT bellwether Infosys too hit $100 billion in market capitalisation in January 2022, but hasn’t sustained at the level.Earlier today, ICICI Bank announced that it will release Q1 FY25 financial results on July 27. In the previous quarter that ended March 31, ICICI Bank reported standalone net profit to 10,707.5 crore, up 17.4 percent from Rs 9,121.9 crore in the corresponding period previous year. Its net interest income in the January-March quarter grew to Rs 19,092.8 crore from Rs 17,666.8 crore a year ago.The lender also declared a dividend of Rs 10 per equity share of face value of Rs 2 each.ICICI Bank has seen a modest growth in its wholesale loans business, but a robust retail and SME lending business has helped it outperform the system credit growth.This week, Motilal Oswal issued a ‘buy’ rating on ICICI Bank stock, on the back of a strong loan growth, robust fee income, strong asset quality, and other factors. The brokerage’s target price of Rs 1,350 per share implies a 15 percent upside from the previous close.The bank is likely to emphasise quality underwriting, said Motilal Oswal in a note, adding that the bank's liability momentum remains strong and it is committed to leveraging superior technology to aid customer acquisition.The brokerage expects ICICI Bank's Net Interest Margins (NIMs) to remain range bound in the near term, while its asset quality remains robust, with credit costs expected to normalise gradually.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "ICICI Bank on June 24 launched ‘SmartLock’, a new safety measure that will enable customers to lock/unlock multiple banking services without any help from a customer care executive through phone or e-mail, the private lender said.The “first-of-its-kind” measure in the country’s banking sector will be available of iMobile Pay. It will empower customers to lock/unlock access to internet banking, UPI (including payments from other UPI apps linked to the bank account), credit and debit cards, simply by clicking a button, the bank’s statement said.The new feature also permits account holders to lock or unlock the entire iMobile Pay, the statement added.The feature can be used to deactivate a particular banking service and in case of a possible fraudulent transaction.The ‘SmartLock’ feature allows scheduled standing instructions (SI) and E-mandates to go through, even when a banking service is locked by the customer, the lender said.Sidharatha Mishra, head – digital channels and partnerships, ICICI Bank said, “Safety of our customers’ accounts is of utmost importance to us. The launch of ‘SmartLock’ is yet another effort of the Bank to strengthen the safety and security of the customer’s accounts and safeguard their interest. This Do-It-Yourself (DIY) feature provides customers the convenience of enhanced security for banking services in their own hands, in one place. The introduction of ‘SmartLock’ is a part of various ‘safe banking’ initiatives of the Bank.”Steps to use ‘SmartLock’ feature-Login to iMobile Pay-Click on ‘SmartLock’ feature on the bottom right corner of the home screen-Click on key banking services that you wish to lock/unlock-Swipe to confirm\n       ",
    "Motilal Oswal Securities Ltd (MOSL) has issued a 'Buy' recommendation for ICICI Bank, setting a target price of Rs 1,350 per share. Motilal Oswal's positive outlook on the bank is driven by its strong loan and fee growth, robust asset quality, among other factors.June 21 marked the fourth consecutive session of gain for ICICI Bank. The stock closed flat at Rs 1,157.50 in the previous session. The stock has gained 16 percent in the past six months, outperforming Nifty 50, which gained nearly 10 percent during the same period.Also Read | Private lenders drive Bank Nifty to fresh life-time highs, nears 52,000-markICICI Bank's loan growth is expected to continue to be robust, Motilal Oswal said. The bank is likely to emphasise quality underwriting.The bank's liability momentum remains strong and it is committed to leveraging superior technology to aid customer acquisition, pointed out Motilal Oswal.The brokerage expects ICICI Bank's Net Interest Margins (NIMs) to remain rangebound in the near term.Follow our live blog for all the market actionICICI Bank's fee income growth has remained steady. Additionally, operating leverage is emerging as a key lever for the bank, with a focus on 'Return on Effort', said Motilal Oswal.The bank's asset quality remains robust, with credit costs expected to normalise gradually, according to Motilal Oswal.On April 27, ICICI Bank reported a net profit of Rs 10,707 crore for Q4 FY24, a 17 percent increase from Rs 9,122 crore in the same period last year.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "India's market has grown substantially, attracting truly global funds with the ability to invest anywhere in the world. In the past, during the peak of China's market, global funds typically held two or three China e-commerce internet stocks in their portfolios.However, this trend has largely changed, with global investors now favouring one, two, or three mega-cap Indian stocks, according to Jonathan Garner, Chief Equity Strategist for Asia and Emerging Markets at Morgan Stanley.\"This shift has already begun and is expected to accelerate,\" Garner told Moneycontrol in an interview. Simultaneously, India is experiencing a retail-driven boom in small and medium stocks, alongside a surge in options trading.This reflects a broader trend of wealth creation among India's young and dynamic population, he added.Follow our market blog to catch all the live actionGlobal investors now prioritise liquidity and substantial market exposure relative to their benchmark index. Previously, when India constituted a smaller segment, it was often overlooked.However, with India now positioned as the second-largest market in emerging markets and poised to become the largest, global investors cannot afford to disregard its significance, emphasised Garner.He further highlighted several pockets of growth within the Indian market. \"What we like particularly is domestic demand plays,\" he explained. This includes sectors like consumer discretionary, industrials, financials, and real estate.Notably, real estate, a sector previously not recommended for exposure in India, is now gaining momentum.Garner expressed bullishness on specific stocks including ICICI Bank, Maruti Suzuki, GAIL, and Godrej Properties in real estate. In contrast, Morgan Stanley is more cautious on externally earning sectors such as IT services, outsourcing names, pharmaceuticals, and defensive stocks, though they are not in a defensive posture on India overall.The analyst noted a recent shift in sentiment towards consumer and IT stocks post-election, as opposed to infrastructure, capital goods, and other economy-sensitive stocks.With a significant CapEx cycle in recent years, Garner anticipates a continued emphasis on infrastructure but expects the focus to gradually shift towards consumer-driven sectors, which offer a robust environment and a wide range of investment opportunities.Also Read | India poised to replace China as largest market in EM index: Morgan Stanley's Jonathan GarnerJonathan Garner's insights underscore the evolving landscape of India's market development and sectoral preferences. As India continues to attract global funds and shift towards consumer-driven growth, it presents compelling opportunities for investors looking to capitalize on its expanding economy and dynamic market environment.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "The National Company Law Appellate Tribunal (NCLAT) has refused to stay an NCLT order admitting infrastructure firm Jaiprakash Associates Limited into insolvency resolution process.The NCLAT said on June 10 that the Interim Resolution Professional submitted that neither the company’s 25,000 employees nor ongoing projects would be affected, as IRP intended to run the company as a going concern.Sunil Kumar Sharma, a suspended company director, sought the stay.The NCLAT has directed banks to respond to the appeal and asked them to consider the company’s one-time settlement offer. The case will now be heard on June 24.Senior advocate Sandeep Sethi, who appeared for Sharma, told the court that the order of insolvency had put many infrastructure projects, in India and abroad, in jeopardy. The company had offered an OTS plan but the NCLT admitted the company to insolvency resolution process before a decision could be reached.The company had already deposited Rs 200 crore of the outstanding Rs 1200 crore it owed to ICICI Bank, he said. The OTS would have worked itself out in four and a half months if the NCLT had not passed the insolvency order.Senior advocate Sanjib Sen, who appeared for ICICI Bank, said it was not a straight-forward case as was being made out and the NCLAT should not stay the insolvency process.The company owed more than Rs 30,000 crore to various banks and Rs 1,200 crore to ICICI, Sen said. It would set a wrong example if the proceedings were stayed.The case has been pending in courts for a decade and Jaiprakash Associates tried to defer the insolvency proceedings by seven years on one pretext or the other.A vacation bench of NCLAT, while refusing to stay the order of the NCLT’s Allahabad bench, said it would pass a detailed order giving instructions to the lenders.Jaiprakash Associates has a debt of Rs 29,361 crore, including interest. In all, 22 lenders have exposure to JP Associates' debt.The company has been trying to sell its cement plants to trim the debt but media reports have said the fate of the deal with Dalmia Cement remains uncertain.Jaiprakash Associates and Dalmia Bharat in December 2022 signed a framework for the acquisition of JAL's cement, clinker and power plants for an enterprise value of Rs 5,666 crore.The National Asset Reconstruction Company of India (NARCL) in March-April submitted an Rs 10,000-crore binding offer to acquire JAL's debt but the lenders sought a better offer, reports said.\n       ",
    "Acting on several complaints by shareholders of ICICI Securities, some of who received calls by ICICI Bank seeking favourable vote for the delisting scheme, market regulator SEBI has issued an administrative warning on the outreach.An exchange filing by ICICI Bank on June 6 cited regulator's observation that said, \"The heightened outreach programme on the last day of voting citing holidays/weekend appears inappropriate\".ICICI Bank's exchange filing cited Sebi's circular, which said the outreach programme was undertaken to explain the scheme of delisting of ICICI Securities and to maximize shareholders' participation. However, investor complaints revealed that some officials had 'gone beyond the outreach programme' and made repeated calls, and even sought screenshots of voting.According to one of the call recordings, a shareholder of ICICI Securities was told that opting for the scheme would be beneficial, a clear breach of the remit of the outreach programme, Sebi's letter revealed.Sebi's letter said, \"... bank being a promoter/ interested party, providing its perspective on the proposed transaction to shareholders of I-Sec cannot be said to be providing a balanced factual position. There was a clear conflict of interest..\"As many as 83.8 percent of the public institutional shareholders and 32 percent non-institutional shareholders of ICICI Bank had voted in favour of ICICI Securities' delisting, the bank had said a regulatory filing on March 27.The regulator warned ICICI Bank to be careful and expected it to improve the compliance standards to avoid such instances, failing which Sebi saidaction may be initiated.The bank has been advised to place the actions taken in this regard before the next meeting and forward SEBI a brief on the discussions within 10 days of the Board meeting.\n       ",
    "Private bank stocks recovered sharply in two days after they witnessed steep decline owing to post-election verdict uncertainty. Shares of HDFC Bank, ICICI Bank, Axis Bank, IndusInd Bank, and Federal Bank surged up to 8 percent in 2 days on June 6, as against 4 percent rise in the benchmark Nifty 50 index during the same period.Analysts at Goldman Sachs believe that this steep correction offers opportunities to accumulate private banks. They remain bullish on HDFC Bank, Kotak Bank, Axis Bank, and IndusInd Bank.\"The fundamentals are more important than the narrative. We continue to favour private banks over PSUs,\" the brokerage firm said in a recent note.Catch all the market action in our LIVE blogKotak Institutional Equities said that banks reported a good March-ended quarter (Q4FY24) as operational profitability holds up. Asset quality also continued to improve, while the proportion of delinquent loans on the balance sheet continued to decline.Additionally, credit growth stayed healthy for private banks at 30 percent year-on-year (YoY) in Q4FY24. According to the latest RBI data, overall credit growth for the banking system has stayed healthy at 20 percent YoY in May 2024, supported by the merger of HDFC into HDFC Bank, while it stood at 16 percent adjusted for the impact of the merger.ALSO READ: PSU Banks: Does the new election verdict derail the party for good?However, banks showed a declining NIM trend during Q4FY24. Yields were either flat or slightly higher sequentially, with some amount of re-pricing of MCLR-linked loans. Going ahead, most banks have indicated that most of the re-pricing of term deposits is largely complete.Nonetheless, Julius Baer remains optimistic about private banks after India recorded 7.8 percent GDP growth YoY in first quarter of 2024. \"While BJP's power may be diluted, it is still intact and the momentum in the economy from existing reforms will not fade away,\" they said.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Adani Group on Monday announced a venture into the financial sector, launching with ICICI Bank a co-branded credit card with airport-lined benefits as it looks to leverage customer touchpoints across businesses.The group’s Adani One, an app to help users book tickets, check flight status, access lounges, shop duty-free products, get cabs and avail parking, and ICICI Bank launched India’s first co-branded credit cards with airport-linked benefits in collaboration with Visa. \"The cards come with a plethora of benefits designed to enhance the cardholders’ lifestyle and elevate their airport and travel experience. They offer up to 7 per cent Adani Reward Points on spends across the Adani Group consumer ecosystem like the Adani One app, where one can book flights, hotels, trains, buses, and cabs; Adani-managed airports; Adani CNG pumps; Adani Electricity bills, and Trainman, an online train booking platform,\" a company statement said.In December 2022, Adani Group launched the Adani One app as ’a step forward’ in the company’s digital journey. The co-branded card would also offer an array of benefits, including welcome benefits like free air tickets and airport privileges like premium lounge access, Pranaam Meet & Greet Service, porter, valet and premium car parking. Card users also get privileges like discounts on shopping at duty-free outlets and on F&B spends at the airports, and benefits like free movie tickets and Adani Reward Points on groceries, utilities, and international spends.\"This strategic partnership marks the Adani Group’s maiden venture into the financial sector, leveraging its unmatched reputation for excellence and innovation,\" the statement said. \"With a vision to redefine the landscape of consumer finance, Adani One aims to set new standards by joining forces with ICICI Bank and Visa.\" The partnership with ICICI Bank aims to provide customers with an enhanced and seamless payment experience while unlocking a world of exclusive privileges, it said.Jeet Adani, Director of Adani Group, said, \"The Adani One ICICI Bank Credit Cards are a window to a seamless digital ecosystem. By leveraging the Adani One platform, which integrates physical B2C businesses into the digital world, users will experience unparalleled convenience and accessibility.\"Rakesh Jha, Executive Director, ICICI Bank, said, \"We believe that our focus on 'Customer 360', backed by our digital products, process improvement and service delivery, enables us to offer holistic solutions to customers in a seamless manner and grow market share across key segments. The launch of the co-branded credit cards, in association with Adani One and Visa, is in line with this philosophy. Through this launch, we intend to offer our customers rewards and benefits across the Adani Group’s consumer ecosystem, and strengthen the Bank’s credit card portfolio.\"Sandeep Ghosh, Group Country Manager, Visa India and South Asia said, \"These cards empower the globetrotting cardholders with an elite travel and shopping experience, both online and offline, elevating their convenience and travel experience.\"The Adani One ICICI Bank Signature Credit Card carries an annual fee of Rs 5,000 with joining benefits worth Rs 9,000, while the Adani One ICICI Bank Platinum Credit Card has an annual fee of Rs 750 with joining benefits worth Rs 5,000.\n       ",
    "In the absence of bulls, bears further strengthened their grip on the market on May 30, the monthly F&O expiry day, and dragged the benchmark Nifty 50 below the 22,500 mark for the first time since May 17. The lower highs-lower lows formation continued with a negative bias in the momentum indicator Relative Strength Index (RSI). However, the positive point is that the index managed to sustain above 50 percent of the Fibonacci retracement level as well as the 20-day SMA (Simple Moving Average). The benchmark BSE Sensex plunged 0.83 percent, and the Nifty 50 slipped 0.95 percent, forming a bearish candlestick pattern on the daily charts. The market breadth remained negative, with 1,757 shares declining against 509 shares advancing on the NSE. The immediate support for the Nifty 50 is likely to be seen at 22,400, followed by 22,300. In case of a bounce back, the 22,600-22,700 levels are the immediate ones to watch. Here are some trading ideas for the near term:Shrikant Chouhan, Head Equity Research at Kotak SecuritiesBharti Airtel | CMP: Rs 1,377On the weekly charts, Bharti Airtel's counter is in a rising channel chart formation with a higher high-higher low series pattern. Additionally, the technical indicator Average Directional Index (ADX) indicates a further uptrend from current levels, which could boost the bullish momentum in the near future. As long as the stock is trading above Rs 1,330, the uptrend formation is likely to continue. Above this level, the counter could move up to Rs 1,480.Strategy: BuyTarget: Rs 1,480Stop-Loss: Rs 1,330Asian Paints | CMP: Rs 2,883.70Asian Paints stock is in the accumulation zone, trading in a rangebound mode for the past many sessions. The texture of the chart formation and technical indicator Relative Strength Index (RSI) indicate that the counter is in oversold territory. Therefore, it is very likely to rebound from current levels for a new leg of the up move in the coming horizon.Strategy: BuyTarget: Rs 3,100Stop-Loss: Rs 2,790ICICI Bank | CMP: Rs 1,113.7After a remarkable up move, ICICI Bank stock has been having a breather for the last few sessions. The consolidation in the rangebound structure suggests a bullish continuation chart formation. Moreover, the stock comfortably closed above its short-term moving average. Therefore, it is likely to resume its uptrend from the current levels.Strategy: BuyTarget: Rs 1,190Stop-Loss: Rs 1,080Virat Jagad, Technical Research Analyst at Bonanza PortfolioEmami | CMP: Rs 611.85Emami has given a breakout of the falling trendline in a weekly time frame, indicating an upward move. The rise in volume during the breakout indicates buyers' interest in the security. The price is trading above the 50 EMA (Exponential Moving Average), which indicates an uptrend in the security. The momentum indicator RSI is moving in the northern direction, supporting the price action.Strategy: BuyTarget: Rs 680, Rs 750Stop-Loss: Rs 580, Rs 570Page Industries | CMP: Rs 37,964.75Page Industries has given a breakout of the Double Bottom pattern, signaling a change in trend (i.e. positive). The increase in volume during the buying days and fall in volume during selling days indicates accumulation in the security. Volume increasing during the breakout indicates that buyers are purchasing the security at CMP and are expecting an upward move. The price is trading above the 21 EMA, indicating an uptrend in the security. The momentum indicator RSI trading in a higher range also indicates an uptrend in the security.Strategy: BuyTarget: Rs 39,800, Rs 41,350Stop-Loss: Rs 35,600, Rs 34,200EID Parry India | CMP: Rs 676.75On a weekly timeframe, EID Parry has given a breakout of an Ascending Triangle on the upside, indicating a continuation in the uptrend. The spurt in volume during the breakout indicates buyers' interest. The price has taken support at the 50 EMA and moved upward, indicating an up move in the security. The momentum indicator RSI, after cooling off, has started moving in the northern direction, supporting the price action.Strategy: BuyTarget: Rs 780, Rs 850Stop-Loss: Rs 613, Rs 560RHI Magnesita India | CMP: Rs 736.35RHIM has been able to settle above the 10-week close, indicating a bullish trend. Buyers have shown interest in the security, leading it to close above the resistance. The increase in volume indicates interest in the security. The price has been able to close above the 50 EMA, indicating a bullish trend. On the momentum front, RSI is making higher highs, supporting the price action.Strategy: BuyTarget: Rs 830, Rs 890Stop-Loss: Rs 650, Rs 590Chandan Taparia, Head - Equity Derivatives & Technicals, Broking & Distribution at Motilal Oswal Financial ServicesDixon Technologies | CMP: Rs 9,308Dixon Technologies is in an overall uptrend and holding gains at higher zones. It has given a consolidation breakout on a daily scale and is relatively outperforming within the IT space. The momentum indicator RSI is positively placed, which has bullish implications.Strategy: BuyTarget: Rs 10,000Stop-Loss: Rs 9,000Samvardhana Motherson International | CMP: Rs 151.7Motherson has given a trendline breakout on the weekly chart and achieved the highest daily close ever. The breakout is supported by a surge in volumes, which may support the ongoing up move. The momentum indicator RSI is positively placed, which has bullish implications.Strategy: BuyTarget: Rs 165Stop-Loss: Rs 145Bajaj Finance | CMP: Rs 6,616.45Bajaj Finance has given a support trendline breakout on a daily scale and closed below the same. The stock is in an overall downtrend and continuously forming lower top-lower bottom patterns on the daily chart.Strategy: SellTarget: Rs 6,100Stop-Loss: Rs 6,850Disclaimer: The views and investment tips expressed by experts on Moneycontrol are their own and not those of the website or its management. Moneycontrol advises users to check with certified experts before taking any investment decisions. ",
    "Here's a quick look at which stocks will be in focus in trade on Thursday, from significant investments and major deals to earnings announced on May 29 and those expected on May 30.Earnings Expected on ThursdayNearly 900 companies will release their quarterly earnings scorecard on May 30 including Apollo Hospitals Enterprise, Bharat Dynamics, Concord Drugs, Gateway Distriparks, Godfrey Phillips India, Hinduja Global Solutions, Lux Industries, Marksans Pharma, Muthoot Finance, Plaza Wires, Salasar Techno Engineering, Sunteck Realty, Suven Pharmaceuticals, Swan Energy, Tarsons Products, TBO Tek, and Welspun Corp.Earnings Announced Post Market Hours on May 29Tata Steel Q4 (Consolidated YoY)Profit plunges 64.6% to Rs 554.6 crore Vs Rs 1,566.2 croreRevenue falls 6.8% to Rs 58,687.3 crore Vs Rs 62,961.5 croreExceptional loss at Rs 594.5 crore Vs exceptional gain of Rs 11.6 croreBoard announces dividend of Rs 3.60 per shareBoard approves issuance of additional debt securities, in one or more tranches, up to Rs 3,000 crore on a private placement basisBoard gives approval for the infusion of $2.11 billion (Rs 17,407.5 crore) in subsidiary T Steel Holdings Pte in FY25Board approves the conversion of debt instruments of $565 million (Rs 4,661.25 crore) held by company in T Steel Holdings in to equity shares in FY25Cummins India Q4 (Consolidated YoY)Profit spikes 54.4% to Rs 538.9 crore Vs Rs 348.9 croreRevenue grows 20% to Rs 2,319 crore Vs Rs 1,933.9 croreBoard approves final dividend of Rs 20 per shareNOCIL Q4 (Consolidated YoY)Profit jumps 46.7% to Rs 41.5 crore Vs Rs 28.3 croreRevenue falls 9.2% to Rs 356.5 crore Vs Rs 392.7 croreOther income zooms to Rs 24.7 crore Vs Rs 2.94 croreLemon Tree Hotels Q4 (Consolidated YoY)Profit surges 42.3% to Rs 84 crore Vs Rs 59 croreRevenue rises 29.5% to Rs 327.3 crore Vs Rs 252.7 croreGMR Airports Infrastructure Q4 (Consolidated YoY)Net loss narrows to Rs 167.6 crore Vs loss of Rs 638.9 croreRevenue jumps 29.5% to Rs 2,446.8 crore Vs Rs 1,889.7 croreBata India Q4 (Consolidated YoY)Profit declines 3% to Rs 63.6 crore Vs Rs 65.6 croreRevenue rises 2.5% to Rs 797.9 crore Vs Rs 778.6 croreBoard announces a dividend of Rs 12 per shareG R Infraprojects Q4 (Consolidated YoY)Profit spikes 42% to Rs 553.1 crore Vs Rs 389.7 croreRevenue rises 1% to Rs 2,485.1 crore Vs Rs 2,461.1 croreExceptional gain at Rs 306.3 crore Vs NilHindustan Oil Exploration Company Q4 (Consolidated YoY)Profit declines 33.8% to Rs 70.6 crore Vs Rs 106.6 croreRevenue jumps 71% to Rs 330.6 crore Vs Rs 193.4 croreExceptional gain of Rs 32.86 crore Vs NilMishra Dhatu Nigam Q4 (Consolidated YoY)Profit declines 30% to Rs 46.3 crore Vs Rs 66.3 croreRevenue jumps 17.7% to Rs 405.5 crore Vs Rs 344.6 croreMTNL Q4 (Consolidated YoY)Loss widens to Rs 783.7 crore Vs loss of Rs 748.6 croreRevenue falls 4.6% to Rs 209 crore Vs Rs 219.2 croreMM Forgings Q4 (Consolidated YoY)Profit rises 18.2% to Rs 36.2 crore Vs Rs 30.6 croreRevenue up 2.4% at Rs 396.8 crore Vs Rs 387.4 croreAGS Transact Technologies Q4 (Consolidated YoY)Loss narrows to Rs 4.4 crore Vs loss of Rs 15.4 croreRevenue declines 17.8% to Rs 349.2 crore Vs Rs 424.7 croreBoard re-appoints Ravi B Goyal as the Managing Director of the companyIon Exchange (India) Q4 (Consolidated YoY)Profit falls 10.8% to Rs 72.5 crore Vs Rs 81.2 croreRevenue rises 20.7% to Rs 781.8 crore Vs Rs 647.5 croreBanco Products Q4 (Consolidated YoY)Profit jumps 33.6% to Rs 68.2 crore Vs Rs 51 croreRevenue rises 19.3% to Rs 730.3 crore Vs Rs 612.3 croreRHI Magnesita Q4 (Consolidated YoY)Loss narrows to Rs 257.9 crore Vs loss of Rs 678.9 croreRevenue increases 7.8% to Rs 943.3 crore Vs Rs 874.8 croreISGEC Heavy Engineering Q4 (Consolidated YoY)Profit falls 22.6% to Rs 72.1 crore Vs Rs 93.2 croreRevenue declines 8.6% to Rs 1,868 crore Vs Rs 2,042.7 croreHeritage Foods Q4 (Consolidated YoY)Profit zooms 126% to Rs 40.5 crore Vs Rs 17.9 croreRevenue rises 16.3% to Rs 950.6 crore Vs Rs 817.6 croreSJVN Q4 (Consolidated YoY)Profit jumps 255% to Rs 61.1 crore Vs Rs 17.2 croreRevenue falls 4.1% to Rs 482.9 crore Vs Rs 503.8 croreExceptional gain of Rs 103.84 crore Vs loss of Rs 12.08 croreDredging Corporation of India Q4 (Standalone YoY)Loss at Rs 23.5 crore Vs profit at Rs 27.2 croreRevenue increases 4.7% to Rs 277.9 crore Vs Rs 265.4 croreStocks To WatchKFin TechnologiesGeneral Atlantic Singapore Fund is likely to sell 4.1% stake in KFin Technologies and could get upsized to 6.8%, sources told CNBC-TV18. The base issue size is likely Rs 500 crore, potentially upsized to Rs 833.3 crore, with a floor price of Rs 712.50 per share. Post-transaction, General Atlantic will hold a 31.23% stake in the company.Awfis Space SolutionsThe workspace solutions provider is set to list its equity shares on May 30, with the final issue price fixed at Rs 383 per share.BanksS&P Global Ratings revised its rating outlook on six Indian banks (State Bank of India, HDFC Bank, Axis Bank, ICICI Bank, Kotak Mahindra Bank, and Indian Bank) to Positive from Stable. This follows a similar action on the sovereign (BBB-/Positive/A-3). S&P affirmed 'BBB-' long-term and A-3 short-term ratings on these banks and upgraded the SACP of Axis Bank and ICICI Bank by one notch each.CESCA fire incident occurred at Unit-1 Generator Transformer in Haldia, West Bengal, owned by Haldia Energy (a wholly-owned subsidiary of CESC), causing partial disruption in plant operation. The fire has subsided, and the cause and extent of damage are being assessed. The plant has insurance coverage.Rail Vikas NigamThe railway company has received a Letter of Acceptance from South East Central Railway for a project worth Rs 38.10 crore, involving the provision of auto signalling with electronic interlocking in the Champa-Sakti section of Bilaspur division.SJVNThe company has received board approval for signing a Joint Venture Agreement with Indian Oil Corporation to form a joint venture company for developing green RTC/renewable projects and other new technology-based projects, subject to approval from the Ministry of Power, NITI Aayog, DIPAM, and Ministry of Finance.Aditya Birla CapitalThe company has invested Rs 300 crore on a rights basis in the equity shares of Aditya Birla Housing Finance, maintaining its percentage shareholding, with ABHFL remaining a wholly-owned subsidiary.Capacite InfraprojectsThe board will meet on June 3 to consider raising funds up to Rs 100 crore via non-convertible debentures on a private placement basis.Great Eastern Shipping CompanyForeign portfolio investor Nalanda India Fund sold 20 lakh equity shares at an average price of Rs 1,045.14 per share, amounting to Rs 209 crore. As of March 2024, Nalanda held 7.37% stake or 1.05 crore shares in GE Shipping. Ghisallo Master Fund LP bought 9,94,479 shares at Rs 1,045 per share, totalling Rs 103.92 crore.PNB Housing FinanceSociete Generale bought 13,08,680 shares at an average price of Rs 724.55 per share. General Atlantic Singapore Fund FII Pte and Asia Opportunities V (Mauritius) sold 58 lakh shares each at Rs 727.47 and Rs 727.26 per share, respectively, totalling Rs 844 crore. As of March 2024, General Atlantic Singapore Fund had held 9.82% stake and Asia Opportunities V had 9.88% in PNB Housing.F&O banGMR Airports Infrastructure, Aditya Birla Fashion & Retail, Hindustan Copper, Vodafone Idea\n       ",
    "Let's catch up on the latest news from the stock market. From significant investments to major deals and earnings announced on May 27 to earnings announcements expected on Tuesday (May 28), here's a quick look at which stocks will be in focus in trade on Tuesday.Earnings Expected on TuesdayEngineers India, Aditya Birla Fashion and Retail, Amara Raja Energy & Mobility, Aster DM Healthcare, Campus Activewear, EIH, Exicom Tele-Systems, General Insurance Corporation of India, Hindware Home Innovation, Indian Railway Catering and Tourism Corporation, Medplus Health Services, MTAR Technologies, NBCC (India), Apeejay Surrendra Park Hotels, Prestige Estates Projects, RITES, R R Kabel, and Wockhardt are among the 440 companies set to announce their March quarter earnings on Tuesday.Earnings Announced Post Market Hours on May 27Life Insurance Corporation of India Q4 (Consolidated YoY)Profit increases 4.5% to Rs 13,781.6 crore Vs Rs 13,190.8 croreNet premium income jumps 15.5% to Rs 1,52,767.3 crore Vs Rs 1,32,223.2 croreOther income surges multi-fold to Rs 14,164 crore Vs Rs 484.8 croreNet commission falls 2.2% to Rs 8,273 crore Vs Rs 8,460 croreLIC announces final dividend of Rs 6 per share for FY24National Aluminium Company Q4 (Consolidated YoY)Profit jumps 101.4% to Rs 996.7 crore Vs Rs 495 croreRevenue declines 2.5% to Rs 3,579 crore Vs Rs 3,671.4 croreExceptional gains at Rs 426.81 crore Vs NilNMDC Q4 (Consolidated YoY)Profit slips 37.8% to Rs 1,412.7 crore Vs Rs 2,271.5 croreRevenue rises 10.9% to Rs 6,489.3 crore Vs Rs 5,851.4 croreExceptional loss at Rs 29.85 crore Vs exceptional gains at Rs 1,237.3 croreTVS Supply Chain Solutions Q4 (Consolidated YoY)Net profit stands at Rs 5.4 crore Vs loss at Rs 12.4 croreRevenue rises 4.5% to Rs 2,426.3 crore Vs Rs 2,321.6 croreDish TV India Q4 (Consolidated YoY)Net loss widens to Rs 1,989.7 crore Vs loss of Rs 1,720.6 croreRevenue falls 19.4% to Rs 407 crore Vs Rs 504.8 croreExceptional loss at Rs 402.7 crore Vs loss at Rs 1,907.61 croreBorosil Renewables Q4 (Consolidated YoY)Net loss stands at Rs 53.3 crore Vs profit at Rs 10.5 croreRevenue falls 8.4% to Rs 283.1 crore Vs Rs 309 croreAutomotive Axles Q4 (YoY)Profit declines 13.2% to Rs 44.1 crore Vs Rs 50.8 croreRevenue falls 17.5% to Rs 571.5 crore Vs Rs 693 croreBoard recommends final dividend at Rs 32 per shareS H Kelkar and Company Q4 (Consolidated YoY)Profit surges 30-fold to Rs 33.4 crore Vs Rs 1.13 croreRevenue grows 12.8% to Rs 533 crore Vs Rs 472.4 croreExceptional item at Nil Vs loss at Rs 21.76 croreElgi Equipments Q4 (Consolidated YoY)Profit sinks 55.2% to Rs 76.2 crore Vs Rs 170.1 croreRevenue rises 3.6% to Rs 865.9 crore Vs Rs 835.7 croreExceptional item at Nil Vs loss at Rs 105.4 croreJubilant Industries Q4 (Consolidated YoY)Profit jumps 128% to Rs 22.2 crore Vs Rs 9.7 croreRevenue drops 12.5% to Rs 300.3 crore Vs Rs 343.4 croreExceptional gains at Rs 13.13 crore Vs NilAstraZeneca Pharma Q4 (YoY)Profit surges 128.6% to Rs 39.5 crore Vs Rs 17.3 croreRevenue rises 34.6% to Rs 383.2 crore Vs Rs 284.7 croreExceptional item at Nil Vs loss at Rs 40.2 croreBoard announces final dividend at Rs 24 per shareVishnu Prakash R Punglia Q4 (YoY)Profit spikes 68.2% to Rs 67.1 crore Vs Rs 39.91 croreRevenue grows 44.2% to Rs 657.2 crore Vs Rs 455.7 croreGujarat Mineral Development Corporation Q4 (Consolidated YoY)Profit plunges 53.1% to Rs 207.1 crore Vs Rs 442.2 croreRevenue declines 20.8% to Rs 750.7 crore Vs Rs 948.2 croreBoard announces dividend at Rs 9.55 per shareNatco Pharma Q4 (Consolidated YoY)Profit zooms 40% to Rs 386.3 crore Vs Rs 275.8 croreRevenue grows 19% to Rs 1,068.3 crore Vs Rs 897.9 croreLumax Auto Technologies Q4 (Consolidated YoY)Profit rises 116.3% to Rs 51.3 crore Vs Rs 23.7 croreRevenue increases 53.5% to Rs 757.4 crore Vs Rs 493.3 croreBoard announces final dividend at Rs 5.50 per shareGarware Technical Fibres Q4 (Consolidated YoY)Profit jumps 16.6% to Rs 69.6 crore Vs Rs 59.7 croreRevenue rises 3.2% to Rs 382.3 crore Vs Rs 370.5 croreStocks To WatchAdani Energy SolutionsThe company announced that its board has approved raising funds up to Rs 12,500 crore via qualified institutional placement (QIP) or other permissible modes.Concord BiotechShareholder Ontario Inc plans to sell 3.4% of shares worth Rs 468.40 crore in Concord Biotech, as reported by CNBC-TV18 sources. The share sale could have a floor price of Rs 1,320 per share. After the transaction, Ontario Inc will have a residual stake of 2% in the company, with a 90-day lock-in period before any sale of this residual stake.Timken IndiaParent entity Timken Singapore is looking to sell a 6.6% stake worth Rs 1,775 crore in Timken India, according to CNBC-TV18 sources. The share sale is expected to have a floor price of Rs 3,550 per share, which represents a 10.2% discount to Monday's closing price.Diamond Power InfrastructurePromoters Monarch Infraparks and GSEC will be selling 12.86 lakh equity shares, or a 2.44% stake each, in the company via an offer-for-sale on May 28-29. The floor price has been fixed at Rs 855 per share.IRIS Business ServicesThe company announced that its board of directors will meet on May 30 to consider a proposal for raising funds.TARCThe company announced board approval for the re-appointment of Anil Sarin as Chairman, effective from May 28ICICI BankThe Reserve Bank of India (RBI) has imposed a monetary penalty of Rs 1 crore on ICICI Bank for non-compliance with RBI directions on Loans and Advances – Statutory and Other Restrictions.Yes BankThe Reserve Bank of India has imposed a monetary penalty of Rs 91 lakh on Yes Bank for non-compliance with directions on Customer Service in Banks and Unauthorized Operation of Internal/Office Accounts.Lumax Auto TechnologiesAmara Partners Growth Fund I acquired 6.06 lakh equity shares (equivalent to 0.89% of the paid-up equity in the company) at an average price of Rs 478 per share via open market transactions. Foreign portfolio investor Albula Investment Fund was the seller in this deal.Nazara TechnologiesPlutus Wealth Management LLP purchased an additional 48.84 lakh equity shares (equivalent to 6.38% of paid-up equity) in Nazara at an average price of Rs 620.5 per share. Plutus held a 6.63% stake in the company as of March 2024. Promoter Mitter Infotech LLP was the seller in this deal.F&O BanBiocon, GNFC, Hindustan Copper, Vodafone Idea, and Piramal Enterprises\n       ",
    "The Reserve Bank of India (RBI) on May 27 said it has imposed monetary penalty on ICICI Bank and YES Bank for rule violations.The central bank imposed Rs 1-crore penalty on ICICI Bank, and Rs 91 lakh on YES Bank, according to a press release.The monetary penalty on ICICI Bank was imposed as it had sanctioned term loan(s) to certain entities in lieu of or to substitute budgetary resources envisaged for certain projects and without undertaking due diligence on the viability and bankability of the projects to ensure that revenue streams from the projects were sufficient to take care of the debt servicing obligations, release said.Further, the repayment/servicing of which was made out of budgetary resources and without ensuring that the funding proposals were for specific monitorable projects, the release added.Penalty on YES Bank was imposed as bank had levied charges for non-maintenance of minimum balance in certain savings accounts having insufficient/zero balance and opened and operated certain internal accounts in the name of its customers for unauthorized purposes like parking funds and routing customer transactions, the RBI said.\n       ",
    "Shares of ICICI Bank fell over 1 percent to Rs 1,108 per share on May 22 after the bank allotted 6.5 lakh equity shares of face value of Rs 2 each under the employee stock option plan (ESOP).So far this year, the stock of this private sector lender has surged over 11 percent, outperforming a 3 percent rise in the benchmark Nifty 50 index. Earlier, ICICI Bank shares had hit 52-week high of Rs 1,169 per share on April 30, 2024.Follow our live blog for all the market actionEarlier, ICICI Bank had alloted 1.67 lakh equity shares under ESOP on January 11, 2024.Apart from that, ICICI Bank also approved appointment of Rajendra Khandelwal as the Group Chief Internal Auditor and senior management personnel effective June 1, 2024. Khandelwal will replace Anish Madhavan whose term as GCIA is due for completion on May 31, 2024.With 29 years of banking and finance experience, Khandelwal handled significant responsibilities in the areas of taxation, wholesale banking planning, operating expense management, and accounts, ICICI Bank said in an exchange filing.Earlier, ICICI Bank had clocked an 18.5 percent year-on-year (YoY) rise in net profit to Rs 11,672 crore in the January-March quarter (Q4FY24), while net interest income increased by 8.1 percent YoY to Rs 19,093 crore.The lender's net NPA declined 2 bps to 0.42 percent from the previous year's 0.44 percent.Following its Q4 results, brokerages maintained their bullish view on ICICI Bank. JM Financial reiterated its 'buy' rating on the stock, with its target price of Rs 1,330 per share. They believe that the lender is poised to achieve an average return on asset (RoA) of 2.3 percent and return on equity (RoE) of 18.5 percent over FY25–26.Similarly, CLSA has upheld its 'buy' rating and raised the target price to Rs 1,350 per share, while JP Morgan maintained its 'overweight' stance on ICICI Bank, with a target price of Rs 1,300 per share.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "The ICICI Securities delisting saga faced another setback when the National Company Law Tribunal (NCLT) postponed the case until July amidst concerns from minority shareholders regarding the company's potential breach of shareholders' privacy and manipulation of the voting process.Last month, over 100 shareholders of ICICI Securities, led by Manu Rishi Gupta, initiated a class-action lawsuit against the company's delisting and its merger plan with ICICI Bank.The lawsuit claimed that ICICI Securities had disclosed confidential shareholder information to ICICI Bank, compromising the privacy and independence of investors. Now, let's take a look at what the story has been so far!ICICI Bank board approves ICICI Securities delisting on June 2023ICICI Bank's board approved the delisting of ICICI Securities on June 29, 2023. According to the scheme, public shareholders of ICICI Securities would receive 67 equity shares of ICICI Bank for every 100 shares of ICICI Securities, resulting in ICICI Securities becoming a wholly-owned subsidiary of ICICI Bank upon delisting.ALSO READ: ICICI Securities names two bankers as co-heads of ECM businessCurrently, ICICI Bank holds a 74.73 percent stake in ICICI Securities, with public shareholders owning the remaining shares. Notable among these public shareholders are Norway's Norges Bank Investment Management, with a 3.2 percent stake, followed by Life Insurance Corporation and California-based Capital Group.Investors raise concern about depressed valuation, share-swap ratioAt the time of announcement, ICICI Securities share price was hovering just above its intial public offering (IPO) issue price of Rs 520, igniting debates about the stock's true value.As the proposal progressed, concerns regarding the depressed valuation and share-swap ratio of ICICI Securities intensified. Market participants and shareholders questioned the fairness of the deal, especially given the stock's low price relative to its potential.Manu Rishi Gupta, a minority shareholder and SEBI registered PMS provider, rallied over 500 shareholders to oppose the delisting resolution. Gupta highlighted the significant disparity between the valuation during ICICI Securities' IPO in 2018 and its delisting offer.\"During the ICICI Securities IPO in 2018, the shares were offered at a valuation of 30x trailing earnings. At the time of delisting today, ICICI Bank is offering just 18x of FY23 earnings,\" he said.ICICI Securities delisting plan passes regulatory hurdles - RBI, BSE, NSE give nodThe good news came in for ICICI Bank after ICICI Securities delisting proposal passed its first regulatory hurdle. The Reserve Bank of India (RBI) gave nod to delist ICICI Securities on November 9, 2023, to make it ICICI Bank's wholly-owned subsidiary, subject to certain conditions.Later, it also received 'no objection' letters from stock exchanges BSE and NSE for delisting shares of the broking arm on November 29, 2023.ALSO READ: ICICI Bank under SEBI lens; watchdog examining complaints in ICICI Securities delisting case, says reportDiscontent grows, investors spell concern at public forum for the first timeHowever, discontent among investors surfaced in a post-earnings analyst conference call on January 16, 2024, where shareholders expressed concerns about the swap ratio and argued for the company to remain listed. Despite this, ICICI Bank received NCLT approval for the shareholders' voting process on January 18, 2024.But this also came to no avail. On January 18, 2024, ICICI Bank informed exchanges that it has received NCLT approval for shareholders' voting process in March.Shareholders give ICICI Securities delisting approval Ultimately, the delisting of ICICI Securities was approved on March 28, 2024, with 71.89 percent of votes in favor of merging ICICI Securities with ICICI Bank, despite resistance from retail investors. However, concerns about vote manipulation and breaching of shareholder privacy persisted.Around 16 domestic mutual funds voted in favour of ICICI Bank's proposal to delist its broking arm. However, around 7 mutual fund houses opposed the plan.Mutual fund houses such as Kotak, Mahindra Manulife, Samco, Quantum, ITI, LIC, and Baroda BNP voted against the delisting proposal. However, asset management companies like UTI, Axis, Aditya Birla, HDFC, ICICI Prudential, Nippon, Mirae Asset, DSP, SBI, Sundaram, Bandhan, NJ, among others.Vote manipulation, breaching of shareholder privacy concerns dial upIn spite of the delisting nod, clamour grew over ICICI Bank meddling with votes and calling ICICI Securities shareholders in the guise of 'awareness' campaigns to gain support for delisting.Voicing these concerns, a group of shareholders led by Bengaluru-based investment manager then approached NCLT last month.According to lawsuit filed by Gupta and fellow minority shareholders, ICICI Securities was alleged to disclose confidential information to ICICI Bank, compromising shareholders privacy.NCLT defers ICICI delisting vote manipulation case to JulyIn the latest development, NCLT has deferred the case to July for further deliberation and the matter remains poised for intense scrutiny and debate.Market regulator Sebi is also investigating allegations of ICICI Bank employees contacting ICICI Securities in an attempt to influence them before a vote on delisting proposal in March.As Moneycontrol reported earlier, it is believed that minority investors of ICICI Securities filed 60-70 complaints with the SEBI and also complained on the SCORES platform about vote manipulation grievances. SCORES is SEBI's online platform for filing grievances.In the past three months, shares of ICICI Securities have tumbled over 9 percent, underperforming the 1.4 percent rise in the benchmark Nifty 50 index.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "At a time when HDFC Bank is navigating merger challenges and Kotak Mahindra Bank is rectifying discrepancies in its digital lending business, the Street has selected ICICI Bank as the flavour of the season in the private banking space this April.According to Moneycontrol's Analyst Tracker, ICICI Bank has bagged around 48 'buy' calls from brokerages and only 3 'hold' calls in April. This picture is in contrast to India's largest private lender — HDFC Bank, which received 45 'buy' calls and 5 'hold' ratings last month.Strengthening balance sheetAs ICICI Bank reported another strong quarterly show, brokerages maintained their bullish stance on the lender and raised their target prices.Analysts at Geojit Financial Services put out a 'buy' call on ICICI Bank, with a target price of Rs 1,274 per share, citing the bank's sustained growth momentum in advances and deposits driven by its technological prowess and extensive reach.\"Positive triggers such as healthy asset quality, adequate capitalisation, and digital transformation augur well for the bank’s future performance,\" they wrote in a post-result analysis.Prabhudas Lilladher, too, gave a 'buy' call on ICICI Bank given its improved in balance sheet, and raised the target price to Rs 1,450 per share from Rs 1,300.ALSO READ: Buy ICICI Bank; target of Rs 1355: KR ChokseyICICI Bank's share of retail and SME loans increased to 75.4 percent in FY24, while its loan-to-deposit ratio reduced to 83.8 percent, and liquidity coverage ratio stood strong at 123 percent.\"This helps us arrive at a return on asset (RoA) and return on equity (RoE) of 2.1 percent and 17.2 percent, respectively, for FY26E, which is best-in class,\" analysts at Prabhudas Lilladhersaid.ICICI Bank's net interest income climbed 19.5 percent year-on-year (YoY) to Rs 74,305 crore in FY24, from Rs 62,128 crore in FY23. Its profit-after-tax (PAT) also jumped  28.2 percent YoY to Rs 40,888 crore in FY24, from Rs 31,896 crore in the year-ago period.Margin pressures to reduceWhile a higher cost of funds continues to haunt the margins of  major banking and financial firms, analysts believe that ICICI Bank's margin drag was limited in Q4 due to ultra-low credit costs versus peers.Analysts at Bernstein shared a 'market perform' rating (a neutral rating) on ICICI Bank, with a target price of Rs 1,150 per share. They said that another quarter of low credit costs helped offset a marginal decline in NIMs (net interest margin).The management said there would be a gradual improvement in the NIM in the upcoming quarters.ALSO READ: ICICI Bank Q4 Results: Net profit jumps 17% to Rs 10,707 crore, asset quality stays healthy\"We expect margins to remain under pressure in the near-term due to deposit re-pricing, but the bank remains committed to offset this with higher yielding segments, keeping margins rangebound,\" the management explained.ICICI Bank's NIMs contracted by 33 basis points (bps) YoY to 4.6 percent, from 5 percent in the year-ago period. Sequentially, too, NIMs were down 14 bps from 4.8 percent in Q3FY24.Attractive valuations pave the way for re-ratingCurrently, ICICI Bank trades at 17.7 times its price-to-earnings (PE) ratio, slightly above Kotak Mahindra's 17.7X PE and HDFC Bank's 17.1 X PE. However, it remains expensive compared to the sector's mean of 11.18X PE.Analysts at Bernstein  said that this premium valuation enjoyed by ICICI Bank compared to its peers was justified as the lender maintained a healthy RoA of 2.36 percent.JP Morgan's analysts see further scope for upward re-rating amid better growth prospects. \"We believe the valuation is still reasonable at 13X FY26. We upgrade ICICI Bank's FY25/26 EPS by 4 percent,\" the brokerage firm added, giving the bank an 'overweight' rating and a target price of Rs 1,300 .So far this year, ICICI Bank's shares have surged over 13 percent, outperforming the 1 percent gain in the benchmark Nifty 50 index during the same period.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "ICICI Bank on May 10 said Bijith Bhaskar, who is the head of cards, payment solutions, e-commerce ecosystem, and consumer finance of the company, has resigned with effect from May 18.He was part of the senior management personnel group and his resignation was accepted by the bank on May 10, the exchange filing said.In his resignation letter, Bhaskar said that he was quitting “purely for personal reasons” and to “pursue opportunities outside the bank”. He was part of the bank for 21 years, according to the filing.Last month, the second-largest private bank in the country admitted to a data glitch that led to the bank's 17,000 newly-issued credit cards getting affected. According to the bank, the new cards got linked to incorrect accounts in the digital channels of the lender. The bank, however, assured that the mistake was soon rectified and there was no reported case of misuse.This is a developing story. Please check back for more updates ",
    "Fitch Ratings on Thursday affirmed the ratings of Axis Bank and ICICI Bank with a stable outlook citing supportive operating environment and large domestic franchise.Fitch Ratings has affirmed India-based Axis Bank and ICICI Bank's Long-Term Issuer Default Rating (IDR) at 'BB+', the global agency said in two separate rating commentaries.Fitch has also affirmed the banks' Government Support Rating (GSR) at 'bb+' and Viability Rating (VR) at 'bb'.Fitch said its IDR ratings reflect expectation of a moderate probability of extraordinary state support from the government relative to large state banks.The agency said its expectation of a supportive operative environment is on account of India's robust medium-term growth potential. Fitch expects GDP growth of 7 per cent in 2024 and 6.5 per cent in 2025, supported by investment prospects.\"The economy has been resilient as healthy business sentiment, steady financial markets and the government's capital spending buffered global economic headwinds and inflation. These factors are conducive for banks to sustain profitable business, provided risks are well-managed,\" Fitch said.With regard to Axis Bank, Fitch said the bank's appetite for growth is likely to remain above the sector average, albeit similar to other large private banks.\"We have revised the outlook on Axis' earnings and profitability score to stable, from positive, as we do not see a significant further upside to the core metric from current levels, despite remaining high relative to the years before FY23,\" it added.On ICICI Bank, Fitch said it maintains a positive outlook on its earnings and profitability score, as it expects profitability to remain elevated relative to prior years.On ICICI Bank's large domestic franchise, Fitch said the bank has a strong retail-focused domestic franchise as India's second-largest private bank.\"This, together with above-average capitalisation, should support sustained generation of revenue and business opportunities as well as market-share expansion through the cycle,\" it added.\n       ",
    "KR Choksey's research report on ICICI BankICICIBC reported a stable quarter, with performance on par with expectations. Net interest income (NII) grew 8.1% YoY (+2.2% QoQ) to INR 190,928 Mn in Q4FY24. NII was in line with our expectation. Pre-Provision Operating Profit (PPOP) for Q4FY24 grew 8.8% YoY (+2.1% QoQ) to INR 150,388 Mn. PPOP was in line. The profit after tax surged by 17.4% YoY (+4.2% QoQ) to INR 107,075 Mn in Q4FY24 on account of lower provisions. Net profit was 2.0% higher than our estimates, led by slightly lower-than-expected provisions. We have slightly cut our FY26E profit estimates by 3.4% factoring in slightly higher operating costs given the Bank’s continued investment in branches and technology.OutlookWe have applied a P/ABV multiple of 2.5x (earlier 2.3x) to the FY26E ABV of INR 475.9 per share, implying a SOTP valuation of INR 1,355 per share (earlier INR 1,250), implying a potential upside of 18.2%. Accordingly, we maintain our “BUY\" rating on ICICI Bank's shares.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.ICICI Bank - 07052024 - kr ",
    "The Securities and Exchange Board of India (SEBI) is investigating allegations of ICICI Bank employees contacting ICICI Securities shareholders in an attempt to influence them before a vote on delisting proposal in March, Mint reported.During the vote, the shareholders were to decide on the delisting of ICICI Securities and its merger with its parent company, ICICI Bank. Over 500 shareholders of ICICI Securities had collaborated through WhatsApp and social media to file numerous complaints with SEBI.\"The regulator is presently reviewing several complaints. Once substantiated evidence is gathered, SEBI will commence an investigation. The specific actions SEBI may take remain uncertain,\" the Mint report quoted an unidentified source.Earlier, Manu Rishi Guptha, a Bengaluru-based fund manager and a minority shareholder in ICICI Securities, said in an exclusive interaction with Moneycontrol that prior to the board meeting, both ICICI Securities and ICICI Bank had been reaching out to retail shareholders of the former, persuading them to vote in favor of the merger scheme.Gupta added that the actions have also led to minority shareholder data being compromised as the calls were made by ICICI Bank and not by ICICI Securities, which means that the details were shared with them.In the Mint report, Guptha also stated that minority investors of ICICI Securities have filed 60-70 complaints with the SEBI and also complained on the SCORES platform. SCORES is SEBI's online platform for filing grievances.Also Read | MC Exclusive: Minority shareholders file class action suit against ICICI Securities on delisting concernsHe further stated that the primary accusations in these grievances involve the breach of data privacy concerning ICICI Securities' shareholders and the valuation at which the company is slated for delisting.Guptha is leading team of over 100 ICICI Securities shareholders who, last month, submitted a class action lawsuit to the National Company Law Tribunal (NCLT) challenging ICICI Bank Ltd's bid to delist ICICI Securities.In a response to the stock exchanges, ICICI Bank clarified that the \"outreach program aimed to encourage higher participation in voting\" rather than influence decision-making. However, Quantum MF labeled this clarification as a \"smokescreen\" and an effort to conceal the \"malicious\" intentions of ICICI Securities.\"Upon initial examination of the clarification response, no valid justification is provided for the queries raised by the stock exchanges. The notice summoning the shareholder's meeting had already been dispatched in February 2024, thus rendering contacting shareholders individually unnecessary,\" the mutual fund emphasised.On March 27, minority shareholders voted in favor of delisting ICICI Securities to wholly merge the entity with its parent, ICICI Bank. Currently, the bank holds a 74.73 percent stake in the brokerage firm, with public shareholders owning the remaining shares.However, several retail shareholders, collectively owning approximately 6 percent of the company, voiced objections regarding the valuation at which the delisting was proposed. According to the plan, shareholders of ICICI Securities were to receive 67 shares of ICICI Bank for every 100 shares they held in the brokerage firm.Both ICICI Bank and ICICI Securities have asserted that the valuation was determined by independent appraisers and scrutinised by independent professionals representing both entities.ICICI Securities notably became the first company to make use of a new SEBI regulation that provides an exemption from the reverse book-building process for price discovery during the delisting of a listed subsidiary involved in a similar business as its parent company.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.\n       ",
    "ICICI Bank on Monday announced that it has enabled instant payment facility UPI for its non-resident Indian (NRI) customers in India through their international mobile numbers. According to the bank, this will significantly enhance convenience of making everyday payments.\"With this facility, the NRI customers of the bank can make payments for their utility bills, merchant and e-commerce transactions with their international mobile number registered with their NRE/NRO bank account held with ICICI Bank in India,\" a statement released here by the bank said. According to the statement, the bank has made this service available through its mobile banking app iMobile Pay.Earlier, NRIs had to register an Indian mobile number with their bank accounts to make UPI payments across 10 countries, namely, the USA, UK, UAE, Canada, Singapore, Australia, Hong Kong, Oman, Qatar and Saudi Arabia. NRI customers of the bank can make UPI payments by scanning any Indian QR code, send money to a UPI ID or any Indian mobile number or Indian bank account.\"With this facility, our NRI customers residing in 10 countries do not need to switch to an Indian mobile number to pay using UPI,\" Sidharatha Mishra, Head Digital Channels and Partnerships, ICICI Bank, said. According to him, with this initiative, the bank intends to leverage on NPCI's UPI (Unified Payments Interface) infrastructure in \"strengthening and transforming the digital payments ecosystem globally\". \n       ",
    "Geojit Financial Services research report on ICICI BankICICI Bank Ltd operates a network of banks located throughout India. The Group specializes in retail and corporate banking, in addition to Forex and treasury operations. ICICI Bank also provides a wide variety of investment banking, insurance and financial services to its clients. In Q4FY24, the bank’s net interest income (NII) grew 8.1% YoY to Rs. 19,093cr. Net interest margin (NIM) contracted 50bps YoY to 4.4%, due to rising cost of deposits. PAT for the quarter stood at Rs. 10,708cr, rising 17.4% YoY, due to lower operating expenses and provisions. ICICI Bank reported a strong quarter, with an increase in its loan book and net profit. Asset quality of the bank continues to improve due to healthy recovery.OutlookAlso, with better asset mix and granularisation of deposits, the bank has been able to manage NIM well. Therefore, we continue to remain optimistic about the company’s long-term growth prospects and reiterate our BUY rating on the stock with an SOTP-based target price of Rs. 1,274.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.ICICI Bank - 06052024 - geo ",
    "ICICI Bank’s prompt denial of Managing Director Sandeep Bakhshi “sending feelers” about his desire to exit as reported by The Morning Context managed to arrest any significant erosion in the stock in today’s trade. The ICICI bank stock ended 1 percent lower at Rs 1,139 per share on May 2.But analysts said it’s not difficult to see why any such news would send a big shock to markets and prove to be sentimentally-negative for ICICI Bank.From Rs 355 per share in October 2018 to smooth sailing at Rs 1,152 currently, ICICI Bank's four-fold jump in stock price reflects investors' faith in the private lender ever since Sandeep Bakhshi donned the heavy hat from Chandra Kochhar. It’s under his leadership that the bank outpaced SBI, the largest bank in the country by size, in terms m-cap.ALSO READ: ICICI Bank denies CEO and MD Sandeep Bakhshi wanting to quit, calls report 'baseless'The big transitionSandeep Bakhshi's step-up in ICICI Bank came at a time when the lender was not in the best of its shape on October 15, 2018. Prior to his appointment as MD and CEO of ICICI Bank, he was a whole-time director and chief operating officer of the bank. The change of baton took place when predecessor Chandra Kochhar was forced out due to money laundering allegations, wavering investors' confidence to a low. But Bakhshi took ICICI Bank from third-largest lender in India by m-cap to second-largest (next only to HDFC Bank).ICICI Bank's m-cap rose to Rs 8.09 lakh crore in 2024 from Rs 2.01 lakh crore in 2018, outpacing State Bank of India's Rs 7.36 lakh crore m-cap, showed data from Bloomberg. Stock also saw a stellar rally, giving over 200 percent returns in the span of 6 years.\"Bakhshi has done a wonderful job in the last six years. He has revamped retail lending, deepened bank's reach across geographies, improved profitability, and brought down bad loans,\" said Jignesh Shial, Director - Research and Head of BFSI Sector at InCred Capital.Dnyanada Vaidya, BFSI Research Analyst at Axis Securities also agreed. She said the since 2018 ICICI Bank’s risk-reward metrics turned favourable and the bank has delivered an all-round performance across operational metrics consistently.ALSO READ: ICICI Bank FY24 – steady show, re-rating to continueThe three-fold jumpBesides, during his tenure, ICICI Bank's bad loans saw a steep decline. The bank’s net non-performing assets (NNPAs) declined tremendously to 0.45 percent in the March-ended quarter of fiscal year 2023-24 (Q4FY24) from 5.43 percent in Q4FY18.Additionally, the private-sector lender's net interest income jumped over three-fold to Rs 19,092 crore in Q4FY24 from Rs 6,021 crore in Q4FY18, while margins expanded by 120 basis points to 4.4 percent in the last 6 years. Similarly, at 4.86 percent, ICICI Bank's cost of funds were marginally lower than HDFC Bank's 4.9 percent and way better than Axis Bank's 5.4 percent.The overhang in this picture perfect scenario remains deteriorating current and savings account (CASA) ratio. CASA ratio declined to 38.9 percent in Q4FY24 from 51.7 percent in Q4FY18. But analysts said that this situation was seen across industry as all CASA flows went to term deposits in a rising rate scenario.Street upbeat on ICICI BankWith Bakhshi managing to front the ship in smooth waters over the course of 6 years, all brokerages turned favourable on the stock. At present, there were zero 'sell' calls on ICICI Bank, while 'buy' calls stood at 48, and 3 were on 'hold', showed Bloomberg data.The lender's return on equity (RoE) - which measures how effectively a company generates profit also jumped to 17.2x in 2023 from 5.24x in 2019.Going ahead, Jefferies analysts see further scope of re-rating in ICICI Bank due to better growth prospects and attractive valuations against peers. \"Since valuations are reasonable at 13x FY26, we upgrade FY25/26 EPS by 4 percent each,\" they wrote in a recent note, sharing an 'overweight' rating and target price of Rs 1,300 apiece.Nomura, too, expects the lender to deliver 13 percent profit-after-tax (PAT) compounded annual growth rate (CAGR) over FY24-26 after reporting a strong Q4FY24. The brokerage firm shared a 'buy' call with a target price of Rs 1,335 per share.With the best quality private sector banks – HDFC Bank and Kotak Bank – struggling to perform on the bourses, analysts and fund managers have been increasingly leaning towards ICICI Bank. A leadership change, if it comes through, may leave fund managers with no easy options in the BFSI space.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Shares of ICICI Bank were flat on May 2 after the bank categorically denied reports of CEO and MD Sandeep Bakhshi wanting to quit his position.ICICI Bank termed The Morning Context report as 'baseless', and a 'figment of imagination', which said that Sandeep Bakhshi wanted to be relieved as MD and CEO due to personal emergency. However, RBI was against his departure, the report said.\"We would like to categorically deny the information published in the article regarding ICICI Bank’s MD allegedly expressing willingness to leave his position due to personal reasons,\" ICICI Bank said in a filing.\"This information is figment of imagination and therefore, completely baseless and misleading. It appears that this rumour is being spread with an ulterior motive and malicious intent in order to harm the Bank and its stakeholders,\" the filing said.Also Read | ICICI Bank becomes 5th Indian firm to cross Rs 8 lakh crore mcapAt 09.24 am, shares of ICICI Bank were flat at Rs 1,150.Last week, ICICI Bank emerged as the fifth Indian company and the second bank to surpass Rs 8-lakh-crore market capitalisation for the first time after its shares rallied over 4 percent on strong earnings.ICICI Bank reported a net profit of Rs 10,708 crore in Q4 FY24, up 20 percent from Q4 FY23, driven by robust advances and reduced credit costs, despite margin pressure. ICICI Bank achieved a ROA of 2.4 percent in FY24, reflecting strong performance across the board.The net interest income (NII) rose 8 percent to Rs 19,093 crore in Q4 FY24, surpassing estimates of Rs 18,958 crore.\n       ",
    "On the robust rally of nearly five percent in ICICI Bank after a consolidation phase in the previous session, market analysts observe that the potential movement following a breakout from such consolidation phases could be approximately twice the width of the consolidation range.Applying this principle to ICICI Bank, \"we can reasonably set a target for the stock at around Rs 1,280, Jigar S Patel, Senior Manager - Equity Research, at Anand Rathi said in an interview to Moneycontrol.Jigar, who has more than nine years of experience in technical research, believes the recent price action of YES Bank indicates a significant development in its long-term trend. Based on this technical analysis, investors may consider initiating long positions in YES Bank within the price range of Rs 25 to 28, he advises.What is your trading strategy for ICICI Bank and State Bank of India?ICICI BankAfter a prolonged period of consolidation lasting 32 trading sessions, during which ICICI Bank's stock price traded within a relatively narrow range of Rs 1,050 to Rs 1,120, a significant development has occurred. The stock has successfully breached this consolidation range and is currently hovering around the Rs 1,160 level.From a technical standpoint, market analysts often observe that the potential movement following a breakout from such consolidation phases could be approximately twice the width of the consolidation range. Applying this principle to ICICI Bank, we can reasonably set a target for the stock at around Rs 1,280. This target reflects the anticipated magnitude of the breakout move beyond the previous range. In light of this bullish outlook, a strategy of buying on dips is recommended for investors interested in entering or increasing their positions in ICICI Bank.State Bank of IndiaIn the case of State Bank of India (SBIN), there has been a notable upward movement, amounting to a 100-point increase over the past seven trading sessions. This surge translates to a substantial gain of approximately 13 percent to 14 percent. However, it's crucial to note the emergence of a Bearish Butterfly pattern near the Rs 835-840 zone on the chart. The presence of this pattern typically indicates a potential reversal in the ongoing upside, suggesting that the stock's upward momentum might be losing steam.Given this technical signal, investors may consider the prudent strategy of booking profits on their SBIN positions. By doing so, they secure gains accrued during the recent bullish phase. Subsequently, investors can adopt a wait-and-watch approach, anticipating a meaningful correction in the stock's price. This approach allows investors to capitalise on potential buying opportunities that may arise as the stock retraces from its current elevated levels. Overall, this strategy aims to strike a balance between realising profits and positioning oneself advantageously for future market movements.Do you advise taking exposure to YES Bank and IREDA?YES BankThe recent price action of YES Bank indicates a significant development in its long-term trend. After enduring a prolonged period of downward pressure, symbolised by a bearish trendline that persisted for 3.5 years, YES Bank's stock price has managed to break above this formidable resistance level. What's particularly noteworthy is that the stock has not only breached this long-standing bear line but has also retraced to retest it from above. This retest serves as a crucial confirmation that the breakout is indeed genuine, strengthening the conviction in the bullish outlook for YES Bank.Based on this technical analysis, investors may consider initiating long positions in YES Bank within the price range of Rs 25 to 28. The upside potential for the stock is estimated to be around Rs 41, representing a substantial increase from current levels. However, it's important to manage risk effectively in trading or investing. Therefore, a prudent approach would involve placing a stop-loss order near Rs 19 on a daily closing basis. This investment view spans over the next 8 to 12 months, reflecting a longer-term perspective on the anticipated trajectory of YES Bank's stock price.IREDACurrently, IREDA (Indian Renewable Energy Development Agency) is encountering significant resistance around the upper boundary of the Bollinger Bands, a technical indicator that depicts volatility and potential price levels. This resistance is reinforced by the presence of a bearish candlestick formation, which typically suggests selling pressure in the market. The conjunction of these two factors indicates a challenging environment for further upward movement in the stock's price in the immediate term.Consequently, it is advisable for investors to exercise patience and await a pullback in the stock's price. This pullback is expected to lead the price down to around the Rs 160 level, offering a more favourable entry point for initiating long positions.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. "
]