[
    "The benchmark indices recorded a new high on May 23 by showing a long bullish candlestick pattern on the daily charts. The BSE Sensex and Nifty 50 indices ended at a new all-time closing high, but with negative breadth as approximately 1,204 equity shares declined and 1,043 shares advanced on the NSE. The market has reached near the crucial resistance of 23,000 on the Nifty 50, and it needs to give a strong close above the same for further upward journey from hereon. However, below the same, it may consolidate. Here are some trading ideas for the near term.Amol Athawale, VP-Technical Research at Kotak SecuritiesInfosys | CMP: Rs 1,472.4Post its declining trend from the higher levels, Infosys is in consolidation mode, trading in a rectangle formation. However, the recent bullish activity near the demand zone indicates good strength. The gradual upward moves in the counter suggest a fresh leg of a bullish trend in the near term.Strategy: BuyTarget: Rs 1,575Stop-Loss: Rs 1,420IndusInd Bank | CMP: Rs 1,440.85After a short-term correction from the higher levels, IndusInd Bank was in the accumulation zone where it was trading in a rectangle formation. However, on the daily charts, there is a range breakout in the counter along with decent volume activity, which suggests upward momentum to persist in the coming horizon.Strategy: BuyTarget: Rs 1,540Stop-Loss: Rs 1,390Eicher Motors | CMP: Rs 4,852.85On the weekly charts, the counter is in a rising channel chart formation with a higher high and higher low series pattern. Additionally, technical indicators like ADX (average directional index) and RSI (relative strength index) are also indicating a further uptrend from current levels, which could boost the bullish momentum in the near future.Strategy: BuyTarget: Rs 5,200Stop-Loss: Rs 4,690Chandan Taparia, Head - Equity Derivatives & Technicals, Broking & Distribution at Motilal Oswal Financial ServicesBharti Airtel | CMP: Rs 1,374Bharti Airtel has given a range breakout on the daily chart and managed to close above the same. It has formed a bullish candle on the daily scale, and supports are gradually shifting higher. The momentum indicator, relative strength index (RSI), is positively placed, which may take prices higher.Strategy: BuyTarget: Rs 1,480Stop-Loss: Rs 1,310Mahindra and Mahindra | CMP: Rs 2,609M&M has been continuously forming higher highs and higher lows for the past three weeks. It has given an Inside Bar breakout on the daily scale and achieved its highest daily close ever.Strategy: BuyTarget: Rs 2,750Stop-Loss: Rs 2,520Axis Bank | CMP: Rs 1,165Axis Bank has retested the breakout and is inching higher. The overall trend is bullish, and every small decline is being bought into. Buying activity is visible across private banks, which may support the ongoing uptrend.Strategy: BuyTarget: Rs 1,250Stop-Loss: Rs 1,130State Bank of India | CMP: Rs 832SBI is in an overall uptrend and has given a consolidation breakout on the daily chart. The base is shifting higher, and a small follow-up can take it towards the Rs 880-900 zones.Strategy: BuyTarget: Rs 900Stop-Loss: Rs 790Mitesh Karwa, Technical Research Analyst at Bonanza PortfolioLarsen & Toubro | CMP: Rs 3,585.40L&T has seen a breakout of a downward sloping resistance trendline and is forming a bullish candlestick with above-average volumes after taking support from a crucial zone on the weekly timeframe. On the indicator front, the Supertrend indicator is indicating a bullish reversal on the daily timeframe, and the momentum oscillator RSI (14) is around 56 on the daily timeframe, indicating strength by sustaining above 50.Observation of the above factors indicates that a bullish move in L&T is possible with a target up to Rs 3,730. One can initiate a buy trade in the range of Rs 3,583-3,585, with a stop-loss of Rs 3,480 on a daily closing basis.Strategy: BuyTarget: Rs 3,730Stop-Loss: Rs 3,480Maruti Suzuki | CMP: Rs 12,934.9Maruti has seen a breakout of a triangle pattern with above-average volumes and a bullish candlestick on the daily timeframe. The Supertrend indicator is also indicating a bullish continuation, supporting the bullish view. The momentum oscillator RSI (14) is around 59 on the daily timeframe, indicating strength by sustaining above 50, and the Ichimoku Cloud is suggesting a bullish move as the price is trading above the conversion and baseline.Observation of the above factors indicates that a bullish move in Maruti is possible with a target up to Rs 13,330. One can initiate a buy trade in the range of Rs 12,930-12,934, with a stop-loss of Rs 12,750 on a daily closing basis.Strategy: BuyTarget: Rs 13,330Stop-Loss: Rs 12,750Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "By Rajesh Bhosale, technical analyst at Angel OneThe prominent highlight of the last week (ended May 10) was the increasing volatility (India VIX), which saw our markets experiencing significant price corrections despite favourable global cues. By the week's end, Nifty witnessed a deep cut of 1.87 percent, ending a tad above the 22,050 mark.Examining the weekly chart, it's evident that prices have been confined within a range for several weeks. This week, prices moved from the upper boundary to the lower one, signaling a notable shift in trader sentiment. The daily chart depicts a similar pattern, resembling a 'Rising Channel,' affirming a defined range for Indian markets.On Friday, prices managed to defend the lower boundary of this pattern, coinciding with the 89EMA (exponential moving average), preventing a breakdown. A comparable scenario occurred on April 19, where prices rebounded from this crucial support, eventually reaching a new high. While the previous move was supported by a strong 'Piercing Line' bullish candlestick pattern, this time it's an 'Inside Bar' pattern, still bullish but less significant.Additionally, the RSI (relative strength index) Smoothened has fallen below its previous swing low, indicating overall bleak conditions. Traders are advised not to be swayed by temporary rebounds and to maintain light positions until concrete signs of a bullish reversal emerge, especially with the impending Lok Sabha election results.Regarding levels, Thursday's low coinciding with the 89EMA at 21,900 serves as immediate support, followed by previous swing lows in the 21,800 - 21,700 range. On the upside, the zone between the 20 and 50EMA, around 22,200 - 22,300, presents a formidable obstacle.Here is one buy call and one sell recommendation for short term:Avenue Supermarts: Buy | LTP: Rs 4,797 | Stop-Loss: Rs 4,610 | Target: Rs 5,140 | Return: 7 percentOnce considered as a trader's delight, this stock has experienced a prolonged period of dormancy over the past year. However, there has been a recent technical breakthrough, with prices surpassing their previous swing high on the weekly chart, affirming a resurgence in the uptrend.Volumes analysis reveals heightened activity during upward movements compared to subdued volumes during declines, indicating accumulation in this particular counter.Furthermore, prices comfortably exceed key averages, with oscillators positioned positively, bolstering the buy signal. Despite a widespread market selloff, this stock has demonstrated relative strength, suggesting that its outperformance is poised to persist.Hence, we recommend buying Avenue Supermarts (D-Mart operator) around Rs 4,800 - 4,750, with a stop-loss of Rs 4,610 and target of Rs 5,140.IndusInd Bank: Sell | LTP: Rs 1,410 | Stop-Loss: Rs 1,457 | Target: Rs 1,320 | Return: 6 percentAfter maintaining the key levels of Rs 1,430 for several months, prices have recently broken below it, signaling a bearish reversal pattern identified as the \"Inverse Cup and Handle\" pattern. This pattern suggests a bearish price cycle characterized by lower tops and lower bottoms.Additionally, the Smoothed RSI has fallen below its median level, indicating momentum favouring the bearish side. Given these parameters, it is anticipated that the stock may continue to decline in the near future.Hence, we recommend selling IndusInd Bank around Rs 1,410 - 1,415, with a stop-loss of Rs 1,457 and target of Rs 1,320.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "IndusInd Bank shares gained 1.6 percent to Rs 1,507 apiece on May 6 after reports suggested that promoter company IndusInd International Holding (IIHL) will raise its stake in the lender to 26 percent from 16 percent in multiple tranches over the next two weeks.IndusInd International Holding (IIHL), the investment arm of the Hinduja Brothers, received Reserve Bank of India's nod to hike its stake in IndusInd Bank to 26 percent. This means that IIHL will need to infuse a little over Rs 11,500 crore for an additional 10 percent stake in the lender.So far this year, the stock of IndusInd Bank has declined 5 percent, underperforming 3 percent rise in the benchmark Nifty 50 index.Follow our live blog for all the market actionIn April last year, RBI had given in-principle approval to IIHL to increase its stake in the bank to a maximum of 26 percent.IndusInd Bank reported 15 percent YoY rise in net profit to Rs 2,347 crore in Q4FY24, while its net interest income rose 14 percent YoY to Rs 5,376 crore. The bank's net interest margin contracted to 4.26 percent in Q4FY24 from 4.29 percent a year back.Following Q4 results, analysts at Kotak Institutional Equities retained 'buy' rating on IndusInd Bank and issued a target price of Rs 1,800. They believe that the bank has delivered an excellent price appreciation in the past year at a time when interest rates were trending higher.ALSO READ: IndusInd Bank Q4 net profit jumps 15% to Rs 2,349 crore, declares Rs 16.50 dividendJM Financial, too, maintained its 'buy' rating on the lender, with a target price of Rs 1,900 per share. \"IndusInd Bank trades at attractive valuations of 1.4x price-to-book (PB) FY26E and as the bank continues to invest in technology, it remains well-positioned for sustained growth across product cycles,\" they noted.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "KR Choksey's research report on IndusInd BankIndusInd Bank result was in-line with our estimates with minor deviations of ~2.0% headline numbers. In Q4FY24, Net Interest Income (NII) grew by 1.5% QoQ/ 15.1% YoY to INR 53,765 Mn. The NII was lower by 2.6% on the back of slightly lower yields on assets. PreProvision Operating Profits (PPOP) grew 8.6% YoY/ 1.0% QoQ in Q4FY24 to INR 40,815 Mn. The PPOP was 2.9% lower than our estimates. The net profit for Q4FY24 stood at INR 23,492 Mn, an increase of 15.0% YoY and 2.1% QoQ, primarily led by stable credit cost and healthy operating performance. The net profit was 2.0% lower than our estimates.OutlookWe have cut our net profit estimates by 4.3%/ 4.5%, considering a slight moderation in the growth and increase in the credit costs. We assign a P/B multiple of 1.8x to the FY26E adj. BVPS of INR 1,027.7 per share and revise our target price to INR 1,850 per share. Accordingly, we maintain our rating on the shares of IndusInd Bank at \"BUY.\"For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.IndusInd Bank - 02052024 - kr ",
    "LKP Research's research report on IndusInd BankIndusInd Bank has presented a favorable set of figures, with several positives: 1) around 15% YoY surge in reported profit, driven by lower provisioning expenses (down 12.7% YoY and 3.8% QoQ). 2) Healthy business growth, with credit expanding by 18.4% YoY and deposits by 14.5% YoY. 3) Reduced slippages (₹14.3 bn compared to ₹17.6 bn QoQ). 4) Stable Provision Coverage Ratio (PCR) at 71% and non-specific provisions at 0.7% of the book. 5) Decrease in restructuring book to 0.40% from 0.48% in the previous quarter. 6) Ample capital cushion with Capital Adequacy Ratio (CAR) of ~18%. However, there are some disappointments: 1) marginally lower Net Interest Margins (NIMs) at 4.26%. 2) Elevated Cost-to-Income (C/I) ratio at 48.9%. 3) Credit Deposit Ratio (CDR) of around 90%. Nevertheless, the bank seems adequately liquid with a Liquidity Coverage Ratio (LCR) of 118%. Moreover, the bank has made sufficient provisioning against potential stress, with an extra buffer of 0.7% of net loans. The growth in deposits, coupled with operating expense reduction in the coming quarters, will be closely monitored.OutlookCore operating performance of the Indusind Bank remains healthy. The Asset Quality seems healthy barring 2W NPAs and MFI collection fluctuation. Management believes the CDR at satisfactory position. Nevertheless, contingent buffer built up and cost reduction will be key monitorable in coming quarters. Thus, we retain our rating to BUY with price target of ₹1,749 (based on 1.6x FY26E Adj. BVPS of ₹1,093).For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.IndusInd Bank - 29042024 - lkp ",
    "Anand Rathi's research report on IndusInd BankStable margins, strong fees income and modest provisions led to IndusInd’s strong Q4 profitability with ~1.9% RoA. Key positives were 1) steady ~4.3% NIM, 2) strong credit growth in retail-book, 3) ~18% y/y retail-deposit growth and 4) lower slippages in the retail book. Ahead, with healthy credit growth likely and modest credit costs, earnings are expected to be robust.OutlookWe retain our positive view with a 12-mth TP of Rs1,758, 1.7x P/ABV on the FY26e book.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.IndusInd Bank - 26042024 - anand ",
    "ICICI Securities's research report on IndusInd BankDespite elevated opex, IndusInd Bank (IIB) reported Q4FY24 PAT of INR 23.5bn, up 15% YoY driven by 15% NII growth and ~13% YoY decline in provisioning. RoA remained strong at 1.9% for Q4FY24 as well as FY24. Gross slippages improved QoQ across subsegments, though the bank has part consumed contingent provisions. We believe IIB is well placed on growth, NIM and asset quality troika. IIB has delivered amongst the highest CAGR (FY21-24) in retail deposits, which should sustain, fuelling superior ~18% CAGR in loans over FY24-26. NIM is likely to remain stable, resulting in sector-leading ~17% CAGR in NII and PPoP for FY24-26E. In our view, the bank has 5–15bps improvement scope in each of NIM, opex to assets and credit costs over FY24-26E. Yet,Outlookwe conservatively factor in cumulative ~5bps RoA expansion to 1.9% (FY25-26E), as we believe IIB would be re-investing in the franchise and/or add contingent provision and/or elongate growth trajectory. Retain BUY; TP unchanged at INR 2,000.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.IndusInd Bank_26042024_ICICI Securities ",
    "Prabhudas Lilladher's research report on IndusInd BankIIB saw a stable quarter as core PPoP was largely in-line. Higher fees and lower opex were offset by softer NIM at 4.69% (PLe 4.83%). NIM decline QoQ was led by higher funding cost attributable to dearer external borrowings that replaced a bulky deposit outflow. Hence LCR reverted back to adequate level of 118%. Full year NIM improved by 14bps YoY to 4.5% as share of higher yielding retail+SME increased by 257bps to 60.9% over FY23 to FY24. Given bank would not like to surpass an LDR of 90%, deposit accretion should scale up to 17% YoY (14.5% over FY22-24) as per our estimates, to fund loan CAGR of 16% over FY24-26E. Hence LDR at 89.2% could reduce by 160bps.OutlookIIB again utilized Rs3bn in Q4’24 although it aspires to maintain additional 2% on MFI and 0.5% on MHCV, translating to ~Rs10bn. Contingent provisions stood at Rs10bn or 29bps. Maintaining multiple at 1.8x on Mar’26 ABV, we slightly increase TP to Rs1,800 from Rs1740. Retain BUY.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.IndusInd Bank - 26042024 - prabhu ",
    "Motilal Oswal's research report on IndusInd BankIndusInd Bank (IIB) reported an in-line 4QFY24 performance. PAT grew 15% YoY to INR23.5b (in line), aided by healthy revenue growth and lower provisions (aided by reversal of INR3b of contingent provisions).Loan growth was healthy at 18.4% YoY to INR3.4t, with healthy traction in the consumer finance segment. Deposits grew 14.4% YoY to INR3.8t, led by term deposits. The CASA ratio moderated 61bp QoQ to 37.9%.Fresh slippages moderated ~19% QoQ to INR14.3b, primarily driven by a decline in slippages in the corporate book to INR1.6b and consumer finance book to INR12.7b. GNPA/NNPA ratios remained stable at 1.92%/0.57%. Restructured book declined 8bp QoQ to 0.4%.OutlookWe estimate IIB to deliver a ~21% earnings CAGR over FY24-26, leading to RoA/RoE of 2.1%/16.8% by FY26. We reiterate our BUY rating on the stock with a TP of INR1,850.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.IndusInd Bank_26042024_Motilal Oswal ",
    "Sharekhan's research report on IndusInd BankQ4 numbers were in-line, with a 15% y-o-y earnings growth, led by 7% y-o-y operating profit growth and a 13% y-o-y decline in provisions translating into RoA/RoE at 1.9%/ 15%. The bank continues to invest in the franchise, leading to elevated cost ratios. Thus, core PPoP growth (ex. treasury gains) was soft at 4% y-o-y despite stable NIMs and strong fee income. Slippages were lower at 2.0% versus 2.6% q-o-q. Credit cost stood at 107 bps annualised versus 116 bps q-o-q. Gross NPL and net NPL ratios were largely unchanged at ~1.92% and 0.57%, respectively.OutlookWe maintain a Buy on the stock with an unchanged PT of Rs. 1,850. At the CMP, the stock trades at 1.6x/1.4x its FY2025E/FY2026E BV.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.IndusInd Bank - 26042024 - khan ",
    "Emkay Global Financial's research report on IndusInd BankIndusInd Bank (IIB) posted a slight (4%) miss on earnings with Rs23.5bn PAT/1.9% RoA (reported), due to some moderation in growth (18% YoY), as also in margin (down by 3bps QoQ to 4.26%). Asset quality took a breather, with slippages down QoQ to Rs14.3bn/1.75% of loans, leading to nearly stable GNPA/NNPA ratio at 1.9%/0.6% of loans. Bank retains medium-term credit growth guidance at 18-22%, with clear focus on diversifying its portfolio, including mortgages and non-vehicle loans. Within Vehicle loans, Bank has gradually moved away from MHCVs and thus reduced cyclicality. Also, Bank would maintain focus on retailization of deposits and invest in the phygital infrastructure. Bank plans to maintain 1.5% of its MFI book and 0.5% of MHCV book as contingent buffer at any given point in time, with contingent buffer (Rs10bn/0.3% of loans) well ahead of the requirement.OutlookWe trim our earnings by ~3%/7% for FY25E/26E, factoring-in the moderate growth, while we expect the bank to report healthy RoA/RoE at 1.9-2%/16-17% over FY25- 27E. We maintain BUY on IIB and our TP of Rs2,000/share, implying 2.2x FY26E ABV.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.IndusInd Bank - 26042024 - emkay ",
    "IndusInd Bank shares gained on April 26, a day after the lender reported in-line earnings for the March quarter. Its net profit (PAT) grew 15 percent on-year to Rs 2,350 crore, aided by healthy revenue growth and lower provisions.According to analysts, improved asset quality, robust growth in retail deposits and strong loan expansion were the key positives, while a miss on net interest income (NII) and fee income remains a concern.Morgan Stanley has an “overweight” rating on the IndusInd Bank stock with a target price of Rs 1,925. The private lender’s balance sheet remains robust, boasting a Common Equity Tier 1 (CET-1) ratio of 15.8 percent and a Liquidity Coverage Ratio (LCR) of 118 percent, it said.Follow our market blog to catch all the live actionThe CET1 ratio compares a bank's capital against its assets, while the LCR refers to the proportion of highly liquid assets held by lenders to ensure they can meet their short-term obligations.According to Jefferies, despite a 15 percent increase in profit, IndusInd Bank slightly missed estimates, as it was impacted by high operational expenses growth and reduced fees.The brokerage adjusted its estimates to reflect slower loan growth and reduced fees, emphasising that operational efficiencies would be crucial moving forward.Jefferies has a “buy” call on the stock with a target price of Rs 1,940 a share.Nuvama said IndusInd Bank's Q4 earnings were soft relative to peers but showed a good uptick in asset quality.Retail slippage, a key variable, dipped, while assets and loans grew. NII came in softer than expected due to a surge in the quantum of borrowings.With improving asset quality and the bank moving towards balanced and granular growth, the brokerage retained its “buy” call on the stock, with a target price of Rs 1,800, down from Rs 1,860.The management guided for a loan growth of 18-23 percent over FY23-26. Healthy provisioning in the MFI portfolio and moderation in the overall slippage run rate will keep credit cost under control, Motilal Oswal analysts said. The presence of a contingent provisioning buffer of 0.29 percent of loans provides comfort, they said.Also Read | IndusInd Bank Q4 net profit jumps 15% to Rs 2,349 crore, declares Rs 16.50 dividend\"IndusInd Bank is well positioned to benefit on margins as and when the rate cycle turns. We estimate a 21 percent earnings CAGR over FY24-26, leading to RoE of 16.8 percent in FY26,\" Motilal Oswal said as it retained a 'buy' rating on the stock with a target price of Rs 1,850 per share.Brokerage Emkay Global trimmed earnings estimates for the private bank by 3 percent and 7 percent for FY25 and FY26, respectively, factoring in the moderate growth. It expects the bank to report healthy return on asset (RoA)/return on equity (RoE) at 1.9-2 percent/16-17 percent over FY25-27E.The brokerage maintained its “buy” call on the stock with a target price of Rs 2,000 a share.At 9.37 am, the stock was trading flat on the National Stock Exchange at Rs 1,496.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. \n       ",
    "IndusInd Bank is continuously evaluating its information technology (IT) capabilities, said Sumant Kathpalia, Managing Director and Chief Executive Officer (MD & CEO) at the private sector lender. \"We have a board level IFSC committee that continuously evaluates our IT capabilities. There will be some gaps here and there,\" Kathpalia said at a post-results press conference.The bank, Kathpalia said, spends around 8-10 percent of its total cost to income on IT.Additionally, he said that every bank should evaluate their IT, know your customer (KYC), UI UX capabilities.Q4 performanceIndusInd Bank on April 25 reported a net profit of Rs 2,349 crore for the January-March quarter of financial year (FY) 2023-24, which marks a 15 percent jump as compared to Rs 2,043 crore clocked in the year-ago period. The net profit surpassed market estimates of Rs 2,261 crore.The bank's net loans grew 18 percent, it had said in its quarterly update earlier this month, outpacing a 14 percent growth in deposits.On April 25, IndusInd's shares closed 1.5 percent higher at Rs 1,496.85 apiece.The bank's gross non-performing asset (NPA) stood at 1.92 percent, down from 1.98 percent recorded in the same quarter last year. On the other hand, net NPA for the quarter stood at 0.57 percent, improving from 0.59 percent on a year-on-year basis.On April 25, the bank also declared a dividend of Rs 16.50 per equity share.\n       ",
    "Private sector lender IndusInd Bank's asset quality improved in the January-March quarter, with gross non-performing assets (GNPAs) easing to 1.92 percent from 1.98 percent in the preceding quarter.Net NPAs, too, declined to 0.57 percent of net advances from 0.59 percent in the previous quarter, the private sector lender said on April 25.The bank reported a provision coverage ratio of 71 percent. Provisions and contingencies for the quarter were at Rs 3,885 crore , down 13 percent from the year-ago quarter.Total loan related provisions stood at Rs7,210 crore, which is 2.1 percent of the loan book.During the January-March period, the bank reported a net profit of Rs 2,349 crore, a 15 percent jump from the year-ago period. Net profit at Rs 2,349 crore beat the market estimates of Rs 2,261 crore.Its net loans grew 18 percent, the bank said in its quarterly update earlier this month, outpacing a 14 percent growth in deposits.Net interest income, the difference between interest earned and paid, rose 15 percent to Rs 5,376 crore. The net interest margin of the lender stood at 4.26 percent against 4.28 percent last year.Operating expenses increased by 24 percent to Rs 3,803 crore.The bank’s Total Capital Adequacy Ratio (CRAR), as per Basel III guidelines, stood at 17.23 percent compared to 17.86 percent in the previous year. Tier 1 CRAR was at 15.82 percent against 16.37 percent in the year-ago quarter.Risk-weighted assets were at Rs 3,83,660 crore against Rs 3,37,036 crore a year ago.The IndusInd stock ended the day 1.5 percent higher at Rs 1,496.85.\n       ",
    "Private sector lender IndusInd Bank on April 25 reported a net profit of Rs 2,349 crore for the January-March quarter of financial year (FY) 2023-24, which marks a 15% jump as compared to Rs 2,043 crore clocked in the year-ago period. The net profit, at Rs 2,349 crore, is beating the market estimates of Rs 2,261 crore.The bank's net loans grew 18%, it had said in its quarterly update earlier this month, outpacing a 14% growth in deposits.On April 25, IndusInd's shares closed 1.5% higher at Rs 1,496.85 apiece.The bank's gross non-performing asset (NPA) stood at 1.92%, down from 1.98% recorded in the same quarter last year. On the other hand, net NPA for the quarter stood at 0.57%, improving from 0.59% on a year-on-year basis.On April 25, the bank declared a dividend of Rs 16.50 per equity share of Rs 10 face value.Net interest income - the difference between interest earned and paid - rose 15% to Rs 5,376 crore. The net interest margin of the lender stood at 4.26 percent versus 4.28 percent last year.Sumant Kathpalia, MD & CEO, IndusInd Bank said: \"We are looking at growing our branches from the existing 2,800 to 3,500 in the next two years. Our operating expenses jumped in FY24 and we hired around 11,000 employees in FY24. Our total expense in IT is around 8-10% of our total cost to income.\"Operating expenses for the quarter ended March 31, 2024 increased by 24% to Rs 3,803 crores as against Rs 3,066 crore for the corresponding quarter of previous year. \n       ",
    "IndusInd Bank is likely to clock 11 percent year-on-year (YoY) growth in net profit to Rs 2,261 crore in the January-March quarter (Q4FY24), backed by healthy interest income, as per average estimate of five brokerages. Net interest income is expected to see 18 percent YoY rise to Rs 5,496 crore, driven by strong credit growth.IndusInd Bank is slated to report Q4 results on April 25, 2024. So far this year, the stock of this private lender has declined over seven percent, underperforming three-percent gain in the benchmark Nifty 50 index.ALSO READ: Buy IndusInd Bank; target of Rs 2000: ICICI SecuritiesLoan growth to outpace IndusInd Bank's deposits, say analystsIndusInd Bank's loan growth is likely to outpace deposit trends, with the former pegged to rise by 17.5 percent YoY, while the latter is expected to climb by 14 percent YoY in Q4FY24, said analysts at Motilal Oswal.At a time when financial majors are grappling with margin pressure due to higher cost of funds, analysts at Prabhudas Lilladher expects IndusInd Bank's margins to be stable among peers. They expect the lender's net interest margins (NIMs) to expand by 20 basis points (bps) to 4.83 percent in Q4FY24 from 4.62 percent in the year-ago period.ALSO READ: India's IndusInd Bank pilots cenbank's e-rupee payments program with farmersModerating credit costs to improve IndusInd's asset pictureIndusInd Bank's Asset-quality, too, is pegged to remain stable in the January-March quarter amid steady credit costs. Credit costs are expected to contract by 25 bps to 1.17 percent in Q4FY24 from 1.42 percent in the year-ago period, outlined Prabhudas Lilladher analysts.IndusInd's gross net performing assets (GNPAs) is likely to moderate to 1.9 percent in Q4FY24 from 2 percent in Q4FY23, while net non-performing assets (NNPA) is seen at 0.5 percent in Q4FY24 from 0.6 percent in the year-ago period, said analysts at Motilal Oswal.Following the release of IndusInd's Q4 results, investors can watch out credit cost trends, asset quality outlook, margin trajectory, and growth outlook.In the March-ended quarter, foreign institutional investors (FIIs) have trimmed their stake in IndusInd Bank to 40.25 percent from 42.47 percent. Mutual funds, however, have upped their stake to 17.82 percent in the March quarter from 15.63 percent in December quarter.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. \n       ",
    "India’s IndusInd Bank said on Monday it has executed transactions to pay farmers for carbon credits with a programmable version of the Reserve Bank of India’s digital currency, or e-rupee.The RBI piloted its central bank digital currency (CBDC), which uses distributed-ledger technology, in 2022 and allows banks to offer these tokens.IndusInd is providing a platform for farmers to exchange their carbon credits for CBDCs. Earlier, the farmers could only exchange their credits for fiat rupees.The private lender conducted the project with 50 farmers in India’s Maharashtra state and plans to expand it, it said in an exchange filing.\"This project involves IndusInd Bank crafting digital wallets and managing CBDC transfers,\" it said.The RBI has been working with lenders to introduce new features to popularise the digital currency, Reuters reported in September last year.\n       ",
    "Quick commerce platform Swiggy Instamart has inked partnership with Parking solutions provider Park+ for the home delivery of IndustInd FASTag under 10 minutes, according to a statement.This will be a first for a quick commerce platform through which users can enjoy the convenience of directly receiving FASTags to their doorstep, Swiggy said in a statement.The service will be available across 25 cities in the country, including Mumbai, Bangalore, Delhi NCR, among others.“The key advantage of purchasing a FASTag on Swiggy Instamart is the seamless integration with Park+ and IndusInd Bank as the issuing partner,” the quick commerce platform said.FASTag has seen a steady rise in adoption with with over 79.8 million FASTags issued in India as of November 2023.“With Park+’s smart parking and vehicular management systems, users can digitally pay at a toll, or a parking spot at a mall, corporate park, or movie hall using FASTag. No cash transaction is required,” the company said.Phani Kishan, head of Swiggy Instamart said, “FASTag stands for seamless payment and convenience, and access to it should be the same. With FASTag now available on Swiggy Instamart, users can procure it anytime, anywhere, slashing delivery wait time from days to under 10 minutes.”Commenting on the partnership, Amit Lakhotia, founder & CEO, Park+, said, “Our robust relationship with IndusInd bank allows us to deliver IndusInd FASTags to customers in less than 10 minutes, thanks to Swiggy Instamart. Furthermore, we are also working with relevant FASTag issuing partners to educate users about FASTag buying/renewal/recharge, etc.” \n       ",
    "Sharekhan's research report on IndusInd BankThe ability to manage NIMs in the current environment along with being a key beneficiary in the interest rate reversal cycle would keep the sentiment positive. Key focus is on strengthening the liability franchise and delivering sustained healthy growth. Return ratios have reasonable support from lower credit costs at this stage of the cycle. The stock trades at 1.6x/1.4x its BV estimates for FY2025E/FY2026E. Valuations are attractive given the RoA trajectory and stable outlook. Key monitorable – Promoters awaiting approval from the RBI to increase their stake.OutlookWe reiterate Buy on IndusInd Bank (IIB) with an unchanged PT of Rs. 1,850. The near-term business outlook remains comfortable except for the elevated cost ratios.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.IndusInd Bank - 27032024 - khan ",
    "ICICI Securities research report on IndusInd BankWe believe IndusInd Bank (IIB) is well placed on growth, NIM and asset quality troika. The bank has delivered the highest CAGR in retail deposits, which should sustain, fuelling superior ~18% CAGR in loans. NIM is likely to remain stable, resulting in sector leading ~16/17% CAGR in NII / PPOP for FY24-26E. The bank has ~5-15bps improvement scope in each of NIM, opex to assets and credit costs over FY24-26E. Yet, we are conservatively factoring cumulatively <10bps RoA expansion to ~1.9% (FY25-26E) as we believe the bank would be re-investing in franchise and/or enhance cushion on credit costs and/or elongate growth trajectory.OutlookWe acknowledge the current tight funding environment and thus our target multiple does not embed material growth component. Retain BUY with an unchanged TP of INR 2,000.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.IndusInd Bank - 22032024 - isc ",
    "IndusInd Bank on March 11 announced the launch of its contactless payments wearable ‘Indus PayWear’, touted to be India's first all-in-one tokenizable wearable for both debit and credit cards. The offering will be exclusively available for Mastercard holders now, but will soon be extended to other card networks as well, the private sector lender said.“Indus PayWear is all set to revolutionize the payment experience by allowing users to effortlessly tokenize their IndusInd Bank credit or debit card onto a chip-enabled wearable device,” the bank said. This, they said, will help facilitate swift and secure tap-and-pay transactions at any contactless point-of-sale (PoS) terminal across the globe, eliminating the need for carrying a physical card or using a payment app to make a purchase.The payment wearables will be available in three styles, i.e., ring, watch clasp, and stickers, and will be priced between Rs 499 and Rs 2999.The Indus PayWear mobile app will allow Indus PayWear users to opt for seamless DIY setup of the cards on the wearable. The dedicated mobile application will also allow customers to easily switch between cards. Additionally, the app provides transaction monitoring and efficient management/blocking of the wearable device for enhanced security. “Security is paramount in the design of IndusPayWear, utilising advanced tokenization technology that replaces actual card details with unique 'tokens’ to bolster the safety and security of every transaction conducted through the wearable,” the bank explained.Notably, Indus PayWear transactions will offer the rewards and security of the underlying debit or credit card. While transactions below Rs 5000 will require a simple tap-and-pay function, transactions exceeding Rs 5000 will necessitate the added security of the PIN of the linked card to be entered on the PoS machine. This provision has been included as per RBI guidelines.Commenting on the product launch, Sumant Kathpalia, Managing Director & CEO, IndusInd Bank, said, “At IndusInd Bank, it has been our constant endeavour to bring forth innovative propositions that can accelerate the shift to a friction-free digital economy. With the rapid growth of contactless payments and its acceptance across the globe, we are glad to introduce Indus PayWear that stands as a symbol of our unwavering commitment to shaping a seamless and secure future of payments for our customers.”Gautam Aggarwal, Division President, South Asia, Mastercard, said, “Mastercard is pleased to collaborate with Induslnd Bank for its range of contactless wearables, Indus Paywear, that aims to deliver unparalleled flexibility, convenience, and security to users. It is a fine example of how Mastercard leverages its expertise in tokenizing transactions based on individual requests and device specifications and allow consumers the power to choose between and make payments using their favourite wearable device”.\n       ",
    "Surpassing the key resistance level of 22,300, which was also the previous week’s high, the Nifty showed investor confidence and a bullish momentum. This upward trend resulted in a notable 0.75 percent gain on the Nifty 50 for the week, highlighting the strength of the bullish trend.Any moderate market dip should be viewed as a buying opportunity. A close below the 22,000 level in the upcoming week could signal weakening bullish sentiment, potentially prompting a retest of the 21,800 support level.The levels to watch out for in the current week would be 22,500 - 22,600 on the higher side, and 22,000 - 21,800 on the lower side.Therefore, traders are advised to monitor key support and resistance levels closely and remain flexible in their trading strategies. Being prepared to adapt to changing market conditions is crucial for navigating shifts in sentiment and seizing opportunities while managing risks effectively.Bank NiftyBank Nifty saw a substantial bounce of over 1,600 points after finding support at the 100-day exponential moving average (DEMA), coincidentally marking a 0.618 percent retracement of its previous upward movement. This rebound was notable, resulting in a weekly gain of 1.02 percent, indicating renewed buying interest at lower levels. This suggests that despite fluctuations, there remains underlying confidence and demand for banking stocks.It is essential now to closely monitor the performance of Bank Nifty. The index must maintain support at the 46,500 level this week to sustain its bullish momentum. If it manages to hold above this level, there's potential for it to test 48,000 level, signaling further upward movement.However, failure to maintain support at 46,500 could lead to additional selling pressure, potentially pushing Bank Nifty towards the next support level at 46,000.Here are three buy calls for next 2-3 weeks:Piramal Enterprises: Buy | LTP: Rs 935 | Stop-Loss: Rs 865 | Target: Rs 1,055 | Return: 13 percentIn September 2023, PEL reached its zenith, soaring to nearly Rs 1,140. However, it subsequently endured a substantial downturn of 26 percent. Presently, the stock seems to have discovered a level of support within the bracket of Rs 840-900, suggesting a potential stabilization in its price movement.Notably, recent market observations have unveiled the formation of a double bottom pattern on the daily chart, accompanied by bullish divergence—a promising indication for traders. This confluence of technical signals presents an enticing opportunity for market participants.In light of these developments, traders are advised to contemplate initiating long positions within the range of Rs 920-940. The anticipated target for this bullish trade is positioned at Rs 1,055, representing a potential upside opportunity. To manage risks effectively, it is recommended to set a stop-loss level at Rs 865, to be evaluated based on daily closing prices.Kotak Mahindra Bank: Buy | LTP: Rs 1,724 | Stop-Loss: Rs 1,665 | Target: Rs 1,820 | Return: 5.6 percentFollowing a peak close to Rs 1,926 level, Kotak Mahindra Bank underwent a substantial decline of around 10 percent in its value. However, in the past month, the bank has established a prolonged bottom around the 1.13 harmonic ratio. Interestingly, a bullish AB=CD pattern has also emerged near the aforementioned ratio, providing further bullish confirmation.Additionally, on the indicator front, there is a bullish divergence observed on the daily stochastic (please refer to the chart), indicating a positive outlook for the stock. Consequently, one may consider buying in the range of Rs 1,705-1,730 with an upside target of Rs 1,820 and a stop-loss set at Rs 1,665.IndusInd Bank: Buy | LTP: Rs 1,526 | Stop-Loss: Rs 1,475 | Target: Rs 1,600 | Return: 5 percentAfter reaching a peak near the Rs 1,695 mark, IndusInd Bank experienced a significant downturn of approximately 15.75 percent in its price. However, over the last two months, IndusInd has formed a triple bottom structure between the 100 and 200-day exponential moving averages (DEMA), presenting an enticing opportunity at its current position.Recent trading activity has seen IndusInd Bank breaking through the bear trendline while simultaneously showing bullish divergence on daily stochastics, indicating a favourable outlook for the stock.Consequently, investors may consider initiating fresh long positions within the range of Rs 1,505-1,530, with an upside target of Rs 1,600. To manage risk, a stop-loss order could be placed near Rs 1,475 on a daily closing basis.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Given the decisive breakout of consolidation range with the market hitting a new historic high at the start of March F&O series, bulls took a control over bears and Dalal Street. Hence, experts expect the Nifty 50 to climb towards 22,500-22,600 zone in the coming session, with immediate support at 22,200, followed by key support at 22,000 mark.On March 1, the Nifty 50 jumped over 350 points or 1.7 percent to 22,339 and formed long bullish candlestick pattern on the daily charts with above average volumes, while the BSE Sensex rallied 1,245 points or 1.7 percent to 73,745.But the gains in broader markets were less compared to benchmarks. The Nifty Midcap 100 index was up 0.9 percent and Smallcap 100 index rose half a percent, while the market breadth was positive as two shares advanced for every declining share on the NSE.Stocks that recorded better performance compared to benchmarks and broader markets included Tata Steel, IndusInd Bank, and Jindal Steel & Power. Tata Steel climbed 6.5 percent to Rs 149.95, the highest closing level since August 17, 2021, and formed robust bullish candlestick pattern on the daily charts with significantly higher volumes.IndusInd Bank smartly defended its 200-day EMA (exponential moving average) many a times in the recent past. The stock has seen a breakout of downward sloping resistance trendline and climbed 3.5 percent to Rs 1,526.65, forming long bullish candlestick pattern on the daily scale with above average volumes.Jindal Steel & Power has also seen a decisive breakout of falling resistance trendline and recorded 6 percent rally to end at new closing high of Rs 822.85. The stock has formed robust bullish candlestick pattern on the daily timeframe with strong volumes, while it traded above all key moving averages.Here's what Jigar S Patel of Anand Rathi Shares & Stock Brokers recommends investors should do with these stocks when the market resumes trading today:Tata SteelOver last few months, Tata Steel has experienced a remarkable rally, with its stock price surging approximately 36 rupees, leading to a notable return of 31 percent within this short period. This rapid ascent has undoubtedly enhanced the appeal of the stock, drawing attention from investors enticed by its recent upward trajectory.However, despite the current attractiveness of the counter, it is imperative to exercise caution due to the significant resistance looming around the 150-155 range, primarily identified through the presence of a bearish AB=CD pattern as depicted in the chart analysis.Therefore, initiating fresh long positions at this juncture is not advisable. For individuals who have already entered the market, it is prudent to consider booking profits and adopting a wait-and-see approach, anticipating a meaningful correction in the stock's price before contemplating further investment actions.Jindal Steel & PowerIn the preceding four-month period, Jindal Steel has undergone a substantial uptick in its stock valuation, marked by an impressive surge of approximately 241 rupees. This surge, constituting a remarkable 42 percent return within this condensed timeframe, positions the company as an appealing option for investors seeking considerable profitability.The pronounced upward trajectory in the stock's performance has undeniably seized the attention of investors, enticing them with the potential for lucrative returns driven by the recent surge in momentum. However, amidst the allure of the current stock trajectory, a cautious stance is warranted.In-depth analysis of the chart data reveals a significant resistance zone spanning Rs 830-840 range, notably characterized by the presence of a bearish AB=CD pattern. This technical indication signals potential obstacles for further upward mobility in the stock price.Consequently, it is not advisable to initiate fresh long positions at this juncture. For investors who have already established positions, prudent consideration should be given to capitalizing on profits and exercising patience. One should wait for a substantial correction in the stock's price.IndusInd BankAfter reaching a peak near Rs 1,695 mark, IndusInd Bank experienced a significant downturn of almost 267 rupees, representing a substantial drop of approximately 15.75 percent in its price. However, over the last two months, the stock has formed a triple bottom structure between the 100 and 200-day exponential moving averages (DEMA), presenting an enticing opportunity at its current position.Recent trading activity has seen IndusInd breaking through the bear trendline while simultaneously showing bullish divergence on daily stochastics, indicating a favourable outlook for the stock. Consequently, investors may consider initiating fresh long positions within the range of Rs 1,505-1,530, with an upside target of Rs 1,600. To manage risk, a stop-loss order could be placed near Rs 1,475 on a daily closing basis.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "HDFC Bank group on February 6 received the Reserve Bank of India's approval to hike its stake up to 9.5 percent in six banks, including Yes Bank and IndusInd Bank, over the next one year.While this is sentimentally positive for the six stocks in the near term, it does not mean that HDFC's stake will necessarily go up to 9.5 percent in these lenders .We spoke to analysts and looked into past trends of such RBI approvals. Here is what we found:What is the RBI approval all about?The HDFC group as a whole, including HDFC Life, HDFC AMC and HDFC Ergo, can now acquire up to 9.5 percent stake each in six banks - IndusInd Bank, Yes Bank, Axis Bank, ICICI Bank, Suryoday Small Finance Bank and Bandhan Bank.A business group cannot hold more than 10 percent stake in a bank. Therefore, approvals are sought for 9.99 percent, the maximum limit.Despite the perceived intent, it does not mean that full 9.99 percent stake will be acquired. Since it does not make sense to seek RBI approval for every 1-2 percent stake, companies tend to ask for the maximum 9.99 percent.How much does the HDFC group currently hold in these banks?At the end of the December quarter, it held 3.43 percent in ICICI Bank, 2.57 percent in Axis Bank, 4.48 percent in IndusInd Bank and 3 percent in Yes Bank.Why is RBI approval needed?The RBI's approval is a must for anyone looking to acquire more than 5 percent stake in a bank as it is a highly regulated sector, said Vijay Singh Gour, lead analyst, Choice Broking.Also Read: China's market restrictions won't help, may be bad for EMs, no immediate impact on IndiaWhat is the validity of the approval?The approval is valid for a year and if HDFC fails to acquire the shareholding within that period, the approval stands cancelled.If the holding stands at sub-5 percent before the year-end, then RBI’s approval will be required again to increase it to 5 percent or more.Is this sign of merger?No. It is simply an approval for investment purpose, clarified Jignesh Shial of Incred Equities.Other examples...LIC on January 24 received the RBI's approval to acquire up to 9.99 percent in HDFC Bank. In December 2023, ICICI Prudential AMC got RBI nod to acquire 9.99 percent in Federal Bank.In October 2023, HDFC AMC got the RBI’s go-ahead to acquire 9.5 percent in DCB Bank, Equitas Small Finance Bank, The Federal Bank, Karur Vysya Bank and City Union Bank.Also Read: Credit growth to moderate to 13%; Paytm and lower-rated NBFCs at risk: Macquarie’s Suresh GanapathyAny instances where RBI approval has lapsed before a 9.9 percent stake acquisition?Yes. In November 2021, LIC got approval to hike stake in Kotak Mahindra Bank to up to 9.9 percent. A year later, its stake in the lender had gone up to 6.25 percent from 4.96 percent.In May 2023, SBI MF received similar approval for HDFC Bank. Three months to go for the validity to lapse and SBI MF holds about 5.57 percent stake in the bank.What does it mean for the six stocks?It is a sentimentally positive news, said Nitin Aggarwal, head–BFSI research, institutional equities, Motilal Oswal Financial Services. “Flows should come in over the medium term,\" he said.What do back-to-back RBI approvals indicate?Domestic institutions, including LIC, are eyeing to increase stake in private banks. Since October 2023, domestic institutions have created over Rs 1.4 lakh crore headroom to buy stakes.With the general election unlikely to throw a surprise and expectations of private capex picking up, domestic institutions are waiting on the sidelines to hike stakes in banks and financials.Banking stocks are seen as a reasonably valued bets at a time when the market sits on high valuations, analysts said.\n       ",
    "Amid raging speculation over the return of the BJP-led government for the third straight term and expectation of a pick-up in private capex, domestic institutions are waiting on the sidelines to raise their stakes in banks and financials. Banking stocks are seen as reasonably valued bets at a time when the market simmers on high valuations, said analysts.HDFC, ICICI, SBI as well as LIC are among the domestic institutions to have sought approval from the Reserve Bank of India for raising their stakes in banks up to 9.9 percent. This creates an additional headroom for purchases worth Rs 1.4 lakh crore over the next one year, with regulatory approvals in place.For the uninitiated, the RBI's prior approval is a must for anyone looking to acquire more than 5 percent stake in a bank as it is a highly regulated sector.The rush to get approvals for higher stakes started in October 2023 on expectations that the Fed’s pivot to lower rates will prompt foreign investors to come back to Indian markets in a big way.Also read: HDFC Bank Group gets RBI nod to acquire up to 9.5% stakes in Yes Bank, IndusInd & 4 othersThe most recent approval came on February 6 when HDFC group received the RBI nod to acquire up to 9.5 percent in six banks - IndusInd Bank, Yes Bank, Axis Bank, ICICI Bank, Suryoday Small Finance Bank and Bandhan Bank.LIC had earlier received the RBI go-ahead to buy 9.99 percent stake in HDFC Bank.Banking sector outlookAnalysts as well as fund managers are bullish on financials, especially private sector banks, as they continue to gain market share while maintaining healthy asset quality.Rating agency ICRA recently raised its projection of bank credit growth for FY24 to 14.9-15.3 percent from its earlier estimate of 12.8-13 percent.  For FY25, credit growth may temper to 11.7-12.6 percent, but it will still remain sizeable, ICRA said.Also read: Moneycontrol Poll | Bankers, economists expect MPC to leave repo rate unchanged on ThursdayICRA also expects the gross NPA (non performing assets) to decline to 2.1-2.5 percent and net-NPA to 0.5-0.6 percent by March 2025.On back of this, Pramod Gubbi, co-founder of Marcellus Investment Managers believes private sector banks, despite the recent underperformance, present an intriguing opportunity. \"These stocks have relatively low valuations compared to other sectors that have seen significant growth,\" he said.FII comeback to propel bank rallyWhen the Fed started hiking rates in 2022, foreign investors sold around $17 billion of Indian equities. This, combined with the influx of domestic money, took the overall FII stake in Indian markets to a decadal low.Also read: Eye on elections: Will FIIs flock to India and front-end investments?According to a recent report by ICICI Securities, FII stake in Indian markets fell to 16.5 percent as of November 2023, hitting its lowest since 2012, while it had peaked at 20.18 percent in 2009.Financials, with a weightage of more than 33 percent in the Nifty 50, will be the first hunting ground for FPIs when they resume their purchases in Indian markets in a big way, believe analysts.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. "
]