[
    "The Indian economy is likely to sustain its high growth trajectory in FY2024-25, driven by strong momentum in fixed investments and a pickup in private consumption, said conglomerate ITC in its latest annual report.Besides, there are \"green shoots of recovery in rural markets\", improving employment conditions and sustained momentum in manufacturing and services sectors, which augur well for consumption demand in the near term, it added.The growth would also be supported by a good Rabi harvest and normal monsoons, according to the ITC annual report for FY 2023-24.\"India continues to be acknowledged as one of the fastest growing major economies in the world with significant headroom for growth over the medium and long-term benefiting from a slew of purposeful interventions over several years,\" it added.Factors like favourable demographic profile, increasing affluence, rapid urbanisation and accelerated digital adoption represent some of the key structural drivers of growth of the Indian economy.\"Multi-dimensional interventions undertaken by the Government of India towards the expansion of physical and digital public infrastructure, enhancing the competitiveness of the manufacturing sector, indirect/direct taxation and financial sector reforms along with measures to promote ease of doing business are expected to power the economy going forward,\" it said.Moreover, stepped-up capital expenditure outlay and focus on infrastructure are expected to drive growth in domestic manufacturing, and focus on agri-related schemes are likely to boost farmers' welfare and rural consumption demand, spurring a virtuous investment employment-consumption cycle, it added.The Kolkata-headquartered company said the agricultural sector is pivotal to the Indian economy.Steps like enhancing agricultural productivity and value addition to international standards while improving market linkages simultaneously remain critical to strengthening the competitiveness of the agri sector and increasing farmers' income.Meanwhile, the report also highlighted that the Indian economy \"contends with uncertainties\" in the external environment and policy interventions focused on supporting sustainable livelihoods and fostering inclusive growth augur well for the economy.\n       ",
    "Net Sales at Rs 17,922.70 crore in March 2024 up 1.63% from Rs. 17,634.89 crore in March 2023.Quarterly Net Profit at Rs. 5,120.55 crore in March 2024 down 1.06% from Rs. 5,175.48 crore in March 2023.EBITDA stands at Rs. 7,310.05 crore in March 2024 up 1.06% from Rs. 7,233.65 crore in March 2023.ITC EPS has decreased to Rs. 4.10 in March 2024 from Rs. 4.17 in March 2023.ITC shares closed at 425.60 on June 27, 2024 (NSE) and has given -6.76% returns over the last 6 months and -4.51% over the last 12 months.",
    "",
    "Net Sales at Rs 16,579.29 crore in March 2024 up 1.11% from Rs. 16,397.98 crore in March 2023.Quarterly Net Profit at Rs. 5,020.20 crore in March 2024 down 1.31% from Rs. 5,086.86 crore in March 2023.EBITDA stands at Rs. 6,961.23 crore in March 2024 up 0.08% from Rs. 6,955.70 crore in March 2023.ITC EPS has decreased to Rs. 4.02 in March 2024 from Rs. 4.10 in March 2023.ITC shares closed at 423.30 on June 25, 2024 (NSE) and has given -7.26% returns over the last 6 months and -5.03% over the last 12 months.",
    "KR Choksey's research report on ITCFor Q4FY24, ITC reported consolidated gross sales of INR 194,465 Mn, a growth of 2.0% YoY while flat on a sequential basis. Gross sales were in line with our estimate. For FY24, gross sales were marginally lower YoY (-0.4% YoY) at INR 768,405 Mn. For Q4FY24 EBITDA was at INR 66,262 Mn. EBITDA was 1.6% lower than our estimate due to higher other expenses. PAT at (-1.1% YoY/ -4.0% QoQ) to INR 51,206 Mn due to higher tax and D&A expenses. For FY24, PAT grew by 6.6% YoY to INR 204,588 Mn. Exceptional item for the quarter includes INR 21 Mn related to the demerger of the Hotel business. Adj. PAT for the quarter grew by 0.4% YoY and declined by -4.1% QoQ to INR 51,226 Mn while for FY24, it grew by 7.0% YoY to INR 204,664 Mn. We reduce our FY26 Adj. EPS by 3.6% due to lower Agri and paperboard revenues amidst macro pressures.OutlookWe apply SOTP approach and maintain our multiples (cigarette business at 15.2x EV/EBITDA, Hotels at 17.3x, Paper business at 4.1x, Agri business at 4.5x, and FMCG at 8.2x EV/Revenue) and arrive at a target price of INR 517/share (previously: INR 533). We maintain our \"BUY\" rating on ITC Ltd.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.ITC - 14062024 - kr ",
    "Motilal Oswal's research report on ITCITC's Cigarette and FMCG performance was healthy, while the nonconsumer business (Paper and Agribusiness) remained weak. Consolidated revenue grew 2% YoY (est. +4.5%). The Cigarette revenue increased 7.5% YoY, with volume growth of ~2% YoY (in line), price hikes of 3-4%, and remaining through mix improvement. The premium cigarette segment continued to outperform, while the value segment remained weak. The Paper business was hit by demand issues, competition from China,lower pulp prices, and higher input costs. Both revenue and margin were weak; however, a gradual recovery is likely in FY25. Agribusiness continued to see a contraction in FY24, due to trade restrictions on agri-commodities. Hotels posted a robust performance, with strong ARR and occupancy. Reiterate BUY with an SOTP-based TP of INR515 (based on 28x FY26E P/E).OutlookThe resilient nature of its core business, amid an uncertain industry environment, and its 3-4% dividend yield make ITC a good defensive bet in the ongoing volatile interest rate environment. Reiterate BUY with an SOTP-based TP of INR515 (based on 28x FY26E P/E).For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.ITC_11062024_Motilal Oswal ",
    "ITC shares gained over 1 percent to Rs 434 apiece on June 6 after shareholders approved demerger of the conglomerate's hotel business. Around 99.6 percent shareholders voted in favour of demerger, while just 0.4 percent voted against it, ITC said in a stock exchange filing.So far this year, shares of ITC declined over 5 percent, underperforming 4 percent rise in the benchmark Nifty 50 index. Earlier, ITC had hit 52-week high of Rs 499 per share on July 24, 2023.Catch all the market action in our LIVE blog\"The resolution for approval of scheme of arrangement amongst ITC and ITC Hotels and their respective shareholders and creditors passed notice dated April 30, 2024 through remote e-voting and e-voting,\" ITC said in an exchange filing.In the January-March quarter (Q4FY24), ITC saw net profit decline 1.31 percent year-on-year (YoY) to Rs 5,020 crore, while revenue rose modestly by 1.4 percent YoY to Rs 17,752 crore.ALSO READ: ITC Q4 results: Net profit falls 1.3% to Rs 5,020 crore, final dividend declaredThe company recommended a final dividend of Rs 7.50 per ordinary share for the financial year ending March 31, 2024.ITC's hotels segment achieved record high revenue and profits during the quarter, supported by strong RevPar growth from retail, MICE, and marquee events. Segment revenue grew 15.6 percent YoY to Rs 2,989 crore in Q4FY24 and EBITDA was up 26.2 percent YoY to Rs 1,049 crore.Following its Q4 results, analysts at Centrum shared a 'buy' rating for ITC with a target price of Rs 536 per share. \"With value unlocking in hotel demerger, we expect investor’s focus to shift on core fundamentals of the business such as growth momentum and margin trajectory,\" the brokerage firm said.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Minority shareholders are expected to benefit from the demerger of ITC's hotel business into a separate entity, ITC Hotels, as it may unlock value for them, and improve return ratios of the FMCG major, as per reports of four proxy advisory firms.The reports from proxy advisory firms, including InGovern Research Services, ISS and SES, come ahead of the June 6 meeting of shareholders of ITC to consider and approve the demerger proposal.According to proxy advisory firm ISS, the demerger may unlock value for its shareholders and improve ITC's return ratios.\"The structure will enable ITC Hotels to operate with an optimal capital structure with the ability to access capital to fund its growth requirements.\"It can attract the right set of investors, strategic partners and collaborations whose investment strategies are more sharply aligned with that of the hospitality industry,\" ISS said in its report.Last year in August, ITC board had approved the demerger of its hotels business into a separate entity. Shareholders of ITC will get one share in the soon-to-be-listed hotel entity for every 10 shares they hold in the company.Highlighting the benefit of demerger, another advisory firm InGovern said that the current ITC shareholders will receive a direct stake in a dedicated, publicly traded hotel entity, becoming shareholders of a specialised company focused solely on the hotel business.This move aligns with ITC's corporate strategy of fostering multiple growth drivers, ensuring continued interest in the hotel sector, and protecting against potential hostile takeovers in the future, it said.\"Given the clean swap of shares which is beneficial for the minority shareholders as well as for the growth of both the companies, we recommend shareholders vote for this scheme of arrangement,\" it said.Proxy advisory firm SES is of the view that the decision to keep 40 per cent stake with ITC, is a strategic decision to give stability and allow fair discovery of price and is in interest of shareholders. SES does not identify any major concern with regard to the proposed demerger.Another proxy advisory firm Glass Lewis, has also recommended the proposed demerger scheme.However, Institutional Investor Advisory Services (IiAS) has suggested shareholders of ITC Ltd to vote against the proposed demerger of the hotel business on the grounds that it does not provide complete value unlocking for shareholders.\n       ",
    "Prabhudas Lilladher's research report on ITCITC EBIDTA de-grew by 0.8% on ~2.1% volume growth and 160bps YoY and 50bps QoQ margin decline in cigarettes due to higher leaf tobacco prices and only calibrated price increases and pricing and input cost inflation in paper business. FMCG EBIDTA margins of 11.6% (15% EBIT de-growth ex of PLI gains in 4Q23) whereas 33.8% EBIT growth in hotels have been positive. Demand scenario remains mixed with mass segment under pressure across cigarettes and FMCG. We expect ~4% cigarette volume growth in FY25/26 in a steady state while FMCG will continue to expand margins by ~80-100bps annually. Although Hotels have, a high, base, strong demand will continue to drive growth. We expect paper margins to improve post 2Q only given high base in 1Q and tough operating environment. Agri business margins will expand in 2H25 only due to high leaf tobacco prices. We are largely retaining our estimates and estimate 7.3% EPS CAGR over FY24-26.OutlookITC trades at 26x FY26 EPS with ROE/ROCE of 31.1/41.2% and ~75%+ dividend payout. We assign SOTP based target price of Rs491 (Rs488 earlier) as we roll forward to FY26. We expect returns to be driven by cigarette volume numbers and budget outcome in July. Retain Accumulate.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.ITC - 29052024 - prabhu ",
    "Net Sales at Rs 19,446.49 crore in March 2024 up 10.27% from Rs. 17,634.89 crore in March 2023.Quarterly Net Profit at Rs. 5,120.55 crore in March 2024 down 1.06% from Rs. 5,175.48 crore in March 2023.EBITDA stands at Rs. 7,310.05 crore in March 2024 up 1.06% from Rs. 7,233.65 crore in March 2023.ITC EPS has decreased to Rs. 4.10 in March 2024 from Rs. 4.17 in March 2023.ITC shares closed at 431.50 on May 27, 2024 (NSE) and has given -0.86% returns over the last 6 months and -3.92% over the last 12 months.",
    "Three proxy advisory firms are mixed on their view on ITC's proposed demerger and separate listing of the hotels business.InGovern and Stakeholders Empowerment Services (SES) recommended shareholders vote in favor, whereas Institutional Investor Advisory Services (IiAS) advised voting against the resolution.Follow our market blog to catch all the live updates“The proposed structure, while designed to improve ITC’s ratios, provides neither a complete value unlocking for shareholders nor does it materially reduce any capital support responsibilities for the hotel business from ITC,” said IiAS, as it does not foresee the demerger unlocking any substantial value for ITC's hotel business.IiAS pointed out that the board of directors has not clarified their intentions for the 40 percent stake in the hotels business. It remains uncertain whether they plan to sell this equity to a strategic buyer or keep it. IiAS is asking the management for more details on this issue.\"While [the demerger] partially unlocks value, capital support will likely continue to be provided by ITC to the hotels business in its capacity as a Promoter,\" IiAS addedSES sees no concern regarding the valuations of ITC Hotels. It said, “Since ITC Hotels will have mirror shareholding (60 percent of ITC) and balance will remain with ITC, the valuation is immaterial at this stage. Further, as ITC Hotels will be listed value will be through a transparent price discovery mechanism. Hence, no concern is identified in this regard.”The hotel segment is the smallest in ITC's portfolio, contributing only 3 to 5 percent to its overall revenue. IiAS noted that the demerger is unlikely to yield significant synergies due to the modest revenue from the hotel business. Market analysts estimate the value of the new, independent entity to be between Rs 12 and Rs 23 per share.Also Read | ITC to convene meeting of shareholders to approve demerger of hotel biz on June 6ITC said on May 23 that after obtaining no-objection from stock exchanges, the National Company Law Tribunal (NCLT) has directed the company to convene a meeting of shareholders on June 6, 2024, to consider and approve the proposed demeger of its hotel business.On August 14, 2023, the board of directors approved the demerger of the hotels business, with an indicative timeline of listing of the new entity in about 15 months. The hotels business will have the license to use the ITC brand name.Under the demerger, shareholders will get one share of hotels business for every 10 shares held in ITC. ITC shareholders are to hold about 60 percent direct stake in ITC Hotels (proportionate to their stake in ITC) and the remaining 40 percent stake to continue with ITC.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Net Sales at Rs 17,752.87 crore in March 2024 up 8.26% from Rs. 16,397.98 crore in March 2023.Quarterly Net Profit at Rs. 5,020.20 crore in March 2024 down 1.31% from Rs. 5,086.86 crore in March 2023.EBITDA stands at Rs. 6,961.23 crore in March 2024 up 0.08% from Rs. 6,955.70 crore in March 2023.ITC EPS has decreased to Rs. 4.02 in March 2024 from Rs. 4.10 in March 2023.ITC shares closed at 441.35 on May 23, 2024 (NSE) and has given 0.23% returns over the last 6 months and 2.84% over the last 12 months.",
    "Brokerages maintained their bullish outlook in diversified conglomerate ITC, despite the hotels-to-cigarettes firm missing Q4 estimates.ITC reported a standalone net profit of Rs 5,020.2 crore for the March quarter, down 1.31 percent from the year-ago quarter, hit by flattish cigarette volumes and lower FMCG margins.The profit fell short of expectations. A Moneycontrol poll of six brokerages pegged ITC’s consolidated net profit at Rs 5,114 crore, up 0.5 percent. ITC's profitability was impacted by a one-time gain in the base-quarter.Revenue came in at Rs 17,752.87 crore, rising 1.40 percent from the corresponding quarter in the preceding fiscal.At 9.30 am, ITC shares were quoting Rs 440.65 on the NSE, lower by 0.1 percent compared to the previous session's close.Follow our market blog to catch all the live updatesDemand scenario remains mixed with mass segment under pressure across cigarettes and FMCG. Prabhudas Lilladher expects ~4 percent cigarette volume growth in FY25/26 in a steady state while FMCG will continue to expand margins by ~80-100 bps annually.The brokerage increased its target price on the player to Rs 491 from Rs 488 earlier, keeping its accumulate rating intact.Morgan Stanley maintained its outperform call on ITC, with a target price of Rs 506 apiece. The brokerage said that the cigarette revenue was better than its estimate, but the FMCG segment reported in-line earnings while the margins were improved for the hotels business.Better monsoons would improve prospects for ITC’s agricultural business and its cigarette margin outlook for FY26. Also, the paper segment is likely to see business and margin recoup in FY26.Emkay Global sees a growth of 10 percent in topline in FY26. However, the domestic brokerage cut its target price on ITC to Rs 510 per share, but maintained its buy call.The cigarette business' earnings and volume growth surprised Jefferies, as the positive surprise led to the segment's EBIT coming ahead of expectations. The acute pressure in the agri and paperboard segment caused an overall earnings miss, per Jefferies.A key factor to look out for will be the upcoming budget, that will be closely watched for any announcements related to taxation.ITC shares have traded flat over the past year, rising a mere 1.6 percent as against a 24 percent jump in the benchmark Nifty 50 index.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "The tobacco and FMCG major ITC said on May 23 that post obtaining no-objection from stock exchanges, the National Company Law Tribunal (NCLT) has directed the company to convene a meeting of shareholders on June 6, 2024 to consider and approve the proposed demeger of its hotel business.The update comes after ITC filed the Scheme of Arrangement for demerger with the tribunal, the company said in a regulatory filing today while announcing its quarterly earnings for the January-March period of FY24.The board of ITC had on August 14 last year approved the demerger of the hotels business, with an indicative timeline of listing of the new entity in about 15 months. The hotels business will have the license to use the ITC brand name.The Board had said that it has considered and approved the demerger of the hotels business under a scheme of arrangement amongst ITC and ITC Hotels and their respective shareholders and creditors under Sections 230-232 and other applicable provisions of the Companies Act, 2013.Under the demerger, shareholders will get one share of hotels business for every 10 shares held in ITC. ITC shareholders are to hold about 60 percent direct stake in ITC Hotels (proportionate to their stake in ITC) and the remaining 40 percent stake to continue with ITC. No cash consideration is payable under the demerger scheme.The company said that 100 percent economic interest will continue to be held by ITC shareholders in the hotels business.Meanwhile, the FMCG giant reported a standalone net profit of Rs 5,020.2 crore for the March quarter, down 1.31 percent from the year-ago quarter, hit by flattish cigarette volumes and lower FMCG margins.Revenue came in at Rs 17,752.87crore, rising 1.40 percent, the tobacco and FMCG major said in a regulatory filing on May 23.The company recommended a final dividend of Rs 7.50 per ordinary share for the financial year ending March 31, 2024. Combined with the interim dividend of Rs 6.25 per share declared on January 29, 2024, the total dividend for the year will be Rs 13.75 per ordinary share.Shares of ITC on May 23 were trading 0.34 percent higher at Rs 441.25 apiece on BSE during late trading session.\n       ",
    "During the week ended April 26, the market, particularly the Nifty 50, showed rangebound behaviour despite an initial gap-up opening on Monday. Throughout the week, it struggled to break free from this consolidation pattern, eventually closing with modest gains of approximately 1.23 percent. Despite attempts to breach the resistance at 22,600, the Nifty failed to sustain above it, and a sharp downturn in the final session led to the erosion of most of its gains.From a technical standpoint, the Nifty is trading within a rising channel pattern, suggesting potential bullish momentum if it manages to maintain levels above 22,300 in the current week, with a likely target range of 22,750-22,800.Additionally, the long-short ratio of foreign institutional investors (FIIs) stands at 39 percent, indicating limited downside potential.Looking forward, immediate resistance levels for the Nifty are projected at 22,700-22,800, and a decisive close above this range could trigger renewed buying interest in the index futures. Conversely, a breach of the support at 22,300 might intensify the selling pressure in the markets.As for the Nifty Bank index, it experienced a notable uptrend, rallying approximately 2,000 points from the low of 46,600 levels and ending the week with gains of about 1.32 percent. However, the breakout from the cup-and-handle pattern faced significant resistance in the 48,600-48,700 zone, notably near the previous top recorded on December 28, 2023 at 48,636.Surpassing the 49,000 level appears challenging for the Nifty Bank, with support seen at 47,700; a breach of this level could potentially trigger further selling in the index.Here are three buy calls for the next 2-3 weeks:Navin Fluorine International: Buy | LTP: Rs 3,310 | Stop-Loss: Rs 3,095 | Target: Rs 3,700 | Return: 12 percentFollowing its Double Top formation near the Rs 4,900-4,800 zone, Navin Fluorine has experienced a significant downturn, shedding 41 percent in price. However, in the last 5-6 trading sessions, it has found support near Rs 3,000 mark.Concurrently, a Bullish Crab pattern has materialized on Navin Fluorine's daily chart, signaling a potential reversal in trend. Moreover, \"regular bull divergence\"* has been identified on the relative strength index (RSI) daily scale, indicating strengthening bullish momentum.Based on these technical indicators, investors may consider initiating long positions within the range of Rs 3,270-3,320. The upside target for this trade is set at Rs 3,700. To manage risk, a stop-loss order should be placed near Rs 3,095, helping to limit potential losses in case the trade doesn't perform as expected.NOTE: If the price is making lower lows, but the oscillator is making higher lows, this is considered to be regular bullish divergence.ITC: Buy | LTP: Rs 440 | Stop-Loss: Rs 412 | Target: Rs 480 | Return: 9 percentAfter reaching a peak near Rs 475 mark on January 4, 2024, ITC has experienced a significant decline of approximately 16 percent. However, in the subsequent 18 trading sessions, ITC has shown stability by avoiding further declines and has instead consolidated within a range of Rs 400-416.Notably, in the previous trading session, there was notable buying interest observed at lower levels, accompanied by substantial trading volume. From a technical standpoint, the formation of a bullish AB=CD pattern on the daily chart of ITC within the mentioned price zone of Rs 400-416. Interestingly, this zone also coincides with the 0.382 percent retracement level of a price swing that occurred between January 2023 and July 2023, as indicated on the chart.Additionally, RSI weekly has reversed from 45 levels, which suggests a potentially lucrative buying opportunity.Thus, one can buy in the zone of Rs 430-440, with an upside target of Rs 480 and a stop-loss would be placed near Rs 412 on a daily close basis.Piramal Enterprises: Buy | LTP: Rs 926 | Stop-Loss: Rs 845 | Target: Rs 1,055 | Return: 14 percentIn September 2023, PEL reached its zenith, soaring to nearly Rs 1,140. However, it subsequently endured a substantial downturn, plummeting by 29 percent. Presently, the stock seems to have discovered a level of support within the bracket of Rs 820-850, suggesting a potential stabilization in its price movement.Notably, recent market observations have unveiled the formation of a Double Bottom pattern on the daily chart, accompanied by bear-trendline violation on weekly RSI —a promising indication for traders. This confluence of technical signals presents an enticing opportunity for market participants.In light of these developments, traders are advised to contemplate initiating long positions within the range of Rs 900-930. The anticipated target for this bullish trade is positioned at Rs 1,055, representing a potential upside opportunity.To manage risks effectively, it is recommended to set a stop-loss level at Rs 845, to be evaluated based on daily closing prices.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Foreign investors lowered their investments in FMCG firms in the March quarter as earnings could be blazed by simmering raw material prices.The foreign institutional investors (FIIs) cut down their holdings in Hindustan Unilever to 12.67 percent, bringing it to the lowest level since March 2020, down from 13.65 percent in the preceding quarter, while their exposure to ITC declined to 40.95 percent from 43.26 percent, according to the latest shareholding data.The FII ownership in Varun Beverages declined to 25.78 percent, marking a six-week low, compared to 26.57 percent in the previous quarter. Similarly, Britannia Industries saw a reduction from 18.99 percent to 18.23 percent. Dabur India also experienced a sequential decrease in FII ownership, down to 15.82 percent from 16.49 percent. Radico Khaitan saw its FII ownership decrease from 19.01 percent to 18.58 percent.Varun Beverages and Britannia Industries hit a six-week low in FII ownership, while Dabur India and Godrej Consumer Products recorded their lowest FII ownership since December 2015.Godrej Consumer Products saw a decline in FII stake to 22.56 percent from 22.94 percent, Tata Consumer's FII stake dipped to 25.46 percent from 25.62 percent, Marico's stake reduced to 25.55 percent from 25.69 percent, Colgate Palmolive India's stake dropped to 24.51 percent from 24.62 percent, and United Breweries Ltd saw a decline to 6.63 percent from 6.71 percent.FMCG firms face pressure from recent spikes in raw material prices like crude oil, palm oil, coffee, and cocoa, potentially halting their margin expansion. Companies are cautious about passing on costs to consumers to maintain competitiveness and sales volumes. Few analysts said that the era of margin expansion is over, with revenue growth expected to be slow because of rising raw material prices.Recent earnings reports show no significant volume recovery and highlight the challenge posed by rising raw material costs, which could potentially lower the consensus earnings estimates. HUL in its recent earnings urged investor patience amid continued sluggish volume growth in the FMCG sector. Q4FY24 sees a mere 2 percent increase, consistent with previous quarters, following a modest 3 percent rise in Q1.Nestle shares dropped sharply last week following a Swiss NGO report alleging higher sugar content in its baby food sold in developing countries compared to Europe. The Indian government plans to investigate, according to reports. Nestle responded, citing adherence to WHO codex and local requirements, and voluntary sugar reductions of up to 30 percent in some variants. They emphasised ongoing product review and reformulation to maintain nutrition, quality, safety, and taste.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "India's diversified entity ITC plans to open more hotels overseas with neighbouring countries and the Middle East as primary target markets after opening of its first international property here, company Chairman and Managing Director Sanjiv Puri said on Thursday.The company's arm ITC Hotels, which had opened 22 new properties in the last 24 months, plans to add another 70 hotels in the next five years in India as part of expansion plans in the hospitality sector. Besides the hotels business, the company will look for opportunities to expand the presence of FMCG and other verticals in new overseas markets as well.\"We are open to exploring opportunities that come about. I think we have strong credentials in hospitality which we can take outside India now. Very clearly at the moment the focus is on proximal markets, be it for hospitality, be it for FMCG…,\" Puri said here at a press conference after the opening of the 352-room luxury property, ITC Ratnadipa here. He said as the company explores and understands a place for a particular business, it may look at it as a market for other verticals as well.Citing the example of Nepal, Puri said,\"We started with other businesses and are now looking at hospitality (there). Here (in Sri Lanka) we have started with hospitality…as we explore and understand the place, we will look at possibilities in some of our other sectors as well.\" On overseas expansion of the hospitality business, while the company's focus is more on 'proximal markets', he said,\"We are open to it if there are some interesting opportunities beyond it. We will certainly be interested in pursuing that.\"When asked if ITC is looking at the Middle East as a market for the hospitality business, he said it is a vibrant economy right now with terrific growth plans and \"if opportunity comes our way then we will certainly explore that\". Puri also said the company will look to expand in more destinations in Sri Lanka going forward.\"This (opening of ITC Ratnadipa) is the starting point and yes, we want to expand and grow the economy and contribute to the development of tourism in Sri Lanka,\" he said. When asked about ITC's overall expansion plans in the hospitality sector, he said,\"We have a very healthy pipeline of 70 hotels in five years.\"All these 70 hotels are for the Indian domestic market and most of them will be the upscale segments. He, however, said \"(For) overseas we're just starting our journey. So we have not yet got to the stage to start putting a number right here.\"On investments planned for the overall expansion, he did not share a specific number but said \"between renovation and new properties will spend somewhere between Rs 700 crore to Rs 1,000 crore a year\". When asked about the progress of the demerger of ITC Hotels and its planned public listing, Puri said it is happening in line with the indicated timelines and is expected \"before the second half of this year or the end of this year\".At its new property here, the company had invested about USD 500 million. It was inaugurated on Thursday by Sri Lankan President Ranil Wickremesinghe. The ITC Ratnadipa or 'Island of Gems' has 352 guest rooms, suites and service apartments, each with private balconies with waterfront views.Earlier in the day, speaking at the opening of the new hotel, Puri said,\"It is very natural for us to specifically focus on markets in proximal areas, encouraged also by our Prime Minister's (Narendra Modi) vision of neighbourhood first where Sri Lanka has a very special position. ITC is deeply committed to growing our presence and contributing to hospitality in the region.\"\n       ",
    "Shares of ITC Ltd traded marginally higher in the opening hours on April 19 after ITC Infotech announced to buy 100 percent stake in a Pune-based IT firm.At 9:31am, ITC was quoting Rs 421.50, up Rs 2.55, or 0.61 percent, on the BSE.ITC Infotech India Limited, a wholly owned subsidiary of ITC, has entered into a share purchase agreement for acquisition of 100 percent of the share capital of Blazeclan Technologies Private Limited for Rs 485 crore, according to an exchange filing.The proposed acquisition will be completed in six to eight weeks, subject to completion of the customary closing conditions.This acquisition is expected to augment ITC Infotech’s capabilities to service its customers in a multi-cloud and hybrid cloud environment with focus on the partner eco-system to accelerate future growth.The acquisition is expected to strengthen ITC Infotech’s commitment to helping clients navigate their digital transformation journey and deliver business outcomes built on the foundation of strong Cloud capabilities.Catch all market action in our live blogBlazeclan is an AWS Premier Partner, Snowflake Elite Partner and a leader in providing Cloud transformation solutions to customers globally. Blazeclan has strong expertise in cloud migration, digital services, digital cloud consulting and Data Analytics & Insights.The share touched a 52-week high of Rs 499.60 and a 52-week low of Rs 396 on 24 July, 2023 and 19 April, 2023, respectively. Currently, the stock is trading 15.63 percent below its 52-week high and 6.44 percent above its 52-week low.\n       ",
    "ICICI Prudential Mutual Fund picked up Rs 5,822-crore shares in ITC in March, accounting for over two-thirds of the total MF buying in the Indian tobacco and FMCG conglomerate of Rs 8,560 crore for the month.ICICI Prudential bought around 13.85 crore shares in ITC in block deals valued at Rs 12,695 crore. As many as 32 other mutual funds bought around Rs 2,991-crore shares in ITC in March, while five sold some stake. One MF neither sold nor bought any stake.Some 38 mutual funds are now invested in ITC together holding shares worth Rs 62,063 crore, or 1.8 percent of the total assets under management (AUM).Apart from ICICI Prudential, Nippon, UTI, and DSP MF each bought shares worth over Rs 400 crore in ITC, while Kotak Mahindra and Axis MF bought around Rs 350 crore each. Aditya Birla, SBI MF invested around Rs 300 crore and Rs 200 crore.On March 13, British firm BAT, which makes Dunhill and Lucky Strike cigarettes, sold 43.68 crore shares in the Indian conglomerate for Rs 17,500 crore, bringing down its stake in ITC to 25.5 percent from 29 percent. The company said it would use the proceeds from the stake sale to buy back BAT shares.The stake sale prompted several foreign brokerages to upgrade the stock and raise their target prices. CLSA and HSBC upgraded ITC, despite citing market volatility, with a target of Rs 468, highlighting potential in cigarette premiumisation despite muted volumes. HSBC has a target of Rs 480 on attractive valuation, despite tax concerns after the block deal. Morgan Stanley expects the stock to rebound after BAT stake sale clears supply pressure.Apart from ITC, top picks for mutual funds in March included Tata Consultancy Services Ltd where they invested Rs 5,905 crore, HDFC Bank at Rs 4,604 crore, Reliance Industries at Rs 2,896 crore, Hindustan Unilever at Rs 1,753 crore, and Interglobe Aviation at Rs 1,752 crore. Bajaj Finance led sellers' pack, withdrawing Rs 1,778 crore. State Bank of India pulled out Rs 1,626 crore, Bharti Airtel Rs 1,458 crore, and ICICI Bank Rs 1,130 crore.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "British American Tobacco Plc. started a £1.6 billion ($2 billion) buyback program after selling part of its stake in India’s ITC Ltd.The maker of Lucky Strike cigarettes, Vuse vapes and Velo nicotine pouches said Monday that net proceeds of the ITC stake sale totaled £1.57 billion and that it will buy back as much as £1.6 billion of its own shares this year and next.The London-listed company said it will purchase £700 million of its shares in 2024 and £900 million by the end of 2025.It still owns a 25% stake in ITC, the Indian conglomerate that’s the country’s top cigarette maker and also runs a number of other businesses including food products and packaging.BAT has been under pressure to return more cash to shareholders. It recently took a writedown of more than £27 billion on the value of its US cigarette brands as more smokers give up the habit, with many switching to alternatives like vapes, nicotine pouches and heated tobacco sticks.After calls from an activist shareholder to exit its London listing, the company has ruled out a move to a US listing as it “would create a lot of distraction internally,” Chief Executive Officer Tadeu Marroco said in an interview with the Financial Times over the weekend.\n       ",
    "Sharekhan's research report on ITCMajor uncertainties hovering around the stock are over, as BAT has sold 3.5% stake in the company. BAT is unlikely to reduce its stake below 25%. Business fundamentals of ITC are intact with steady growth in the core cigarette business and non-cigarette FMCG business witnessing consistent improvement in EBITDA margins. Efficient capital allocation plan and strong dividend payout make it a preferred pick in the large-cap FMCG space with attractive valuations.OutlookWe reiterate our Buy on ITC with an unchanged PT of Rs. 515. Post the recent correction in the stock price, valuation at 22x/20x its FY2025E/FY2026E EPS looks attractive with favourable risk reward.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.ITC - 15032024 - khan ",
    "The market went into the red after a green sweep for five weeks in a row and fell more than 2 percent at the end on March 15. Given the nervousness in the Street, bears took the plunge, paving the road for more volatility with a negative bias in the coming sessions. Experts see support for the market barometer at 21,900-21,850 and, below this, the bears will have a wider room to run the riots. On the higher side, the Nifty may face resistance at 22,200-22,300 and a decisive close above this may charge the bulls to drive the index to record highs.For the week ended March 15, the Nifty 50 declined 470 points to 22,023 and formed a long bearish candlestick pattern which resembles Evening Star kind of a pattern (not the exact one) on the weekly charts with high volumes.On the downside, there are visible multiple bottoms on the hourly chart in the range of 21,900 to 21,850, coinciding with the 50EMA (exponential moving average), suggesting critical support, Rajesh Bhosale, technical analyst at Angel One said. \"Further decline below this level may trigger another round of significant selling, potentially pushing prices towards the previous swing low of 21,500, aligning with the 89EMA.\"Going ahead, he advised caution and asked traders to refrain from attempting to catch the falling knife and, instead, wait for clear bullish reversal signals before considering aggressive long positions.Jigar Patel, senior manager of equity research at Angel One, also feels that on the downside, 21,850 stands as a crucial support level, and a breach of this level might push the index towards the 21,600 level.The current breakdown would only be invalidated if the index closes above 22,200, said Patel, who feels the market uncertainty will likely dissipate by the end of the month, allowing the markets to resume their primary upward trend.Moneycontrol collated a list of top 10 stocks from experts, with 3-4 weeks perspective. The closing figure of March 15 is considered for the stock return calculation.Expert: Shrikant Chouhan, Head Equity Research, Kotak Securities.ICICI Prudential Life Insurance Company: Buy | LTP: Rs 567 | Stop-Loss: Rs 545 | Target: Rs 610 | Return: 7.4 percentAfter the remarkable up move of the last few sessions, the counter witnessed short-term correction from the higher levels. However, closing above the important retracement levels suggest bullish continuation chart formation.Therefore, the counter is likely to resume its uptrend from the current levels in the near term.L&T Technology Services: Buy | LTP: Rs 5,419 | Stop-Loss: Rs 5,210 | Target: Rs 5,790 | Return: 7 percentPost decline from the higher levels, the counter rebounded from its demand zone and witnessed a steady recovery from the lower levels. Additionally, on the daily charts, the counter has given a breakout from its sloping channel formation. The up moves in the counter suggest a new leg of bullish trend from the current levels.Bharti Airtel: Buy | LTP: Rs 1,220 | Stop-Loss: Rs 1,170 | Target: Rs 1,300 | Return: 7 percentThe counter is into a rising channel chart formation with a higher low series pattern on a consistent basis. After a sharp uptrend rally, the counter comfortably closed above its previous swing high. In addition, on daily charts the counter has formed bullish continuation chart formation, which indicates strong up move to persist in the near term.Expert: Riyank Arora, technical analyst at Mehta EquitiesUPL: Buy | LTP: Rs 475 | Stop-Loss: Rs 440 | Target: Rs 505 | Return: 6 percentThe stock has touched its major support mark of Rs 460 on its daily charts and is forming a potential double bottom reversal pattern. The overall volume in Friday's session was nearly 1.5 times the average (10-day) volume.At the current market price of Rs 475, the risk is minimal, and the stock is looking poised for a good upside move towards Rs 500 - Rs 505 zone.Action Construction Equipment: Buy | LTP: Rs 1,241 | Stop-Loss: Rs 1,190 | Target: Rs 1,330/1,420 | Return: 7 percentThe stock has successfully re-tested its anchor VWAP (volume-weighted average price) support mark of Rs 1,220 and managed to hold well above the same. From a broader perspective, the stock has a minor resistance near Rs 1,330 mark, above which the next hurdle would be somewhere near Rs 1,420 levels.On its hourly charts, the stock is forming a potential higher low at around Rs 1,200 levels. The risk-reward looks favourable on the buy side at the current market price with a set stop-loss at Rs 1,190 mark for potential targets of Rs 1,330 and Rs 1,420.Expert: Om Mehra, technical analyst at SAMCO SecuritiesPidilite Industries: Buy | LTP: Rs 2,868 | Stop-Loss: Rs 2,770 | Target: Rs 3,050 | Return: 6 percentThe stock formed higher highs and higher lows in the daily chart. It is trading above 20 and 50 DMA (days moving average) indicating strength in price action.The positive crossover is indicated in MACD (moving average convergence divergence) while RSI (relative strength index) stands at 70 levels.The stock is sustaining above the Rs 2,800 levels (crucial resistance) with decent volumes pointing out buying interest among short-term traders.Hence, based on the above technical structure, one can initiate a long position at CMP Rs 2,868 for a target price of Rs 3,050. The stop-loss can be kept at Rs 2,770.Tata Consumer Products: Buy | LTP: Rs 1,212 | Stop-Loss: Rs 1,155 | Target: Rs 1,310 | Return: 8 percentAfter a decent correction, the stock reveals a strong recovery, forming a sturdy base around Rs 1,160 levels. The stock is currently trading above the 20 SMA (simple moving average) indicating positive momentum. The daily chart reveals price is ticking up with a rise in trading volumes. The RSI is gradually inching higher suggesting bullishness in stock.Hence, based on the above technical structure, one can initiate a long position at CMP Rs 1,212 for a target price of Rs 1,310. The stop-loss can be kept at Rs 1,155.Expert: Jigar Patel, senior manager - equity research at Anand RathiITC: Buy | LTP: Rs 419 | Stop-Loss: Rs 390 | Target: Rs 475 | Return: 13 percentAfter reaching a peak near Rs 475 mark on January 4, 2024, ITC has experienced a significant decline of 16 percent. However, in the subsequent 18 trading sessions, ITC has shown stability by avoiding further declines and has instead consolidated within a range of Rs 400-416. Notably, in the previous trading session, there was notable buying interest observed at lower levels, accompanied by substantial trading volume.From a technical standpoint, the formation of a bullish AB=CD pattern on the daily chart of ITC within the mentioned price zone of Rs 400-416. Interestingly, this zone also coincides with the 0.382 percent retracement level of a price swing that occurred between January 2023 and July 2023, as indicated on the chart.Additionally, it has formed complex structure forming on the daily RSI indicator, resembling a 'W shape' below the 30 level, which suggests a potentially lucrative buying opportunity.Thus, one can buy in the zone of Rs 415-425 with an upside target of Rs 475 and a stop-loss would be placed near Rs 390 on a daily close basis.Britannia Industries: Buy | LTP: Rs 4,974 | Stop-Loss: Rs 4,790 | Target: Rs 5,250 | Return: 5.5 percentFollowing a peak near Rs 5,386 level, Britannia experienced a significant decline of almost 11 percent in its value. However, over the past couple of months, Britannia has stabilized around Rs 4,800 levels, forming a prolonged support base. Notably, this level coincides with the 200-day exponential moving average (DEMA) and represents a 50 percent retracement of its previous upward movement from November 2023 to December 2023, as depicted in the provided chart.Additionally, a bullish AB=CD pattern has emerged near Rs 4,800 level, further confirming positive market sentiment. Furthermore, the daily stochastic indicator indicates a bullish divergence, suggesting a favourable outlook for theTherefore, investors may consider initiating buy positions within the range of Rs 4,950-4,980, targeting an upside objective of Rs 5,250, with a stop-loss set at Rs 4,790 on a daily closing basis.Aegis Logistics: Buy | LTP: Rs 381 | Stop-Loss: Rs 355 | Target: Rs 430 | Return: 13 percentOn March 7, 2024, Aegis Logistics reached a high of Rs 455. Since then, it has experienced a significant decline of 21.5 percent in its price. Presently, the stock has found support at the 200-day exponential moving average (DEMA). Additionally, on the hourly chart, a bullish BAT pattern has formed in the range of Rs 360-370 levels, coinciding with the vicinity of the 200 DEMA.Furthermore, on the indicator front, the hourly RSI has displayed a complex structure near the oversold zone, indicating a bullish stance.Given these technical indicators, investors may consider buying in the zone of Rs 375-385, with an upside target set at Rs 430. A prudent stop-loss strategy would involve placing it near Rs 355 on a daily closing basis.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. "
]