[
    "Here's a quick look at which stocks will be in focus in trade on Monday, from significant investments and major deals to monthly auto sales volumes announced over the weekend:Monthly Sales Volumes Announced on June 1Maruti Suzuki India sales in May (YoY)Total sales down 2% at 1.74 lakh units Vs 1.78 lakh unitsTotal domestic sales rise 3.7% to 1.57 lakh units Vs 1.51 lakh unitsDomestic passenger vehicle sales up 0.2% at 1.44 lakh units Vs 1.43 lakh unitsTotal exports drop 34.4% to 17,367 units Vs 26,477 unitsTotal production increases 7.2% to 1.93 lakh units Vs 1.80 lakh unitsMaruti reduced prices of its auto gear shift variants across its models by Rs 5,000 per unit effective June 1Tata Motors sales in May (YoY)Total sales grow 2.4% to 76,766 units Vs 74,973 unitsDomestic sales up 2% at 75,173 units Vs 73,448 unitsCommercial vehicle sales rise 2% to 29,691 units Vs 28,989 unitsPassenger vehicle sales up 2% at 47,075 units Vs 45,984 unitsMahindra and Mahindra sales in May (YoY)Total sales volumes grow 16.7% to 71,682 units Vs 61,415 unitsPassenger vehicle sales up 31% at 43,218 units Vs 32,886 unitsTractor sales increase 9% to 37,109 units Vs 34,126 unitsTractor exports grow 85% to 1,872 units Vs 1,013 unitsTVS Motor Company sales in May (YoY)Total sales grow 12% to 3.70 lakh units Vs 3.30 lakh units2-wheelers sales up 13% at 3.59 lakh units Vs 3.19 lakh unitsElectric vehicle sales increase 4% to 18,674 units Vs 17,953 unitsExports jump 27% to 96,966 units Vs 76,607 units3-wheeler sales down 8.8% at 10,324 units Vs 11,314 unitsHero MotoCorp sales in May (YoY)Sales volume falls 4.1% to 4.98 lakh units Vs 5.19 lakh unitsDomestic sales declines 5.7% to 4.79 lakh units Vs 5.08 lakh unitsExports grow 67.3% to 18,673 units Vs 11,165 unitsEscorts Kubota sales in May (YoY)Tractor sales drop 6.1% to 8,612 units Vs 9,167 unitsDomestic tractor sales down 5.4% to 8,232 units Vs 8,704 unitsEicher Motors sales in May (YoY)Royal Enfield sales down 8% at 71,010 units Vs 77,461 unitsInternational Business (Royal Enfield) sales grow 12% to 7,479 units Vs 6,666 unitsTotal VECV sales up 9.7% at 6,901 units Vs 6,289 unitsSML Isuzu sales in May (YoY)Sales up 21.2% at 1,563 units Vs 1,290 unitsPassenger vehicles grow 19.3% to 1,245 units Vs 1,044 unitsAtul Auto sales in May (YoY)Total sales up 112% at 2,331 units Vs 1,101 unitsVST Tillers sales in May (YoY)Power tillers & tractors sales down 34.1% to 2,474 units Vs 3,756 unitsStocks To WatchCoal IndiaCoal production in May grew by 7.5% year-on-year to 64.4 million tonnes, and offtake increased by 7.2% year-on-year to 68.2 million tonnes.MOILThe manganese-ore mining company has increased prices of all ferro grades of manganese ore with manganese content of Mn-44% and above by 35%. It also hiked prices of all other ferro grades with manganese content below Mn-44% by 30%. Furthermore, it increased prices of all SGMR, fines, and chemical grades by 30%, effective from June 1.Adani Ports and Special Economic ZoneAdani International Ports Holdings Pte (AIPH), a wholly owned subsidiary of Adani Ports, has signed a 30-year concession agreement with the Tanzania Ports Authority to operate and manage Container Terminal 2 at the Dar es Salaam Port, Tanzania. The Adani Ports-led consortium will acquire the project company in Tanzania, which houses all port handling equipment and employees, for $39.5 million. Container Terminal 2 has a capacity of 1 million TEUs and handles approximately 83% of Tanzania’s container volume.Ashoka BuildconThe company has emerged as the lowest bidder for two projects worth Rs 2,153 crore from the Maharashtra State Road Development Corporation.Ahluwalia ContractsThe company has received a contract worth Rs 2,157 crore from India Jewellery Park, Mumbai. The contract involves design, engineering, procurement, and construction (EPC) for the construction and development of Gems & Jewellery Park in Mahape, Navi Mumbai. It also bagged a contract worth Rs 88.15 crore from Daffodil Hotel.NMDCThe company announced total iron ore production at 2.34 million tonnes in May 2024, down 37% from 3.71 million tonnes in the year-ago period. Iron ore sales fell 22% YoY to 2.82 million tonnes.Poonawalla FincorpThe NBFC company has achieved a milestone of gross NPA below 1% and net NPA below 0.5% as of May 31, 2024.Oil and Natural Gas CorporationThe state-owned oil & gas exploration company said K C Ramesh ceased to be Chief Financial Officer with effect from June 1, due to superannuation.PuravankaraThe real estate developer, through its subsidiary Purva Oak, has acquired 12.75 acres of land in Thane. The land has an estimated potential carpet area of 18.20 lakh square feet and a potential gross development value (GDV) of Rs 4,000 crore over the project lifecycle.Moschip TechnologiesThe Hyderabad-headquartered company has secured a Rs 509.37 crore contract from the Centre for Development of Advanced Computing (CDAC). The contract includes the design, development, and delivery of an HPC SoC based on 5nm technology.Shriram FinanceThe board has approved the re-appointment of Umesh Revankar as Executive Vice Chairman of the company for 5 years, with effect from October 26, 2024, to October 25, 2029. Further, the board approved the elevation and re-designation of Parag Sharma as Managing Director & CFO of the company, with effect from June 1, 2024. Parag Sharma was Joint Managing Director & Chief Financial Officer of the company.Endurance TechnologiesSubsidiary Endurance Overseas Srl, Italy, has acquired a 100% stake in Italy-based Ingenia Automation Srl for 3.6 million euros. Ingenia operates in the design, production, and installation of industrial automation systems.BSEThe country's oldest stock exchange has completed the acquisition of S&P Dow Jones Indices’ entire equity stake in Asia Index (AIPL), making AIPL a wholly-owned subsidiary of BSE. AIPL will continue to provide its services to clients who are subscribed to AIPL’s indices/data products. AIPL was a joint venture between S&P DJI and BSE and is best known for calculating and maintaining the popular index Sensex.RECThe state-run company has received approval from the board for raising funds up to Rs 1.45 lakh crore through the private placement of non-convertible debentures. Further, the board has approved the appointment of Harsh Baweja as Director (Finance) (as Additional Director) and Chief Financial Officer of the company, with effect from May 14, 2024.Canara BankThe bank has received approval for initiating the process of diluting a 14.50% stake in its subsidiary Canara HSBC Life Insurance Company by listing it on stock exchanges through an initial public offer (IPO). This will be subject to the approval of the Reserve Bank of India and the Government of India.PNC InfratechSubsidiary PNC Kanpur Highways has received Rs 390.62 crore from NHAI. This is part of the Settlement Agreement executed by the National Highways Authority of India and PNC Kanpur Highways due to a one-time settlement under the Vivad Se Vishwas II Scheme of the Government of India.Rossari BiotechThe company has incorporated its wholly-owned subsidiary Rossari Global DMCC in Dubai. DMCC is the Dubai Multi Commodities Centre.Punjab National BankThe public sector lender has increased its marginal cost of funds-based lending rate by 5 bps on 3-month to 3-year tenures, with effect from June 1.Indian BankThe state-run bank has raised its marginal cost of funds-based lending rate by 5 bps on its 3-month to 1-year tenures, with effect from June 3.Vilas TranscoreThe company will make its debut on the NSE Emerge on June 3. The issue price has been fixed at Rs 147 per share. Its equity shares will be available in the Trade-for-Trade Surveillance Segment.Cartrade TechForeign investor CMDB II sold 18,76,059 equity shares (equivalent to 4% of paid-up equity) in the company at an average price of Rs 900 per share. However, TT Emerging Markets Unconstrained Fund bought 5,46,012 equity shares (equivalent to 1.16% of paid-up equity) in Cartrade at the same price.\n       ",
    "Amid rising mercury levels and lukewarm retails during election season, passenger vehicle (PV) sales during May 2024 saw Year-on-Year (YOY) growth of 4.4 percent at 3,50,257 units as against 3,35,436 units dispatched during May 2023.  The high base effect of last year also resulted in modest growth in PV volumes last month.Maruti Suzuki’s total domestic PV sales rose marginally to 1,44,002 units last month from 1,43,708 units in the year-ago period. During May 2024, the company’s marketshare  in the entire PV market stood at 41.1 percent.When enquired about the modest growth in PV market last month Partho Banerjee, Senior Executive Officer, Marketing and Sales, said, “As the high base effect (of 2023) has come in, the growth will not be significant this year.” He also stated that there was some \"postponement of sales\" by prospective buyers due to scorching heat and ongoing elections during the last month.The country's largest carmaker's total domestic sales, comprising LCVs, sales to OEMs (Toyota) and PVs, were 1,57,184, up by 3 percent from 1,51,606 units in May 2023. According to Banerjee, while there were some bookings, their customers were waiting for the final purchase once the new government is formed.“From the middle of June, after the new government is formed, we will see some traction. We are hopeful that we will start see the greenshoots coming once the election results are announced and we get a stable government,” added Banerjee.Hyundai Motor India’s domestic dispatch of vehicles to dealers saw 1 per cent rise to 49,151 units last month from 48,601 units in the year-ago period.\"We have maintained a healthy total sales volume in May 2024, despite a week-long routine bi-annual maintenance shutdown at our Sriperumbudur factory,\" HMIL COO Tarun Garg said.He also stated that SUVs, which contributed 67 percent of its total sales, continue to be a \"growth driver\"  for the company. \"Our rural penetration stood at a healthy 20.1 per cent in May,\" added Garg.Mahindra & Mahindra (M&M) achieved overall sales of 71,682 in month of May 2024, recording a growth of 17 percent over last year. Total sales include passenger vehicles sales of 43,218 units, higher by 31% over 32,886 units sold in May 2023Tata Motors' total domestic PV sales, including EVs, were 46,697 units , up by just 2 percent from  45,878 units last year.Kia India stated its total wholesales increased 4 percent year-on-year to 19,500 units in May. The South Korean carmaker had dispatched 18,766 units to dealers in May 2023.\"So far in this year, we have been aggressive in introducing new competitive variants of our models, which has contributed significantly to our sales,\" Kia India Senior VP and Head Sales & Marketing Hardeep Singh Brar said in a statement.Toyota Kirloskar Motor (TKM) reported 24 percent YOY  increase in total wholesales (including exports) in May at 25,273 units. Last month, domestic sales stood at 23,959 units.\"The newest addition to our robust SUV lineup, the All-New Urban Cruiser Taisor, reaffirms TKM’s commitment to meeting the dynamic demands of the market. Furthermore, the sustained enthusiasm shown by customers towards all our products and services underscores the success of our product strategy and our deep market connection,\" TKM Vice President, Sales-Service-Used Car Business Sabari Manohar said in a statement.MG Motor India, however, reported a 5 percent dip in wholesales at 4,769 units in May compared to the same month last year. The company had dispatched 5,006 units to dealers in May 2023. \n       ",
    "Encouraged by record sales in FY24, the country's top four passenger vehicle (PV) makers have committed investments exceeding Rs 1 lakh crore for the current fiscal year, according to data compiled by Moneycontrol. This confidence, according to industry experts, is rooted in the nearly 4.23 million units of PV sales during the year ended March 31, with sustained growth projected for the coming years.While a significant portion of investments from carmakers like Maruti Suzuki, Hyundai Motor India, Tata Motors, Mahindra and Mahindra (M&M), and JSW-MG Motor India will be allocated to expanding capacities for Internal Combustion Engine Vehicles (ICEVs) to meet demand, a considerable sum will also be directed towards platform, product, and technology development for Electric Vehicles (EVs).Big ticket plans Among the top car makers, Maruti Suzuki, aiming to reclaim its 50 percent market share by the middle of the decade, plans to invest Rs 10,000 crore in various initiatives, including new model development, capacity creation and expansion, etc., for the current financial year. The current year's capex is a part of the Rs 1.25 lakh crore-outlay that the carmaker has earmarked till 2030-31,  a senior company official told Moneycontrol.Hyundai Motor India Limited (HMIL), which achieved all-time high sales in CY 2023 and FY 2023-24, intends to spend Rs 13,180 crore in the medium term, primarily focusing on expanding its manufacturing capacity. Of this amount, nearly Rs 6,180 crore will be invested in constructing a greenfield facility in Chennai, Tamil Nadu, and Rs 6,000-7,000 crore for overhauling production lines at its Talegaon facility, Maharashtra.Unsoo Kim, MD and CEO of Hyundai Motor India, emphasized that these recent investments are in addition to the previously announced Rs 20,000 crore investment towards capacity expansion, new products, and a battery pack assembly plant, outlining HMIL’s vision for the next decade in India. Notably, the South Korean carmaker is also considering listing its India unit and experts feel that a bulk of the fund raise is expected to go towards expanding capacities and product development.Homebred auto major Mahindra and Mahindra (M&M) has declared plans to invest nearly Rs 27,000 crore during FY 2025-27 in product development, capacity expansion, and technological advancements in the automotive division.“We are not neglecting ICEVs, as they remain an important part of our portfolio for consumers over the next five to seven years. Therefore, Rs 14,000 crore will be allocated to ICEVs, covering new models and refreshes, ensuring that we maintain the best SUV portfolio”  Anish Shah, MD & CEO of M&M Ltd said recently at a post Q4 earnings call.Another indigenous automaker, Tata Motors, announced an investment of Rs 43,000 crore for products and technologies in 2024-25. Jaguar Land Rover (JLR), Tata Motors’ British arm, is expected to account for the bulk  of this, around Rs 35,000 crore.P.B. Balaji, Group CFO of Tata Motors, at a post Q4 earnings call highlighted, “In FY25, JLR investments will see a 6 percent increase, while Tata Motors investments will remain stable,” noting that the investments are primarily directed towards product and technological advancements for both JLR and Tata Motors.JSW MG Motor (formerly MG Motor India) recently revealed plans to invest Rs 5,000 crore to enhance production capacity and launch a new car every 3-6 months starting from September. The joint venture between China's SAIC and Indian conglomerate JSW Group aims to replicate a \"Maruti moment\" in the new energy vehicle segment.A year after announcing Rs 5,300 crore investment plans in India, Nissan Motor Corporation and Renault SA have unveiled their future portfolio expansion, with four new sport utility vehicles (SUVs) expected to hit the market starting from 2025. \n       ",
    "The benchmark indices recorded a new high on May 23 by showing a long bullish candlestick pattern on the daily charts. The BSE Sensex and Nifty 50 indices ended at a new all-time closing high, but with negative breadth as approximately 1,204 equity shares declined and 1,043 shares advanced on the NSE. The market has reached near the crucial resistance of 23,000 on the Nifty 50, and it needs to give a strong close above the same for further upward journey from hereon. However, below the same, it may consolidate. Here are some trading ideas for the near term.Amol Athawale, VP-Technical Research at Kotak SecuritiesInfosys | CMP: Rs 1,472.4Post its declining trend from the higher levels, Infosys is in consolidation mode, trading in a rectangle formation. However, the recent bullish activity near the demand zone indicates good strength. The gradual upward moves in the counter suggest a fresh leg of a bullish trend in the near term.Strategy: BuyTarget: Rs 1,575Stop-Loss: Rs 1,420IndusInd Bank | CMP: Rs 1,440.85After a short-term correction from the higher levels, IndusInd Bank was in the accumulation zone where it was trading in a rectangle formation. However, on the daily charts, there is a range breakout in the counter along with decent volume activity, which suggests upward momentum to persist in the coming horizon.Strategy: BuyTarget: Rs 1,540Stop-Loss: Rs 1,390Eicher Motors | CMP: Rs 4,852.85On the weekly charts, the counter is in a rising channel chart formation with a higher high and higher low series pattern. Additionally, technical indicators like ADX (average directional index) and RSI (relative strength index) are also indicating a further uptrend from current levels, which could boost the bullish momentum in the near future.Strategy: BuyTarget: Rs 5,200Stop-Loss: Rs 4,690Chandan Taparia, Head - Equity Derivatives & Technicals, Broking & Distribution at Motilal Oswal Financial ServicesBharti Airtel | CMP: Rs 1,374Bharti Airtel has given a range breakout on the daily chart and managed to close above the same. It has formed a bullish candle on the daily scale, and supports are gradually shifting higher. The momentum indicator, relative strength index (RSI), is positively placed, which may take prices higher.Strategy: BuyTarget: Rs 1,480Stop-Loss: Rs 1,310Mahindra and Mahindra | CMP: Rs 2,609M&M has been continuously forming higher highs and higher lows for the past three weeks. It has given an Inside Bar breakout on the daily scale and achieved its highest daily close ever.Strategy: BuyTarget: Rs 2,750Stop-Loss: Rs 2,520Axis Bank | CMP: Rs 1,165Axis Bank has retested the breakout and is inching higher. The overall trend is bullish, and every small decline is being bought into. Buying activity is visible across private banks, which may support the ongoing uptrend.Strategy: BuyTarget: Rs 1,250Stop-Loss: Rs 1,130State Bank of India | CMP: Rs 832SBI is in an overall uptrend and has given a consolidation breakout on the daily chart. The base is shifting higher, and a small follow-up can take it towards the Rs 880-900 zones.Strategy: BuyTarget: Rs 900Stop-Loss: Rs 790Mitesh Karwa, Technical Research Analyst at Bonanza PortfolioLarsen & Toubro | CMP: Rs 3,585.40L&T has seen a breakout of a downward sloping resistance trendline and is forming a bullish candlestick with above-average volumes after taking support from a crucial zone on the weekly timeframe. On the indicator front, the Supertrend indicator is indicating a bullish reversal on the daily timeframe, and the momentum oscillator RSI (14) is around 56 on the daily timeframe, indicating strength by sustaining above 50.Observation of the above factors indicates that a bullish move in L&T is possible with a target up to Rs 3,730. One can initiate a buy trade in the range of Rs 3,583-3,585, with a stop-loss of Rs 3,480 on a daily closing basis.Strategy: BuyTarget: Rs 3,730Stop-Loss: Rs 3,480Maruti Suzuki | CMP: Rs 12,934.9Maruti has seen a breakout of a triangle pattern with above-average volumes and a bullish candlestick on the daily timeframe. The Supertrend indicator is also indicating a bullish continuation, supporting the bullish view. The momentum oscillator RSI (14) is around 59 on the daily timeframe, indicating strength by sustaining above 50, and the Ichimoku Cloud is suggesting a bullish move as the price is trading above the conversion and baseline.Observation of the above factors indicates that a bullish move in Maruti is possible with a target up to Rs 13,330. One can initiate a buy trade in the range of Rs 12,930-12,934, with a stop-loss of Rs 12,750 on a daily closing basis.Strategy: BuyTarget: Rs 13,330Stop-Loss: Rs 12,750Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "With XUV 3XO’s bookings crossing 50,000 units within 60 minutes, Mahindra and Mahindra (M&M) is drawing up a blueprint to ensure that the sub-compact (under four-metre) sports utility vehicle (SUV) does not see months-long  waitlists. Speaking after the company's Q4FY24 earnings call, Rajesh Jejurikar, ED and CEO, M&M Auto and Farm Equipment Services, said that a prospective  customer, who could be a first time buyer, will not wait endlessly for the XUV 3XO as he has multiple options in the market.“We are aware that when first-time buyers want a car, they are are not going to wait for months. That's something  we are very alive to. The nature of this buyer is different from the nature of Thar (lifestyle SUV) buyers, who don't mind waiting as there's nothing like that  in the market,” said Jejurikar.At present, Tata Motors’ Nexon is the market leader in this segment, with sales of 1,71,697 units in FY2023-24, per industry data . Maruti Suzuki Brezza is  number two, with 1,69,897 units, followed by Hyundai Venue at third spot, with 1,28,897 units.Jejurikar revealed that M&M has already produced more than 10,000 units of this model and will commence deliveries on 26th May. He also said that the company has already enhanced the XUV 3XO’s production capacity to 9,000 units per month, which is higher than the numbers for the outgoing version ( XUV 3OO).“We already have the inventory, and with a very short lead-time and minimal investment, we can go up to 10,500 units (per month). Of course, if the numbers go higher than that, we will ramp up the output further,” added Jejurikar.He also acknowledged that the company is very mindful that if the waiting periods are high, it may lead to higher cancellations.“We will have to keep up the momentum on the ground to drive demand, because it can't be a static customer list. If you're not delivering, they're going to drop out and buy something else. That's pretty clear to us,\" explained Jejurikar.The company reaffirmed its plans to roll out nine SUVs, seven of which would be ICE models. While some models will be replacing existing product lines, some are tailiormade for the overseas markets.“There are ICE and EV portfolios that are getting developed, which will enable us to globalise over the next six to seven years. We'll take our time, and build market by market. But we need globally competitive products. When we say new ICE products, we mean it may be replacing existing models, but built on a totally new platform,” said Jejurikar.Regarding its Born Electric range of products, he said the company is all set to roll out the first model by the first quarter of next calendar year. Talking about positioning, he noted that it would be targeted at  a new set of buyers, who are looking for aspirational electric cars at reasonable price points.“I would put it as an attitude, or  psychographic, of people who want to stand out, do things differently, experience new things, and are hungry for the latest tech. This product is going to come with tech which is unseen in vehicles at way higher price points. We have been seeing a similar profile even among our ICE customers,'' averred Jejurikar.While the company has already launched its maiden EV XUV 400, which is based on the same platform that underpins XUV 3OO (now 3XO), its ground-up EVs will be priced above Rs 15 lakh.“Ideally, we don't want the Mahindra ICE customer to move to our EVs. We are hoping to attract those we haven't been able to so far, but who have the same psychographics. Then it's a win-win. Of course, there may be some cannibalisation, but we think that there is enough untapped opportunity for a vehicle of this type, which we have not been able to leverage so far with even the XUV700. This is a quantum leap over XUV700,” said Jejurikar.\n       ",
    "Net Sales at Rs 35,451.73 crore in March 2024 up 9.54% from Rs. 32,365.60 crore in March 2023.Quarterly Net Profit at Rs. 2,754.08 crore in March 2024 up 4.45% from Rs. 2,636.67 crore in March 2023.EBITDA stands at Rs. 6,959.62 crore in March 2024 up 15% from Rs. 6,051.64 crore in March 2023.M&M EPS has increased to Rs. 24.71 in March 2024 from Rs. 23.68 in March 2023.M&M shares closed at 2,514.45 on May 17, 2024 (BSE) and has given 61.82% returns over the last 6 months and 101.92% over the last 12 months.",
    "LKP Research's research report on Mahindra And MahindraM&M reported decent Q4 FY24 numbers wherein the topline was reported at ₹254 bn, a growth of 12.7% yoy and flattish qoq. Volumes rose by 9.3% yoy and realizations went up by about 3.1% yoy. Automotive division revenues came in at ₹199 bn, an increase of 20% yoy led by success of Thar, Bolero, XUV & Scorpio families with ~220K order book. Automotive segment reported strong EBIT margins, which rose by 170 bps yoy and 50 bps qoq to 8.8% on positive operating leverage, stable commodity basket and model mix. Tractor margins came at 15.8% which was 30 bps up qoq and lower 60 bps yoy as lower monsoons and unseasonal rains led to fall in volumes but margins improved qoq on lower RM basket costs. Overall EBITDA margins therefore came in higher at 14% (flattish qoq and 160 bps up yoy). Lower other income coupled with higher tax rate, led PAT to come in 4.3% up yoy at ₹21.6 bn. On a sequential basis, the growth was 12% lower. Overall results were quite decent despite tractor business being on weak wicket.OutlookWe maintain BUY rating on attractive valuations; SoTP-based target price now stands raised at ₹2,740 (₹2,364 core business valued at 15x FY 26E earnings + subsidiary valuation of ₹376) in line with our assumptions of margin improvement on increase in volumes and value of SUV where we expect market share to bounce back on new launches, 3Ws and LCV segments, production increase offering operating leverage, price hikes and prudent cost reduction measures. We believe FES segment also to revive in FY 25E on expectations of above normal monsoons by the weather departments.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Mahindra And Mahindra - 18052024 - lkp ",
    "Net Sales at Rs 25,436.05 crore in March 2024 up 12.69% from Rs. 22,571.37 crore in March 2023.Quarterly Net Profit at Rs. 2,038.21 crore in March 2024 up 31.58% from Rs. 1,548.97 crore in March 2023.EBITDA stands at Rs. 3,666.19 crore in March 2024 up 17.09% from Rs. 3,131.22 crore in March 2023.M&M EPS has increased to Rs. 17.00 in March 2024 from Rs. 12.93 in March 2023.M&M shares closed at 2,372.85 on May 16, 2024 (BSE) and has given 51.04% returns over the last 6 months and 87.95% over the last 12 months.",
    "HighlightsMahindra & Mahindra (M&M; Current Market Price: Rs 2,372; Market Cap: Rs 2.94 lakh crore, Rating: Over-weight) has reported financial results for the final quarter of FY24 that met expectations,\n                                    ",
    "Despite the chip crisis getting mitigated, Mahindra & Mahindra (M&M) continues to sustain a strong demand momentum for its bestselling Sports Utility Vehicles (SUVs). A senior company official said that it is garnering an average of close to 48,000 units booking every month over the last few months.Speaking to media post Q4 FY-24 earnings call, Rajesh Jejurikar, ED and CEO of Auto and Farm business at Mahindra & Mahindra said that the company is sitting on an order book of 2.20 lakh units at the beginning of 1st of May and the cancellation rate continues to remain in single digits at 10 percent.On a monthly basis, while the homegrown automaker continues to garner 48,000 units, its new billings are at 42,000 units and cancellation rates are 10 percent.While giving a presentation, Jejurikar revealed that M&M currently has over 220,000 bookings for its SUVs, which includes XUV 3XO (50,000 open bookings), Thar (59,000 open bookings), XUV7OO (16,000 open bookings), Bolero (including Neo) (10,000 open bookings) and Scorpio-N (86,000 open bookings).His presentation revealed that the company is able to sell 7,000 units of Thar, 8,000 units of XUV 7OO, 9,500 units of Bolero (including Neo), 17,000 units of Scorpio (including Classic).“Our focus is clearly on the SUV segment, where we see a huge opportunity for growth.  The SUV category last year was about 25 lakh (units) per annum,\" said Jejurikar.The official clarified that the open bookings include the 50,000 bookings of the XUV 3XO, which the company garnered during the the first hour.“Everything else is as of 1st of May, except XUV 3OO and have we have taken the one hour booking right now. We will not update that on an hourly basis. If you are looking at what is the number today, you are not getting it. This is the number we have put out in the first hour. We will update appropriately,” stated Jejurikar.However, he maintained that the company's key winning factor is to get the vehicles out. \"While we have produced 10,000 units of XUV 3XO we have the capacity of 9,000 units (per month) of this model,\" said Jejurikar.Jejurikar also revealed that Mahindra has nearly trebled its total SUV volumes from 179,400 units per annum to 459,000 units per annum in five years. As a result, its SUV revenue marketshare was up  from 17.6 percent during FY 20 to 20.4 percent during FY 24.Meanwhile, the company is ramping up its annual capacity of its SUVs from 6 lakh units or 49,000 units per month currently to over 8.64 lakh units or 72,000 units per month.“FY23 we have exited 39,000 per month capacity and expect to end next year at 64,000 units per month. And at the end of FY 26, we expect to end with 72,000 units per month,\" said Jejurikar.He went on to add, “For SUVs, we will be expanding by 5,000 units per month additionally and that covers up for the 5-door Thar (to be launched this year) and 10,000 units of Born Electric vehicle capacity that will be kicking in by exit of FY 25. It will include another 8,000 units of Born Electric (vehicle's) capacity.\" \n       ",
    "Mahindra and Mahindra (M&M), one of India's leading automobile companies, said that its farm business, which has been facing challenges for the last couple of quarters, could see an improvement in the second half of FY25.In a post-result analyst call on May 16, the company's management outlined several factors that could contribute to this anticipated improvement.Firstly, the Indian Meteorological Department (IMD) forecasts an 'above normal' monsoon, which typically commences the planting season and boosts demand for tractors as farmers prepare their fields and sow seeds. Additionally, the management noted expected recovery in farm output and robust growth in agricultural exports as further supportive factors.ALSO READ | Mahindra & Mahindra to invest Rs 12,000 crore in its EV unitNot just that, the increased emphasis by the government on infrastructure development, agricultural and rural spending, and the availability of agricultural credit are expected to play crucial roles in driving growth, said the firm's management.READ MORE | M&M Q4 net profit rises 32% to Rs 2,038 cr, declares Rs 21.10 dividendIn the fiscal fourth quarter, Mahindra & Mahindra's tractor sales volumes slipped 20 percent year-on-year to 71,000 units. Moreover, the company also conceded market share from the year-ago period to 39.4 percent, a decline of 130 basis points. In FY24, tractor sales volumes fell to 375,000 units, down 7.2 percent year-on-year.In its flagship automobile segment, the SUV major has proposed to allocate Rs 27,000 crore worth of investments through FY25-27. Of this, a substantial chunk of Rs 12,000 crore will be invested in its electric vehicles unit MEAL or Mahindra Electric Automobile. MEAL was incorporated in October 2022.The SUV segment, the fastest-growing vertical of the company, will attract an investment of Rs 8,000 crore, Mahindra and Mahindra said.Earlier in the day, the company reported that its Q4 FY24 standalone net profit rose 32 percent year-on-year to Rs 2,038 crore, helped by robust performance of the automotive segment, favourable product mix, and operating leverage benefits. The homegrown automaker’s standalone revenue from operations rose 11 percent to Rs 25,109 crore during January-March, from Rs 22,571 crore a year ago.\"It has been an excellent year with most of our businesses delivering a high level of performance. Auto continued its high growth trajectory, Farm gained share in a tough market and Mahindra Finance delivered on asset quality,\" said M&M Ltd Managing Director & CEO Anish Shah.M&M shares closed over 3 percent higher at Rs 2,371 on May 16. The shares have rallied over 29 percent in the last three months.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Homegrown automaker Mahindra and Mahindra (M&M), has announced that it will be investing Rs 37,000 crore for the next two financial years. Out of the earmarked outlay for FY 2025-27,  nearly 27,000 crore will be spent on product development, capacity creation and technological advancements in the automotive division, said a senior official of the company.“For the next three years, we are looking at deploying  Rs 37,000 crore and a large part of that is going to be in the automotive (division). The deployment in auto has gone up significantly of what you see in the previous three years’ cycle (of FY 2022-25),\" Anish Shah, MD & CEO, M&M Ltd. told reporters at a post earning conference call.Out of the total amount earmarked for auto verticals, nearly 52 percent of the outlay will be spent on Internal Combustion Engine Vehicles (ICEVs), especially Sports Utility Vehicles (SUVs).As Shah puts it, “I would like to highlight that we are not going to ignore ICE and they continue to be an important part of our portfolio (and) for our consumers over the next five to seven years. And therefore the deployment on ICE is Rs 14,000 crore. This will be new models, refreshes and we will ensure that we have the best SUV portfolio by far.”Furthermore, M&M will invest Rs 12,000 crore in its Electric Vehicle (EV) unit, Mahindra Electric Automobile Limited (MEAL), over a period of three years up to March 31, 2027.“EV will get Rs 12,000 crore and all of this will be something that will be generated by the Auto Business. So it will be self-funding. That is the reason we have talked to potential investors. Over the next 6 months, we have to assess if we need more funds from BII and we mutually decide if we need more funds or not. This is essentially driven by fact that the auto business will be self-generating from cash,\" added Shah.He also revealed that M&M's Farm Equipment Services (FES) division will get a cash deployment of Rs 5,000 crore as this business continues to be a \"cash generator\" for the company. Similarly, M&M's Financial Services unit will spend Rs 5,000 crore , a sector Shah believes is growing “ very well” .M&M reported a 32 percent jump in its Q4 FY 24 net profit at Rs 2,038 crore owing to robust performance of the automotive segment, favourable product mix, and operating leverage benefits. Its revenue from operations rose 11 percent to Rs 25,109 crore in Q4FY24 as against Rs 22,571 crore a year ago.Capacity expansion, etc., on full swingOut of the Rs 27,000 crore earmarked for FY 2025-27, nearly Rs 8,500 crore will be spent on ramping up ICE SUV, Rs 4,500 crore for CVs comprising bus, trucks and e-LCVs, and Rs 1,500 crore for sustenance plan.“That will take the Auto division to Rs 14,000 crore, 12,000 crore in MEAL, Rs 1,000 for investment in other subsidiaries,\" noted  Rajesh Jejurikar, ED - auto and farm business at M&M.The company plans to launch over 23 all new models - which include 9 internal combustion engine powered SUVs, 7 battery electric vehicles and 7 light commercial vehicles by 2030.“Out of the nine SUVs, six will be all-new products and three will be mid-cycle enhancements. So (we have a) very aggressive plan towards ICEVs  over and above our Born Electric portfolio,” stated Jejurikar, adding, “The 7 LCV have electric versions as in. So a lot happening to make us future-ready.”Apart from rolling out new products and developing new technologies, the investment will also be used for capacity expansion, taking the annual capacity from 6 lakh units or 49,000 units per month currently to over 8.64 lakh units or 72,000 units per month.“FY23 we have exited 39,000 per month capacity and expect to end next year at 64,000 units per month. And at the end of FY 26, we expect to end with 72,000 units per month,\" said Jejurikar.He went on to add, “For SUVs, we will be expanding by 5,000 units per month additionally and that covers up for the 5-door Thar (to be launched this year) and 10,000 units of Born Electric vehicle capacity that will be kicking in by exit of FY 25. It will include another 8,000 units of Born Electric (vehicles') capacity.\"The company has also lined up an additional investment of Rs 1,000 crore in its subsidiaries. However, he clarified, “This expansion does not mean that we will not have more ICE capacity coming in but that will happen after FY 26.Meanwhile, M&M is looking at a mid-teens to high-teens growth for this financial year which will enable the company grow its sales beyond half a million units per annum. \n       ",
    "Leading auto maker Mahindra and Mahindra has lined up nine internal combustion engine (ICE) based SUVs by 2030, the company said in press briefing after quarterly results on May 16.Three of these would be mid-cycle enhancements and six will be new SUVs.The current capacity of XUV 300 stands at 9,000 units per month, which the company hopes to fully utilise, MD Anish Shah said. The response to the XUV 3Xo has been 'phenomenal', M&M top management said in the press briefing.The company will also be launching seven electric vehicles and light commercial vehicles each, Rajesh Jejurikar, Executive Director and CEO - auto and farm equipment sector, M&M added.A robust demand for SUVs has helped M&M post a strong fourth quarter results, taking the share to the top of Sensex gainers for the day. Mahindra sold 27.2% more SUVs in the three months to March 31 from a year earlier. Utility vehicles accounted for more than half of passenger vehicle sales in India in FY24, rising 31% year-on-year.Also Read: M&M plans to investment Rs 12,000 crore in its EV unitThe export of SUVs too has seen momentum in the quarter, with both electric and hybrid finding takers, M&M said. Anish Shah sounded confident of taking the leadership spot in e-SUVs too, and said the company will be launching a portfolio of electric products in January-March of 2025. The e-SUVs too will follow M&M's brand DNA of sporty, fun to drive cars in the segment, Shah added.EVs will make up 30 percent of M&M's SUV portfolio by 2027, according the company.This story is being updated ",
    "Auto major Mahindra & Mahindra Ltd (M&M) said on May 16 that its standalone net profit rose 32 percent in March quarter to Rs 2,038 crore owing to robust performance of the automotive segment, favourable product mix, and operating leverage benefits. It reported standalone net profit of Rs 1,549 crore in the year-ago period.The homegrown automaker’s standalone revenue from operations rose 11 percent to Rs 25,109 crore in Q4FY24 as against Rs 22,571 crore a year ago.\"It has been an excellent year with most of our businesses delivering a high level of performance. Auto continued its high growth trajectory, Farm gained share in a tough market and Mahindra Finance delivered on asset quality,\" said M&M Ltd. Managing Director & CEO Anish Shah.At the operational front, M&M’s earnings before interest, taxes, depreciation and amortization (EBITDA) during Q4 FY 24 rose 12 percent YoY to Rs 3,119 crore from Rs 2,789 crore, while EBITDA margin remained flat at 12.4 percent.During the quarter ended March 2024, M&M's automobile segment volumes were at 2,15,280 units, up 14 percent YoY. Its farm equipment segment sold 71,039 units of tractors during the same period, down 20 percent YoY.Mahindra sold 27.2 percent more SUVs in the quarter from a year earlier.  The company's automotive business brings in almost two-thirds of total revenue and includes the sale of commercial vehicles and SUVs such as Scorpio and Thar.Rajesh Jejurikar, Executive Director & CEO (Auto and Farm Sector), M&M Ltd. stated that the company continues to be #1 SUV player by revenue and gained 3.5 percent market share in LCVs < 3.5T category. It has also improved Auto Standalone PBIT margin by 190 bps during this period. In tractors, the company achieved a market share of 41.6 percent, a gain of 40 bps during FY24, and improved core tractor PBIT margins by 30 bps.\"Our farm machinery segment continued to have robust revenue growth of 32percent, \" said Jejurikar while adding, \"We will launch 9 SUVs, 7 EVs, 7 LCVs by 2030.\"Meanwhile, the Mumbai-based automaker said its board approved dividend of Rs 21.10 per equity share of Rs 5 face value.. The record date for the dividend is July 5, 2024, and the dividend will be paid after July 31, 2024.\"Our disciplined capital allocation and sharp focus on operating metrics helped generate record cashflows in FY24. We also repaid debt of Rs 3,100 crore and delivered RoE of 18.4 percent,\" said Manoj Bhat, Group Chief Financial Officer, M&M.The results surpassed analysts expectations as the Moneycontrol poll of six brokerage estimates forecast that M&M’s Q4FY24 net profit will rise to Rs 2,026 crore, up 2.5 percent from the year-ago period. It predicted that the company’s revenue from operations will increase by over 7 percent to Rs 24,182 crore from the same period last year.Talking about capex plans for the next fiscal, Shah said, \"We will deploy Rs 37,000 crore from FY 2025-27, a major chunk will be spent on the automotive category. We will not ignore ICEV and a major chunk of our capex will be spent on that segment in the automotive segment.\"EV InvestmentMeanwhile, the board of directors of M&M has approved an investment of Rs 12,000 crore in its electric vehicle (EV) unit Mahindra Electric Automobile Ltd (MEAL), over a period of next three years up to March 31, 2027.The company stated that it anticipates to \"sufficient operating cash\" to satisfy all its capital investment needs and are not looking to raise additional capital.As  result, M&M and British International Investment (BII) have agreed to extend the timeframe for the final tranche of BII’s planned investment of Rs 725 crore. So far, BII has invested Rs 1,200 crore and Temasek has invested Rs 300 crore so far in MEAL. Temasek will be investing the balance Rs 900 crore as per the agreed timelines.M&M's shares closed 3.98 percent higher on the NSE at Rs 2,393.90 apiece.\n       ",
    "Mahindra and Mahindra, one of India's leading automobile companies, is expected to report muted Q4 financial results as the farm equipment business drags the overall revenue and profitability.The company's fiscal fourth quarter net profit is expected to rise to Rs 2,026 crore, up a mere 2.5 percent from the year-ago period, according to a Moneycontrol poll of six brokerage estimates. Revenue from operations is expected to rise just over 7 percent to Rs 24,182 crore from the same period last year. M&M will declare its result on May 16.Follow our live blog for all the market updates\"Revenue growth on-year will be supported by robust performance in the automobile segment. However, the key thing to watch out for is auto production and tractor demand outlook,\" Nuvama Institutional Equities said in a note.ALSO READ | Tata Motors forecasts election-linked slump in PV sales in first-half of FY25M&M’s January-March EBITDA is expected to climb to Rs 3,067 crore, higher by nearly 10 percent from the corresponding period previous year.The Thar-maker is expected to experience a modest 2.9 percent increase in volume this quarter, selling 286,924 units. The limited growth in the automobile business is also expected to be affected by the underperformance of the farm equipment business. Total tractor sales slipped to 71,644 during the Q4, down 20 percent from the year-ago period, and down 30 percent from the previous quarter.READ MORE | Analyst Call Tracker: Maruti, Eicher Motors see most downgrades in April as demand outlook weakensHDFC Securities said that for the fourth quarter, SUVs continued to outperform the Passenger Vehicle (PV). While Maruti led with a 72 percent year-over-year growth, M&M reported a 28 percent year-over-year growth. However, it is anticipated that growth will slow in FY25 due to a high base effect and a lack of exciting new launches from listed players.In a report, BNP Paribas said M&M continues to experience strong demand for its new SUV models, with monthly bookings surpassing both its sales and target capacity of 49,000 units by the end of Q4 FY24. Recent model launches have significantly bolstered its brand identity in the SUV market. It added that there is also significant potential for value creation should M&M’s board decide to list the auto and farm businesses separately.In April, the company reported a 13 percent increase in sales at 70,471 vehicles. In the Utility Vehicles segment, Mahindra sold 41,008 vehicles in the domestic markets, a growth of 18 percent. As for the farm equipment business, the company reported that domestic sales in April 2024 came in at 35,805 units, as against 35,398 units during April 2023.At about 12 noon on May 15, a day ahead of the results, shares of the company were trading at Rs 2,296, up over a percent. Mahindra and Mahindra shares have rallied 27 percent in the last three months.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "More than a fortnight after launching the 3XO, Mahindra and Mahindra (M&M) has announced that its dealerships across the country have started taking bookings for its new subcompact Sports Utility Vehicle (SUV) 3XO. The homegrown utility vehiclemaker stated that the customer deliveries will begin from May 26.The prices for the Mahindra XUV 3XO were announced last month. The most affordable SUV by Mahindra is available in five variants with prices starting at Rs 7.49 lakh (ex-showroom). Once launched, it will be taking on Tata Nexon, Hyundai Venue, Maruti Brezza and Kia Seltos sub-four metre SUVs.While unveiling the vehicle, Rajesh Jejurikar, executive director and CEO, auto and farm equipment sector, M&M had said: “In this Rs 6 lakh segment (of subcompact SUVs), which is 25 percent of the market, we are actually the number fifth player. This is a big opportunity for us to disrupt.\"He also stated that in the next three years, the company  aims to be the number one or two in the subcompact monocoque SUV segment. To plan for this, we have to do something disruptive and that is where the 3XO comes in, he said.The Mahindra XUV 3XO is available with three engine options, which comprises a 1.2-litre turbo-petrol engine producing 109 BHP and 200 Nm, the 1.2-litre turbo-petrol ‘mStallion’ that makes 129 BHP and 230 Nm and a 1.5-litre turbo-diesel that puts out 115 BHP and 300 Nm. Transmission options include a 6-speed manual, 6-speed automatic and a 6-speed AMT.The SUV will be rolled out from M&M’s Nashik facility, where its outgoing version (earlier named XUV 3OO) was also made. The capacity of this facility is 9,000 units per month (including XUV 4OO electric SUV), which will be enhanced to 10,500 units per month in the medium term.While unveiling the model, M&M stated that the he XUV 3XO is offered with a first-in-segment panoramic sunroof and Level 2 ADAS.The SUV is also equipped with a 10.25-inch floating touchscreen infotainment system and a digital instrument cluster, a new 3-spoke steering wheel in addition to  features such as dual-zone automatic climate control with rear AC vents, wireless charger, ambient lighting, ventilated front seats and a 360-degree camera.,\n       ",
    "Overall, the sentiment largely remained in favour of bears given the long bearish candlestick pattern formation on the daily charts, breaking down of the lower end of the rising channel and bearishness in momentum indicator RSI (relative strength index at 38 level), though there is some possibility of rebound due to consistent selling pressure since record high levels. If the Nifty manages to rebound, it may face resistance at 22,000-22,200 levels. But in case of a downtrend, the index may test April lows around the 21,750-21,800 zone, experts said.On May 9, the Nifty 50 plunged 345 points or 1.55 percent to 21,958, and the BSE Sensex dropped 1,062 points or 1.45 percent to 72,404, while the market breadth was majorly in favour of bears as six shares declined for every advancing share on the NSE. The Nifty Midcap 100 index and Smallcap 100 index corrected 1.85 percent, and 2.8 percent respectively.Stocks that bucked the trend and recorded healthy performance despite weakness in benchmarks as well as broader markets, included M&M, Infosys, and Macrotech Developers. Mahindra and Mahindra hit a fresh record high intraday, before closing the session 1.4 percent higher at Rs 2,212.55 on the NSE, and formed a bullish candlestick pattern with a long upper shadow on the daily charts, indicating profit booking pressure at higher levels. The trading volumes remained higher than average.Infosys continued to consolidate after showing a nice recovery from multi-month lows seen on April 19 this year. On Thursday, the stock rose 0.86 percent to Rs 1,439.55, formed a bullish candlestick pattern on the daily charts and closed above the 10-day exponential moving average (EMA).Macrotech Developers climbed 1 percent to Rs 1,123.65, but formed High Wave kind of candlestick pattern on the daily charts, after falling in the previous four consecutive sessions, raising the possibility of a bounce back. The stock traded with above-average volumes.Here's what Shrikant Chouhan of Kotak Securities recommends investors should do with these stocks when the market resumes trading today:Macrotech DevelopersThe stock was in a sloping channel from the past few sessions. Eventually, its downward move stopped near the important demand zone. Moreover, the counter has found support at its short-term moving averages on the daily scale.Unless it is trading below Rs 1,070 positional traders can retain an optimistic stance and look for a target of Rs 1,220 in the coming horizon.Mahindra and MahindraLast Thursday, the stock registered a fresh all-time high of Rs 2,256.75. Despite weak market sentiment, it held positive momentum throughout the day. Technically, on daily charts, the stock is holding higher high and higher low formation and currently, it is comfortably trading above short-term averages, which is largely positive.For the trend-following traders now, Rs 2,150 would act as a key support level. Above the same, the bullish texture is likely to continue. On the higher side, it could move up to Rs 2,275-2,300. On the flip side, below Rs 2,150, the uptrend would be vulnerable.InfosysAfter a short-term correction, the stock took the support near Rs 1,375 and reversed. Post reversal the stock is trading near the 20-day SMA (simple moving average) and is also holding higher bottom formation on intraday charts, which is largely positive. For the positional traders now Rs 1,400 would act as a sacrosanct support zone.Above the same, the stock could bounce back to Rs 1,500-1,525. However, below Rs 1,400 traders may prefer to exit from the trading long positions.Disclaimer: The views and investment tips expressed by experts on Moneycontrol are their own and not those of the website or its management. Moneycontrol advises users to check with certified experts before taking any investment decisions. ",
    "Though the market wiped out all its gains in the last hour of trade and ended moderately lower on April 30 due to caution ahead of Fed meet outcome, overall, the trend remains in favour of bulls as it maintained above all key moving averages as well as continued with higher highs, higher lows formation. Hence, 22,783, the record high levels seen in previous session, is expected to remain as a key hurdle on the higher for the Nifty 50, with immediate support at 22,500 in coming sessions, experts said. The US Federal Reserve on May 1 retained interest rates unchanged at 5.25-5.5 percent.On April 30, the Nifty 50 fell 39 points to 22,605, and formed bearish candlestick pattern on the daily charts, while the BSE Sensex was down 189 points to 74,483. The Nifty Midcap 100 and Smallcap 100 indices ended flat.Stocks that outperformed broader markets and were among the gainers in the Nifty 500 index included HDFC AMC, M&M, Power Grid, PFC, Bank of Baroda, and PNB.HDFC AMC recorded more than 3 percent gains to Rs 3,894.65, which is near the record closing high of Rs 3,903.85 of February 27 this year. The stock has formed bullish candlestick pattern on the daily charts with significantly higher volumes.Mahindra and Mahindra has seen a nice consolidation breakout and rallied 4.6 percent to end at new closing high of Rs 2,156. The stock has seen formation of long bullish candlestick pattern on the daily timeframe with above average volumes.Power Grid Corporation also recorded new closing high of Rs 301.85 on the NSE, rising 2.77 percent with healthy volumes, and formed long bullish candlestick pattern on the daily charts, while PFC has traded above all key moving averages with consistent uptrend and climbed 6.3 percent to Rs 441.55, forming bullish candlestick pattern on the daily charts with strong volumes.Bank of Baroda continued its upward journey for yet another session with healthy volumes, and rose 3.3 percent to Rs 281.50, forming long green candle on the daily timeframe, while Punjab National Bank (PNB) traded above all key moving averages with above average volumes, and advanced by 2.8 percent to Rs 141, the highest closing level February 14, 2018.Here's what Jigar S Patel of Anand Rathi Shares & Stock Brokers recommends investors should do with these stocks when the market resumes trading today:HDFC Asset Management CompanyOver the past 28 trading sessions, HDFC AMC has maintained a range between approximately Rs 3,600 and Rs 3,800. Recently, it broke out convincingly from this range, presenting an attractive opportunity. Additionally, it breached the Bear trendline and closed above the upper Bollinger band, reinforcing the bullish sentiment.Notably, the Daily Stochastics indicator consistently avoided entering the oversold zone prior to the breakout, indicating sustained buying interest within the lower levels of the consolidation range. Consequently, we advise initiating long positions on HDFC AMC within the range of Rs 3,850-3,900, targeting an upside of Rs 4,275, with a stop-loss set around Rs 3,675 based on daily closing prices.Mahindra and MahindraIn the last 14 trading sessions, M&M has traded within the range of roughly Rs 2,010 to Rs 2,135. Recently, it convincingly broke out from this range, offering an appealing opportunity. Furthermore, it surpassed the upper Bollinger Band, coinciding with the consolidation above the middle Bollinger Band, reinforcing the bullish outlook.Notably, the Daily Stochastics indicator remained clear of the oversold zone before the breakout, indicating ongoing buying interest at the lower levels of the consolidation range. Consequently, we recommend initiating long positions on M&M within the range of Rs 2,120-2,160, targeting an upside of Rs 2,385, with a stop-loss set around Rs 2,015 based on daily closing prices.Power Grid Corporation of IndiaDuring the recent trading session, Power Grid experienced a notable breakout above the R4 camarilla pivot at Rs 299.60 levels, maintaining its position above this threshold. Moreover, the daily RSI (relative strength index) has entered into overbought territory, indicating an expected bullish momentum in the days ahead.The combination of price action persisting above the R4 camarilla pivot and the RSI reaching overbought levels forms a strong technical confluence, bolstering the bullish sentiment surrounding Power Grid.Additionally, it surpassed its previous all-time high at Rs 298.90 levels. Consequently, investors may consider initiating long positions within the range of Rs 299-302, targeting an upside potential of Rs 321, with a prudent stop-loss placed near Rs 290 based on daily closing prices.Note: Camarilla Pivot levels are shown in the chart for reference.Here's what Riyank Arora of Mehta Equities recommends investors should do with these stocks when the market resumes trading today:PFC (Power Finance Corporation)The stock has given a good breakout from its Inverted Head & Shoulder formation. With the stock giving a strong closing above its major resistance mark of Rs 435 and volume witnessing a strong pick-up, surging to almost 4 times its average (30) days traded volumes.With the RSI (relative strength index 14) being around 68 on its daily charts, the momentum looks strong. The stock should likely head towards Rs 475 and Rs 480. We advise investors to hold on to their positions with a stop-loss of Rs 425.Bank of BarodaThe stock has touched its immediate resistance zone of Rs 283-285 on its daily time frame charts, forming a 'potential' Double Top. As per the technical structure, the stock has also touched its upper end of the parallel channel formation.With the stock moving well above its moving averages, and the initial base trend being positive, any breakout above Rs 290 should push the rally further in the stock. However, as long as this resistance is not taken out, we might see the stock witnessing a minor dip towards Rs 270-275.We advise investors to follow a wait-and-watch approach on Bank of Baroda until there is a breakout above Rs 290 for buying.PNBThe stock seems to be moving in a rising wedge formation on its daily time frame charts and has touched its upper end of the wedge formation. With RSI (14) being around 68, the momentum continues to look strong.Any breakout above Rs 144 should push the rally further and lead to a breakout on the same. We advise investors to hold their existing long positions and wait for a breakout above Rs 144 - which should push the rally further towards Rs 155 and Rs 160. A trailing stop-loss can be kept at Rs 135 for all existing long positions on the stock.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "After witnessing an all-time high numbers in FY 2023-24, passenger vehicle (PV) sales during April 2024 remained flat at 338,341 units. Industry players reckon that due to the “high base effect” of last year and “lukewarm retails” during election season, the total industry car wholesales were up by just 1.76 percent in April 2024 from 3,32,468 units dispatched during April 2023.The sports utility vehicle (SUV) segment continued to contribute a major chunk of volumes at 181,044 units, which is 53.5 percent of the total PVs sold in the domestic market. The total SUV sales by carmakers grew by 15 percent on an annual basis in April 2024.Out of the total PVs sold in April 2024, Maruti Suzuki India Limited (MSIL)  sold 1,37,952 units in the domestic market, as compared to 137,320 units during the same month last year. While MSIL retained a market share of 40.8 percent, its SUV sales grew by of 38.6 percent YoY at 39,308 units.“The flat sales in the PV industry were due to two reasons. First of all, we started on the high base this (fiscal year) compared to last year. If you see the industry’s network stock last year was much higher than his year. Another reason is the election phase which is going on along with the model code of conduct (coming in),\" Partho Banerjee, senior executive officer, marketing & sales, Maruti Suzuki, told reporters over a virtual call.He went on to add, \"Things will be the same until the month of June and after the new government formation we will see a revival in the market.\" He also reaffirmed that the industry will grow in single digits during the entire fiscal.Hyundai Motor India Limited (HMIL) revealed that its domestic wholesales saw an increase of 1 per cent to 50,201 units last month from 49,701 units in the year-ago period.HMIL COO Tarun Garg revealed that in April, it achieved a fourth consecutive month of 50,000-plus domestic sales this year on the back of models such as Creta, Venue and Exter and other SUVs contributing 67 percent of its total sales.In his view, “In both rural and urban markets, SUVs accounted for 67 percent of our total (domestic) sales, which is a significant departure from previous years when rural demand trailed behind urban markets by 5-7 percent. This transformation in the non-urban markets is largely due to the evolving needs and preferences of rural buyers, who are now seeking vehicles that have advanced technological and safety features.”Tata Motors’ total domestic PV sales. including Electric Vehicles (EVs) rose 2 percent to 47,983 units last month from 47,107 units in April 2023.Mahindra & Mahindra Ltd (M&M ), which recently rolled out the XUV 3XO subcompact SUV, sold 41,008 units of passenger cars in the domestic market in April against 34,698 units in the same month last year, a growth of 18 percent YOY.Toyota Kirloskar Motor (TKM) revealed that its wholesales increased by 32 percent year on year to 20,494 units in April. Out of the total sales, the domestic market accounted for 18,700 units while exports were 1,794 units.\"Our product strategy resonates the strong connect with the market thanks to the diversified portfolio,\" Toyota Kirloskar Motor Vice President, Sales-Service-Used Car Business Sabari Manohar said in a statement.MG Motors India said its retail sales declined 1.45 per cent year on year to 4,485 units in April. The company had reported sales of 4,551 units in April 2023. \n       ",
    "By launching the XUV 3XO at Rs 7.49 lakh (ex-showroom), India’s largest utility vehicle-maker Mahindra and Mahindra (M&M) has undercut the Tata Nexon by Rs 60,000-65,000 (depending on the variant).  Tata Nexon ICE version (priced in the range of Rs 8.15 lakh to Rs 15.6 lakh, ex-showroom), which was the market leader for the past two financial years, averages around 12,000-13,000 units per month.With the XUV 3XO subcompact Sports Utility Vehicle (SUV), the homegrown automaker is looking to target customers who aspire to buy an ultra-premium SUV XUV7OO  (priced in the range of Rs 13.99 lakh to Rs 26.99 lakh ex-showroom), according to a top official of the company.In the process, the company aims to be the market leader in the hyper-competitive subcompact Sports Utility Vehicle (SUV) market, where other models like Maruti Suzuki Brezza, Hyundai Venue and Kia Sonet are already present.“In this Rs 6 lakh segment (of subcompact SUVs), which is 25 percent of the market, we are actually the number fifth player. This is a big opportunity for us to disrupt. In the next three years, we target to be number one or two in the subcompact monocoque SUV segment. To plan for this, we have to do something disruptive and that is where the 3XO comes in,” said Rajesh Jejurikar, executive director and CEO, auto and farm equipment sector, M&M.According to him, “the right to win” comes out with the offer that one brings to the market. “We have done everything possible to create a proposition to ensure we have the right to win. It doesn’t come only out of price, product, technology or features. It is a combination of getting everything right and we think we have done that.”Without sharing any sales target for the model, he stated, “We have set up a fungible capacity (along with XUV 4OO) of 9,000 units per month that will be expanded to 10,500 units per month.”He also clarified that 60-65 percent of the sales will be from gasoline-powered - version and 35-40 from diesel variant. However, he clarified that there won’t be a CNG offering for this model in the near term.“We have a very aggressive gasoline strategy to encash on the size of the 65 percent share (in subcompact SUV segment.” He also revealed that while it continues to do well in tier 2 and 3 cities, the ‘real opportunity” to pick up “substantial volumes” for this model will be from tier 1 cities.According to him, the total size of the SUV market last year was about 2.5 million per annum and about half of that was in the sub four-metre segment at around 1.2 million (per annum). Within that, out of 50 percent is sub-four metre SUV segment, which it considers as the “direct relevant segment”.Exuding confidence that the SUV segment will grow faster than passenger cars (sedans, hatchbacks) in FY25, he maintained that are not true-blue SUVs. “A substantial chunk of SUVs in India are car crossovers. So, it is not a like-to-like comparison by saying that it’s all pure SUVs (which are selling). I would say that the way SUVs are growing in India is faster than cars.”“Buoyed by this, existing and upcoming models (5-door Thar), we aim to grow in mid-teens in our overall volumes during FY 25, Jejurikar further added.Puneet Gupta, director, S&P Global Mobility is of the view that the XUV 3XO has the potential to revolutionize Mahindra's presence in the sub 4-meter SUV segment, enabling the company to capture a larger portion of the compact SUV market.“Given Mahindra's current dominance in the midsize SUV segment, they might be considering expansion into other sub segments as well. X3o at this price will be a game changer product and can be among the customer favourites due to fresh and stunning looks,” said Gupta. \n       ",
    "In a bid to take on Tata Nexon, Hyundai Venue and Maruti Suzuki Brezza, Mahindra and Mahindra (M&M) rolled out the XUV3XO subcompact Sports Utility Vehicle (SUV) at a starting price of Rs 7.49 lakh (ex-showroom). The top-end trim, which is the AX7 L trim, is priced at Rs 15.49 lakh (ex-showroom).“The total size of the SUV market last year was about 25 lakhs per annum and about half of that was in the sub four-metre segment at around 12 lakhs (per annum). Within that, out of 50 percent is sub-four metre SUV segment, which we are defining as the relevant target segment,” Rajesh Jejurikar, ED and CEO, auto and farm sectors, M&M.While the Mumbai-based automaker will open online and offline orders simultaneously from May 15, the deliveries are set to commence from May 26.“In this six-lakh segment (of subcompact SUVs), which is 25 percent of the market, we are actually the number fifth player. This is a big opportunity for us to disrupt. In the next three years, we target to be number one or two in the subcompact monocoque SUV segment. To plan for this, we have to do something disruptive and that is where the 3XO came in from,” added Jejurikar.The model will be rolled out from its Nashik facility, where its outgoing version (earlier named XUV 3OO) was also made. The capacity of this facility is 9,000 units per month (including XUV 4OO electric SUV), which will be enhanced to 10,500 units per month in the medium term.The XUV 3XO will be available with three engine options (2 petrol and 1 diesel) and transmission options will include 6-speed manual, 6-speed automatic and a 6-speed AMT.  It gets several design changes on the exteriors which includes a panoramic sunroof and updated technology on the inside like level 2 of ADAS (advanced driver assisted system), 26.03 cm infotainment screen, Harman Kardon premium audio among many other things.Some of the safety features offered include hill descent control, hill hold control, vehicle dynamics control and traction control. R. Velusamy, President, Automotive Technology and Product Development, M&M said, \"Built on a durable, well-tested platform, it is engineered to meet the highest global safety standards, including the B-NCAP.”The sub-four metre SUV was conceptualised at the Mahindra India Design Studio (MIDS) in Mumbai, and engineered and developed at the Mahindra Research Valley (MRV) near Chennai. Mahindra had spent Rs 650 crore for the development of the platform as well as for revamping the production line to build the newly-launched model.M&M has reconfirmed that XUV 3XO will be its most affordable SUV as it has no plans to relaunch mini-SUV KUV100.  According to Jejurikar, any model below the XUV 3XO “does not match its DNA”.Meanwhile, M&M has reaffirmed that it is the largest sports utility vehicle (SUV) maker in India in terms of revenues, aided by models such as XUV 7OO, Thar, and Scorpio-N.\n       ",
    "Nearly six months after awarding 5-star ratings to Tata Safari and Harrier SUVs, the Global New Car Assessment Programme (Global NCAP) has awarded three, two, and one star ratings to Kia Carens, Honda Amaze, and Mahindra Bolero, respectively.This assessment marks one of the final evaluations under Global NCAP's Safer Cars for India initiative as the country transitions to its own Bharat NCAP safety evaluation program.The 2024 Kia Carens received a 3-star rating for adult safety and 5 stars for child safety. GNAP revealed that the overall build quality of the newer version has been improved by enhancing neck performance and restraint systems, according to GNAP.The Kia India Spokesperson did not respond to emails until the time of publishing this story.While disclosing the test results, Alejandro Furas, Global NCAP Secretary-General, said, \"There has been an improvement in Kia’s rating for the Carens since our original test when the model scored a zero rating for adult occupant protection. However, we were expecting a better performance in the retest given the Carens is fitted with six airbags as standard.\"The Honda Amaze, which previously secured a four-star rating for adult occupant protection and one star for child occupant protection during its 2019 assessment, saw a drop in its ratings under more stringent testing standards. The sedan's rating dropped to two stars for adult protection and plummeted to zero stars for child safety.“Regrettably, Honda did not take the opportunity to update the Amaze with more safety features which explains its disappointing score,” added Furas.Honda Cars India Ltd. (HCIL), in an emailed response, stated that the South Africa-spec 2nd Generation Amaze had already been tested as 4 stars by GNCAP in 2019.“The latest test, based on new protocol, shows that the total score is of a 5-star level with a stable body shell. However, mainly due to the requirement of certain equipment like Electronic Stability Control and Side Curtain Airbags, it resulted in a lower rating,\" HCIL said in an emailed statement, adding, “We are dedicated to continuously working to enhance our vehicles on all parameters of Safety and improve them further at model change timing.”The Mahindra Bolero Neo, a sub 4m SUV widely acclaimed for its versatility and robustness, garnered a 1-star safety rating for both adult and child safety. The model was tested and showed low protection for adult protection in the frontal crash with an unstable structure, unstable footwell area, weak chest protection for the driver, and poor feet protection, according to GNCAP.“We at Mahindra are committed to delivering vehicles that ensure the safety and satisfaction of our customers and users. The Bolero Neo is the trusted utility vehicle of choice in India, owing to its robust build, highly dependable nature, and its innate capability to handle a variety of usage conditions. It has always complied with safety regulations that have been introduced over time and continues to be fully compliant with the latest Indian safety standards,” M&M said in an emailed reply to queries sent by Moneycontrol.According to David Ward, President of the Towards Zero Foundation, this mixed set of results demonstrates that more effort is still needed from some manufacturers to prioritize vehicle safety in the Indian market.“We have seen a great deal of improvement throughout our #SaferCarsforIndia campaign, but it’s clear that maintaining this safety momentum is crucially important. We will be discussing this and other key vehicle safety matters for India during an NCAP24 panel session later today.” \n       ",
    "About 15 carmakers are preparing to launch over 50 new petrol and diesel models by June next year to retain market shares, boosting the count of conventional vehicles even as the government favours a shift towards electric vehicles.According to the data from auto research firm JATO Dynamics India, the 50 new or updated models will be priced in the range of Rs 6 lakh to Rs 3 crore.An estimated 97.68 percent of passenger vehicle sales were ICE (internal combustion engine)-driven in 2023, compared with 98.72 percent in 2022, JATO Dynamics India said.“ICE models will remain a sizeable contributor in the medium term Therefore, carmakers will continue to launch petrol, diesel or hybrid models across various price points in the next few years in order to retain their market shares,” said Ravi Bhatia, president of JATO Dynamics India.Notably, 65 percent of these upcoming ICE (internal combustion engine) models are sports or multi utility vehicles. (See table below)Last year witnessed the introduction of nearly 40 new Interna Combustion Engine (ICE) cars, including models like the Maruti Suzuki Jimny, Fronx, and Invicto (a badge-engineered version of Toyota Innova Hycross), Tata Nexon (available in both ICE and EV options), Honda Elevate, Citroen C3 Aircross, Hyundai Verna and Exter, and facelifts for the Kia Seltos and Sonet, among others.Passenger Vehicle (PV) market leader Maruti Suzuki, which has strengthened its presence in the SUV segment, is expanding its footprint in the hatchback and sedan segments with the Swift Hybrid and Dzire 2024. However, the company is yet to officially confirm the launch of these models.Hyundai Motor India Limited, which already derives 65 percent of its total sales from SUVs, is aiming for a larger marketshare with the Tucson 2024, Alcazar 2024, and the all-new Santa Fe in February 2025, as per JATO Dynamics. An HMIL spokesperson refrained from commenting on future product launches.M&M, having confirmed the launch of the 5-door Thar by mid-August, is considering the Bolero 2024 and XUV9OO. Similarly, Tata Motors is gearing up to launch Curvv (to be available in EV version as well) in August 2024 and the all-new Punch by June 2025, with the company confirming only the rollout of Curvv for this year.Additionally, other ICE SUVs expected to hit the roads include the Kia Sportage, MG Gloster, and sub-four-metre SUVs from Nissan Motor India, Skoda Auto India, and Volkswagen India. In the luxury car segment, Mercedes-Benz India is anticipated to launch the GLC Coupe, CLE Coupe, V-Class, and GLB 2024, while BMW India is set to introduce the all-new 5 Series and M3. Audi may also consider the A3 2024 and Q8 2024 in the coming months.While the official spokespeople of Audi did not respond to emails, a Mercedes-Benz India spokesperson stated that the company has planned 12 new models for CY 2024, of which three will be Battery Electric vehicles (BEVs)BMW India spokesperson, when contacted, revealed that internal combustion engine vehicles form about 90 percent of sales in its current lineup.\"In the coming years, we see the overall demand for luxury cars going up in the Indian market and internal combustion engine vehicles will continue to be an important part of this success along with offerings like electric vehicles,\" the spokesperson noted.\n       "
]