[
    "Motilal Oswal's research report on Maruti SuzukiSuzuki’s manufacturing principle: smaller, fewer, lighter, shorter, beauty Suzuki, the parent company of Maruti Suzuki India (MSIL), has unveiled its next 10-year technology strategy aimed at achieving minimal energy consumption throughout the lifecycle of its products. This goal will be pursued through the principles of Sho-Sho-Kei-Tan-Bi, a Japanese abbreviation for “smaller, fewer, lighter, shorter and beauty.” The strategy encompasses five strategic approaches: 1) the development of a “light-weight yet safe vehicle” as the core foundation, 2) the design of “lean-battery EV and HEV” with optimized materials to meet consumer needs, 3) the integration of “high-efficiency ICE with CNF,” 4) the implementation of “SDV right” for value creation through cost-effective systems, and 5) the promotion of “easy recyclability and disassembly design” to support a circular economy. Some of the focus areas are: 1) further working on weight reduction of 100kg for the next 10 years; 2) in EVs and hybrids, using minimum necessary batteries without excess in order to ensure energy efficiency; and 3) working toward a circular economy. Suzuki believes hybrid cars are the best choice until non-fossil based electric energy usage becomes fully widespread. Accordingly, MSIL has embraced a multi-tech approach (working on CNG, flex fuels, hybrids, and EVs) to achieve its emission targets. It is probably the only company in India to be working on diverse technologies to suit Indian consumer needs. MSIL continues to be our top pick in Auto OEMs with a TP of INR14,440 (premised on 26x June-FY26E EPS).OutlookWe expect MSIL to post a 13% earnings CAGR over FY24-26. Besides, any government incentives for hybrid or CNG or flex fuels are likely to lead to a re-rating of MSIL in the future. The stock trades at 26x/23x FY25E/FY26E consolidated EPS. We reiterate our BUY rating on MSIL with a TP of INR14,440 (premised on 26x June-FY26E EPS).For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Maruti Suzuki_29072024_Motilal Oswal ",
    "Automaker Maruti Suzuki India Ltd on Friday said it has received a demand of Rs 779.2 crore, including interest from the Income Tax authority.The company has received a final assessment order for the financial year 2019-20 from the Income Tax authority, Maruti Suzuki India Ltd (MSIL) said in a regulatory filing.The order has a total demand, including interest, of Rs 779.2 crore, it said, adding that it has also received a showcause notice for initiation of penalty proceedings with respect to the order.MSIL said it will file an appeal before the Income Tax Appellate Tribunal. There is no impact on financial, operation or other activities of the company due to this order.\n       ",
    "Auto major Maruti Suzuki India on Friday said it was partly affected by the global outage of Microsoft systems and production and despatch operations halted briefly.The company, however, said it has been able to resume operations.\"A global IT issue affected several companies across several countries today. This problem was encountered in our company also,\" Maruti Suzuki India said in a regulatory filing.The car market leader further said it immediately initiated precautionary and remedial measures \"and production/despatch operations were briefly halted\".\"The company has been able to resume its operations now,\" Maruti Suzuki said, adding, it does not anticipate any material impact of this incident on its performance.Microsoft users globally, including several in India, have reported massive outages in services, with outage tracking website Downdetector showing users flagging disruptions across various services.There have been reports of disruptions in functioning of several airlines, banks, media outlets worldwide.\n       ",
    "Maruti Suzuki has revealed Suzuki Motor Japan's 10-year technology strategy, as part of which it will aim to reduce the weight of hatchback Alto by 100 kg from the current 680 kg, which will be 15 percent lower.The strategy aims to reduce energy usage by the car over the next decade. Maruti Suzuki shared a statement by Suzuki Motor that said it will focus on energy efficiency and recyclability of batteries, aiming for a carbon-neutral footprint.In Suzuki's assessment, a 200 kg reduction in vehicle weight can cut down on energy consumption by 20 percent at the manufacturing stage and 6 percent when in use.The new strategy by Suzuki will employ “technology that minimizes energyconsumption” from manufacturing to recycling, Suzuki Motor Corp said in the statement.Smaller motors and batteries would hopefully allow Suzuki to lower car prices, the company said. Its high-efficiency engine - the Z12E - will be extended worldwide to minimize energy consumption, the company added.Suzuki Motor also said that it is working on software and driver-assist technologies such as Advanced driver-assistance systems (ADAS), that will help reduce traffic congestion, particularly in key markets like India.In future, Suzuki said it will design products that can be easily disassembled with recycling and re-use in mind.\n       ",
    "Shares of Maruti Suzuki extended gains on July 10 after a solid 6.5 percent surge on Tuesday, as several brokerages sounded bullish on the stock following Uttar Pradesh government's registration fee waiver on hybrid cars.The stock rose over 3 percent to hit an all-time high of Rs 13,285 on the National Stock Exchange (NSE).Analysts at Citi said the tax waiver on hybrid vehicles is a positive development for Maruti, Toyota, and Honda. The note added that the move is expected to benefit Maruti significantly, potentially leading to more hybrid model launches, backing it with a Buy rating with a target price of Rs 15,100 per share.Citi maintains Maruti as its top sector pick, anticipating further volume growth if other states follow the UP government's lead.Follow our market blog to catch all the live actionMorgan Stanley has an overweight call on Maruti with a target price of Rs 14,105 per share. The brokerage said the policy support points to having a diversified portfolio of powertrains as the best strategy in the automotive sector.The sizable incentive by the State government for hybrid cars is a notable boost, it noted. \"This move by UP could inspire other states to adopt similar incentives. Consequently, a portfolio of powertrains, including hybrids, deserves a premium valuation,\" Morgan Stanley added in its note.Macquarie has maintained a Neutral call on Maruti with a target price of Rs 11,565 per share. The reduction in road tax on strong hybrid vehicles by the UP government is seen as a sentiment-positive for the company.This policy reduces the price premium for strong hybrids over internal combustion engine (ICE) vehicles to 10 percent from 20 percent, Macquarie said.Some estimates suggest that the registration waiver could reduce the on-road price of hybrid cars by up to Rs 4 lakh. Maruti Suzuki is expected to benefit significantly as the company offers hybrid features in many of its models.Also Read | Stock radar : Adani Ports and Special Economic Zone, Phoenix Mills, RVNL, BLS International in focusUP's Tax Relief For HybridsIn an effort to promote green mobility, the state government announced a 100 percent registration fee waiver on strong hybrid electric vehicles (HEVs) and plug-in hybrid electric vehicles (PHEVs).It noted that Uttar Pradesh contributed 10 percent to passenger vehicle sales in India in FY24, compared to 11 percent of Maruti's domestic sales, where the company's market share in the state was 44 percent versus 42 percent nationally.In the previous session, Maruti Suzuki shares ended 6.5 percent higher at Rs 12,807 on the National Stock Exchange (NSE). So far this year, the stock has soared 24 percent, beating Nifty's returns of 12 percent during this period. In the last one year, the stock has risen 31 percent. In comparison, Nifty delivered returns of 26 percent during this period.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Maruti Suzuki India plans to utilise Indian Railways to transport 35 per cent of the vehicles produced across its factories over the next 7-8 years, according to MD and CEO Hisashi Takeuchi.The share of vehicle dispatches through railways scaled to 21.5 per cent in the 2023-24 fiscal from 5 per cent in 2014-15.The country's largest carmaker's vehicle dispatches through railways increased from 65,700 units in 2014-15 to 4,47,750 units in 2023-24.\"With our production capacity nearly doubling from about 2 million units to 4 million units by FY 2030-31, we plan to augment the use of railways in vehicle dispatches, close to 35 per cent over the next 7-8 years,\" Takeuchi stated.Maruti Suzuki has so far dispatched over 20 lakh units through Indian Railways. The automaker ferries vehicles to 20 destinations, serving over 450 cities using Indian railways.Takeuchi said the company pioneered the use of railways for vehicle dispatches over a decade ago by becoming the first company in India to obtain the Automobile-Freight-Train-Operator license.Since then, the company has systematically increased its share of vehicle dispatches using railways, he added.\"Through our sustained efforts in green logistics, we have achieved outstanding results including cumulative reduction of 10,000 metric tonne of CO2 emissions and 270 million litre of cumulative fuel savings,\" Takeuchi noted.The company stands committed to the country's net zero emissions target by 2070, he added.Earlier this year, under the PM Gati Shakti programme, Prime Minister Narendra Modi inaugurated the country's first automobile in-plant railway siding at Maruti Suzuki's Gujarat facility.This facility has a capacity to dispatch 3 lakh vehicles per annum.The next in-plant railway siding is in progress at the company's Manesar facility and will be operational soon, the automaker stated.\n       ",
    "Automobile major Tata Motors emerged as the top bet within the sector as it topped the list of stocks that garnered the maximum upgrades from analysts in June. On the other hand, rival Maruti Suzuki saw downgrades in the same tenure. Optimism for Tata Motors is emerging from its plans to demerge the commercial vehicles business into one entity and consolidate the passenger vehicles, including PV, EV, and JLR, into another entity.According to Moneycontrol's Analyst Call Tracker, 'buy' calls for Tata Motors rose to 23 in June as against 20 in the month prior. Along with that, 'sell' and 'hold' calls reduced by one each during the month. On the flipside, rival Maruti Suzuki saw 'buy' calls reduce to 31 in June from the prior 33 while 'sell' and 'hold' ratings rose by one each.Tata Motors' demerger to unlock valueTata Motors' plans to demerge its businesses into two separate entities are seen as a welcome move by analysts. \"Post demerger, Tata Motors' PV business will include both the domestic EV segment and the Jaguar Land Rover (JLR) business. Consequently, its separately listed PV stock will provide an opportunity to invest in both the domestic passenger vehicle market and the global premium passenger vehicle segment,\" Sharekhan stated in a note.Based on this, Sharekhan also believes that the demerger will give investors yet another option to play on the mass-market PV growth story. Accordingly, the firm believes that though rival Maruti Suzuki may still sustain its leadership position in the PV segment, it may not have its TINA (there is no alternative) tag among investors for long. \"Thus, considering the structural positive view on PV segment, we now prefer Tata Motors over Maruti Suzuki,\" Sharekhan said.Meanwhile, Tata Motors also chalked out its plans to raise its market share in passenger vehicles (PVs) and increase its non-vehicle revenues in commercial vehicles (CVs), yet another move that sparks optimism among analysts.Analysts at Jefferies also noted that in PVs, Tata intends to increase its market share from 14 percent in FY24 to 16 percent in FY27 and 18-20 percent by FY30. In CVs, it intends to gradually increase its market share and deliver strong double-digit EBITDA margins.Premiumisation, Hyundai India IPO- a worry for Maruti SuzukiAnalysts at Sharekhan highlighted that even though the PV segment is expected to grow by single digits in FY25, the demand for entry-level models stays lukewarm as it continues to be skewed toward high-end products.Given that Maruti Suzuki represents a classic play on the mass-market PV growth story, the rising trend of premiumisation may moderate its earnings growth, analysts believe.In addition, the much-awaited initial public offer of Hyundai India also gives investors another option to bet on India's growing PV story, implying increased competition for Maruti Suzuki's stock. In addition, the 17.5 percent surge in shares of Maruti Suzuki in the year so far also prompted analysts to be cautious over prospects of a further upside.Also Read | Analyst Call Tracker April 2024: Optimism eludes IT stocks despite upgrades, auto stocks see rating cutsHence, even though the company's growth trajectory remains intact, analysts choose to prefer other rivals due to the availability of better options.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before making any investment decisions. ",
    "Amidst soaring temperatures and hefty discount offerings by auto dealers, Passenger Vehicle (PV) wholesales during June 2024 witnessed  3.67 percent growth at 3,40,784 units as against 3,28,710 units dispatched during June 2023.While the high base effect of last year also resulted in modest growth in volumes, industry players reckon that new launches such as as Maruti Suzuki Swift, Hyundai Creta, etc., continued to contribute to incremental volumes.During the first half of this year, the total sales by PV makers stood at 21,68,512 units, which is 7.6 percent more than 20,15,033 units sold during during corresponding period last year.The country’s largest passenger vehicles maker Maruti Suzuki India (MSIL) reported domestic wholesales of 1,37,160 units in June, up by 3.10 per cent from 1,33,027 units in the same month last year.According to Partho Banerjee, Senior Executive Officer, Marketing & Sales, MSIL, the growth in the PV industry is majorly on the back of the new models that are gaining a lot of traction.“We have managed to sell 35,815 units of the all-new Swift since its launch in early May. Last month itself, we sold 16,000 units despite last month’s production maintenance shutdown,\" revealed Banerjee.Similarly, IPO-bound Hyundai Motor India (HMIL) reported a marginal growth in its domestic wholesales to 50,103 units during the month as compared with 50,001 units in the same month last year.\"We closed H1 of CY2024 with an overall sales growth of 5.68 per cent year-on-year. SUVs have contributed strongly, accounting for 66 per cent of our domestic sales,\" Hyundai Motor India COO Tarun Garg said in a statement.Tata Motors stated that the sales of passenger vehicles, including electric vehicles, in the domestic market, were lower by 8 percent at 43,624 units in June as compared with 47,359 units in the year-ago month.\"Going forward, we foresee recovery of demand, as enquiries have remained strong despite low retails in the past two months. This strong enquiry pipeline, in addition to the onset of festive season from August, augurs well for the industry,\" Tata Motors Passenger Vehicles Managing Director Shailesh Chandra said in a statement.Mahindra and Mahindra’s (M&M) passenger vehicle sales in the domestic market rose 23 percent to 40,022 units last month against 32,588 units in June last year.According to Veejay Nakra, President, Automotive Division, M&M Ltd., “June has been a momentous month, as we rolled out the 200,000th XUV700 from our facility.”Kia India recorded sales of 21,300 units in June 2024, marking 9.8 percent Y-O-Y growth compared to the 19,391 units sold in June 2023.Hardeep Singh Brar – Senior Vice President and National Head Sales & Marketing said, \"We have observed a healthy month-on-month sales growth in H1 2024, averaging over 21,000 units per month.”Toyota Kirloskar Motor (TKM) stated that its domestic wholesales stood at 25,752 units, while exports accounted for 1,722 units.\"Our SUV and MPV segments continue to lead our impressive sales surge thus reflecting a strong consumer preference for these versatile and reliable vehicles,\" Toyota Kirloskar Motor Vice President, Sales-Service-Used Car Business, Sabari Manohar said in a statement.Honda Cars India Limited (HCIL) reported a 5 percent decline in wholesales in the domestic market to 4,804 units in June. The Japanese carmaker had dispatched 5,080 units to its dealers in the domestic market in June 2023.JSW MG Motor India reported a 9 percent year-on-year decline in retail sales at 4,644 units in June.\n       ",
    "India's largest car marker Maruti Suzuki reported strong double-digit sales growth in June, selling 1.79 lakh units which was higher by 12.4 percent compared to a year ago.The strong show in June was backed by a 57 percent year-on-year rise in total export sales at 31,033 units.Shares of Maruti Suzuki were higher by 0.6 percent at 2:40pm, broadly in line with benchmark Sensex.Maruti's total domestic Passenger Vehicle sales (PV) was at 1.37 lakh units, marginally higher compared to a year ago. This includes Utility Vehicles such as Brezza, Ertiga, Fronx, Grand Vitara and Jimny, hinting as stiff competition in the UV space, especially from M&M.M&M's Investor Day presentation in June had shared plans to introduce six new SUVs by 2030, and a total of 23 launches by 2030. Investors have been very bullish on M&M stock given its promising growth outlook and a potential recovery in the farm equipment business for FY25. June also saw M&M and Tata Motors locked in an intense battle of market capitalisation, with M&M briefly overtaking Tata Motors to become India's second most valuable automobile company.However, the mid-sized segment of sedans and compact cars found fewer takers in June this year compared to a year ago. This segment contract in June as well in Q1FY25, with both Alto and the S-Presso models selling less than 9,400 units in June 2024, as compared to 14,054 units a year ago. Sale of compact cars such as Baleno, Celerio, Dzire, Ignis, Swift and WagonR was also lower, at 64,049 units in June, compared to 64,471 units a ago.\n       ",
    "Grappling with prolonged stock holding periods and sluggish sales, auto dealers have asked car makers to delay vehicle dispatches to reduce inventory pile-up at their end. While average inventory levels have averaged 40-42 days for a long time, it has increased to 60 days over the past three months.This surplus has heightened worries about increased interest costs and financial pressure on dealerships.“During the last festive season, dealers received inventory stocks covering more than 60 days. Subsequently, we have been urging OEMs and have even written to SIAM to reduce the dispatch of stocks,\" Manish Raj Singhania, president of the Federation of Automobile Dealers Associations, told Moneycontrol.While expressing concerns over the rising inventory levels of passenger vehicles at dealerships, Singhania said that FADA will also reach out to its industry counterpart, Society of Indian Automobile Manufacturers (SIAM), to advise its members to moderate the unrestricted inflow of vehicle stocks.“Over the last three months, we have seen a steady rise in inventory, and in May, we closed with 55 to 60 days of inventory. That is equivalent to 550,000 to 600,000 vehicles for a two-month stock,” Singhania added. He foresees similar stock levels at the end of June.Explaining the predicament, Singhania stated that auto dealers constantly secure loans to finance vehicle stocks bought from OEMs. These loans come with interest payments meant to be repaid within 60 days.According to the data collated by FADA, PV retail sales during April and May totalled 638,481 units, up by 7.24 percent from 595,361 units registered in the corresponding period last year. Similarly, total PV wholesalers during April and May were 685,886 units, just a 1.26 percent increase from 666,714 units sold during the same period last year, according to SIAM data.Based on this data, the total number of unsold stocks stood at 47,405 units as of June 1, 2024, compared to 71,353 units in the same period last year. While the gap narrowed between PV wholesale and retail figures, the inventory period nearly doubled to 60 days.A spokesperson for SIAM did not comment on the queries sent by Moneycontrol.The FADA president stated that wholesale figures for all segments, including SUVs, have stabilised recently. “With the waiting period for SUVs over, all vehicles, except for a few variants, are available off-the-shelf at dealerships,” Singhania noted.He also said that OEMs need to strike a balance between production levels and demand to prevent overstocking of cars, particularly in the hatchback and sedan segments. “OEMs should bill vehicles according to the retail figures in the market. They should not overbill dealers by pushing stocks of low-demand vehicles.”Inventory period extendsSinghania also revealed that OEMs have been pushing banks, which offer vehicle financing solutions, to extend the revolving credit facility provided to dealers to 90 days to facilitate holding higher levels of inventory. He also claimed that OEMs are urging dealers to extend the tenure of this financing scheme to 90 days, with dealers bearing the additional interest costs.“While dealers are getting an additional month, this scheme enables OEMs to offload more stocks. This would further burden dealerships with interest costs and excess stock,” Singhania noted. \"If they are extending the financing period, they should introduce a scheme to cover the extra interest costs.” In his view, a 30-day inventory level is manageable.Responding to a query from Moneycontrol, India’s largest car maker Maruti Suzuki stated that it has a stock level of 35 to 36 days, which it considers \"manageable\".  The company said that its current inventory pipeline totalled 168,000 units as of early June, and the company does not intend to take any measures to further reduce that count.“We have a network stock of 30-35 days, including transit time. This is neither too high, nor too low, as we are averaging monthly wholesale numbers of 147,000 units. The current levels are also pretty normal, and we do not feel under pressure,” Partho Banerjee, senior executive officer of marketing and sales at MSIL, said on June 1.Hyundai Motor India Limited (HMIL) stated that it had an inventory of 44,774 units in early June. “With average monthly sales of 50,000 units, our inventory is less than four weeks. We take pride in maintaining optimal inventory in our network. We have always done so and plan to continue,” said Tarun Garg, chief operating officer of Hyundai Motor India (HMIL), earlier this month.\n       ",
    "India's market has grown substantially, attracting truly global funds with the ability to invest anywhere in the world. In the past, during the peak of China's market, global funds typically held two or three China e-commerce internet stocks in their portfolios.However, this trend has largely changed, with global investors now favouring one, two, or three mega-cap Indian stocks, according to Jonathan Garner, Chief Equity Strategist for Asia and Emerging Markets at Morgan Stanley.\"This shift has already begun and is expected to accelerate,\" Garner told Moneycontrol in an interview. Simultaneously, India is experiencing a retail-driven boom in small and medium stocks, alongside a surge in options trading.This reflects a broader trend of wealth creation among India's young and dynamic population, he added.Follow our market blog to catch all the live actionGlobal investors now prioritise liquidity and substantial market exposure relative to their benchmark index. Previously, when India constituted a smaller segment, it was often overlooked.However, with India now positioned as the second-largest market in emerging markets and poised to become the largest, global investors cannot afford to disregard its significance, emphasised Garner.He further highlighted several pockets of growth within the Indian market. \"What we like particularly is domestic demand plays,\" he explained. This includes sectors like consumer discretionary, industrials, financials, and real estate.Notably, real estate, a sector previously not recommended for exposure in India, is now gaining momentum.Garner expressed bullishness on specific stocks including ICICI Bank, Maruti Suzuki, GAIL, and Godrej Properties in real estate. In contrast, Morgan Stanley is more cautious on externally earning sectors such as IT services, outsourcing names, pharmaceuticals, and defensive stocks, though they are not in a defensive posture on India overall.The analyst noted a recent shift in sentiment towards consumer and IT stocks post-election, as opposed to infrastructure, capital goods, and other economy-sensitive stocks.With a significant CapEx cycle in recent years, Garner anticipates a continued emphasis on infrastructure but expects the focus to gradually shift towards consumer-driven sectors, which offer a robust environment and a wide range of investment opportunities.Also Read | India poised to replace China as largest market in EM index: Morgan Stanley's Jonathan GarnerJonathan Garner's insights underscore the evolving landscape of India's market development and sectoral preferences. As India continues to attract global funds and shift towards consumer-driven growth, it presents compelling opportunities for investors looking to capitalize on its expanding economy and dynamic market environment.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Passenger vehicle exports from India rose by 2.68 lakh units in the last four financial years with Maruti Suzuki India accounting for nearly 70 per cent of the incremental shipments during the period.As per the industry data, passenger vehicle exports in the 2020-21 fiscal stood at 4,04,397 units. It rose to 5,77,875 units in the 2021-22 fiscal year and to 6,62,703 units in 2022-23 financial year.Last fiscal, exports stood at 6,72,105 units, an increase of 2,67,708 units since 2020-21.In the last three fiscal years, Maruti Suzuki has accounted for 70 per cent of the incremental 2,67,708 units across the industry which were shipped to overseas markets.The auto major’s export shipment increased by 1,85,774 units between FY21 and FY24.When contacted, Maruti Suzuki India Executive Officer Corporate Affairs Rahul Bharti said that factors like addition of more models, adherence to global production standards and tie-up with Toyota have helped in ramping up the exports’ volume.He noted that the company is currently exporting models to around 100 nations across the globe.Top overseas markets for the company currently are South Africa, Saudi Arabia, Chile and Mexico.Other major markets include the Philippines, Indonesia and Ivory Coast. MSI exports models like Baleno, Dzire, Swift, S-Presso, Grand Vitara, Jimny, Celerio and Ertiga.As per SIAM data, overall PV exports stood at 6,72,105 units in FY24, an increase of 1.4 per cent over 6,62,703 units in FY2023.MSI exported 2,80,712 units last fiscal, an increase of 10 per cent over 2,55,439 units in FY23. Rival Hyundai shipped 1,63,155 units in FY24 as compared with 1,53,019 units in FY23, an increase of 7 per cent.\n       ",
    "Amid rising mercury levels and lukewarm retails during election season, passenger vehicle (PV) sales during May 2024 saw Year-on-Year (YOY) growth of 4.4 percent at 3,50,257 units as against 3,35,436 units dispatched during May 2023.  The high base effect of last year also resulted in modest growth in PV volumes last month.Maruti Suzuki’s total domestic PV sales rose marginally to 1,44,002 units last month from 1,43,708 units in the year-ago period. During May 2024, the company’s marketshare  in the entire PV market stood at 41.1 percent.When enquired about the modest growth in PV market last month Partho Banerjee, Senior Executive Officer, Marketing and Sales, said, “As the high base effect (of 2023) has come in, the growth will not be significant this year.” He also stated that there was some \"postponement of sales\" by prospective buyers due to scorching heat and ongoing elections during the last month.The country's largest carmaker's total domestic sales, comprising LCVs, sales to OEMs (Toyota) and PVs, were 1,57,184, up by 3 percent from 1,51,606 units in May 2023. According to Banerjee, while there were some bookings, their customers were waiting for the final purchase once the new government is formed.“From the middle of June, after the new government is formed, we will see some traction. We are hopeful that we will start see the greenshoots coming once the election results are announced and we get a stable government,” added Banerjee.Hyundai Motor India’s domestic dispatch of vehicles to dealers saw 1 per cent rise to 49,151 units last month from 48,601 units in the year-ago period.\"We have maintained a healthy total sales volume in May 2024, despite a week-long routine bi-annual maintenance shutdown at our Sriperumbudur factory,\" HMIL COO Tarun Garg said.He also stated that SUVs, which contributed 67 percent of its total sales, continue to be a \"growth driver\"  for the company. \"Our rural penetration stood at a healthy 20.1 per cent in May,\" added Garg.Mahindra & Mahindra (M&M) achieved overall sales of 71,682 in month of May 2024, recording a growth of 17 percent over last year. Total sales include passenger vehicles sales of 43,218 units, higher by 31% over 32,886 units sold in May 2023Tata Motors' total domestic PV sales, including EVs, were 46,697 units , up by just 2 percent from  45,878 units last year.Kia India stated its total wholesales increased 4 percent year-on-year to 19,500 units in May. The South Korean carmaker had dispatched 18,766 units to dealers in May 2023.\"So far in this year, we have been aggressive in introducing new competitive variants of our models, which has contributed significantly to our sales,\" Kia India Senior VP and Head Sales & Marketing Hardeep Singh Brar said in a statement.Toyota Kirloskar Motor (TKM) reported 24 percent YOY  increase in total wholesales (including exports) in May at 25,273 units. Last month, domestic sales stood at 23,959 units.\"The newest addition to our robust SUV lineup, the All-New Urban Cruiser Taisor, reaffirms TKM’s commitment to meeting the dynamic demands of the market. Furthermore, the sustained enthusiasm shown by customers towards all our products and services underscores the success of our product strategy and our deep market connection,\" TKM Vice President, Sales-Service-Used Car Business Sabari Manohar said in a statement.MG Motor India, however, reported a 5 percent dip in wholesales at 4,769 units in May compared to the same month last year. The company had dispatched 5,006 units to dealers in May 2023. \n       ",
    "Encouraged by record sales in FY24, the country's top four passenger vehicle (PV) makers have committed investments exceeding Rs 1 lakh crore for the current fiscal year, according to data compiled by Moneycontrol. This confidence, according to industry experts, is rooted in the nearly 4.23 million units of PV sales during the year ended March 31, with sustained growth projected for the coming years.While a significant portion of investments from carmakers like Maruti Suzuki, Hyundai Motor India, Tata Motors, Mahindra and Mahindra (M&M), and JSW-MG Motor India will be allocated to expanding capacities for Internal Combustion Engine Vehicles (ICEVs) to meet demand, a considerable sum will also be directed towards platform, product, and technology development for Electric Vehicles (EVs).Big ticket plans Among the top car makers, Maruti Suzuki, aiming to reclaim its 50 percent market share by the middle of the decade, plans to invest Rs 10,000 crore in various initiatives, including new model development, capacity creation and expansion, etc., for the current financial year. The current year's capex is a part of the Rs 1.25 lakh crore-outlay that the carmaker has earmarked till 2030-31,  a senior company official told Moneycontrol.Hyundai Motor India Limited (HMIL), which achieved all-time high sales in CY 2023 and FY 2023-24, intends to spend Rs 13,180 crore in the medium term, primarily focusing on expanding its manufacturing capacity. Of this amount, nearly Rs 6,180 crore will be invested in constructing a greenfield facility in Chennai, Tamil Nadu, and Rs 6,000-7,000 crore for overhauling production lines at its Talegaon facility, Maharashtra.Unsoo Kim, MD and CEO of Hyundai Motor India, emphasized that these recent investments are in addition to the previously announced Rs 20,000 crore investment towards capacity expansion, new products, and a battery pack assembly plant, outlining HMIL’s vision for the next decade in India. Notably, the South Korean carmaker is also considering listing its India unit and experts feel that a bulk of the fund raise is expected to go towards expanding capacities and product development.Homebred auto major Mahindra and Mahindra (M&M) has declared plans to invest nearly Rs 27,000 crore during FY 2025-27 in product development, capacity expansion, and technological advancements in the automotive division.“We are not neglecting ICEVs, as they remain an important part of our portfolio for consumers over the next five to seven years. Therefore, Rs 14,000 crore will be allocated to ICEVs, covering new models and refreshes, ensuring that we maintain the best SUV portfolio”  Anish Shah, MD & CEO of M&M Ltd said recently at a post Q4 earnings call.Another indigenous automaker, Tata Motors, announced an investment of Rs 43,000 crore for products and technologies in 2024-25. Jaguar Land Rover (JLR), Tata Motors’ British arm, is expected to account for the bulk  of this, around Rs 35,000 crore.P.B. Balaji, Group CFO of Tata Motors, at a post Q4 earnings call highlighted, “In FY25, JLR investments will see a 6 percent increase, while Tata Motors investments will remain stable,” noting that the investments are primarily directed towards product and technological advancements for both JLR and Tata Motors.JSW MG Motor (formerly MG Motor India) recently revealed plans to invest Rs 5,000 crore to enhance production capacity and launch a new car every 3-6 months starting from September. The joint venture between China's SAIC and Indian conglomerate JSW Group aims to replicate a \"Maruti moment\" in the new energy vehicle segment.A year after announcing Rs 5,300 crore investment plans in India, Nissan Motor Corporation and Renault SA have unveiled their future portfolio expansion, with four new sport utility vehicles (SUVs) expected to hit the market starting from 2025. \n       ",
    "Indian automobile majors Maruti Suzuki and Eicher Motors fell prey to brokerages' axe in April, becoming the two most downgraded stocks during the month owing to a tepid outlook and concerns over demand moderation.In April, Maruti Suzuki saw a decline in positive recommendations from analysts, with 34 buy calls compared to 41 in March, alongside nine hold calls (up from six) and three sell calls (unchanged). Similarly, Eicher Motors experienced a shift in sentiment, with 17 analysts recommending a buy (down from 19 in March), 13 suggesting to hold, and 11 advising to sell their stocks during the same period.In April, Maruti Suzuki shares gained nearly two percent while the Eicher Motors stock surged over 14 percent.ALSO READ: Analyst Tracker: Wipro stock sees maximum pessimism in April on weak IT outlookMaruti treads on bumpy roadFollowing Maruti's strong Q4 results on April 26, a slew of brokerages issued bearish views on the country's leading four-wheeler automobile manufacturer, since the earnings were mostly priced in.Domestic brokerage Kotak Institutional Equities has issued a 'sell' call on the Maruti Suzuki stock with a price target of Rs 10,500, a downside of over 17 percent from the last closing price. Analysts suggest that the volume trajectory is likely to remain muted over FY25.Further, they said that the company's volume trajectory in the small and SUV segment is likely to decline. \"We expect market share to slip to about 40.5-41 percent owing to newer launches by competitors,\" said a Kotak research note.The company reported a 48 percent rise in its net profit to Rs 3,878 crore for the fourth quarter led by higher sales volume and favourable commodity prices. The Wagon R maker registered a revenue of Rs 38,235 crore in the three months ended March 31.Nomura is 'neutral' on the stock and has a price target of Rs 12,523. It is also of the view that market share can come under threat from other players in FY 2025-26. The brokerage also predicts that discounts could rise as inventory increases.Axis Securities recently downgraded the stock to 'hold' from 'buy' citing expensive valuations as growth volume in the entry-level car segment will remain muted in the near term. Furthermore, competition in SUVs or sports utility vehicles is expected to escalate. Maruti competes with the likes of Mahindra and Mahindra, Tata Motors, and Hyundai.READ MORE: Analyst Call Tracker | HDFC Life, HUL see upgrades despite underperformingWhat's hurting Eicher Motors?In the last three months, Eicher Motors stock has trailed Nifty peers Hero MotoCorp and Bajaj Auto. Multiple analysts have expressed caution for the company.Morgan Stanley maintains its 'underweight' rating on the Royal Enfield maker. The firm noted that Royal Enfield is moving from a period of strong growth with high margins to one of slower growth with high margins maintained. They suggested that current valuation multiples seem expensive when considering long-term growth potential.However, just like its competitors, the company remains positive about volume growth in the fiscal year 2025. The brokerage raised the target price to Rs 3,533 significantly lower than the current market price of Rs 4,657.Analysts also suggest that short-term challenges are anticipated for the VECV business, a joint venture with Volvo, attributed in part to ongoing elections and a slowdown in infrastructure projects. This results in limited upside potential for the stock, suggesting that its current price already factors in the positive market share momentum, recent product launches, and a recovery in exports.In a recent report, Nuvama Institutional Equities maintained its 'hold' call on the Eicher Motors stock. Royal Enfield (RE) is facing intense competition from global brands, and that is likely to sustain, Nuvama predicts, expecting underperformance to persist with a moderate volume CAGR of 5 percent in the domestic market over FY24–26.Analysts at Elara Securities suggest that RE may lose market share in the premium segment in FY23-26, amid launches by peers. The contribution share of existing RE customers upgrading to a new RE may not rise significantly, and any major outperformance versus industry growth is unlikely. Thus, premium valuation at 20-70 percent versus peers is unjustified.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "KR Choksey's research report on Maruti SuzukiMSIL’s reported numbers were a miss across Revenue/ EBITDA/ PAT. The sequential decline in average realizations led to slightly lower revenue (-1.5% deviation) while sequential gross margin pressure led to lower than estimated EBITDA and margin. MSIL had its highest-ever sales, domestic sales, exports, net sales and net profit in both Q4FY24 and FY24. The Board of Directors recommended the highest-ever dividend of INR 125 per share compared to INR 90 per share in FY23. We continue to like MSIL due to the strong capex plans in the medium term, focus on high-demand spaces like SUVs/ CNG/ hybrids along with EVs in the pipeline, strength in export markets and margin stability.OutlookWe revise our EPS estimates by +1.6%/ +2.5% for FY25E/ FY26E, respectively as we increase our average realization to factor in stronger growth in CNG, hybrids and exports. We apply a P/E multiple of 27.5x on FY26E EPS of INR 544.2 to arrive at a target price of INR 14,975/ share (unchanged), with an upside of 16.8%,retaining our “BUY” rating.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Maruti Suzuki India - 02052024 - kr ",
    "Shares of Maruti Suzuki India declined nearly 2 percent to Rs 12,577 in morning trade on May 2 after the automobile major reported that its mini cars and compact car sales witnessed a notable decline in April.At 9:20 am, the counter was trading at Rs 12,593, down 1.8 percent from the previous close on the NSE. The shares have rallied 25 percent in the last three months.Maruti reported total sales at 1,68,089 units in April, up 5 percent from the year-ago period but fell month-on-month. However, total domestic passenger vehicle sales gained marginally to 1,37,952 units compared to 1,37,320 units in the year-ago period.Follow our live blog for all the market updatesSales of mini segment cars, comprising Alto and S-Presso, declined to 11,519 units as against 14,110 units in April 2023. Compact cars, essentially Baleno, Dzire, Celerio and Ignis, also slumped 24 percent to 56,953 in April from the year-ago period.On the other hand, sports utility vehicles or SUVs like Brezza, Fronx, Grand Vitara, and Invicto sales jumped a healthy 54 percent in April.India's largest four-wheeler OEM reported a 48 percent rise in net profit to Rs 3,878 crore for the fourth quarter ended March 31, 2024, on account of higher sales volume and favourable commodity prices.In the entire financial year, the standalone net profit of the company surged by over 64 percent, reaching Rs 13,209 crore compared to Rs 8,049 crore in the previous year ending March 2023. Concurrently, its total revenue from operations witnessed a 20 percent rise, amounting to Rs 140,933 crore for the fiscal year ended March 2024, up from Rs 117,523 crore recorded in FY23.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "After witnessing an all-time high numbers in FY 2023-24, passenger vehicle (PV) sales during April 2024 remained flat at 338,341 units. Industry players reckon that due to the “high base effect” of last year and “lukewarm retails” during election season, the total industry car wholesales were up by just 1.76 percent in April 2024 from 3,32,468 units dispatched during April 2023.The sports utility vehicle (SUV) segment continued to contribute a major chunk of volumes at 181,044 units, which is 53.5 percent of the total PVs sold in the domestic market. The total SUV sales by carmakers grew by 15 percent on an annual basis in April 2024.Out of the total PVs sold in April 2024, Maruti Suzuki India Limited (MSIL)  sold 1,37,952 units in the domestic market, as compared to 137,320 units during the same month last year. While MSIL retained a market share of 40.8 percent, its SUV sales grew by of 38.6 percent YoY at 39,308 units.“The flat sales in the PV industry were due to two reasons. First of all, we started on the high base this (fiscal year) compared to last year. If you see the industry’s network stock last year was much higher than his year. Another reason is the election phase which is going on along with the model code of conduct (coming in),\" Partho Banerjee, senior executive officer, marketing & sales, Maruti Suzuki, told reporters over a virtual call.He went on to add, \"Things will be the same until the month of June and after the new government formation we will see a revival in the market.\" He also reaffirmed that the industry will grow in single digits during the entire fiscal.Hyundai Motor India Limited (HMIL) revealed that its domestic wholesales saw an increase of 1 per cent to 50,201 units last month from 49,701 units in the year-ago period.HMIL COO Tarun Garg revealed that in April, it achieved a fourth consecutive month of 50,000-plus domestic sales this year on the back of models such as Creta, Venue and Exter and other SUVs contributing 67 percent of its total sales.In his view, “In both rural and urban markets, SUVs accounted for 67 percent of our total (domestic) sales, which is a significant departure from previous years when rural demand trailed behind urban markets by 5-7 percent. This transformation in the non-urban markets is largely due to the evolving needs and preferences of rural buyers, who are now seeking vehicles that have advanced technological and safety features.”Tata Motors’ total domestic PV sales. including Electric Vehicles (EVs) rose 2 percent to 47,983 units last month from 47,107 units in April 2023.Mahindra & Mahindra Ltd (M&M ), which recently rolled out the XUV 3XO subcompact SUV, sold 41,008 units of passenger cars in the domestic market in April against 34,698 units in the same month last year, a growth of 18 percent YOY.Toyota Kirloskar Motor (TKM) revealed that its wholesales increased by 32 percent year on year to 20,494 units in April. Out of the total sales, the domestic market accounted for 18,700 units while exports were 1,794 units.\"Our product strategy resonates the strong connect with the market thanks to the diversified portfolio,\" Toyota Kirloskar Motor Vice President, Sales-Service-Used Car Business Sabari Manohar said in a statement.MG Motors India said its retail sales declined 1.45 per cent year on year to 4,485 units in April. The company had reported sales of 4,551 units in April 2023. \n       "
]