[
    "India's recovery from COVID appears to have favoured urban areas, with rural recovery lagging, said Jefferies in a recent report. However, a significant increase in new home construction and higher private investment is expected to create more job opportunities in the rural areas. Additionally, the government's focus on welfare spending could boost investor confidence, according to the report.Jefferies projects consumer staples such as GCPL and Marico for potential gains in this recovery.Read more: Banks' valuations look reasonable, 2024's credit growth to be around 15%: JefferiesThe report noted that in the FMCG and staple goods sector, smaller businesses are gaining market share, indicating increased demand at the lower end. The Jefferies India Strategy Report emphasises consumer staple and certain discretionary stocks, particularly in the automotive sector, with a significant share of sales in rural areas. In the consumer sector, GCPL and Marico are their preferred choices.In 2023, the rural and agricultural sectors received support through increased farm purchase prices, reaching a five-year high for rice and wheat crops. Looking ahead to 2024, being a national election year, historical patterns indicate a focus on significant schemes benefiting the rural and economically weaker sections. Jefferies stated that before the 2019 elections, the Modi government introduced the Rs 800-billion minimum basic income scheme for small farmers. The 2023 state elections also demonstrated the BJP's willingness to implement substantial income transfer programmes, including monthly transfers for women and landless laborers.Read more: Zomato denies Shiprocket acquisition report, Jefferies bullish on stockRural importanceIndia’s packaged consumer goods companies reported robust urban growth in the September quarter, marked by a consumer preference for premium products, while demand in rural markets remained subdued. A recovery in rural regions is important for FMCG firms, as it constitutes more than one-third of their overall sales.Although the first quarter of FY24 faced challenges with untimely rains, the second quarter experienced irregular rainfall and pressures from food inflation. Marico reported issues such as increasing food prices and irregular rainfall in some areas hindered the expected recovery in rural demand. Dabur India noted year-on-year improvement in FMCG consumption but highlighted weather uncertainties affecting rural demand.Nestle India is enhancing its presence in rural areas through effective distribution and marketing efforts, distinguishing itself from other FMCG companies facing sluggish rural recovery.Also Read: Why are analysts not too happy with Nestle India? \n       ",
    "Highlights FMCG (fast-moving consumer goods) companies, especially in the staples categories, are likely to report low to mid-single-digit volume growth and a decline in revenue growth, given the price correction.Demand and margin trends for the December 2023 quarter are likely to be broadly similar as in the September 2023",
    "Big FMCG players are increasing advertisement and promotional (A&P) spends as they look to drive volume growth amid growing competition from smaller regional brands, analysts said.While leading industry names such as Godrej and Dabur have increased marketing spends, the country’s largest FMCG player HUL noted in its latest post-earnings call that while the primary focus of the company remains competitiveness in pricing, it continues to invest heavily in advertising and promotion to keep its \"share of voice\" ahead of the share of the market.Godrej Consumer Products Limited (GCPL) has increased spends approximately to 10 percent of the company’s turnover in Q2, which is approximately 200 bps more than the same quarter last year and 400 bps versus the same quarter two years ago.  “This has led to value market share gains in five of our top six global cells and volume market share in six of six.” said Sudhir Sitapati, Managing Director and Chief Executive Officer, GCPL, in a post-earnings call. Similarly, Dabur increased its Q2 A&P investments by around 43 percent.Read more: FMCG TV ad volumes surge 6% in first half of 2023 on rural demand picks upThe Chyawanprash maker said that media investments are essential to drive long-term sustainable growth and maintain market leadership. Similarly, Tata Consumer Products Limited (TCPL) said that India A&P spends continued to be high at 6.7 percent for their India business.The company said in its post-earnings call that it has started to put money back into A&P to strengthen brands so that they move from a push-based model to a pull-based model internationally.Read more: Cricket World Cup to drive festive advertising, spends to grow 15%According to market research firm Kantar Worldpanel, for the July-September 2023 quarter, the adoption of local brands in households has increased by 4-31 percent in categories such as detergent bars, washing powder, biscuits, and soaps. In comparison, larger players experienced growth ranging from 2-10 percent within households during the reviewed quarter.“Most categories have seen upticks in terms of ad spends because commodity prices have come down and companies have money to spend on A&P.” said Vishal Gutka, analyst at Philips Capital.Analysts noted that among the available options, brands are increasingly focusing on the digital medium for a higher return on investment (ROI) due to a higher rate of conversion.For instance, Nestle increased its digital ad spend anywhere between 20 percent to 70 percent across brands. “It is easier to keep track of customer engagement in the digital medium,” said Gutka.This trend will persist in the upcoming quarters as there is no other effective method for boosting volume growth in the current scenario. “Rising competition from regional players and a lack of volume growth is leading to higher spends,\" said Gutka.\n       ",
    "Net Sales at Rs 5,036.82 crore in September 2023 up 9.71% from Rs. 4,591.00 crore in September 2022.Quarterly Net Profit at Rs. 908.08 crore in September 2023 up 35.87% from Rs. 668.34 crore in September 2022.EBITDA stands at Rs. 1,258.14 crore in September 2023 up 20.82% from Rs. 1,041.32 crore in September 2022.Nestle EPS has increased to Rs. 94.18 in September 2023 from Rs. 69.32 in September 2022.Nestle shares closed at 24,132.35 on October 19, 2023 (NSE) and has given 23.98% returns over the last 6 months and 28.61% over the last 12 months.",
    "Nestle India Limited shares hit a fresh record high on October 19 after the FMCG major reported a 36 percent surge in consolidated net profit to Rs 908 crore for the September quarter of FY24 as against Rs 668.3 crore a year ago.Total revenue of the company stood at Rs 5,036 crore, rising 9.6 percent from Rs 4,591 crore a year ago, the FMCG major said in a regulatory filing.According to a poll of three brokerages, Nestle India's Q3 revenue was seen at Rs 5,177.1 crore, while its net profit was expected at Rs 841.4 crore.EBITDA rises, Margins expandNestle's earnings before interest, tax, depreciation and amortization (EBITDA) for the quarter under review came in at Rs 1,225 crore, up 1.6 percent from CNBC-TV18 poll of Rs 1,205 crore. EBITDA margin increased by 220 basis points (bps) YoY to 24.3 percent from 22.1 percent in the corresponding quarter of last fiscal.Domestic sales riseDomestic sales grew 10.3 percent, on account of mix, volume, and price. \"We crossed Rs 5,000 crore turnover, which has been our first in any quarter in the history of the Company and a landmark for us,\" said Suresh Narayanan, Chairman and Managing Director, Nestle India.Also Read | Nestle India announces 1:10 stock splitOutlookUneven rain and rain deficit is expected to impact production of maize, sugar, oilseeds and spices which may have an adverse impact on pricing, Nestle said in a release. Additionally, coffee continues to be volatile because of the global supply deficit. The weather during the harvest of the Indian Robusta crop may impact production.\"Upcoming winter weather may impact wheat production. Healthy milk flush is expected in winter which is expected to keep prices stable,\" the FMCG major said.Nestle announces dividendAlong with its quarterly earnings, Nestle India board also declared a second interim dividend of Rs 140 per equity share of Rs 10 each for the year 2023. This dividend will paid on or from November 16, 2023, and the record date for the same has been fixed at November 1, 2023.Nestle's 1st ever stock splitThe Nestle board approved a stock split in the ratio of 1:10. The Nestle stock closed at Rs 24,080, up 3.5 percent on the National Stock Exchange.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions\n       ",
    "Nestle India is expected to outperform its FMCG counterparts, by reporting strong earnings growth in the July-September (Q3CY23) quarter, led by stable volume growth and strong pricing growth.The company, which follows a January-December financial year, is due to announce its Q3 results on October 19.The biscuit-to-confectionary company’s result expectations diverge from industry peers, which cut prices in a period of easing commodity costs.The FMCG company is likely to clock a 26 percent year-on-year (YoY) growth in net profit, at Rs 833 crore, in Q3CY23, estimated analysts.Broad-based growth across citiesAccording to the average of three brokerage estimates, a broad-based growth across cities is expected to drive the company’s revenue by 12.5 percent YoY to Rs 5,136 crore in Q3CY23. Sequentially, it is likely to rise 11 percent.Though rising price trends were seen in coffee and dairy products, analysts say that the softening prices of edible oils and packaging, coupled with no discounts, will enable the company to override any pressure on margins.Nestle India’s earnings before interest, tax, depreciation, and amortisation (EBITDA) margin is estimated to expand up to 235 basis points on-year to 24.5 percent in Q3CY23, helped by deflation in commodity costs, price hikes, and operating leverage.Analysts at Kotak Institutional Equities believe that Nestle India will outperform peers. “Nestle India is well-placed to outperform the FMCG pack by a healthy margin and stable volume growth. The company will clock 4 percent volume growth and 7 percent value growth in Q3CY24,” they added.Long-term growth leversAnalysts at Prabhudas Lilladher said that the long-term growth drivers remain intact for the FMCG company.“The long-term growth levers include growth across channels like out-of-home consumption (OOH), and e-commerce, sustained expansion in rural reach, huge scope for growth in coffee, and innovation across core segments. We estimate 13 percent earnings per share (EPS) compounded annual growth rate (CAGR) of 13 percent over CY23E-CY25E for Nestle India,” the brokerage firm added, sharing an ‘accumulate’ rating on the counter, with a target price of Rs 23,585 per share.That said, the company is set to receive only 20 percent revenue contribution from rural India (the lowest among stable companies), said analysts.This muted demand trend, however, is set to improve gradually as inflation moderates, liquidity pressures ease, and healthy sowing trends emerge.Some of the important factors that investors should watch out for are the commentary on recovery in trade channels and rural demand, new product pipeline, and demand trends in the packaged food segments.\n       ",
    "Nestle SA said the total amount of food and drink sold globally has been falling since the start of the year, highlighting the challenge for the sector.“People are consuming less, or they’re eating less or they’re wasting less or they’re eating more out of home,” outgoing Chief Financial Officer Francois-Xavier Roger said during a Bernstein conference Thursday. “It’s difficult to know. I don’t think it will last.”Large consumer goods companies have grown sales through sharp price rises in recent quarters, and many have suffered declines in volumes. Nestle hasn’t raised prices much since the start of April, Roger said.US consumers have been resilient, but the end of Covid-era subsidies and savings is starting to impact consumption, the CFO said. Nestle’s China business hasn’t recovered as quickly as the company had expected.Roger said Nestle is more optimistic about Europe, having been worried about that market’s access to energy last winter.Nestle shares fell as much as 1% Thursday. They have dropped about 4% this year.The Swiss company makes food ranging from KitKats to Maggi stock cubes and has been reshaping its food portfolio as it’s still optimistic that consumers will want to eat healthier products. Nestle announced a target on Thursday to boost sales of its more nutritious products by as much as 25 billion Swiss francs ($27 billion) by 2030. That would be about 50% more than the 2022 level.Roger, 61, who will be replaced by Anna Manz, the finance boss of the London Stock Exchange Group, is confident he is leaving Nestle in good shape as he takes his next “exciting” step in his career, which is yet to be disclosed.He said Nestle continues to look at deals but most of those the company is assessing aren’t “must-haves.” The food maker could make small acquisitions that would boost earnings growth, he said.Nestle will probably revisit its share buyback program next year, the CFO also said. The company can finance paying 7 billion francs in dividends and 3 billion francs on repurchasing shares each year, he added.Asked about Nestle’s stake in L’Oreal SA, Roger said keeping the holding just above 20% allows the food company to include the French cosmetic maker’s earnings in its figures and that going below that threshold would hit earnings per share.\n       ",
    "FMCG companies in India are betting on smaller pack sizes and low price points as they chase double-digit growth in rural markets.“We have expanded our product basket in the rural market by way of newer Low Unit Price (LUP) or affordable packs across categories to feed these markets and push demand growth,” said Mohit Malhotra, CEO, Dabur India.The company has stepped up investments to tap into the resurgence of rural demand, increasing the company’s reach to over 100,000 villages.“We have also invested in consumer activations in rural India to better reach out to consumers in the hinterland, giving them an opportunity to touch, feel and experience our products,” Malhotra added.Nestlé India, on the other hand, is re-launching its flagship Maggi noodles at the Rs 10 price point, targeting smaller towns and villages to regain market share and fend off competitors in the packaged consumer goods segment.This repositioned Rs 10 pack, at 40gm, targets \"Rurban\" regions across 15 states, while continuing at the same price in parts of Punjab and Uttarakhand. Prices like Rs 5 and Rs 10 have a bigger recall and are convenient for transactions, making them appealing for affordable consumer goods like food and shampoos. Maggi Masala noodles also come in Rs 7 (32gm) and Rs 14 (70gm) variants.Nestle and other FMCG companies continue to tweak their rural strategy to capture a bigger share of this growing market.Dabur India has also initiated Project Yoddha, which focuses on penetrating small villages nationwide and identifying local entrepreneurs. Through this initiative, the company aims to establish brand ambassadors in each village but also offer consistent income opportunities to the rural community.The rural promiseA Euromonitor insight published on September 11 noted that despite rising urbanisation and expansion of metro and non-metro cities, by 2040, rural areas will house half of all Indian families, in contrast to the global trend where only a third of households will be in rural settings.Rural consumers often prioritise spending on necessities and tend to choose value packs to make the most of their budgets. The physical landscape and ease of access to products also significantly influence their buying decisions, the report added. Hence, for businesses aiming to prosper and widen their reach in India, a strategy centred on affordability, value, and robust distribution networks catering to the rural market is crucial.LPUs driving growthAccording to NIQ August data for India, driven by unit growth in urban, rural, modern, and traditional sectors, consumption has experienced double-digit growth, predominantly fuelled by smaller pack sizes. Although there's been a rise in the average pack size, it's still negative in most markets, excluding urban ones. It's crucial for brands now to offer the appropriate product assortment and pack sizes, the report added.Analysts say that many companies are focusing on low price points (LPUs) to boost sales of these affordable units. “Rural markets are largely driven by LPUs and low price point stock keeping units (SKUs),” said Ajay Thakur, an analyst at Anand Rathi Institutional Equities.Digital penetration in rural marketsAnalysts noted that digital penetration in rural markets has seen a significant surge, driven by affordable smartphones and expanding internet infrastructure. This growth is transforming how rural consumers access information, products, and services, opening new avenues for businesses and empowering communities with digital tools and resources.Rural consumers are shifting towards seeking value rather than just focusing on price. Digital access in rural areas is now on par with or even exceeds TV accessibility, a Proctor & Gamble (P&G) spokesperson said. “This change presents fresh opportunities for advertisers and simultaneously educates consumers about their available choices, further driving their aspirations.”For P&G, the primary emphasis has been on enhancing direct distribution in rural areas, the spokesperson said, adding, “By integrating artificial intelligence and machine learning with the insights into local consumer patterns, we ensure our products reach the appropriate stores with the ideal mix.”Outlook for rural demandAccording to data for August by NIQ, a consumer intelligence firm, both rural and urban markets in India are witnessing growth. While the rural market's growth is somewhat uneven, it saw a 4 percent increase from the previous year. The urban market maintained its upward trend, with growth jumping from 5.3 percent in Q1 2023 to 10.2 percent in Q2, the report added.Demand trends in both urban and rural India are showing signs of improvement, said Malhotra. “While rural India has been a key driver of growth a few years back, we have seen rural demand lagging urban demand for some quarters now. While rural is still behind urban, the gap is narrowing significantly,” he added.The expectation is that, following the festival season, rural markets will draw level with urban ones, although they aren't projected to surpass them at the moment, said Thakur.\n       ",
    "Looking at the first upcoming clean, Covid-free Diwali after 2019, Nestle India Chairman and MD Suresh Narayanan feels that Nestle India will “do better than last year”.In conversation with CNBC TV18, he hopes to be lucky enough to hit double digits, with the only dampener in the equation being food inflation, although witnessing premiumisation in Nestle products at the same time.Shedding light on packaged foods and beverages, Narayanan says that it constitutes just $100 billion out of the total $800 billion food segment. “Focussing on penetration-led volume growth, it would take us easily a decade or two. So improving on the same will provide good returns by the company,\" he says, adding that the category is expanding as Nestlé’s resonance is going up even in smaller towns.Lastly, Narayanan says that the quest for acquisition is definitely there with the company, though there is no desperate need for the same to accelerate growth,  as Nestle has “enough on its plate” to make the core categories deliver growth.In August this year, in a press briefing, Narayanan said that looking at margins amidst high food raw material prices, 2023 has been better than 2022 from a commodity inflation perspective. The inflation in 2019, 2020, and 2021 combined was less than that of 2022, whereas, 2023, wheat, rice, packaging materials and fuel have remained stable. He states that coffee, as well as the milk process, are a cause for concern because the cost of production has increased for the latter. “Margins would continue to cause some pain, although serious concerns have been mitigated when compared to the previous year,” says the MD.In the June quarter, Nestle India witnessed an uptick in consumer demand in the rural economy. But that's partly because it has been expanding its rural exposure. Currently, the rural segment comprises about one-fifth of sales. Moreover, the FMCG major launched 10 new products in the first half of 2023In an exclusive interview with CNBC-TV18 in July, Narayanan said tier-two or tier-six towns are adopting to company's brands and are seeing three broad trends in the market, \"One is a strong trend towards premiumisation of brands. So, consumers are trending up in terms of certain categories, brands, and certain preferences.\"Nestle has witnessed double-digit growth in 21 out of 26 quarters, In the same almost 15 out of the 26 quarters have been quarters of double-digit profit growth. Founded in 2011, Nestle Health Science sells health-focused and nutrition products.\n       ",
    "Food inflation is still a cause of concern despite measures taken by the government to check overall price rise and the movement of commodity prices needs to be closely watched for a long-term impact, Nestle India Chairman & Managing Director Suresh Narayanan said on Thursday. Going by publicly available information, now it is reasonably clear that with a 30 per cent deficit in the monsoon, Kharif crops might get impacted, even if the sowing is good, said Narayanan in a media roundtable here.With this El Nino impact not fully played out, we still have to watch for the spectre of food inflation, he said. \"There will be pressure in terms of food inflation. Headline inflation will get mitigated because of various steps that the government will take but food inflation is still a cause for concern,\" Narayanan said.However, he also added, \"Immediately put, I would not say that something alarmist is happening in terms of commodity prices. But we would have to watch this space and see how it evolves, impact being really for 2024 rather than immediate impact we will have.\" On increased milk prices, Narayanan said it has a few structural issues as well.\"We talked about the post-Covid impact on the milch herd and then we had the lumpy skin disease and various other things, but that still has to be played out and plus the cost of production has gone up sharply. There has been a 30-40 per cent increase in the cost of feed,\" said Narayanan adding \"We do not expect the former to be able to absorb all of them\".Milk will still be seesawing. There will be some relief during flush and then some escalation during the lean season, said Narayanan. \"But the other commodities, a lot will depend on how the Kharif and the Rabi crops come out. But still, there is a little bit of uncertainty there,\" he said.Over the rural demand, Narayanan said even though it sounds speculative, if the rural sector gets badly impacted due to rains, then demand from those markets will have an impact. Nestle India, the makers of popular Maggi instant noodles, Kitkat chocolates and Nescafe, is expanding its rural exposure with relevant offering and currently gets one-fifth of sales from far-flung markets.\"Even though my play is relatively lower at about 20 odd per cent (in rural) it is fairly significant, he said adding At the moment, things are looking stable. In the last June quarter, Nestle had witnessed an uptick in consumer demand in the rural economy. In the last June quarter, Nestle had witnessed an uptick in consumer demand in the rural economy.But if the thing gets dramatically Southwards in terms of impact, then they could be an impact. But today, I would put it in the realm of crystal gazing. One really has not fully absorbed the impact of shortfall in the monsoon so far because one is expecting that there will be some uptick in September but one does not know. That happens, and then we are back into the sunshine once again. \"The other trends such as premiumization and stronger demand in the smaller categories of towns from tier II to tier 6, continue. Nothing has happened there One should not keep crying wolf at the same time one should be cognizant that we still have not fully unbound the full monsoon cycle,\" he added.\n       ",
    "",
    "Fast moving consumer goods (FMCG) companies are expected to report moderate revenue growth in the quarter ended June 30, 2023. This is due in part to companies’ cutting prices and in part, to lower rural demand.Nuvama Wealth expects a 5 percent growth in revenue and 15 percent in Earnings Before Interest, Tax, Depreciation and Amortization (EBIDTA) for companies under its coverage.Kotak Institutional Equities expects a 12 percent revenue growth for ITC, 10.2 percent for Britannia, 7 percent for Dabur and 9.1 percent for Hindustan Unilever (HUL). “We expect Nestle to lead the pack on revenue growth and Britannia or Godrej Consumer Products Ltd. on earnings growth (off a low base),” Kotak Institutional Equities says. Analysts expect Marico Ltd. to have a weaker growth.In terms of performance, Britannia, Nestle, and Godrej Consumer Products Ltd. are expected to do well, while Dabur, ITC, HUL and Bajaj Consumer are predicted to be in the middle tier, Nuvama Research says. Emami and Marico will likely struggle in the first quarter of FY24, the firm adds.Nuvama’s report says Britannia’s rural performance is expected to help despite an overall weakness for the company, as biscuits have remained more resilient than other segments. For Godrej Consumer Products Ltd. the India business (organic business) is expected to grow by 9.5 percent with a volume growth of 11 percent year-on-year due to negative pricing in soaps.Nestle is expected to perform better due to strong demand for milk and Infant nutrition. The company’s rural demand is also strong due to expansion in distribution and resilience in the noodles category.ITC is expected to have a consolidated revenue dip by 4.3 percent year-on-year due to a very high base in wheat in their agriculture business.Hindustan Unilever’s ice-cream portfolio is expected to see the impact of unseasonal rains and weak summers. The tea business is expected to see a fall. Milk inflation also remains a challenge for the company.Marico, in its quarterly update of Q1 FY24, says that anticipated pickup in rural demand remained elusive, dampening overall growth prospects. The company is expected to report a revenue dip of 2.3 percent year-on-year on the back of sharp price cuts in Saffola edible oil, Nuvama notes.Margins and Volume growthRevenues are expected to be moderate as companies pass on the benefit of lower raw material costs to customers, but margins are set to expand as price cuts in select segments will likely increase prices.“Easing inflationary pressures would drive gross margin improvement, but ad spends are likely to go up. El Nino is a key risk for the entire sector, but government stimulus programmes in an election year are likely to mitigate the former’s potential fallout,” Nuvama Research says.Most companies will report healthy EBITDA growth led by gross margin expansion (off a low base). The increase in gross margins is primarily caused by decreasing raw material costs.The companies under Kotak Institutional Equities are expected to report a 16.9 percent EBIDTA growth. After reaching their highest point in the first half of FY23, the prices of raw materials have been gradually decreasing, although they are still higher than they were before the COVID pandemic.“The FMCG sector seems well poised in 1HFY24 with a raw material cost tailwind. However, in 2HFY24 we expect revenue growth to be moderate as pricing benefits should fade and growth would have to be volume-led.” said BNP Paribas.DiscretionaryThe larger players in the paints industry are expected to experience moderate volume growth, although on a very high base. Indigo Paints is expected to outperform with twice the industry's growth rate. Most paints and adhesives companies are likely to see strong margin expansion, as per Nuvama Research.The Health & Immunity sector is expected to bounce back and show decent growth after a few quarters of disappointing performances. However, the summer portfolio, which includes beverages, cooling hair oils, ice cream, and talcum powder, is likely to be weak due to unexpected rainfall, the research firm notes.Demand for Quick Service Restaurants (QSR) continues to be soft but steady due to inflationary pressures. In this segment, Kotak Institutional Equities expects a 7 percent revenue growth led by 4 percent same store sales decline for Jubilant FoodWorks which would imply a marginal deceleration in the growth trajectory.\n       ",
    "The Q4 earnings reports of Indian FMCG majors reveal divergent trends in consumer spending. In this regard, broking firm Jefferies in its recently released analysis of management comments of 40 major Indian consumer companies and disclosure of their individual demand figures has noticed mixed trends across segments.According to the report authored by Vivek Maheshwari, Jithin John and Kunal Shah, while the premium consumer segment comprising premium apparels, jewellery and paints reported double-digit growth, most of the other mass oriented companies reported weak to moderate demand trends.“Recovery seems to be underway across mass customer segments and low-tier geographies, but a rebound may take time, and would likely be visible during 2HFY24,” the authors further observed. While the individual management commentaries differed in their reasoning for tepid growth, they were unanimous in observing that although decline in inflation levels had considerably brought down input costs, it hadn’t necessarily helped pick up consumer demand to the expected levels.This has been particularly noted in the management commentaries of Quick Service Restaurant (QSR) majors like Jubilant Foodworks, the operator of popular pizza chain Domino’s and Devyani International Foods which operates popular fast food brands like Pizza Hut and KFC. The former two along with popular dining chain Barbeque Nation have reported Q4 demand in red but expect to tide over the situation by the end of the second half of the first quarter in FY24.Interestingly, while Pizza selling majors have seen a slump on various fronts such as declining Same Store Sales Growth (SSSG) due to aggressive store addition policy and reduced margins, other QSR majors popular for burgers such as the Burger King operator Restaurant Brands Asia (RBA) and Westlife Foodworld, operator of McDonald’s for western and southern India have disclosed having received strong demand in Q4FY23 and are confident of being in green in the coming quarters of FY24.Also read: FMCG stocks under pressure on El Nino uncertainties flagged by RBI governorThe Jefferies report also notes that while aggressive store additions may not have worked in favour of QSRs, pursual of the same has turned out to be a major growth driver for multi-category retail majors like DMart and Reliance Retail. The latter in particular has reported a strong 66 percent growth year-on-year (YoY), driven by grocery sales through its outlets like Reliance Smart Point while the outcome for DMart has been a mix owing to weak demand for mass apparels and other Fast Moving Consumer Goods (FMCG) which constitute a major chunk of its inventory.In the context of multi-category retail, it is also worthwhile to note that barring Dabur and Emami which are in red, for most FMCG majors the demand continued to be moderate. Authors point out that most of the staples producers like Nestle, Varun Beverages and Tata Consumer Products Limited's brands like Tata Tea were acquiescent of the fact that the net demand was being driven by increasing consumption in rural areas. However, the report also notes that the response from the rural consumer base hasn’t been the same for mass footwear brands like Relaxo and Campus which have reported demand contraction in this geography.Contrary to the conditions faced by mass oriented brands, demand for premium consumer goods manufacturers and brands remained relatively stable. Among the apparels segment, while overall demand for the commodities of Page Industries (Indian manufacturer of American brand Jockey), Aditya Birla Fashion and V-Mart remained in red, wedding apparel brand Manyavar’s owner Vedant Fashion along with fashion retail major Shoppers Stop and GoColours registered strong growth in FY23Q4.In the jewellery segment, Tata’s premium watch maker and owner of jewellery brand Tanishq along with south Indian major Kalyan Jewellers reported high growth, with the latter having reported 18 percent revenue growth YoY driven by strong demand coming from the non-south. Similarly, riding on the strong 48% surge in housing sales and enhanced government spending on infrastructure, all major paint and adhesive companies reported revenue growth in green with Asian Paints reporting 13% growth YoY along with a strong demand driven 16% volume growth.The management commentaries in ressonance with the observation of several analysts also observed that the demand and subsequent revenue growth forecast continues to be vulnerable to external factors. The Jefferies report in this regard observed that sustained easing out of inflation for keeping the input costs in check along with climatic factors like El Nino could play an important role in deciding the growth trajectory of the FMCG segment in coming quarters.Disclaimer: The views and investment tips expressed by experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.​​​Disclaimer: Moneycontrol is a part of the Network18 group. Network18 is controlled by Independent Media Trust, of which Reliance Industries is the sole beneficiary. ",
    "Essar Group firm GreenLine Logistics on Friday said it has deployed its LNG-powered trucks for transportation of Nestle's Maggi noodles.This, a company statement said, is in line with Nestle India's sustainability goals as it looks to reduce the carbon footprint of its logistics operations.\"GreenLine has custom created the first-of-its-kind 46 feet long containers, which will be deployed for transporting Maggi noodles from Nestle's factory at Sanand, Gujarat to Bhiwandi, Maharashtra,\" it said.Its LNG-powered fleet significantly reduces toxic emissions compared to diesel - carbon dioxide by up to 30 per cent, sulphur oxides by up to 100 per cent, nitrogen oxides by up to 59 per cent, carbon monoxide by up to 70 per cent and particulate matter (PM) by up to 91 per cent.\"In line with Nestle's carbon emissions reduction goals, the adoption of GreenLine's larger 55 tonne, 46 feet containers replaces smaller diesel 20-tonne vehicles, resulting in a substantial reduction in vehicle requirements,\" it said.This, combined with the emissions reduction achieved by utilising LNG-powered containers, contributes to Nestle's green mission and enhances its ESG performance.Commenting on the occasion, Anand Mimani, CEO, GreenLine, said, \"We are thrilled to announce our partnership with Nestle India in their journey to reduce emissions through our innovative green mobility solutions\".\"This collaboration marks a significant milestone, signalling the dawn of eco-friendly logistics for consumer goods companies in India. We eagerly anticipate the widespread adoption of our green mobility solutions by other industry leaders, empowering them to enhance their ESG performance, foster a cleaner environment, and pave the way for a sustainable future for generations to come.\" Sanjay Khajuria, Director, Corporate Affairs and Sustainability, Nestle India, said, \"We are accelerating our sustainability initiatives. We are committed towards net zero emissions and sustainable logistics is a step in that direction.\"With this aim, we are deploying different modes of transportation using alternate fuel and using bigger vehicles to optimise vehicle capacity utilisation. We are hopeful that the association with GreenLine would help us to achieve our objectives.\" Building on its achievements in green logistics for cement and steel, GreenLine is now introducing the superior capabilities of LNG-powered containers to revolutionise transportation in consumer goods, pharmaceuticals and express cargo sectors, the statement said.\n       ",
    "Here is a collection of our most important stories this morning:TCS plans to double salary, reduce disparity: HR head reveals the blueprintTata Consultancy Services (TCS), which employs over 600,000 people globally, is up-skilling in-house talent and evaluating them at a high bar to double their salaries. The company finds this a better strategy than shelling out very high increments to new hires as the industry has started to come out of a pandemic-induced rally of high employee attrition and massive hikes of over 80-120 percent. Read moreNestle India stuns the Street but valuations may keep investors at bayNestle India surprised analysts with its first quarter results for CY2023 with its net profit at Rs 736 crore, beating estimates of Rs 674 crore. Revenue from operations jumped 21.3 percent on-year to Rs 4,830 crore in the March quarter. In fact, the revenue growth was highest in the last 10 years. The company follows a January to December financial year. More hereTransport services have picked up, mining still volatile, says Morgan Stanley Chief India EconomistThe Reserve Bank of India will start cutting rates from Q1 CY24 — that’s Morgan Stanley’s base case. But the faster pace at which inflation is moderating, oil prices cooling off and the pick-up in private projects, are factors indicating there may be an earlier start to the rate-cut cycle. More information here MC selectsAnalysts caution on Yes Bank’s continuing high reliance on bulk depositsAnalysts have said private lender Yes Bank’s high reliance on bulk deposits continues to be a risk despite its efforts to ramp up retail deposits. At around 40 percent of bulk deposits, the cost of funds remains high, analysts said.  Know moreBollywood actor framed in drugs case, jailed in UAE. The motive: revengeMumbai Police's crime branch has arrested two people for framing a Bollywood actor in a drugs case. According to news agency ANI, a bakery owner named Anthony Paul and an assistant bank manager, Rajesh Damodar, hatched a plan to exact revenge on actor Chrisann Pereira by giving her a memento with drugs in it and asking her to deliver it to someone in Sharjah. Find out moreJeff Bezos spotted wearing $12 shirt from Amazon at CoachellaAmazon founder Jeff Bezos ditched designer labels in favour of a much more accessible $12 shirt for his Coachella appearance. The billionaire was filmed attending rapper Bad Bunny’s Coachella set on April 21 night. A short clip of Bezos, 59, dancing at the music festival alongside girlfriend Lauren Sanchez has taken the internet by storm. The couple was also spotted hanging out with Kris Jenner and Corey Gamble. Read on ",
    "Net Sales at Rs 4,830.53 crore in March 2023 up 21.35% from Rs. 3,980.70 crore in March 2022.Quarterly Net Profit at Rs. 736.64 crore in March 2023 up 23.87% from Rs. 594.71 crore in March 2022.EBITDA stands at Rs. 1,129.17 crore in March 2023 up 19.35% from Rs. 946.09 crore in March 2022.Nestle EPS has increased to Rs. 76.40 in March 2023 from Rs. 61.68 in March 2022.Nestle shares closed at 20,665.20 on April 25, 2023 (NSE) and has given 1.89% returns over the last 6 months and 13.70% over the last 12 months."
]