[
    "Shares of Welspun Specialty Solutions Ltd (WSSL) rose over 17 percent on the BSE after the company emerged as the lowest bidder for an order worth Rs 117 crore from Bharat Heavy Electricals Ltd (BHEL).At 11.41 AM, shares of Welspun Specialty were trading 12 percent higher at Rs 42.5 apiece. The stock has gained 5 percent in the past six months, underperforming the Nifty 50 index, which gained nearly 10 percent during the same period.On June 23, Welspun Specialty informed BSE that it has been named the L1 bidder by BHEL for the supply of seamless stainless steel boiler tubes for the National Thermal Power Corporation's (NTPC) Talcher 2 x 660 MW super critical thermal power project.Follow our live blog for all the market actionThis selection follows a rigorous assessment and approval process by both BHEL and NTPC, Welspun said.Welspun Specialty is a fully integrated manufacturing facility for stainless steel long products and seamless pipes and tubes spread over an area of 126 acres in Jhagadia, Gujarat.Welspun Specialty Solutions Limited, formerly known as RMG Alloy Steel Ltd. The company was incorporated in 1980 in Mumbai.In the quarter ended March, Welspun Specialty's net profit stood at Rs 40 crore, up from Rs 8 crore in the year-ago period. The company's revenue from operations came in at Rs 151.1 crore, rising from Rs 137.8 crore recorded a year ago.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. \n       ",
    "Shares of GE Power India surged over 6 percent after the company secured a Letter of Intent (LoI) for a contract valued at Rs 243.46 crore from NTPC GE Power Services Private Ltd (NGSL).The contract involves the renovation and modernisation of LMZ Steam Turbines at Wanakbori Thermal Power Station (TPS) Unit No. 1 and Unit No. 2, each with a capacity of 210 MW.The project aims to enhance the heat rate efficiency and extend the operational life of these units, GE Power India said in a regulatory filing.Follow our market blog to catch all the live actionThe nature of the order is focused on Steam Turbine Renovation and Modernisation (R&M), with a stipulated execution period of 33 months. NGSL, a joint venture between GE Power India Ltd (GEPIL) and NTPC Ltd, led the bid, while GEPIL participated as a joint venture/consortium partner.Genus Power will be responsible for all critical supplies, including design and engineering, as well as the testing and commissioning of the system.At 9:21 am, GE Power India shares were trading 6 percent higher at Rs 416.95 on the National Stock Exchange (NSE). In the last one year, the stock has gained just 150 percent, more than doubling investors' money. In comparison, Nifty delivered returns of around 25 percent during this period.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "India's infrastructure and capex boom through projects like the PM Gati Shakti is creating opportunities in the stock market as well, Morgan Stanley said, listing out key names that it is bullish on.Analysts at Morgan Stanley have cited Larsen & Toubro, NTPC, Titagarh Rail Systems and Ultratech Cement as among the key names benefitting from the government spend on infrastructure. The capex boom is also expected to dampen inflation, and boost corporate profitability, according to the analysts.A Morgan Stanley note informed investors that the momentum that India's infrastructure development has seen over the last decade is projected to continue. Analysts expect infrastructure investments to rise from 5.3 percent of GDP in FY24 to 6.5 percent of GDP by FY29, reflecting a robust 15.3 percent compound annual growth rate (CAGR). This increase will result in cumulative spending of approximately $1.45 trillion over the next five years, the note said.This surge in infrastructure investment is expected to enhance overall investment rate and foster a period of sustained, high, productive growth.Follow our market blog to catch all the live actionBeneficiaries of India's infra push1. Larsen & Toubro (L&T)According to Morgan Stanley, increased government spend on infrastructure projects would likely benefit L&T significantly. Additionally, a moderation in steel and other material prices could improve the company’s cost structure.An overall improvement in the economy, leading to higher-than-anticipated private capex, would also be a positive driver for L&T.However, a slowdown in government-led infrastructure capex is a key risk for the company's prospects, so is a slowdown in the execution cycle which could hamper project completion and profitability. Geopolitical risks could lead to slower execution of projects, and a sharp increase in material costs could squeeze margins.2. NTPCAccording to Morgan Stanley, the potential upside for NTPC includes faster capacity addition driven by stronger power demand and improving health of State Electricity Boards (SEBs), value-accretive acquisitions, and value unlocking in subsidiaries.On the downside, risks involve delays in commissioning, fixed cost under-recovery due to coal or machine availability issues, investments in non-core businesses, and value-decreasing acquisitions.3. Titagarh Rail SystemsFor Titagarh Rail Systems, Morgan Stanley's base case is derived from a target P/E of 35x for September 2026 earnings. This multiple is considered fair, given strong earnings visibility from a large backlog and improving return ratios, which are the best among peers, the foreign brokerage said.An improvement in freight margins and a faster-than-expected ramp-up in passenger coach execution are significant positive drivers for Titagarh. Additionally, an acceleration in passenger segment margins beyond expectations would further enhance the company's financial performance, said analysts.Also Read | Goldman Sachs has a Sell on Tata Tech, VinFast reliance a vulnerabilityHowever, supply chain issues could affect the freight business and hamper execution. A slowdown or delay in wagon tendering and ordering for passenger coaches could hurt operating margins.Additionally, delayed execution of contractual obligations could lead to liquidated damages, which would negatively affect the company's financial health.4. Ultratech CementMorgan Stanley believes that despite near-term uncertainties, the medium-term demand visibility for Ultratech Cement remains strong. The brokerage note has identified several factors that could drive the stock's performance, including continued demand and a sharp decline in input prices.However, a weaker-than-expected demand offtake is possible if the macroeconomic situation worsens, and a rise in input prices could increase overall costs without corresponding higher realizations, thus denting company's profitability.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Clean energy firm Jakson Green said on June 19 that it has secured an order from state-owned NTPC to establish a plant for producing 4G ethanol from flue gas. The company has been enlisted as the Licensing, Engineering, Procurement, and Construction (LEPC) partner.The project, located in Lara, Chhattisgarh, will produce 10 tons per day (TPD) 4G Ethanol from flue gases.Flue gases are the emissions produced when fossil fuels such as coal, oil, natural gas, or biomass are burned for energy production in industrial processes or power plants. These gases are typically released through a chimney or flue, hence the name \"flue gases.\"Using the carbon capture technology by Veolia Carbon Clean, the plant will capture 25 TPD CO2 from the flue gases, significantly reducing greenhouse gas emissions. Additionally, 3 TPD Green Hydrogen will be generated through 7.5 MW Electrolyser.The Plant has been conceptualized & designed by NETRA (NTPC Energy Technology Research Alliance), the R&D arm of NTPC Limited.Jakson Green will spearhead this project targeted for operation within two years, according to the statement.\n       ",
    "New energy transition platform Jakson Green on Wednesday said it has bagged an order from state-owned NTPC for setting up a plant to produce 4G ethanol from flue gas.The proposed plant at Lara in Chhattisgarh will produce 10 tonnes per day (TPD) of 4G ethanol from flue gases emitted from power plants, a company statement said.Using the latest carbon capture technology by Veolia Carbon Clean, the plant will capture 25 TPD CO2 from flue gases, significantly reducing greenhouse gas emissions, it said.Also, 3 tonnes per day of green hydrogen will be generated through 7.5 MW electrolyser, the statement said.Captured carbon dioxide (CO2) and generated hydrogen (H2) are combined via advanced microbial fermentation technology from LanzaTech Inc., converting these inputs into 4G ethanol, it explained According to the statement, Jakson Green has been awarded a critical role in India's groundbreaking project towards a greener future, establishing the world's first flue gas CO2-to-4G ethanol project for a power plant.As the licensing, engineering, procurement, and construction (LEPC) partner, Jakson Green will spearhead this project which is expected to begin operations within two years.The plant has been conceptualized and designed by NETRA (NTPC Energy Technology Research Alliance), the research and development arm of NTPC Ltd.Kannan Krishnan, Joint Managing Director of Jakson Green Private Limited, said in the statement, \"This partnership builds upon the success of our numerous joint projects... Increasing the production of ethanol is crucial to achieving India's blending goals, strengthening energy security, and fostering a cleaner future.\"Having the production capacity of over 8,500 tonnes per annum of green hydrogen and its derivatives under development across six projects, Jakson Green is uniquely positioned to spearhead India's clean energy transition and contribute to a sustainable future, it said.\n       ",
    "Shares of public-sector undertaking companies jumped back into action on June 10, recovering from the selloff in most counters seen early last week. The bounce in these counters can be attributed to the return of PM Narendra Modi to power as he took oath for a third consecutive tenure on Sunday.Names like Power Grid, State Bank of India and NTPC, all state-owned companies, were among the top gainers on the Nifty 50. At 09.43 am, Power Grid was leading gains in the 50-stock index as it traded 3.6 percent higher at Rs 320.35 on the NSE. Also, SBI shares were up around 1 percent at Rs 836.65 apiece while NTPC rose one percent to Rs 367.35 on the NSE.Apart from these, sentiment for other PSU stocks also remained robust as the BSE PSU index was also among the major sectoral gainers, up around one percent.Follow our live blog for all the market actionBJP's return to power, albeit with the help of its allies, is seen as a major positive for the market as the participants are now pining for higher hopes for policy continuity as guided by the incoming government.On Sunday, 72 ministers were sworn in as part of a BJP-led government with Prime Minister Narendra Modi taking oath for his third consecutive term. Several notable names like Nirmala Sitharaman, Amit Shah, Rajnath Singh, Nitin Gadkari, and S Jaishankar also returned from the previous cabinet, further fueling hopes of a continuity in policies.\"While alliance issues are still ripe, the initial concerns are behind us,” said Ambareesh Baliga, an independent market expert.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "HighlightsThe post poll verdict that triggered a free-fall on bourses on Tuesday June 4 penalised many high quality stocks. Leading state-owned power companies — NTPC  (CMP:331 Market Cap:3,27,349) and Power Grid (CMP:296 M Cap: 2,76,175) were among those that offer decent investment opportunity in a volatile market.Post the correction, NTPC\n                                    ",
    "What do companies like Tata Power, Genus Power, HPL, ABB, Hitachi Energy, and Schneider Electric have in common? Apart from the fact that most of these companies had a great run on the bourses in the past year and belong to the power sector?All these listed companies have a role to play in the growing ‘smart meter’ segment on which the government is banking to curb power theft and improve billing accuracy, among other things, while also securing accurate, real-time data on power demand.India aims to replace 250 million traditional electricity meters with smart ones by 2025 under the Smart Meter National Programme (SMNP), and this has made the analyst community quite bullish on this segment, as currently only a minor part of the overall target has been met.“If you look at the opportunity size, it's close to 25 crore meters in the next three-four years,” said Rupesh Sankhe, Senior Research Analyst, Elara Capital.“As of now, they have just installed close to 1.5 crore smart meters, so the opportunity is plenty. Even at a cost of Rs 6,000-7,000 per smart meter, the market size is close to 1.5 lakh crore,” he adds, while highlighting the fact that the sector has received significant financial incentives, such as central government subsidies, as well.“Each state faces significant T&D (transmission and distribution) losses, and there's a regulatory push to reduce this. The SMNP initiative represents major capital expenditure moving forward,” he adds.Currently, the SMNP rollout is being executed in phases, with an initial focus on high-loss areas and regions equipped with the necessary infrastructure. Projects have already been implemented in states such as Uttar Pradesh, Haryana, and Bihar.Companies like Tata Power, Genus Power, and HPL Electric & Power have, over the past year, won orders for implementing smart meters, while stocks in the segment have given double-digit and multi-bagger returns on the back of growing power demand.Tata Power has gained 98 percent, while Genus Power is up 237 percent. HPL has gained 318 percent, while ABB and Schneider Electric have moved up 102 percent and around 192 percent, respectively, over the last one year.More importantly, despite the high potential for revenue growth, competition remains limited due to the specialised nature of smart meter manufacturing.Also read : Power play: Are global stocks a better bet for Indian investors?Analysts believe that the current beneficiaries will feature among the larger players going ahead, as making these meters involves complex technological advancement and smaller players may take some time to develop this technology and attain scale.According to Sankhe, the large, existing players can expand their capacity, ensuring revenue growth.“Even if the current revenue from smart metering is less than 10 percent, the potential is significant. With limited supply, these companies will maintain healthy margins,” he explains.Another play in the smart metering segment could be financing entities like REC (Rural Electrification Corporation) and PFC (Power Finance Corporation), which act as nodal agencies for the scheme and play an important role in planning, implementation, and monitoring.Sagar Lele of Rupeeting, a financial advisory firm, however, believes that while there are growth opportunities, it may not be enough for an investment thesis.“While smart meters are an essential theme, they should not dominate an investment thesis. The broader energy sector, particularly with infrastructure enhancements and grid automation, offers more significant and immediate opportunities,\" he says.Also read : Power not just a domestic theme; data centres, AI to drive next wave of growthGiven the cyclicality of the segment and inherent risks, especially for discoms, a more diversified investment strategy is advisable, says Lele, while citing examples of companies like NTPC and Tata Power, which offer a more balanced approach due to their mix of renewable energy and distribution assets.Alchemy Capital's Head-Quant and Portfolio Manager Alok Agarwal concurs. While he remains extremely bullish on the power sector, he, like Lele, sees other opportunities like renewables, etc., within the segment as bigger and better plays for now.Sankhe, however, remains optimistic even as valuations appear high, and attributes the current valuations to the anticipated, sustainable high growth over the next 10-12 years.“This growth is not just for the initial deployment, but also for the replacement phase. Companies are poised to benefit significantly from this long-term opportunity,” he explains.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Net Sales at Rs 47,622.06 crore in March 2024 up 7.61% from Rs. 44,252.92 crore in March 2023.Quarterly Net Profit at Rs. 6,168.73 crore in March 2024 up 26.91% from Rs. 4,860.67 crore in March 2023.EBITDA stands at Rs. 15,389.73 crore in March 2024 up 23.76% from Rs. 12,435.22 crore in March 2023.NTPC EPS has increased to Rs. 6.36 in March 2024 from Rs. 5.01 in March 2023.NTPC shares closed at 369.65 on May 27, 2024 (NSE) and has given 43.53% returns over the last 6 months and 109.67% over the last 12 months.",
    "State-run power generation company NTPC has shared a more clearer path to unloc value in its renewable energy business, and informed analysts in a concall that it is likely to list NTPC Green by October-November of this year.NTPC Unlocking ValueThe process of tapping the primary market had been underway, and Moneycontrol had reported last month that investment bankers for the proposed Rs 10,000 crore initial public offering had been shortlisted in April. Earlier, in February, Moneycontrol had cited Mohit Bhargava, CEO of NTPC Green stating that the company was aiming to tap the primary market by FY25. \"We are in the process of appointing the merchant bankers and as we see, it's about an eight to nine-month cycle from where we are today, at least, if we are able to finally hit the market,\" Mohit Bhargava told CNBC-TV18 in February 2024.The IPO proceeds are intended to be used to fund ongoing and future projects across solar, green hydrogen and green ammonia, the company had said. At a projected issue size of Rs 10,000 crore, NTPC Green’s IPO will be the biggest initial share sale by a public sector company since the Rs 21,000 crore IPO of Life Insurance Corp. in May 2022.Ambitious OrdersIn the concall with analysts after Q4FY24 results, NTPC said it is targeting new thermal orders worth 15.2 GW in the coming years, and has also raised the ordering pipeline for its thermal capacity. NTPC said it now intends to award 10.4 GW worth of orders for thermal power projects in FY25, which is significantly higher than what was earlier being projected.In terms of commissioning as well, NTPC said it expects commissioning of thermal power projects worth 2.8 GW in FY25, and 1.5 GW for FY26.Brokerage View Given NTPC’s 25 percent share in India’s power generation and the country’s plan to add 30–40GW of RE a year, Nuvama argues that the PSU is poised to maintain its market share without requiring external equity.Track NTPC's Earnings fineprint hereAbout NTPC GreenNTPC Green was incorporated in April 2022 as a wholly owned subsidiary of NTPC to consolidate the parent company's renewable energy assets.\n       ",
    "Net Sales at Rs 42,532.18 crore in March 2024 up 2.94% from Rs. 41,317.86 crore in March 2023.Quarterly Net Profit at Rs. 5,556.43 crore in March 2024 down 2.04% from Rs. 5,672.32 crore in March 2023.EBITDA stands at Rs. 13,023.14 crore in March 2024 up 1.5% from Rs. 12,830.57 crore in March 2023.NTPC EPS has decreased to Rs. 5.73 in March 2024 from Rs. 5.85 in March 2023.NTPC shares closed at 374.75 on May 24, 2024 (NSE) and has given 47.60% returns over the last 6 months and 114.20% over the last 12 months.",
    "Shares of National Thermal Power Corporation (NTPC) gained on May 27 as brokerages maintained bullish calls on the stock despite the PSU reporting below-estimate earnings for the quarter ended March 2024.Morgan Stanley has maintained its 'overweight' call on NTPC, setting a target price of Rs 390 per share. The brokerage noted that the company's recent earnings report fell short of estimates primarily due to fixed cost under-recoveries.Its consolidated profit after tax (PAT) was also below expectations, largely driven by reduced profit contributions from subsidiaries.Despite this, the company boasts a robust renewable energy (RE) portfolio, totaling 23.2 GW, said Morgan Stanley, adding that there is speculation that a renewable energy (RE) IPO could be on the horizon, possibly occurring by October or November 2024.At 9:18 am, NPTC shares were trading around a percent higher at Rs 378.40 on the National Stock Exchange (NSE).Follow our market blog to catch all the live actionIndia's largest integrated power utility's consolidated net profit for Q4FY24 jumped 33 percent on year amid higher power demand due to scorching high temperatures in the country.The state-run company's revenue from operations also rose over 7 percent YoY in the March quarter. The company’s power generation and coal production also increased in the period.According to analysts at Nuvama Institutional Equities, NTPC is a distinctive play on thermal demand and transitioning towards renewable energy, aided by its size and profitability. Thermal is still the mainstay but all future capacity addition is based on renewable energy with a target of 6GW per annum, it noted.\"NTPC currently has most of its operational capacity (standalone) under the regulated model. This enables it to pass on increase in costs, limiting the impact on profitability,\" the brokerage said.According to Nuvama analysts, NTPC’s thermal profitability shall likely improve, given: i) no significant fuel-based under recoveries; ii) improving PLFs; iii) accelerated commissioning; and iv) higher incentives.NTPC’s RE focus is the mainstay given its unique advantage to leverage its thermal plants to blend-in RE; ready access to human and financial capital; and risk framework, which protects against the downside.\"Further, the thermal giant’s transition towards new energy encompasses decarbonisation of industrials and mobility, not just RE.While the existing business earns regulated RoEs of 18-19 percent on invested equity (including incentives), the RE capex is on a competitive bidding basis, wherein NTPC enjoys a 1–1.5 percent lower cost of debt (versus private sector peers) given its balance sheet size and near-sovereign status. \"This enables higher IRRs despite competitive tariffs,\" said Nuvama.Given NTPC’s 25 percent share in India’s power generation and the country’s plan to add 30–40GW of RE a year, Nuvama argues that NTPC is poised to maintain its market share without requiring external equity.The domestic brokerage maintained its 'buy' rating on the stock but revised the target price upwards to Rs 435 from Rs 367 earlier.Also Read | NTPC net profit jumps 33% amid increased power demand. Here are key highlightsKey risks for NPTC",
    "Let's catch up on the latest news from the stock market. From significant investments to major deals and earnings announced on May 24-25 to earnings announcements expected on Monday (May 27), here's a quick look at which stocks will be in focus in trade on Monday.Earnings Expected on MondayMore than 300 companies will release their quarterly earnings on May 27 including Life Insurance Corporation of India, Astrazeneca Pharma, Borosil Renewables, Flair Writing Industries, Jubilant Industries, Natco Pharma, National Aluminium Company, NMDC, Peninsula Land, Sumitomo Chemical India, TVS Supply Chain Solutions, and West Coast Paper Mills.Earnings Announced Post Market Hours on May 24NTPC Q4 (Standalone YoY)Profit falls 2% to Rs 5,556.4 crore Vs Rs 5,672.3 croreRevenue rises 2.9% to Rs 42,532.2 crore Vs Rs 41,317.9 croreNTPC Q4 (Consolidated YoY)Profit surges 33% to Rs 6,490 crore Vs Rs 4,871.6 croreRevenue increases 7.6% to Rs 47,622 crore Vs Rs 44,253.2 croreOther income more than doubled to Rs 1,194.5 crore Vs Rs 491.8 croreBoard recommends the final dividend at Rs 3.25 per shareBosch Q4 (Consolidated YoY)Profit grows 41.5% to Rs 564.4 crore Vs Rs 398.9 croreRevenue increases 4.2% to Rs 4,233.4 crore Vs Rs 4,063.4 croreBoard recommends a final dividend of Rs 170 per shareKarnataka Bank Q4 (Standalone YoY)Profit tanks 22.5% to Rs 274.2 crore Vs Rs 353.8 croreNet interest income declines 3% to Rs 834 crore Vs Rs 860 crorePre-Provision Operating Profit drops 27.1% to Rs 499.8 crore Vs Rs 685.8 croreProvisions down 27% at Rs 184.7 crore Vs Rs 253.3 croreNet NPA rises to 1.58% Vs 1.55% (QoQ)Gross NPA drops to 3.53% Vs 3.64% (QoQ)Torrent Pharma Q4 (Consolidated YoY)Profit surges 56.4% to Rs 449 crore Vs Rs 287 croreRevenue grows 10.2% to Rs 2,745 crore Vs Rs 2,491 croreCochin Shipyard Q4 (Consolidated YoY)Profit spikes 558.1% to Rs 258.88 crore Vs Rs 39.3 croreRevenue jumps 114.3% to Rs 1,286 crore Vs Rs 600 croreGlenmark Pharma Q4 (Consolidated YoY)Net loss widens to Rs 1,238.6 crore Vs loss of Rs 549.4 croreRevenue grows 2.1% to Rs 3,063 crore Vs Rs 3,000.5 croreUnited Spirits Q4 (Consolidated YoY)Profit jumps 136.3% to Rs 241 crore Vs Rs 102 croreRevenue (excluding excise duty) climbs 11.2% to Rs 2,783 crore Vs Rs 2,503 croreEBITDA rises 42.1% to Rs 334 crore Vs Rs 235 croreEBITDA margin expands 260 bps to 12% Vs 9.4%Divi’s Laboratories Q4 (Consolidated YoY)Profit surges 67.6% to Rs 538 crore Vs Rs 321 croreRevenue increases 18% to Rs 2,303 crore Vs Rs 1,951 croreEBITDA spikes 50.1% to Rs 731 crore Vs Rs 487 croreEBITDA margin expands 670 bps to 31.7% Vs 25%Aurobindo Pharma Q4 (Consolidated YoY)Profit zooms 79.6% to Rs 909 crore Vs Rs 506 croreRevenue rises 17.1% to Rs 7,580 crore Vs Rs 6,473 croreEBITDA spikes 68.3% to Rs 1,687 crore Vs Rs 1,002 croreEBITDA margin jumps 677 bps to 22.3% Vs 15.5%Indiabulls Housing Finance Q4 (Consolidated YoY)Profit grows 21.6% to Rs 319.4 crore Vs Rs 262.6 croreNet interest income falls 19.9% to Rs 281 crore Vs Rs 350.8 croreZF Commercial Vehicle Control Systems India Q4 (Consolidated YoY)Profit slips 1% to Rs 100.2 crore Vs Rs 101.2 croreRevenue declines 1.9% to Rs 958.6 crore Vs Rs 976.9 croreParas Defence and Space Technologies Q4 (Consolidated YoY)Profit falls 18.9% to Rs 9.6 crore Vs Rs 11.84 croreRevenue jumps 22.4% to Rs 79.7 crore Vs Rs 65.1 croreZuari Agro Chemicals Q4 (Consolidated YoY)Profit stands at Rs 77.4 crore Vs loss of Rs 426.7 croreRevenue declines 33% to Rs 897.7 crore Vs Rs 1,338.9 croreDoms Industries Q4 (Consolidated YoY)Profit jumps 29.6% to Rs 46.9 crore Vs Rs 36.2 croreRevenue rises 20% to Rs 403.7 crore Vs Rs 336.5 croreEBITDA grows 22.6% to Rs 75.9 crore Vs Rs 61.9 croreEBITDA margin expands 40 bps to 18.8% Vs 18.4%Sun TV Network Q4 (Consolidated YoY)Profit increases 9% to Rs 414.7 crore Vs Rs 380.2 croreRevenue jumps 14.4% to Rs 961.3 crore Vs Rs 840.4 croreEasy Trip Planners Q4 (Consolidated YoY)Net loss at Rs 15.08 crore Vs profit of Rs 31.06 croreRevenue surges 40.7% to Rs 164 crore Vs Rs 116.6 croreAstra Microwave Products Q4 (Consolidated YoY)Profit surges 302.3% to Rs 54.4 crore Vs Rs 13.5 croreRevenue jumps 37% to Rs 354 crore Vs Rs 258.4 croreEBITDA zooms 135.5% to Rs 80.7 crore Vs Rs 34.3 croreEBITDA margin expands 950 bps to 22.8% Vs 13.3%Affle India Q4 (Consolidated YoY)Profit spikes 40.2% to Rs 87.5 crore Vs Rs 62.4 croreRevenue increases 42.3% to Rs 506.2 crore Vs Rs 355.8 croreJM Financial Q4 (Standalone YoY)Profit surges 137% to Rs 27.5 crore Vs Rs 11.6 croreRevenue jumps 127.6% to Rs 191 crore Vs Rs 83.9 croreTamil Nadu Newsprint & Papers Q4 (YoY)Profit plunges 67.9% to Rs 33 crore Vs Rs 102.8 croreRevenue drops 13.7% to Rs 1,231.1 crore Vs Rs 1,427.3 croreSun Pharma Advanced Research Company Q4 (Consolidated YoY)Net loss widens to Rs 105.8 crore Vs loss of Rs 82 croreRevenue falls 65.3% to Rs 16.6 crore Vs Rs 47.7 croreBoard approves fund raising of up to Rs 1,800 crore via issuance of securitiesChetan Rajpara resigns as Chief Financial Officer with effect from June 5Board appoints Anup Rathi as Chief Financial Officer with effect from June 6Antony Waste Handling Q4 (Consolidated YoY)Profit jumps 143.5% to Rs 30.2 crore Vs Rs 12.4 croreRevenue rises 4.2% to Rs 210.2 crore Vs Rs 201.8 croreTax write-back at Rs 17.2 crore Vs tax expenses at Rs 5.5 croreLumax Industries Q4 (Consolidated YoY)Profit surges 73.8% to Rs 36 crore Vs Rs 20.7 croreRevenue grows 22.1% to Rs 742.7 crore Vs Rs 608.1 croreBoard announces final dividend of Rs 35 per shareNarayana Hrudayalaya Q4 (Consolidated YoY)Profit grows 10.1% to Rs 190.8 crore Vs Rs 173.2 croreRevenue rises 4.7% to Rs 1,279.4 crore Vs Rs 1,221.6 croreShaily Engineering Plastics Q4 (Consolidated YoY)Profit jumps 94.7% to Rs 19.3 crore Vs Rs 9.9 croreRevenue grows 26.8% to Rs 170.6 crore Vs Rs 134.5 crore Stocks To WatchTata SteelThe High Court of Calcutta has dismissed the writ petition filed by the company, with a liberty to the company, to approach the Joint Plant Committee. It will seek further legal remedies in the matter. On April 2, 2024, it had filed writ petition in the court in the matter of rejection of a representation made by the company in respect of waiver of loans availed from the Steel Development Fund (SDF). The loan outstanding (principal and interest) as of the last annual audited financial statements is Rs 2,751.17 crore. The entire amount of Rs 2,751.17 crore has already been accounted for as borrowings in the last audited financial statements.Rail Vikas NigamThe company has emerged as the lowest bidder (L1) for a project worth Rs 187.34 crore from Maharashtra Metro Rail Corporation (Nagpur Metro). The project involves the construction of six elevated metro stations in Phase 2.Shaily Engineering PlasticsThe company announced that the board has appointed Paresh Jain as Chief Financial Officer with effect from May 24. Furthermore, the board has redesignated Sanjay Shah from the post of Chief Strategy Officer & Chief Financial Officer to Chief Strategy Officer.HDFC Asset Management CompanyMudeita Patrao has resigned as Head – Digital of the company with effect from June 21, 2024. Patrao resigned to pursue other personal interests.Hero MotoCorpThe world's largest two-wheeler maker had filed rectification applications with respect to the reassessment orders of March 30, 2024, pertaining to six assessment years: 2013-14 to 2017-18 and 2019-20. The company has received the rectification orders for the said assessment years, resulting in the reduction of the original demand from Rs 604.87 crore to Rs 177.96 crore. It has filed appeals against the same.Aurobindo PharmaThe United States Food and Drug Administration (US FDA) conducted an inspection at Unit III, a formulation manufacturing facility of the company's subsidiary, Eugia Pharma Specialities, at Pashamylaram, Telangana, from January 22 to February 2 this year. Subsequently, the US FDA has determined the inspection classification status of this facility as Official Action Indicated (OAI).Adani Ports, WiproAdani Ports and Special Economic Zone will enter the BSE Sensex, replacing Wipro, with effect from June 24. Additionally, REC, HDFC AMC, Canara Bank, Cummins India, and Punjab National Bank will be included in the S&P BSE 100 index, while Page Industries, SBI Card, ICICI Prudential Life Insurance, Jubilant FoodWorks, and Zee Entertainment Enterprises will be removed from the index. Trent will replace Divis Laboratories in the S&P BSE Sensex 50 index.Easy Trip PlannersThe online travel platform's co-founder and chief executive officer (CEO) Nishant Pitti announced the withdrawal of his personal bid from the GoAir acquisition process. Nishant stated that he would better focus on other strategic priorities and initiatives that align with the company's long-term vision and growth objectives.F&O BanBiocon, GNFC, Vodafone Idea, Bandhan Bank, Hindustan Copper, India Cements, National Aluminium Company, Piramal Enterprises, Punjab National Bank.\n       ",
    "State-run power generator NTPC Ltd recorded gross power generation of 93.387 billion units (BU) in Q4, 4.15 percent higher than 89.668 BUs recorded in the same period of the previous year. This comes amid rise in power demand amid high temperatures across the country.Compared to the previous quarter, gross electricity generation of NTPC rose 4.38 percent in Q4 from 89.467 BUs recorded in Q3FY24.Amid rising power demand in the country, India’s total stock of coal at pit-head and on transit to thermal power plants (TPPs) reported a growth of 25 percent to 147 metric tonnes (MT) as on May 15, compared to stock of 117 MT on the same day last year, the coal ministry had said.In the full year FY24, NTPC recorded gross power generation of 361.703 BUs, compared to 344.272 BUs in FY23, an increase of 5.06 percent.Meanwhile, with the decline in natural gas prices, NTPC gas consumption showed sharp spike of 131.71 percent to 0.95 MMSCMD in the fourth quarter from 0.41 MMSCMD last year.On May 24, NTPC reported a consolidated net profit of Rs 6490.05 crore for the fourth quarter of 2023-24, up 33 percent from Rs 4871.5 crore in the year-ago period. Sequentially, consolidated net profit of the company rose by 24.5 percent from Rs 5208.87 crore in the December quarter.The company’s board of directors recommended final dividend of Rs 3.25 per equity share for the financial year 2023-24, subject to the approval of the shareholders in the annual general meeting.The board also accorded the in-principle approval for incorporation of a wholly owned subsidiary company for undertaking nuclear energy business, subject to approval of its administrative Ministry i.e. Ministry of Power, DIPAM, Niti Aayog and/or other statutory authorities as may be required.\n       ",
    "State-run NTPC Ltd reported a 33 percent increase in its consolidated net profit for the fourth quarter of financial year 2023-24 amid higher power demand due to scorching high temperatures in the country.The power utility major's revenue from operations also rose above seven percent in the March quarter. The company’s power generation and coal production also increased in the period.Moneycontrol takes a look at the highlights from the company’s fourth quarter results:-NTPC consolidated net profit rose to Rs 6,490.05 crore in the fourth quarter from Rs 4,871.5 crore in the year-ago period. Sequentially, net profit of the company rose by 24.5 percent from Rs 5,208.87 in the December quarter.-Revenue from operations in the March quarter was Rs 47,622.06 crore, rising 7.6 percent from Rs 44,253.17 crore reported last year.-The company’s board of directors recommended final dividend of Rs 3.25 per equity share for the financial year 2023-24, subject to the approval of the shareholders in the annual general meeting.-The board of directors accorded the in-principle approval for incorporation of a wholly owned subsidiary company for undertaking nuclear energy business, subject to approval of its administrative Ministry i.e. Ministry of Power, DIPAM, Niti Aayog and/or other statutory authorities as may be required.-For FY24, net profit of the group was Rs 21,332 crore as against Rs 17,121 crore in the previous year, registering a growth of 24.60 percent.-During the quarter, the company recorded gross power generation of 93.387 billion units (BU), 4.15 percent higher than 89.668 BUs in the same period of the previous year.-Coal produced from NTPC’s captive mines stood at 7.87 million tonnes in the quarter, marking a spike of 21.45 percent over 6.48 MT in FY23.-The total installed capacity of the NTPC group stood at 75,958 MW in Q4FY24 against 72,254 MW in the same quarter of the previous fiscal year. On a standalone basis, NTPC reported a total installed capacity of 59,078 MW, compared to 56,368 MW in Q4FY23.-NTPC group recorded the highest-ever annual generation of 422 BU in FY24 as compared to 399 BU in FY23, an increase of around 6 percent. NTPC’s standalone gross generation in FY24 was 362 BU as compared to 344 BU in the previous year, registering an increase of around 5 percent.-Gas consumption of the company improved to 0.95 MMSCMD in the fourth quarter from 0.41 MMSCMD last year, growing 131.71 percent.\n       ",
    "State-run power generator NTPC Ltd reported a consolidated net profit of Rs 6490.05 crore for the fourth quarter of 2023-24, up 33 percent from Rs 4871.5 crore in the year-ago period. The profit of the company improves amid higher electricity generation and spike in power demand.Sequentially, consolidated net profit of the company rose by 24.5 percent from Rs 5208.87 in the December quarter.Revenue from operations in the March quarter was Rs 47,622.06 crore, rising 7.6 percent from Rs 44,253.17 crore reported last year.NTPC is India's largest integrated power utility, contributing 25 percent of the country’s power requirement.The company’s board of directors recommended final dividend of Rs 3.25 per equity share for the financial year 2023-24, subject to the approval of the shareholders in the annual general meeting.Earnings before interest, taxes, depreciation and amortisation (EBITDA) came in at Rs 15,601.13 crore, compared to Rs 12,435.22 crore posted a year earlier.The board of directors, in their meeting held on May 24, accorded the in-principle approval for incorporation of a wholly owned subsidiary company for undertaking nuclear energy business, subject to approval of its administrative Ministry i.e. Ministry of Power, DIPAM, Niti Aayog and/or other statutory authorities as may be required.During the quarter, the company recorded gross power generation of 93.387 billion units (BU), 4.15 percent higher than 89.668 BUs in the same period of the previous year.Coal produced from its captive mines stood at 7.87 million tonnes in the quarter, marking a spike of 21.45 percent over 6.48 MT in FY23.The total installed capacity of the NTPC group stood at 75,958 MW in Q4FY24 against 72,254 MW in the same quarter of the previous fiscal year. On a standalone basis, NTPC reported a total installed capacity of 59,078 MW, compared to 56,368 MW in Q4FY23.The company said in its press release that NTPC group recorded the highest-ever annual generation of 422 BU in FY24 as compared to 399 BU in FY23, an increase of around 6 percent. NTPC’s standalone gross generation in FY24 was 362 BU as compared to 344 BU in the previous year, registering an increase of around 5 percent.Shares of NTPC closed at Rs 374.50 apiece on the National Stock Exchange on May 24 ahead of the results, up 0.59 percent from previous day’s close.\n       ",
    "Power utility major NTPC is likely to report a profitable Q4, on the back of increased production capacity, power demand, and \"impressive trends in coal production\".The company is set to announce its Q4 FY24 earnings on May 24.For Q4FY24, NTPC may report revenue of Rs 45,278 crore, up 5 percent quarter on quarter (QoQ) and 2 percent year on year (YoY), according to a Bloomberg consensus estimate of five brokerages.The company’s net profit is expected to grow by 2 percent QoQ and 9 percent YoY to Rs 5,331 crore. EBITDA (earnings before interest, taxes, depreciation and amortisation) is expected to increase to Rs 13,115 crore in Q4FY24 from Rs 11,362 crore in Q3FY24 and Rs 12,435 in the December 2023 quarter.Analysts bullish on opportunitiesAnalysts continue to remain positive on the stock and opportunities for growth on the back of growing demand in both the thermal and renewable segments.In a March 2024 report, analysts at Antique Broking highlighted that NTPC's total shareholder return (TSR) was 37 percent in the past year (March 2022–March 2023), outperforming the median sector performance of 12 percent.The brokerage, which has a buy call on the stock, added that NTPC is in the final leg to unlock 20 percent value from its renewable arm and highlighted that 6 GW is under consideration for thermal power project capacity expansion, and new projects of 17–28 GW are on the cards.Analysts at Sharekhan noted in a March 2024 report that NTPC’s risk-averse regulated business model provides earnings growth visibility, RoE improvement, and RE (renewable energy) capacity expansion, which would drive a gradual re-rating of the stock as it would allay concerns on the ESG (environment, social and governance) front.Also read: ONGC, NTPC Green Energy may come together to bid for Ayana Renewable'Potential IPO for RE business another plus'Additionally, the brokerage noted that a potential IPO for its RE business could further improve shareholders’ returns in the coming years. Sharekhan has a buy rating on the stock.NTPC, according to analysts at ICICI Securities, has been the only companywhich has added coal-based capacities over the last 5 years.\"With an aggressive approach to expanding renewable energy, including green hydrogen, it aims for nearly 45–50 percent of its capacity to come from non-fossil fuels by 2030, with a medium-term target of 60 GW of renewable capacity by 2032,\" the February 2024 report noted.The brokerage added that the management is fairly confident of reaching20,000 MW of renewable capacity by FY26E, and the company is also striving hard to diversify into areas like green hydrogen and nuclear power (JV with NPCIL).Analysts see any decrease in power demand, increase in price or shortage of coal, and/or slowdown in capacity expansion as possible challenges for the stock.Currently, around 19 brokerages have a buy call on the stock and three have a sell call. The stock has gained over 113 percent in the last year. NTPC is a central public sector undertaking (PSU) under the Ministry of Power.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.  ",
    "Norway’s central bank has excluded Adani Group’s port firm, APSEZ from its government pension fund over ethical concerns, making it the 15th Indian company to face such action with previous ones being the likes of ONGC, GAIL, NTPC and Vedanta. Norges Bank, which manages the sovereign wealth fund, on May 15 stated that it has decided to exclude Adani Ports and Special Economic Zone due to ”unacceptable risk that the company contributes to serious violations of individuals’ rights in situations of war or conflict.”APSEZ, which was on the central bank’s watch list for possible exclusion from investment since March 2022, faced the action due to its business association with the armed forces in Myanmar. Sources however said the Adani group firm sold the Myanmar asset entirely in May last year, and there has been no incremental disclosures made regarding that asset, as the company has fully exited.The Norwegian fund’s Council of Ethics acknowledged APSEZ’s May 2023 disclosure that it had sold its port-related operations in Myanmar to Solar Energy Ltd but said ”no information on buyer is available, and APSEZ has stated that it cannot share any such information on the grounds of confidentiality.””Lack of information means that the Council cannot establish whether APSEZ has links to the enterprise concerned. In a situation in which extremely serious norm violations are taking place, this constitutes an unacceptable risk that the Norwegian Government Pension Fund Global’s (GPFG’s) investments in APSEZ may breach its ethical guidelines,” it added.The Norwegian Fund started buying into APSEZ in mid-October, post the May 2023 disclosure. It made near 70 per cent on its first purchase in nearly 6 months, until it exited in April. APSEZ joins more than a dozen Indian firms which had faced similar action over the past few years, according to information on the website of Norges Bank Investment Management.The Norwegian bank had excluded ITC in January 2020 over production of tobacco. Similar action followed against Zuari Agro Chemicals in October 2013 over alleged human rights violations. Vedanta faced similar action in January 2014 over ’severe environmental damage’.Coal India, NTPC, Reliance Power, Tata Power and three other power producers faced a similar action in April 2016 for production of coal or coal-based energy. BHEL faced action in May 2017 and January 2023 over environmental damage and sales to states in armed conflicts.Oil and Natural Gas Corporation (ONGC) was charged with serious violations of individuals’ rights in situations of war or conflict when it faced similar action in September 2021. GAIL was charged with the same in April 2023.\n       ",
    "Shares of NHPC gained 0.6 percent during morning trades on the NSE on April 24, a day after the company reported that it had signed a  supplementary joint venture agreement for the sale of partial stake in National High Power Test Laboratory (NHPTL). At 11 am, the stock was trading at Rs 90.35.Follow our market blog for live updatesIn a regulatory filing, NHPC said that it had signed a JVA with NHPC, NTPC, Power Grid Corporation of India, Damodar Valley Corporation (DVC), Central Power Research Institute (CPRI) & NHPTl. Currently, NHPC holds 20 percent stake in NHPTL. Power Grid Corporation is the buyer and is an existing Promoter of NHPTL. Under the agreement, NHPC will sell 1.31 crore shares to Power Grid at a notional total consideration of Rs 1.NHPTL is unlisted. Post the sale, according to the filing, Power Grid will hold around 50 percent equity in the company. Previously, all five JV partners held 20 percent stake each. Now, the remaining four partners- NHPC, NTPC, DVC & CPRI will hold 12.5 percent each.Also read: NHPC board approves raising Rs 6,100 crore debt in 2024-25NHPTL, according to the company is a \"High Power Short Circuit Test Facility\" that aims to provide short circuit testing for \"national power equipment manufacturers, national power utilities and international power equipment manufacturers from SAARC, ASEAN & Middle East Countries in conformance to Indian and International Standards\".Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.  ",
    "NTPC shares were trading lower in early trade on April 22 after the company's wholly owned subsidiary signed a Memorandum of Understanding (MoU) with Indus Towers.\"NTPC Green Energy Limited (NGEL) and Indus Towers Limited (ITL) on April 18 signed an MoU to address the need for pacing green energy objectives and the GOI’s efforts towards carbon neutral economy,\" company said.NTPC Green Energy Limited (NGEL) is a wholly owned subsidiary of NTPC.The MoU is to explore a joint development of grid connected renewable energy based power projects including solar, wind, energy storage etc. and solutions thereof.Indus Towers Limited aims to expand its renewable energy portfolio in a phased manner to Giga Watt scale capacity, for its business operations spread across the country, as a part of its net zero commitments.In early trade, around 6.12 million shares of NTPC traded in a bunch, reported Bloomberg.Catch all market action in our live blogEarlier this month, the company received an order from the State Tax Officer, Ghatak 57, Range -15, Division – 7, Surat, Gujarat, for collection of interest and penalty under Goods and Service Tax laws for Rs 28.93 lakh.Also, it received an order from the Deputy Commissioner (ST), State Special Circle-I, Kunchanapalli, Guntur Distt. for Rs 7.91 crore.The company will file an appeal before the First appellate authority of the applicable jurisdiction against the said orders within the prescribed timeline.\n       ",
    "JSW Energy on Saturday said that its arm JSW Neo Energy has received a letter of award from NTPC for setting up a 700 MW solar project.With the latest project win, JSW Energy\u0092s total locked-in generation capacity has increased to 13.3 GW of which 3.1 GW is solar power, a BSE filing said.According to the filing, JSW Neo Energy Limited, a wholly owned subsidiary, has received Letter of Award for setting up a 700 MW ISTS connected Solar Power Project from NTPC Limited.The company\u0092s current installed generation capacity is 7.2 GW and expects to have 9.8 GW of installed capacity by CY24.The company aims to reach 20 GW generation capacity and 40 GWh of energy storage capacity before 2030. JSW Energy has set an ambitious target of achieving Carbon Neutrality by 2050.\n       ",
    "Disinvestment of state-owned companies such as NTPC and Shipping Corporation of India (SCI) will figure high on the first 100-day agenda of the government after the votes are counted on June 4, a report said.Prime Minister Narendra Modi, who is confident of a rare third term in a row, has on more than one occasion said the government was working on the plan not just for 100 days after the Lok Sabha elections but also towards making India a developed nation by 2047.The government’s focus would be to push for disinvestment, which fell short of its target in FY24, sources told CNBC Awaaz.The government may push to sell its stake in NTPC, which aims to bring its green energy IPO first, sources said.Moneycontrol reported earlier that at least a dozen investment banks have shown interest in managing the proposed Rs 10,000-crore initial public offering (IPO) of NTPC Green Energy Ltd, the renewables subsidiary of NTPC Ltd.The government is also looking to expedite its 63.75 percent stake sale in the Shipping Corporation of India (SCI) and invite financial bids, sources said.ALSO READ: SCI divestment faces more hurdles as pension scheme and ongoing court case may delay process further: SourcesIDBI Bank divestment may see financial bids coming in in FY25, however, another divestment target, BEML, may get delayed, the report cited sources as saying.Moneycontrol couldn’t verify the report independently.In her interim Budget speech on February 1, finance minister Nirmala Sitharaman said the government aims to raise Rs 50,000 crore from stake sales in various public sector companies in 2024-25.For the previous fiscal, the budget scaled down the disinvestment revenue target in the revised estimates to Rs 30,000 crore from Rs 51,000 crore.A significant portion of the projected revenue was missed because no strategic sale transaction came through due to complications and issues with state governments in each case. The Center missed its divestment target for the fifth year in a row.The new government is expected to present a full budget in early July.\n       ",
    "State-run power giant NTPC on Monday said it has added 3,924 MW power generation capacity in 2023-24, taking the total installed capacity to around 76GW.This (3,924 MW) includes the commissioning of the second unit in Bangladesh and maiden capacity addition by both its subsidiaries -- NTPC Green Energy Ltd (NGEL) and NTPC Renewable Energy Ltd (NREL), during the fiscal year ending March 31, 2024, a company statement said.In FY24, NTPC Ltd achieved an addition of 3,924 MW new capacity to its overall portfolio, elevating its cumulative installed capacity to almost 76 GW.NTPC is India's largest integrated power utility, contributing 1/4th of the power requirement of the country.With a diverse portfolio of thermal, hydro, solar, and wind power plants, NTPC is dedicated to delivering reliable, affordable, and sustainable electricity to the nation.The company is committed to adopting best practices, fostering innovation, and embracing clean energy technologies for a greener future.On Sunday, NTPC said it has logged an all-time high annual electricity generation of 422 billion units in 2023-24, registering a growth of nearly 6 per cent over 2022-23.During 2023-24, NTPC coal stations recorded a plant load factor (PLF, or capacity utilisation) of 77 per cent.On September 1, 2023, the company had recorded the highest-ever single-day generation of 1,428 million units.The company further said that it has logged a 55 per cent growth in coal dispatch and nearly 50 per cent expansion in output of the dry fuel from its mines in 2023-24, compared to the year-ago period.The company dispatched 34.15 MMT coal, while coal production stood at 34.38 MMT during the financial year 2023-24.The company aims to have 130 GW installed electricity generation capacity by 2032.\n       "
]