[
    "The share price of Power Grid Corporation of India gained nearly 1 percent to hit a 52-week high of Rs 226 in early trade on December 6 after the company was declared as a successful bidder for a project from the Khavda RE park.At 9:28am, Power Grid Corporation of India was quoting Rs 224.15, up Rs 1.75, or 0.79 percent, on the BSE.\"We have been declared as a successful bidder under tariff-based competitive bidding to establish inter-state transmission system project for 'transmission system for evacuation of additional 7 GW of RE power from Khavda RE park under Phase III Part B' on a build-own-operate-and-transfer (BOOT) basis,\" it said. The company received the Letter of Intent (LoI) on December 4, 2023.The project involves setting up a 765/400kV switching station at Vataman in Ahmedabad district, three 765kV D/c transmission lines (including a LILO line) traversing in Gujarat as well as extension works at Navsari and Halvad substations.Catch all market action in our live blogOn November 30, the company was declared a successful bidder under tariff-based competitive bidding to set up two inter-state transmission system projects under build, own, operate and transfer (BOOT) basis.\n       ",
    "Considering the bullish bias with continuation in higher highs, higher lows formation for six days in a row and support-based buying for yet another session, experts expect the Nifty50 to touch 21,000 mark for the first time in the coming days, with support at the 20,700 levels, but on the other side, also advised to keep an eye on momentum indicator RSI (relative strength index) which is at (83) overbought levels, along with increasing volatility and breadth which was negative on December 5.On December 5, the benchmark indices ended at fresh record closing high. The Nifty50 soared 168 points to 20,855, and the BSE Sensex was up 431 points at 69,296, while the Nifty Midcap 100 and Smallcap 100 indices underperformed benchmarks, rising 0.5 percent and 0.1 percent respectively.Stocks that performed much better than broader markets included Power Grid Corporation of India, IDFC First Bank, and JK Paper. Power Grid Corporation of India has seen a decisive breakout of slightly downward sloping resistance trendline adjoining multiple resistance points, and formed robust bullish candlestick pattern on the daily scale. The stock jumped 4.4 percent to Rs 222 on the NSE and traded above all key moving averages (20, 50, 100 and 200-day EMA - exponential moving averages) with strong volumes.IDFC First Bank has also seen a horizontal resistance trendline breakout adjoining multiple resistance points and climbed 2.65 percent to Rs 89.25. The stock has formed bullish candlestick pattern with upper shadow on the daily charts, with above average volumes, while with Tuesday's upmove, it traded above all key moving averages.JK Paper, too, has seen decisive breakout of horizontal resistance trendline breakout adjoining multiple resistance touchpoints and traded well above all key moving averages. The stock surged nearly 7 percent to Rs 394 and formed robust bullish candlestick pattern after several days of consolidation, with significantly higher volumes.Here's what Om Mehra of SAMCO Securities recommends investors should do with these stocks when the market resumes trading today:JK PaperFollowing a substantial consolidation, JK Paper showcases a breakout with notable volume, engulfing November's entire candle range. Sustaining above the 50-day simple moving average (SMA), the stock exhibits RSI (relative strength index) recovery, currently placed at 63.The price ascent signals renewed market interest and potential upward momentum bolstered by robust volume participation.Hence, based on the above technical structure one can initiate a long position at Rs 394.30. However, on the safer side, it is advised to enter the counter near Rs 385-390 levels to enter, for the target price of Rs 418. Stop-loss can be kept as Rs 375.IDFC First BankThe stock is forming higher high and higher low formation in the daily chart. The stock is trading above 20 and 50 DMA, indicating strength in price action. Also, positive crossover is indicated in MACD (moving average convergence divergence) while RSI stands at 62 levels.The price is holding above 89 levels, which was previously its resistance, indicating buying interest among short-term traders.Hence, based on the above technical structure, one can initiate a long position at Rs 89.55, for the target price of Rs 96, and stop-loss at Rs 85.Power Grid Corporation of IndiaTrading at Rs 222.30, Power Grid exhibits a robust breakout, surpassing the crucial Rs 215 resistance with significant volumes. The stock rose taking support of 20 SMA. A positive crossover in the Stochastic daily indicator enhances the bullish outlook.Any dip in the stock can be accumulated in tranches for the long term as the weekly chart indicates Rs 210 zone as a solid support. Additionally, the power sector is in flavour and may continue to scale up in the coming weeks.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Shares of Power Grid Corporation of India gained 1 percent in the opening trade on December 1 after the company was declared as a successful bidder for inter-state transmission system projects.At 9:26am, Power Grid Corporation of India was quoting Rs 211.10, up Rs 2.15, or 1.03 percent, on the BSE.\"We have been declared as successful bidder under tariff-based competitive bidding to establish two inter-state transmission system projects under build, own, operate and transfer (BOOT) basis,\" said Power Grid Corporation in a press release.Catch all market action in our live blogThe first project is transmission system for evacuation of power from Rajasthan REZ Ph-IV (Part-1) (Bikaner Complex): Part-A. It comprises setting up of a 765/400/220 kV Pooling Station at Bikaner-III, two 400 kV D/C and one 765 kV D/C transmission line traversing in Rajasthan and associated bay extension works.The second project is transmission system for evacuation of power from Rajasthan REZ Ph-IV (Part-1) (Bikaner Complex): Part-D. The project involves building a 765 kV D/C Transmission Line traversing in Rajasthan and Uttar Pradesh along with associated bay extension works.The share touched a 52-week high of Rs 215.10 and a 52-week low of Rs 153.34 on November 13, 2023 and January 9, 2023. It is trading 1.86 percent below its 52-week high and 37.67 percent above its 52-week low.The share price gained 14 percent in the last three months.\n       ",
    "",
    "Sharekhan's research report on Power Grid Corporation of IndiaQ2 standalone PAT rose 5% y-o-y to Rs. 3,795 crore (4% above estimate) on higher interest & dividend and incentive income. Consolidated asset capitalisation rose 28% y-o-y to Rs. 3997 crore in H1FY24. Receivables fell 7% q-o-q to Rs. 6,633 crore as of September 2023. Management guided for capex/asset capitalization of Rs. 10000 crore/Rs. 10000 crore for FY24 and Rs. 12,500 crore/Rs. 17,000 crore for FY25. Potential rebound in transmission capex from FY25-FY26 bodes well for earnings growth.OutlookWe maintain a Buy with a revised PT of Rs. 240 as valuation of 1.7x FY2026E its P/BV seems attractive considering a decent growth outlook, healthy RoE of 18-19% and dividend yield of ~4-5%.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Power Grid Corporation of India - 10 - 11 - 2023 - khan ",
    "Net Sales at Rs 10,419.41 crore in September 2023 down 2.22% from Rs. 10,655.70 crore in September 2022.Quarterly Net Profit at Rs. 3,833.96 crore in September 2023 up 5.01% from Rs. 3,651.04 crore in September 2022.EBITDA stands at Rs. 9,993.63 crore in September 2023 up 5.28% from Rs. 9,492.87 crore in September 2022.Power Grid Corp EPS has decreased to Rs. 4.12 in September 2023 from Rs. 5.23 in September 2022.Power Grid Corp shares closed at 208.00 on November 07, 2023 (NSE) and has given 13.31% returns over the last 6 months and 21.64% over the last 12 months.",
    "The Indian energy market is primed for substantial growth, projected to rank as the third-largest global energy consumer by 2030, providing a rewarding opportunity for investors.The nation's significant leaps in electricity access, widespread LED adoption, and an escalating focus on renewable energy have ignited a booming demand.Investing online in India's booming energy sector stocks can be a fascinating financial venture. Here are the top five energy stocks of 2023, chosen considering India's swift energy market expansion and its determination towards renewable energy.1. Adani PowerA large number of Indians are searching for Adani Power Ltd when exploring top energy sector stocks in 2023. As India's largest private thermal power sector entity, it operates thermal power plants in various states while also owning a solar power unit.Boasting a solid thermal power portfolio of 12,410 MW, Adani Power has been having an exceptional year. Its revenue climbed by 35.8%, from Rs 31,686 crore in FY22 to Rs 43,041 crore in FY23, and profits skyrocketed 2.5x from Rs 5,242 crore to Rs 10,795 crore.As of 18th Oct 2023:●    Adani Power Share Price: Rs. 333.95●    Market Cap (Cr): Rs. 1,29,0152. Tata PowerTata Power is devoted to escalating its renewable power capacity as the foremost player in the energy sector. With ambitious plans to enhance its renewable energy production capacity, Tata Power has already ceased the construction of coal-based plants.Tata Power, a stalwart in the Indian power sector, continues to demonstrate robust financial performance. In FY23, the company's revenue surged by a striking 28.7%, from Rs 42,815.67 crore in FY22 to Rs 55,109.08 crore in FY23.Simultaneously, Tata Power's profit witnessed a considerable upswing, rising by a remarkable 76.7% from Rs 2,155.61 crore in FY22 to Rs 3,809.67 crore in FY23, reflecting its strong operational efficiency.Considering its strong industry position and promising growth prospects, no wonder searches for Tata Power stock are on the rise.As of 18th Oct 2023:●    Tata Power Share Price: Rs. 253.05●    Market Cap (Cr): Rs. 81,177.603. Indian Energy Exchange (IEX)IEX, an outstanding power exchange, is leading the energy race by diversifying its portfolio to include renewable energy. IEX's introduction of green energy trading and issuance of renewable energy certificates (REC) has bolstered renewable energy providers.Indian Energy Exchange's financial performance has been a study in stability. Despite a slight dip of 4.5% in revenue from Rs 11,208.35 crore in FY22 to Rs 10,702.89 crore in FY23, the company's profit remained nearly steady at Rs 8,833.73 crore in FY23 compared to Rs 8,840.71 crore in FY22.This resilience underscores the robust business model and efficiency of IEX. IEX is also exploring other possibilities, such as establishing a virtual power purchase agreement (VPPA) on its exchange. These developments could be persuasive when considering the potential future prospects of IEX.As of 18th Oct 2023:●     IEX Share Price: Rs. 133.60●    Market Cap (Cr): Rs. 11,993.304. Power GridIncorporated on 23 October 1989 and fully owned by the Government of India, Power Grid Corporation of India Limited (POWERGRID) operates in the power transmission business.Power Grid, an integral player in the Indian energy sector, reported a strong financial year with steady growth. The company's revenue rose by approximately 9.5%, from Rs 41,621.64 crore in FY22 to Rs 45,581.28 crore in FY23.Concurrently, the profits ascended by about 9.7%, up from Rs 14,050.08 crore to Rs 15,417.12 crore for the same period, underlining the firm's consistent profitability.In FY23, the company constructed 24,900 MVA of transformation capacity, seven sub-stations, and 1,676 km of transmission lines.As of 18th Oct 2023:●    Power Grid Share Price: Rs. 206.50●    Market Cap (Cr): Rs. 1,87,547.005. Reliance PowerReliance Power is actively involved in developing diverse energy projects, including coal, gas, hydro, wind, and solar-based projects. The company's operating portfolio consists of Ultra Mega Power Projects (UMPPs) with a total capacity of 5945 MW.Reliance Power has shown signs of financial recovery in FY23. Although the revenue remained almost constant, moving from Rs 750,311 crore in FY22 to Rs 754,269 crore in FY23, the company significantly reduced its losses.The loss plummeted by about 51.2% from Rs 96,400 crore in FY22 to Rs 47,077 crore in FY23, indicating that the firm is on the path to financial stabilization and, potentially, profitability in the near future.The stock and the company continue to be of intrigue for Indians as they continue to monitor their growth with a close eye.As of 18th Oct 2023:●    Reliance Power Share Price: Rs. 18.50●    Market Cap (Cr): Rs. 6,637.46ConclusionThe Indian energy sector continues to be a keen topic of interest for investors on the lookout for various shares.Being rife with opportunities yet relatively volatile and dynamic, companies such as Power Grid Corporation, Reliance Power, IEX, Tata Power, and Adani Power have emerged as the most searched-for energy sector stocks.The path to seize opportunities in these stocks is through an online trading and investing platform that is reliable, robust, and resilient.Moneycontrol Journalists are not involved in creation of this article.  ",
    "Shares of Power Grid Corporation traded up in the morning trade on September 12 after the state-owned company announced that it has been declared the successful bidder under tariff-based competitive bidding for an inter-state transmission system project in Rajasthan.“The project comprises establishment of a new 765/400 kilovolt substation along with a static synchronous compensator at Ramgarh, a 765 kilovolt direct current transmission line and associated bays extension works at other existing substations in the state of Rajasthan,” the company said in a regulatory filing at the exchanges.At 9.30am on the NSE, the Power Grid Corporation stock was quoting at Rs 199.15, up Rs 0.80, or 0.40 percent.The stock has a trailing P/E of 12.13x, making it the second cheapest stock in absolute terms among its peers.Follow our live blog for all the market actionIn the April to June quarter, the company reported a 1.31 percent year-on-year (YoY) rise in its revenue from operations at Rs 11,048 crore. The company’s net profit for the quarter declined 5.36 percent on a yearly basis to Rs 3,597 crore. The operating profit margins shrunk by 100 basis points YoY to 84 percent.Power Grid Corporation is engaged in the business of electricity transmission and allied services. The company operates a vast network of high-voltage transmission lines and substations across India.Disclaimer: The views and investment tips expressed by experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Sharekhan's research report on Power Grid Corporation of IndiaIndia’s aim to expand renewable energy (RE) capacity to ~500GW by 2032 would require significant investment in transmission infrastructure. Thus, Power Grid sees a large addressable market and estimates its transmission capex at Rs. 1.71 lakh crore up to 2032 and expects capex revival to Rs. 20,000-25,000 crore starting from FY25-26. This makes us optimistic of pick-up in Power Grid’s capex/asset capitalization. Focus on new opportunities in power value chain like smart meters, smart grid, energy storage would diversify earnings stream and create value in the long term. Smart metering is gaining traction as Power Grid received an order to install 69 lakh smart meters for Gujarat discoms at an investment of Rs. 4067 crore. Robust work in hand (Rs. 48,700 crore), large transmission bid pipeline and a regulated RoE model provides healthy earnings growth visibility with likelihood of upside to our earnings estimates in case of a faster pick-up in transmission capex.OutlookWe maintain a Buy rating on Power Grid with an unchanged PT of Rs. 290. A valuation of 1.7x FY2025E its P/BV seems attractive, considering a decent growth outlook, healthy RoE of 19%, and a dividend yield of ~6%.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Power Grid Corporation of India - 08 -09 - 2023 - khan ",
    "Although the Nifty on Wednesday rebounded from the lowest point of the day, the short-term outlook for the market remains feeble, given that the index ended the session below the vital short-term moving average of 21 days.The relative strength index (RSI) shows a bearish crossover, further amplifying the pessimistic sentiment. The prevailing trend will continue to lack strength as long as it maintains levels below 19,521, where the 21-day exponential moving average (EMA) is placed. Looking downward, the initial support level is seen at 19,250.The Bank Nifty index recently found support at a crucial level, the 100-day moving average (DMA), at 43,600. The index's potential to experience a pullback rally is contingent on maintaining this level above the 100DMA on a closing basis.The immediate obstacle for the index is situated around 44,000. An upward breach beyond this level could validate a move towards 44,300 or 44,500 levels.Here are three buy calls for short term:Power Grid Corporation of India: Buy | LTP: Rs 248 | Stop-Loss: Rs 240 | Target: Rs 270 | Return: 9 percentPower Grid is exhibiting an ascending pattern characterized by the formation of higher highs and higher lows. Additionally, the price is currently positioned above a significant moving average.The daily RSI has undergone a bullish crossover. Looking at the upper range, there's a possibility of it advancing toward the range of Rs 265-270. On the downside, a support level is established at Rs 240.NTPC: Buy | LTP: Rs 217.45 | Stop-Loss: Rs 210 | Target: Rs 230 | Return: 6 percentFollowing a notable rally, the NTPC stock experienced a corrective phase and found support at its 20-day moving average (20DMA). The momentum indicator, RSI, signaling a positive crossover, affirms the strengthening momentum.An essential support for the stock lies at Rs 210, anticipated to provide a buffer for the bulls. Meanwhile, the potential upside targets are marked at Rs 226-230.KPIT Technologies: Buy | LTP: Rs 1,135.55 | Stop-Loss: Rs 1,100 | Target: Rs 1,220 | Return: 7.4 percentThe stock has demonstrated its ability to maintain a position above the crucial moving average, indicating an ongoing bullish trend. A favourable crossover in the weekly RSI implies a growing sense of positive momentum.In the short term, there is potential for the stock to ascend toward higher levels. As a downside safeguard, support is established at Rs 1,100, while resistance is noted at Rs 1,220.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Sharekhan's research report on Power Grid Corporation of IndiaQ1FY2024 standalone PAT declined by 6% y-o-y to Rs. 3,543 crore (13% below estimate) due to lower transmission income for the previous period, steep fall in earnings from the consultancy business, and continued subdued trend of asset capitalisation. Standalone/consolidated asset capitalisation was muted at Rs. 652 crore/Rs. 1,615 crore, down 51%/26% y-o-y in Q1FY2024. Overall, receivables increased by 48% q-o-q to Rs. 7,140 crore as of June 2023. Management expects the transmission capex to pick-up and has estimated capex of Rs. 1.71 lakh crore over the next nine years. This would mean a rebound in capex in the range of Rs. 20,000-25,000 crore for a few years starting from FY2025-FY2026. The company has received smart metre order from Gujarat discoms which would require an investment of Rs. 4,067 crore; management has guided for mid-teen RoE on smart meter investment.OutlookWe maintain our Buy rating on Power Grid with a revised PT of Rs. 290 (rollover of valuation to FY2025 earnings estimate). The valuation of 1.7x FY2025E its P/BV seems attractive, considering a decent growth outlook, healthy RoE of 19%, and a dividend yield of ~6%.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Power Grid Corporation of India - 03 -08 - 2023 - khan ",
    "Power Grid Corporation of India shares were down marginally at Rs 251.30 on August 2. The company had informed that it received board approval for the implementation of an 85 MW solar PV power project at Nagda in Madhya Pradesh.The estimated cost of the project is Rs 554.91 crore with an implementation schedule of 10 months from the date of award and an O&M phase of 5 years for a solar plant.Catch all the market action on our live blogThe company had posted a 6 percent year-on-year decline in standalone profit at Rs 3,542.65 crore in the June quarter of FY24 against Rs 3,765.93 crore in the year-ago period.Revenue from operations fell marginally to Rs 10,436.1 crore from Rs 10,446.08 crore in the same quarter of the previous year.Earnings before interest, tax, depreciation and amortization (EBITDA) grew 3.4 percent year on year to Rs 9,099.5 crore, with a margin expansion of 290 basis points at 87.2 percent in Q1FY24.The company’s board recommended the issue of bonus shares in the ratio of 1:3 and also approved raising up to Rs 12,000 crore from the domestic market in the financial year 2024-25 in one or more tranches.The share touched a 52-week high of Rs 266.85 on July 31, 2023, after a 52-week low of Rs 186.35 recorded on September 26, 2022.Currently, the stock is trading 5.83 percent below its 52-week high and 34.85 percent above its 52-week low.\n       ",
    "",
    "",
    "Power Grid Corporation of India was trading almost 4 percent lower on August 1 morning, a day after the state-owned firm reported a 6 percent year-on-year decline in standalone profit at Rs 3,542.65 crore in the June quarter of FY24.Power Grid Corporation of India had posted a profit of Rs 3,765.93 crore in the year-ago period.Revenue from operations fell marginally to Rs 10,436.1 crore from Rs 10,446.08 crore in the same quarter of the previous year.Earnings before interest, tax, depreciation and amortization (EBITDA) grew 3.4 percent year on year to Rs 9,099.5 crore, with a margin expansion of 290 basis points at 87.2 percent in Q1FY24.One basis point is one-hundredth of a percentage point.Catch all the market action on our live blogThe company’s board also recommended the issue of bonus shares in the ratio of 1:3, which means for every three shares that investors hold, they will get one additional share.The board recommended raising up to Rs 12,000 crore from the domestic market in the financial year 2024-25 in one or more tranches.The decision came after a committee of directors on July 29 approved the raising of upto Rs 5,700 crore in FY 23-24 through bonds in multiple tranches to meet the firm’s  capex requirement and to provide inter-corporate loans to wholly owned subsidiaries and joint ventures.The funds will also be used for general corporate purposes by securitization of cashflows of 4 operational special purpose vehicles including Powergrid Bhuj Transmission Limited, Powergrid Khetri Transmission System Limited, Powergrid Medinipur Jeerat Transmission System Limited & Powergrid Varanasi Transmission System Limited upto March, 2034.At 9.55 am, the share was trading at Rs 257.7 on the National Stock Exchange, down 3.89 percent from the previous close. \n       ",
    "Power Grid Corporation of India Limited (PGCIL) on July 31 reported a 5.3 percent drop in consolidated net profit to Rs 3,597.16 crore in the April-June quarter, as against Rs 3,801.29 crore a year earlier.The public sector company's Board also approved issue of bonus shares in the ratio of one equity share of Rs 10 each for every three equity shares held, subject to the approval of shareholders of the Company. The bonus is likely to be credited by September 25.Besides, Power Grid will also raise funds of up to Rs 12,000 crore in FY 2025 from the domestic market. The company's Board approved raising funds through bonds under private placement, which could be issued in a single or multiple tranches.ALSO READ: Power Grid declared successful bidder for 2 projects, shares spike nearly 2%Consolidated revenue marginally increased to Rs 11,257.60 crore in the three months ended June from Rs 11,168.54 crore in the year-ago quarter. In that, the revenue from operations during the same period increased by one percent to Rs 11,048.13 crore to Rs 10,905.21 crore.The company's transmission business saw a marginal increase to Rs 10,829.67 crore in the first quarter of FY 24 from Rs 10,702.98 crore during the same period last year. Earnings from telecom business rose to Rs 212.19 crore from Rs 190.32 crore. Revenue from consultancy services, however, declined 46 percent to Rs 126.74 crore from Rs 235.39 crore.The company's shares closed 3.04 percent higher at Rs 266.05 on the NSE on July 31.ALSO READ: Power Grid board approves raising up to Rs 5,700 crore through bonds this fiscal  ",
    "Shares of Power Grid Corporation of India spiked nearly 2 percent on July 31 after the company was declared a successful bidder for a host of inter-state transmission system projects.At 9:29am, Power Grid Corporation was quoting Rs 261.90, up Rs 3.65, or 1.41 percent, on the BSE.The projects include transmission system for evacuation of power from REZ in Rajasthan (20GW) under Phase III Part B1. The job comprises setting up a 765/400/220 kV pooling station at Bhadla-3 and a 765 kV D/C transmission line traversing in Rajasthan and associated bay extension works.Catch all the market action on our live blogAnother project is for transmission scheme for a solar energy zone in Ananthpuram (Ananthapur) (2500 MW) and Kurnool (1,000 MW), Andhra Pradesh. It involves building a 400/220 kV pooling station at a suitable border location between Ananthpuram and Kurnool (in Andhra Pradesh) and setting up two 400 kV D/C transmission lines traversing in Andhra Pradesh and associated bay extension works.A meeting of the board of directors of the company is scheduled later today to consider the unaudited financial results of the company for the quarter ended June 30, 2023 and declaration of bonus shares subject to approval of shareholders of the companyThe board will also consider raising up to Rs 12,000 crore from domestic market through issue of secured / unsecured, non-convertible, non-cumulative/cumulative, redeemable, taxable / tax-free debentures/bonds under private placement during the financial year 2024-25 in one or more tranches.The company's board had earlier this month approved the implementation of advanced metering infra projects worth Rs 4,067.3 crore and revised investment proposal for establishment of a pilot data centre at Manesar substation at a cost of Rs 713.83 crore.Apart from this, the board approved transfer of the telecommunications business undertaking of holding company to subsidiary Power Grid Teleservices.\n       ",
    "The Nifty has recently experienced a positive breakout from a sideways pattern, which has seen as a favourable development. This breakout comes just before the Reserve Bank of India (RBI) announces its rate decision on June 8.Market participants are anticipating a dovish stance from the RBI governor, contributing to a positive sentiment in the market. Technically, support for the Nifty is positioned at 18,650, while resistance is expected around the range of 18,880-18,900.The Bank Nifty remained sideways following a positive start. The undertone of the index is still bullish, maintaining the support of 44,000 in a spot where a decent amount of Put writing was seen and resistance is still intact at 44,500.After the central bank policy, the Bank Nifty is expected to give a move on either side. Upon a decisive move 44,500, we might see strong directional upside moves.Here are three buy calls for short term:NTPC: Buy | LTP: Rs 177.35 | Stop-Loss: Rs 172 | Target: Rs 190 | Return: 7 percentThe stock has recently experienced a breakout from a wedge pattern, which is considered a bullish signal. Furthermore, it is sustaining above a critical moving average, reinforcing the positive trend.The relative strength index (RSI) is also showing a bullish crossover, suggesting increasing buying momentum. In terms of technical levels, support for the stock is positioned at Rs 172, while resistance is expected around Rs 190.Bharat Forge: Buy | LTP: Rs 808.45 | Stop-Loss: Rs 788 | Target: Rs 860 | Return: 6.4 percentThe stock has recently experienced a breakout from a double bottom pattern, which is considered a bullish signal. This breakout indicates a potential reversal of the previous downtrend. Additionally, the stock is sustaining above a critical near-term moving average, further supporting the positive outlook.The RSI is showing a bullish crossover, indicating increasing buying momentum. In terms of technical levels, support for the stock is placed at Rs 788, while resistance is expected around Rs 860.Power Grid Corporation of India: Buy | LTP: Rs 239 | Stop-Loss: Rs 234 | Target: Rs 250 | Return: 5 percentThe stock has recently experienced a breakout from a consolidation pattern, indicating a potential shift in its price trend. It is currently sustaining above a critical near-term moving average, which reinforces the positive outlook.The RSI is showing a bullish crossover, suggesting increasing buying momentum in the stock. In terms of technical levels, the support is placed at Rs 234, while resistance is expected around Rs 250.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Sharekhan's research report on Power Grid Corporation of IndiaQ4FY23 standalone PAT grew by 13% y-o-y to Rs. 4,214 crore (3% above estimate) led by higher other income and lower tax rate, which offset muted asset capitalisation. Standalone/consolidated asset capitalisation was muted at Rs. 4499 crore/Rs. 7413 crore; down 70%/64% y-o-y in FY23 and also below the management’s guidance of Rs. 10,000-12,000 crore. Overall, receivables declined sharply by 48% q-o-q to Rs. 4,821 crore as of March 2023 Subdued FY24 capex/assets guidance of Rs. 8,800 crore/Rs. 10,000-11,000 crore and management expect 7-8% PAT growth in FY24. Renewable energy (RE) projects to result in substantial pick in power transmission investment over FY25-26. Transmission bid pipeline is healthy at Rs31,000 crore and power transmission investment are estimated at Rs4 lakh crore upto 2030.OutlookWe maintain a Buy on Power Grid with an unchanged PT of Rs. 265 as valuation of 1.4x FY25E P/BV seems attractive given expectation of 10% PAT CAGR over FY23-25E, RoE of 19% and a dividend yield of ~6%.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Power Grid Corporation of India - 24 -05 - 2023 - khan ",
    "Net Sales at Rs 11,494.90 crore in March 2023 up 12.46% from Rs. 10,221.23 crore in March 2022.Quarterly Net Profit at Rs. 4,214.40 crore in March 2023 down 2.46% from Rs. 4,320.64 crore in March 2022.EBITDA stands at Rs. 10,927.87 crore in March 2023 up 13.87% from Rs. 9,596.63 crore in March 2022.Power Grid Corp EPS has decreased to Rs. 6.04 in March 2023 from Rs. 6.20 in March 2022.Power Grid Corp shares closed at 235.65 on May 18, 2023 (NSE) and has given 7.58% returns over the last 6 months and 3.22% over the last 12 months.",
    "Net Sales at Rs 12,263.72 crore in March 2023 up 14.76% from Rs. 10,686.00 crore in March 2022.Quarterly Net Profit at Rs. 4,320.43 crore in March 2023 up 3.95% from Rs. 4,156.44 crore in March 2022.EBITDA stands at Rs. 11,203.33 crore in March 2023 up 15.23% from Rs. 9,722.48 crore in March 2022.Power Grid Corp EPS has increased to Rs. 6.19 in March 2023 from Rs. 5.96 in March 2022.Power Grid Corp shares closed at 235.65 on May 18, 2023 (NSE) and has given 7.58% returns over the last 6 months and 3.22% over the last 12 months.",
    "Shares of Power Grid Corporation of India fell one percent on May 19 ahead of March quarter earnings.At 2:34 pm, the stock was quoting at Rs 233.10, down 0.93 percent with lower volumes. The scrip was trading with volumes of 212,219 shares so far today, as compared with its five day average of 644,814 shares, a decrease of 67 percent.YTD, the stock has gained 9 percent while it is up merely 2 percent in the past one year.Elara Securities expects the largest transmission utility to post higher growth on increased capacity. Even Kotak Institutional Equities sees healthy growth in revenue owing to asset capitalisation of Rs 73 billion in FY23.Catch up on all LIVE stock market updates hereConsolidated revenue is seen rising 10.4 percent YoY and 4.8 percent QoQ to Rs 11,797.2 crore while adjusted net profit could rise 12 percent YoY and 30 percent QoQ during the quarter ended March to Rs 4,311.1 crore, according to Elara Securities.Analysts would track Power Grid’s focus on new business avenues such as smart metering and capital expenditure guidance.Disclaimer: The views and investment tips expressed by experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Kunal Shah, Senior Technical & Derivative Analyst at LKP SecuritiesThe Nifty experienced a period of volatility, trading between a range of 18,211 and 11,326 before closing in positive territory on May 10. The next strong resistance level for the Nifty is expected to be in the range of 18,400 to 18,500.However, the overall trend remains positive, indicating that there is an overall upward bias in the market. Therefore, despite potential resistance levels, the market is still expected to move in an upward direction as long as it sustains above 18,200.Bank Nifty witnessed a strong recovery by the bulls after a weak start. The support level at 43,000 demonstrated a strong demand zone. Currently, there is immediate resistance at 43,500, and surpassing this level would clear the way for further gains toward 44,000.Here are three buy calls for next 2-3 weeks:GAIL India: Buy | LTP: Rs 109 | Stop-Loss: Rs 105 | Target: Rs 120-126 | Return: 16 percentGAIL has experienced significant buying interest recently. The stock has formed a symmetrical triangle pattern. The momentum indicator RSI (relative strength index) has shown a positive crossover, confirming a buy signal.The support is observed at Rs 105, and once the stock surpasses the level of Rs 111, it is expected to gain strong momentum towards targets of Rs 120 or Rs 126.Dreamfolks Services: Buy | LTP: 487.65 | Stop-Loss: Rs 450 | Target: Rs 510-525 | Return: 8 percentDreamfolks has recently experienced a breakout on the daily chart, accompanied by a significant increase in trading volumes. The stock found support at its 200-day moving average (DMA) level, which is positioned at Rs 420.The RSI momentum indicator has also shown a positive crossover, further confirming a buy signal. As a result, a \"buy on dip\" strategy is recommended for this stock.Power Grid Corporation of India: Buy | LTP: Rs 247.65 | Stop-Loss: Rs 240 | Target: Rs 260-265 | Return: 7 percentThe stock has given a consolidation breakout on the weekly chart, indicating a shift in its previous sideways movement. Additionally, the stock has been consistently trading above critical moving averages, which suggests a bullish sentiment and reinforces the possibility of further upward movement.Furthermore, the RSI has displayed a bullish crossover. The short-term trend looks positive with an upside potential of Rs 265, support on the lower end is placed at Rs 240.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "The Nifty bulls managed to hold the support of 17,700 after the gap-down opening and the index recovered fully at the end of the session on April 26. The momentum remained strong. One should keep a buy approach and expect targets of 18,000-18,200 in the near term.The monthly expiry indicates resistance at 18,000 where the highest open interest is built up on the Call side.Bulls have kept their hold on the Bank Nifty as the index ended in the green, recovering from the morning losses. In the short term, the trend remains bullish with the new range for traders being 42,500-43,000, where writers have significant build-up.On the lower end, a fall below 42,500 on Bank Nifty may trigger panic in the banking space; whereas on the higher end, a decisive rise above 43,000 may induce further rally.Here are three buy calls for next 2-3 weeks:GNFC: Buy | LTP: Rs 587 | Stop-Loss: Rs 550 | Target: Rs 625-640 | Return: 9 percentGujarat Narmada Valley Fertilizers & Chemicals (GNFC) has given a strong breakout on the daily chart with a sharp surge in volumes. The stock has broken out from a falling channel pattern which was in force for the last 2-3 months.The positive divergence was clearly visible on the daily chart which confirms the buy signal. The lower end support is at Rs 550 and the potential upside targets are Rs 625-640.Berger Paints: Buy | LTP: Rs 605 | Stop-Loss: Rs 575 | Target: Rs 625-640 | Return: 6 percentBerger Paints has given a breakout from an Inverse Head and Shoulder pattern with a rise in volume. The momentum indicator RSI has also given a positive crossover which confirms the buy signal.The MACD indicator has given a zero line crossover which confirms a double buy signal. The lower-end support is at Rs 575 and the potential upside targets are Rs 625-640.Power Grid Corporation of India: Buy | LTP: Rs 238 | Stop-Loss: Rs 232 | Target: Rs 248-253 | Return: 6 percentThe stock has moved up after consolidation on the daily timeframe. Besides, the stock has sustained above the critical moving average.The momentum indicator is in bullish crossover and rising. Over the short term, the stock is likely to remain positive. On the higher end, the stock may move up towards Rs 250, and support on the lower end is pegged at Rs 232.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "After a nine-day rally, the market closed in the red on the back of selling pressure in technology stocks, but the Bank Nifty outperformed them on April 17.The BSE Sensex fell below the psychological 60,000 mark, shedding 520 points to 59,911, while the Nifty50 lost over 120 points to 17,707 and formed a bearish candlestick pattern on the daily charts with long lower shadow but defended not only a downward sloping resistance trendline but also stayed above all key moving averages.The Nifty Midcap 100 and Smallcap 100 indices performed much better than the benchmarks, rising 0.4 percent and 0.3 percent.Stocks that we have selected for Trade Spotlight include Nestle India which was the third biggest gainer in the futures & options segment, rising 4 percent to Rs 20,244, the highest closing level since December 22 last year and formed long bullish candlestick pattern on the daily timeframe with strong volumes.Aditya Birla Capital was also in action, climbing 4.4 percent to Rs 165, the highest closing level since February 28, 2018, with trading above all key moving averages (21, 50, 100 and 200-day EMA). The stock has formed long bullish candlestick pattern on the daily scale with above average volumes.Power Grid Corporation of India shares rose over 2 percent to Rs 236.65, the highest closing level since September 15, 2022, and formed bullish candlestick pattern on the daily scale with long upper shadow indicating some profit booking at higher levels.Here's what Viraj Vyas of Ashika Stock Broking recommends investors should do with these stocks when the market resumes trading today:Aditya Birla CapitalThe stock has been consolidating time and price wise after a brilliant rally that we witnessed from June 2022 till December 2022. The stock is poised for a move towards Rs 185-190 level provided it sustains above the breakout level of Rs 160 which makes it an attractive risk-reward proposition.Power Grid Corporation of IndiaThe stock has enjoyed strong bullish momentum from October 2020 till April 2022 post which the stock corrected both time and price wise. Until last week, the stock broke above the downward sloping trendline which signalled the start of a new leg of bullish move.The stock has also broken above a 5-month consolidation zone which signifies accumulation by stronger hands and the stock is expected to move towards fresh life highs of Rs 255-260 provided it sustains above Rs 227-225 zone.Nestle IndiaPost Covid lows seen in March 2020, the stock has enjoyed significant rally till about September 2022, when the stock started to consolidate price wise.The stock on the weekly chart appears to be trading in a Ascending Triangle pattern and a breakout above Rs 20,400-20,500 will have strong bullish implications as the stock can be expected to target Rs 24,000-25,000 with crucial support coming it Rs 19,300-level.Even on the daily chart, the stock appears to have broken out of a Flag and Pole pattern which augurs well for bullish momentum.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. "
]