[
    "KR Choksey's research report on SBI Life InsuranceGross Written Premium (GWP) grew by 14.3% YoY/ 3.5% QoQ to INR 2,00,136 Mn in Q4FY23, mainly driven by 10.1% YoY/9.4% QoQ growth in renewal premium. Value of New Business (VNB) declined by 2.3% YoY/ 4.6% QoQ to INR 14.4 Bn in Q4FY23 with margins at 31.6%. Profit after Tax (PAT) stood at INR 7,769 Mn in Q4FY23, a growth of 15.6% YoY/ 157.7% QoQ. The solvency ratio as of March 31, 2023, stood at 2.15x as against the regulatory requirement of 1.50x. AUM grew by 14.9% YoY/ 2.5% QoQ to INR 3,073 Bn as of March 31, 2023. Embedded value stood at INR 460.4 Bn for FY23.OutlookWe continue to apply a 2.5x P/EV on FY25E EVPS of INR 651.8 and a VNB multiple of 13.4x to arrive at a weighted average TP of INR 1,630 per share (earlier INR 1,750) for SBI Life (50:50 weights on the P-EV and appraisal value methodology); implying a potential upside of 42.9% from the CMP. Accordingly, we maintain our rating as \"BUY\" on the shares of SBILIFE.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.SBI Life Insurance - 01 -05 - 2023 - kr ",
    "ICICI Direct's research report on SBI Life InsuranceSBI Life (SBIL) is among the most dominant players in the Indian life insurance industry with strong distribution network, parentage, operating metrics. Balanced product mix with focus on opex ratio ahead of industry • Strong parentage led distribution remains key. Premium accretion slower than expected • Gross premium growth slower at 14% YoY; NBP growth up 21%, led by tax amendment • VNB margins steady at 30.1%, aided by balanced product mix • Surplus at Rs 1942 crore; focus on cost and decline in claims led PAT growth at 16% YoY to Rs 777 crore • AUM growth decent at 16% YoY to Rs 307340 crore.OutlookWe retain our BUY rating on the stock. We broadly maintain our EV estimates for FY24-25E. We upgrade out target price for SBIL from Rs 1300 to Rs 1350, valuing the stock at 2.2x FY25E EV.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.SBI Life Insurance - 27 -04 - 2023 - icici ",
    "Motilal Oswal's research report on SBI Life InsuranceSBILIFE reported an inline 4QFY23. APE grew 10% YoY (inline), while VNB grew 23% YoY, as margins expanded 380bp QoQ to 31.6%, driven by higher growth in Non-PAR. PAT grew 16% YoY to INR7.8b (10% beat). Among segments, Annuity saw a healthy growth of 78% YoY, while Non-Par savings grew 65% YoY in 4QFY23. Growth in the Protection business was modest at 12% YoY, while the ULIP business saw a decline. We slightly lower our VNB margin estimates and expect VNB margins to remain at ~30% in FY25. We expect SBILIFE to deliver a 20% CAGR in APE over FY23-25, thus enabling a 20% VNB CAGR. RoEV is expected to hover around ~22-23%. We reiterate our BUY rating on the stock.OutlookWe estimate a 20% CAGR in APE over FY32-25 and estimate VNB margin to remain at ~30% in FY25, thus enabling a 20% VNB CAGR. RoEV is expected to stay around ~22%. We reiterate our BUY rating with a TP of INR1,500 (2.4x Sep’24E EV).For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.SBI Life Insurance - 27 -04 - 2023 - moti ",
    "On February 1, listed life insurers saw their valuations erode by more than 10 percent as the Union Budget brought in tax rules that would shave off a big part of their business growth. Investors believed that the stellar growth trajectory of the industry was now a thing of the past and so valuations should come down.Since April, though, life insurance shares have gained, in a sign that the earlier expectations of growth deceleration were overdone. Shares of the largest life insurer, Life Insurance Corporation of India (LIC), have risen nearly 1 percent. ICICI Prudential Life Insurance Company Ltd's stock has gained nearly 2 percent, while Max Financial Services Ltd has gained roughly 1 percent. HDFC Life Insurance Company Ltd and SBI Life Insurance Company Ltd have gained more than 3 percent.So, what has changed for investors to be nibbling on life insurance stocks now? The answer: another change in tax rules and a returning optimism on growth.Tax lost is tax gainedIn the budget, the government had proposed that the proceeds of insurance policies with premiums in excess of Rs 5 lakh would be taxed in the hands of the holder. Further, the centre made the new tax regime, which removes almost all exemptions, as the default tax regime from 2023-24 onwards. To be sure, shifting to the new tax regime remains optional, but the government’s intent cannot be ignored.These rules, which took effect on April 1, were seen as hurting business growth for the life insurance companies. After all, India’s life insurers relied on deep-pocketed clients who invested lumpy amounts to avail of tax exemptions.But on April 1, another tax rule change took effect. The government removed the indexation benefit on debt mutual funds by bringing all of them under the marginal tax rate. Analysts at Kotak Institutional Equities believe that some of the investment into these debt funds could now reflow into insurance policies with a smaller premium size.“Notably, income from non-linked insurance policies below Rs 0.5 million of the annual premium remain(s) tax-free; hence, we believe that some incremental flows from debt mutual funds may be directed to such policies. This will help offset the impact of the slowdown in high ticket (over Rs 0.5 million) policies,” they wrote in the April 21 note.Further, there are mitigating tactics that can help insurers bypass the tax exemption rule. “The Rs 500k annual premium limit for tax breaks on traditional (par/non-par) products is seen as relevant to a small section of potential demand, given mitigations are possible (for example, splitting the premium between spouses in the same family),” wrote Santanu Chakrabarti, an analyst at BNP Paribas India in a note.A stronger MarchListed life insurers lived up to the expectations of investors in the January-March quarter. SBI Life reported 11 percent growth in total annualised premium equivalent and profitability metrics, such as value of the new business. And its margins beat Street expectations. HDFC Life, too, reported healthy growth metrics but the acquisition of Exide Life resulted in an increase in expense ratios.That said, analysts believe that repeating growth in FY24 won’t be an easy task for life insurers.The outsized business growth in the March quarter was expected as life insurers made last-ditch efforts to sell as many large-sized policies as possible before the tax changes took effect. The 59 percent surge in the ticket size of policies for the month of March shows this last-minute dash. For HDFC Life, this rush contributed to 35 percent of premiums in March.Even so, listed life insurers exceeded market expectations of business growth for the quarter. Analysts at Morgan Stanley pointed out that the 38 percent year-on-year growth in retail weighted received premium (RWRP) for the industry and 56 percent for private life insurers were much stronger than expectations. Data from the industry regulator showed that private sector life insurers reported 53 percent business growth for March, taking the overall growth for FY23 to 24 percent, on an annualised premium equivalent basis.Further, management guidance on growth in FY24 has been optimistic amid emerging concerns over the tax rule impact. Chief executives of life insurers have asserted that tax exemptions are no longer the driving factor for life insurance policies.All this is contributing to the interest among investors in life insurance stocks.Future imperfectThe growth in FY23 may have exceeded expectations but the outlook for FY24 is still cloudy. This explains why the gains in life insurance stocks have so far been modest. Further, investors are awaiting the fourth-quarter earnings of insurers such as SBI Life, LIC and HDFC Life in the coming weeks. The results of ICICI Prulife, which released its Q4 earnings on April 20, show that investors’ assumptions on profitability and growth have been met.Meanwhile, the impact of the tax rule changes on life insurers will be fully visible only in the second half of FY24. Insurers are already putting in place mitigating measures through changes in pricing and the product mix. How much they will be able to reverse the impact on growth will be keenly monitored.Chakrabarti of BNP Paribas pointed out that current valuations reflect the concerns surrounding growth. “We continue to believe that current market prices reflect the fear of both a near-term revenue decline as well as a reduction in TAM (total addressable market),” he said.Most analysts expect insurance stocks to be under pressure in FY24 given the growth concerns. At the same time, valuations look appealing for some after the sharp post-budget erosion. Re-rating triggers, though, are slim and should be visible two quarters down.\n       ",
    "HDFC Securities' research report on SBI Life InsuranceSBILIFE’s adj. VNB came in 4% above estimates at INR15bn (+35% YoY), as VNB margin expanded 630bps QoQ to 32.9% on the back of a higher share of NPAR savings in the mix (Q4FY23: 23%). While the management remains upbeat about achieving a 20-25%YoY APE growth in FY24E, we continue to watch out for sensitivity to insurance sales from the removal of (a) tax incentives in the new tax regime and (b) tax exemption in NPAR savings with ticket size >INR0.5mn. The company's three long-term growth levers are in place: (a) SBI’s massive distribution network (26k+ branches); (b) a healthy mix of protection and NPAR; and (c) the lowest opex ratio among peers (FY23: 9.6%).OutlookWe expect SBILIFE to deliver FY23-25E APE/VNB CAGRs of 12/12% and retain BUY with a lower TP of INR1,580 (2.4x Mar-25E; rolling forward multiple adjustment and factoring in high uncertainty to FY24E estimates).For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.SBI Life Insurance - 27 -04 - 2023 - hdfc ",
    "Motilal Oswal has come out with its fourth quarter (January - March’ 23) earnings estimates for the Banking and Financial sector. The brokerage house expects SBI Life Insurance to report net profit at Rs. 707.9 crore up 5.3% year-on-year (up 132.8% quarter-on-quarter).Net Interest Income (NII) is expected to increase by 16.7 percent Y-o-Y (up 6.1 percent Q-o-Q) to Rs. 20,342 crore, according to Motilal Oswal.Pre Provision Operating Profit (PPOP) is likely to rise by 15.8% Y-o-Y (down 10.3 percent Q-o-Q) to Rs. 1,354.7 crore.Disclaimer: The views and investment tips expressed by investment experts on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Motilal_Banking & Insurance ",
    "The shares of insurance companies took a knock following Finance Minister Nirmala Sitharaman's renewed thrust for the new tax regime, where deductions are not allowed, in Budget 2023-24. The government also announced it will disallow deductions in certain cases.“(A) proposal…is to limit income tax exemption from proceeds of insurance policies with very high value,” Sitharaman said.The budget explained that where the aggregate of premium for life insurance policies (other than ULIP) issued on or after April 1, 2023 is above Rs 5 lakh, income from only those policies with an aggregate premium of up to Rs 5 lakh shall be exempt.“This will not affect the tax exemption provided to the amount received on the death of a person insured. It will also not affect insurance policies issued till March 31, 2023,” said the document.Life Insurance Corporation (LIC) fell 4 percent, SBI Life Insurance was down 7 percent, ICICI Prudential Life Insurance 6 percent, and HDFC Life Insurance was down nearly 9 percent.General Insurance was also down 6 percent and ICICI Lombard General Insurance about 0.5 percent. Star Health and Allied Insurance were up about a percent.Follow our live blog for the latest Budget 2023 updates Analysts tracking the sector said the push for the new tax regime will be detrimental to the business of insurance companies. As many taxpayers take insurance policies only to take benefit of Section 80C deduction, they will not be inclined to do so under the new tax regime.Disclaimer: The views and investment tips expressed by experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "KR Choksey's research report on SBI Life InsuranceGross Written Premium (GWP) grew by 6.5% YoY/ 16.3% QoQ to INR 1,93,319 Mn in Q3FY23, mainly driven 6.5% YoY/ 16.3% QoQ growth in renewal premium. Value of New Business (VNB) grew by 31.3% YoY/ 21.8% QoQ to INR 15.1 Bn in Q3FY23 with margins at 27.8%. The VNB margins expanded by 264 bps YoY on account of better product mix but declined by 374 bps QoQ. Profit after Tax (PAT) stood at INR 3,014 Mn in Q3FY23, a de-growth of 17.2% YoY/ 20.0% QoQ. The solvency ratio as of December 31, 2022, stood at 2.25x as against the regulatory requirement of 1.50x.OutlookWe continue to apply a 2.5x P/EV on FY25E EVPS of INR 699.9 and a VNB multiple of 12.8x to arrive at a weighted average TP of INR 1,750 per share (earlier INR 1,550) for SBI Life (50:50 weights on the P-EV and appraisal value methodology); implying a potential upside of 37.5% from the CMP. Accordingly, we maintain our rating as \"BUY\" on the shares of SBILIFE.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.SBI Life Insurance - 27 -01-2023 - kr ",
    "ICICI Direct's research report on SBI Life InsuranceSBI Life (SBIL) is among the most dominant players in the Indian life insurance industry with strong distribution network, parentage, operating metrics. Balanced product mix with focus on opex ratio ahead of industry • Strong parentage led distribution remains key catalyst.OutlookWe retain our BUY rating on the stock. Rolling to FY25E, we value SBIL at ~2.5x FY25 EV and maintain our target price at Rs 1500 per share.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.SBI Life Insurance - 23 -01-2023 - icici ",
    "Motilal Oswal's research report on SBI Life InsuranceSBILIFE reported a mixed 3QFY23. APE grew 19% YoY (7% beat), whereas VNB margins contracted 374bp QoQ to 27.8% due to higher growth in ULIP. Shareholders’ PAT declined 16% YoY to INR3.0b (29% miss). Among segments, Annuity saw a healthy growth of 17% YoY, while Non-Par savings grew 75% YoY in 3QFY23. Growth in the Protection business was modest at 10% YoY, while the ULIP business saw healthy sequential growth. We lower our VNB margin estimates by 160-170bp for FY23-25 and expect VNB margins to remain at ~30% in FY25. We expect SBILIFE to deliver a 25% CAGR in APE over FY22-25, thus enabling a 32% VNB CAGR. RoEV is expected to stay around ~20-22%. Maintain Buy.OutlookWe maintain our Buy rating with a TP of INR1,570 (2.5x Sep’24E EV).For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.SBI Life Insurance - 23 -01-2023 - moti ",
    "HDFC Securities' research report on SBI Life InsuranceSBILIFE’s adj. VNB came in 3% below the estimate at INR14.5bn (+19% YoY), as VNB margin moderated 483bps QoQ to 26.6% on the back of a higher share of ULIPs in the mix (65%). While the management continues to remain upbeat about growth in the NPAR savings business (+3% QoQ), we continue to watch out for stronger sequential trends. The company's three growth levers stay in place: (1) SBI’s massive distribution network (24k+ branches); (2) a healthy mix of protection and NPAR; and (3) the lowest opex ratio among peers (9MFY23: 9.7%).OutlookWe expect SBILIFE to deliver a healthy FY22-25E APE/VNB CAGR of 17/22% and retain BUY with an unchanged TP of INR1,850 (3x Sep-24E).For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.SBI Life Insurance - 23 -01-2023 - hdfc ",
    "Private sector SBI Life Insurance on Saturday reported more than 16 per cent decline in net profit at Rs 304 crore in the third quarter ended December 2022.The insurer's profit stood at Rs 364 crore in the same quarter of the previous fiscal, SBI Life said in a regulatory filing.Total income increased to Rs 26,626.71 crore in the latest December quarter from Rs 20,458.31 crore in October-December 2021.The company's solvency ratio too improved to 225 per cent from 209 per cent as on December 31, 2021. The regulatory requirement is 150 per cent.The asset under management (AUM) grew by 17 per cent from Rs 2,56,870 crore as on December 31, 2021 to Rs 2,99,990 crore as on December 31, 2022 with debt-equity mix of 71:29, it said.For the nine months period ended December, the life insurer posted a profit Rs 940 crore as against Rs 830 crore in the same period a year ago.\n       ",
    "Motilal Oswal's research report on SBI Life InsuranceSBILIFE has delivered a robust NBP growth of 26% in FY23YTD, outperforming the leading private players. We estimate SBILIFE to deliver an APE CAGR of 26% over FY22-24, the highest in our LI coverage universe. The company’s premium mix has improved with the share of annuity and protection in total NBP increasing 900bp over the last three years, while the mix of ULIP/PAR has reduced. We estimate the product mix to improve further, thus keeping margins resilient. A strong agency channel in bancassurance provides SBILIFE a distinct competitive advantage in the distribution of its insurance products. Improving productivity of both these channels reinforces our faith in the long-term growth prospects of the company. -We estimate VNB to register a CAGR of 38% over FY22-24, while margins to expand to 31.4%. We expect VNB contribution to Operating RoEV to improve to 15% in FY24 from 9% in FY20, thus driving RoEV to 22% in FY24E.OutlookSBILIFE is among our preferred picks in the life insurance space and we reiterate our BUY rating on the stock with a TP of INR1,600 (2.5x Sep’24E EV).For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.SBI Life Insurance - 14 -12-2022 - moti ",
    "Highlights",
    "KR Choksey's research report on SBI Life InsuranceGross Written Premium (GWP) grew by 12.9% YoY/ 46.5% QoQ to INR 1,66,211 Mn in Q2FY23, mainly driven 17.3% YoY/ 58.5% QoQ growth in renewal premium. Value of New Business (VNB) grew by 24.0% YoY/ 40.9% QoQ to INR 12.4 Bn in Q2FY23 with margins at 31.6%. The VNB margins expanded by 643 bps YoY/ 121 bps QoQ. Profit after Tax (PAT) was at INR 3,767 Mn in Q2FY23, a growth of 52.8% YoY/ 43.3% QoQ. The solvency ratio as of September 30, 2022, stood at 2.19x (improvement of 700 bps YoY) as against the regulatory requirement of 1.50x. The company’s net worth increased by 11.9% from INR 122.1 Bn.OutlookWe continue to apply a 2.7x P/EV on FY24E EVPS of INR 574.3 and a VNB multiple of 15x to arrive at a weighted average TP of INR 1,550 per share (unchanged) for SBI Life (50:50 weights on the P-EV and appraisal value methodology); implying a potential upside of 23.5% from the CMP. Accordingly, we maintain our rating as \"BUY\" on the shares of SBILIFE.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.SBI Life Insurance - 271022 - kr ",
    "ICICI Direct's research report on SBI Life InsuranceSBI Life (SBIL) is among the most dominant players in the Indian life insurance industry with strong distribution network, parentage, operating metrics. Balanced product mix with focus on opex ratio ahead of industry • Strong parentage led distribution remains key catalyst.OutlookWe retain our BUY rating on the stock. We continue to value SBIL at ~2.8x FY24 EV and maintain our target price at Rs 1500 per share.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.SBI Life Insurance - 251022 - icici ",
    "Motilal Oswal's research report on SBI Life InsuranceSBI Life Insurance (SBILIFE) posted a mixed 2QFY23 with APE clocking a 1% YoY decline (5% miss). However, VNB grew 24% YoY (4% beat) led by ~640bp YoY margin expansion to 31.6%. Shareholders’ PAT grew 53% YoY to INR3.8b. Among segments, Annuity surged 86% YoY while Non-Par savings grew 121% YoY in 2QFY23. Growth in Protection business was modest at 10% YoY; however, along with ULIP business it saw a healthy sequential growth. We increase our VNB margin estimate for FY23 marginally and raise the same by ~240bp for FY24E to 32.1%. We also raise our VNB estimate by 7% for FY24. We expect SBILIFE to deliver 26% CAGR in APE over FY22-24, thus enabling 40% VNB CAGR while RoEV to sustain at ~22%. SBILIFE remains our preferred pick in the Life Insurance space.OutlookWe maintain our BUY rating with an unchanged TP of INR1,500 (premised on 2.6x FY24E EV).For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.SBI Life Insurance - 231022 - moti ",
    "Analyst optimism lingered mostly around banks and financials as of September-end as credit growth peaked at as high as 16 percent and the condition of the Indian economy improved post-pandemic.Data available with Bloomberg showed that most of the analyst optimism – measured as the percentage of analysts that have a ‘buy’ call on a stock – was centered around ICICI Bank, Larsen & Toubro (L&T), and ITC among others.ICICI Bank, which is one of the best performing bank stocks right now, has 52 ‘buy’ calls and just one ‘hold’ call, translating into an optimism score of 98 percent. The company has been delivering expectation-beating earnings for a while now and has become the apple of analysts’ eye. Analysts have praised its top-of-the-class net interest margins and investments into technology that is reaping rewards now.L&T also has an optimism score of 98 percent with 40 ‘buy’ calls and a solitary ‘sell’ call. The stock is regarded as the best play on the infrastructure boom in India. The company is building some of the most important projects in the country including the Mumbai-Ahmedabad Bullet Train project. It also has maintained its run rate of fresh orders resulting in revenue visibility, analysts underline.Cigarette maker ITC is also one of analysts' top favourites with an optimism score of 97 percent. As many as 35 analysts are bullish on the stock with one analyst with a ‘hold’ call. The stock is also one of the best blue-chip performers of the current calendar year with returns of 51 percent.Housing Development Finance Corporation (HDFC) and State Bank of India (SBI) are two more stocks in the financial space that have the same optimism score – 96 percent. HDFC – the largest mortgage lender in India – is in process of merging with HDFC Bank which analystsbelieve will be value accretive. Hence, the stock has also attracted investors. Meanwhile, SBI which is the largest bank in the country is riding on a high credit growth phase and relatively cheaper valuations.Two top life insurers – SBI Life Insurance and HDFC Life Insurance – are the next two stocks where optimism is high. Insurance penetration in India remains very low and it is likely to go up as awareness increases. Analysts are banking on this trend and are bullish on these stocks.Sun Pharmaceutical Industries, UPL, and NTPC are others in the top 10 where analysts are most bullish. Analysts believe Sun Pharma is likely to gain from ramping up sales in the US. It will also benefit from rupee depreciation. NTPC is investing heavily in new energy which will become another source of revenue for the firm and hence grabbed attention.IT, metals continue to face flakFor another month, metals and IT sectors remained the pockets where analysts were not as bullish. JSW Steel, Wipro and Shree Cement were among the top stocks where the pessimism score was the highest. Pessimism score refers to the percentage of analysts that are not bullish on a stock.JSW Steel, which is a victim of rich valuation and declining metal prices, has 17 ‘sell’ calls and 9 ‘hold’ calls compared to 7 ‘buy’ calls. The steelmaker is also likely to face a slowdown in export sales as western countries will be under recessionary pressure that will lead to fall in demand.Wipro, along with Tata Consultancy Services (TCS) and HCL Technologies, are IT stocks that are part of this list. IT companies, being export-facing, are also bearing the brunt of the slowdown in Europe and the US. Any recessionary phase leads to lesser tech spending and hence analysts have cut down their expectations.Besides them, FMCG majors Britannia Industries and Nestle India are others that are seeing a concentration of pessimism. Both companies have been struggling with a slowdown in demand in rural India, which is likely to become even more challenging as kharif sowing has been lower than expectations. That means rural income is likely to be lower going ahead. Rich valuations of both stocks is also playing spoilsport for them.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "ICICI Direct's research report on SBI Life InsuranceSBI Life (SBIL) is among most dominant players in the Indian life insurance industry with strong distribution network, parentage, operating metrics. Balanced product mix with focus on opex ratio ahead of industry • Strong parentage led distribution remains key catalyst.OutlookWe retain our BUY rating on the stock. We value SBIL at ~2.7xFY24 EV still lower than HDFC Life and revise our target price from Rs 1400 to Rs1500 per share.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.SBI Life Insurance - 290722 - ic ",
    "Motilal Oswal's research report on SBI Life InsuranceSBILIFE reported a robust 1QFY23 with APE growth of 80% YoY (7% beat) and a sharp jump of 132% YoY in VNB (28% beat). VNB margin spiked 665bp YoY to 30.4% while shareholders’ PAT grew 18% YoY to INR2.6b. Strong momentum in APE was reflected across all product segments. However, non-par savings stole the limelight in 1QFY23 with a massive growth of 645% YoY. It now forms 28% of business in APE terms. The growth was aided by a strong response to the newly launched product ‘Smart Annuity Plus’ in Mar’22. The notable improvement in VNB margin was primarily driven by a shift in underlying product mix with a larger share of high-margin products such as non-par savings and protection. Together, they constituted 39% of APE in 1QFY23 v/s 20%, a year ago. Retail protection APE growth of 54% YoY to INR2b is commendable, considering the muted performance of private peers. We raise our VNB margin estimates by 340bp and 270bp for FY23 and FY24 to 30.1% and 29.7%, respectively, and raise VNB estimate by 19% each over FY23/24. We expect SBILIFE to deliver 27% CAGR in APE over FY22-24, thus enabling 36% VNB CAGR, while RoEV sustains at ~22%. SBILIFE remains our preferred pick in the Life Insurance space. Maintain BUY.OutlookWe retain our BUY rating with a revised TP of INR1,500 (based on 2.6x FY24E EV).For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.SBI Life Insurance - 290722 - moti ",
    "Private life insurance companies finished FY22 on a positive note even as business in the first half of the year was dented by the second wave of the pandemic and a surge in death claims. The revival in growth and the expansion in margins underlined the performance of the listed private players.(image) In the last few years, the industry has focused on pure protection products (term assurance) that provide cover against mortality risk, and the annuity/savings segment,",
    "The Paschim Banga Gramin Bank has joined hands with SBI Life Insurance for a bancassurance pact, officials said on June 30.The partnership will see all the branches of Paschim Banga Gramin Bank across West Bengal offer SBI Life’s range of protection, wealth creation, credit life, annuity and savings products, thereby increasing accessibility of life insurance solutions in the region, they said.The agreement was signed by Arun Kumar Patra, General Manager of Paschim Banga Gramin Bank and Jayant Pandey, Regional Director of SBI Life.Bancassurance is an arrangement between a bank and an insurance company, as a part of which the latter can sell its products to the lender’s customers.\n       ",
    "India’s insurance whale, Life Insurance Corporation of India (LIC) will list today amid volatile equity markets. The initial public offer (IPO) of LIC fetched Rs 21,000 crore for the government at a price of Rs 949 per share.While the IPO size itself has been pruned from the initially expected amount, the issue witnessed robust demand, reflected in the large oversubscription from all categories of investors. To that extent, LIC has managed to keep the sentiment of investors buoyant amid discomforting market dynamics. Its listing comes at the backdrop of roughly 8 percent fall in benchmark equity indices over the past one month. Rising inflation and the specter of policy rate hikes have triggered concerns over corporate profitability and dampened market sentiment.Also read: LIC listing today: What should investors do with the stock after it debuts on bourses?Listing gains are more a function of broad market sentiment and conditions and not just the share issuing company’s business fundamentals alone. LIC’s listing, if tepid, need not dismay its investors. As the country’s largest life insurer is poised to list, it pays to look at the performance of its private sector rivals:ICICI Prudential Life Insurance CompanyListed private sector life insurance companies have had their soft periods after their IPOs. Among them, ICICI Prudential Life Insurance Company was the first to list in 2016. Recall that the life insurer’s shares listed at 11 percent discount to its issue price of Rs 334 per share. On the day of its listing, benchmark equity indices were under pressure. It took the company’s shares more than three months to reach its issue price.Beyond the listing day, the shares have seen episodes of underperformance versus the broader market which was largely driven by the company underlying business performance. As such, the company’s shares were under pressure owing to the pandemic.Be that as it may, more than five years since listing, ICICI Prulife’s shares are now 58 percent above the issue price. An improvement in business grwoth metrics have played a big part in generating returns for its investors.SBI Life Insurance CompanyThe largest private sector life insurer offered its shares to the public for the first time in October 2017 through an IPO. Amid strong market conditions, SBI Life’s shares listed at 5 percent premium on October 3, 2017. Since then, the shares have followed a robust trajectory, mostly helped by the company’s strong performance. SBI Life’s shares have been more volatile than its other peers, in part reflecting the volatility in its business performance as well. After a brief period of underperformance versus broad market in 2019, shares notched up sharp gains. Since the pandemic, SBI Life shares have given investors better gains than other listed peers. Investors in its IPO are sitting on 52 percent gain as of today.HDFC Life Insurance CompanyHDFC Life is the most valuable private sector insurance company and its business performance gave enough reasons for investors to cheer. The company launched an IPO weeks after rival SBI Life concluded its own. HDFC Life notched up 7 percent premium over its issue price on listing day. Its IPO investors are richer by 89 percent today. Much of this has been due to the life insurer’s superior profitability metrics. Its value of new business and new business margins have consistently been above that of rivals. Even during lean times post the pandemic, HDFC Life’s profitability metrics have been resilient. That said, its valuations have come under pressure partly due to anticipated regulatory limitations that may arise from the proposed HDFC and HDFC Bank merger. Further, the company saw a sharp rise in death claims due to the pandemic which dampened its earnings outlook somewhat.LIC’s peers have had varied listing experiences, depending on the market conditions at that time. However, beyond the listing day the performance of the stock has closely followed that of the business. This is evident from ICICI Prulife’s lackluster performance as business growth became a brief casualty of changed priorities. SBI Life’s stock witnessed a period of pressure when the company failed to meet market expectations on business growth and HDFC Life disappointed investors after the pandemic took off some of its profitability shine.To ensure returns to its investors beyond the ultra short term, LIC just needs to demonstrate an improvement in its business metrics. It should start with arresting the market share loss the insurance behemoth has witnessed over the past decade.\n       "
]