[
    "Mining conglomerate Vedanta Limited has received approvals from the majority of its creditors for a proposed demerger of businesses, marking an important step in the company's plan to split into six independent listed companies.\"I am happy to let all of you know that we have received the 52 per cent plus the additional percentage, which is required for us to reach 75 per cent. We have crossed that threshold as well. Most of the lenders have approved it,\" a senior Vedanta executive said in a recent bondholder conference call.The transcript of the call was reviewed by PTI.\"Some are pending for their committee meeting and some are pending for their board meeting. So, as we speak, we have already received 52 percent. The balance requirement will be met in a week or 10 days' time. And thereafter, we will file the application with the NCLT,\" he added.A major creditor – State Bank of India – had already granted its consent earlier, according to a banker aware of the development. This crucial approval is seen as the last major compliance requirement for the company, which was keenly watched by the market, and paves the way for the USD 20 billion demerger.The green light by the majority of the creditors comes at a time when Vedanta has shown significant progress in deleveraging. As of March 31, the company's net debt reduced by Rs 6,155 crore from December 2023, reaching Rs 56,388 crore, primarily driven by strong cash flows from operations and working capital release.Taking note, credit rating agencies have assigned stronger credit ratings to the company and its debt instruments.Icra assigned an A1+ rating to Vedanta's Rs 2,500 crore commercial paper on May 30. It granted the company a long-term rating of ICRA AA- and a short-term rating of Icra A1+ earlier in May. Similarly, Crisil and India Ratings have assigned long-term ratings of AA- and A+, and short-term ratings of A1+ and A1 on Vedanta, respectively.Vedanta's lenders include state-owned lenders like State Bank of India, Bank of Baroda, Punjab National Bank, Canara Bank, Indian Overseas Bank, Union Bank of India and Bank of Maharashtra. Private sector banks – Yes Bank, ICICI Bank, Axis Bank, IDFC First Bank, and Kotak Mahindra Bank are also part of Vedanta's consortium of lenders.The demerger will create independent companies housing the aluminium, oil & gas, power, steel and ferrous materials, and base metals businesses, while the existing zinc and new incubated businesses will remain under Vedanta Limited.\n       ",
    "Muthoot Microfin on Thursday said it has entered into a strategic co-lending partnership with the State Bank of India (SBI).Under the agreement, Muthoot Microfin and SBI will co-lend to members of Joint Liability Groups (JLGs) who are engaged in agricultural and allied activities as well as other income-generating enterprises. The loan amounts will range from a minimum of Rs 10,000 to a maximum of Rs 3 lakh.With this collaboration, Muthoot Microfin Limited aims to extend its financial services to women entrepreneurs in rural and semi-urban regions across India, the Kochi-headquartered microfinance firm said in a statement.\"With this partnership, we will be able to offer wide range of products and services to our clients, most importantly it will help us in meeting the growing demand of our women entrepreneur clients in a cost-effective manner,\" Muthoot Microfin CEO Sadaf Sayeed said.Under the co-lending model, banks are permitted to co-lend with all registered NBFCs (including HFCs) on the basis of a prior agreement.\n       ",
    "State-run lender State Bank of India has become the seventh Indian listed company to have surpassed Rs 8 lakh crore market capitalisation.The shares of SBI hit a fresh record high of Rs 900.15 on BSE on June 3, rising as much as 8.3 percent in morning trade, its best day since September 2021. The share prices have soared over 40 percent so far this year.The Rs 8 Trillion ClubPreviously, Reliance Industries, Tata Consultancy Services, HDFC Bank, Bharti Airtel, Infosys, and ICICI Bank have all attained this milestone.Exit Poll CheerShares of SBI are rising along with other PSU stocks after exit polls on June 1 indicated a landslide victory for the BJP-led NDA. Most exit polls projected Prime Minister Modi’s government to secure over 350 Lok Sabha seats, surpassing many brokerage's bullish market scenarios. Stocks riding the wave of government's growth plans, like those in capital expenditure or public sector units, have surged over the past year and are expected to continue rising, according to market experts.Track Moneycontol's election coverage right here.Analysts at Nomura predict that sustained focus on capital expenditure and fiscal consolidation could lead domestic sectors - especially infrastructure and manufacturing - to outperform in the near future.Track SBI FY24 earnings right here\"Healthy business growth despite size along with stable margins and asset quality likely to provide further potential for improved performance. We expect stable NIM at 3% and RoA/RoE of 1.1%/17% by FY26. We broadly maintain our growth estimate due to strong performances across segments\", BoB Cap said in its latest note on State Bank of India.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "The country’s largest lender, the State Bank of India (SBI), has asked its employees to seek permission before opening demat or trading accounts with service providers outside the group.A breach of the instruction would be treated as gross misconduct and punishable, an internal circular, dated May 27, has said. Moneycontrol has reviewed a copy of the circular. “No officer/award staff shall open their or their wholly dependent family member’s demat account and or trading account outside the State Bank Group without prior permission of his / her controller not below rank of Chief General Manager,” the circular says.The SBI Group includes companies in the larger financial sector such as SBI Cards, SBI Life, SBI General Insurance, SBI Funds Management and SBI Pension Funds. SBI Securities is the broking arm of the group. “Breach of these instructions shall be treated as a misconduct punishable amongst others under Rule No. 50(1), 50(4), 50 (11) read with Rule 66 of SBIOSR for officers,” the circular says.A demat is an online portfolio that makes the process of holding investments such as shares, bonds, mutual funds and ETFs easier, doing away with the physical handling and trading paper shares and other documents.SBI is yet to respond to Moneycontrol’s emailed queries.The bank has also asked the employees to submit their details and those of their “dependent” family members’ demat account statements to their controllers for verification.The staff must also obtain de facto permission from their controllers within six months from the date of issue of the instructions or close such accounts during the period.And legal experts highlighted that a company cannot impose on its employees to use the services of the employer group. \"Banks and companies may issue caution to employees for trading as it is done during the normal working hours. Since they also have policies under which employees have to make declaration about their investments, they cannot prohibit using services outside their company or group,\" said Mukesh Chand, Senior Legal Counsel · Economic Laws Practice (ELP).Demat account boomIndia had 151 million demat accounts at the end of the financial year 2023-24, data analysed by brokerage Motilal Oswal shows. As many as 3.1 million new accounts were added in March alone. “This trend seems to be continuing throughout the year, with an average of 3.1 million new accounts opened each month in the financial year 2024 (FY24),” Motilal Oswal said.Groww emerged as the largest broker, with a market share of 23.4 percent, handling an active client base of 9.5 million in FY24, Motilal Oswal said in another report, citing National Stock Exchange (NSE) data.The broker recorded a 77.5 percent jump in the active client base in FY24 and a 42 percent overall jump in the market share. Next in line is Zerodha, which recorded a 14 percent jump in the number of active clients touching 7.3 million. The Bengaluru-based brokerage firm’s market share, however, slipped to 17.9 percent at the end of FY24 from 19.6 percent in the previous year. ",
    "FSIB -- the headhunter for directors of state-owned banks and financial institutions -- in an unexpected move has deferred the scheduled interview to select a suitable candidate for the post of SBI chairman.The last-minute postponement comes hours before the scheduled interview, sources said.The exact reasons for postponement could not be ascertained immediately.However, sources said, the new date for the interview will be decided after the formation of the new government after June 4.The Financial Services Institutions Bureau (FSIB) will schedule the interview well in advance to select a replacement for Dinesh Khara, who will be superannuating on August 28, when he turns 63, the upper age limit for the position of SBI Chairman.As per the convention, the chairman is appointed from a pool of serving managing directors of SBI. FSIB will recommend the name and the final decision would be taken by the Appointments Committee of the Cabinet headed by Prime Minister Narendra Modi.FSIB is headed by Bhanu Pratap Sharma, former secretary of Department of Personnel and Training (DoPT).The members of the government-appointed selection panel are Financial Services Secretary, Department of Public Enterprises Secretary and an RBI Deputy Governor.Other members of the headhunter are Animesh Chauhan, former chairman and MD of erstwhile Oriental Bank of Commerce, RBI's ex-executive director Deepak Singhal, and Shailendra Bhandari, former MD of erstwhile ING Vysya Bank.\n       ",
    "Top PSU lender State Bank of India (SBI) has revised the interest rates it offers on retail term deposits of up to Rs 2 crore, with effect from May 15.Deposits with tenor of 211 days to less than a year will now offer 6.25 percent interest as against 6 percent earlier, while for senior citizens this has been raised higher to 6.75 percent.Revision in Interest Rates on Retail Domestic Term Deposits (Below Rs. 2 crore) w.e.f. 15.05.2024 (Source: SBI website)This is being updated. ",
    "Check the brokerage calls and comments on the stocks in action. Today we cover the State Bank of India, SRF, BPCL, and others following their Q4 results.State Bank of IndiaKotak Instl Eq On SBIBuy Call, Target Raised To `950/ShReported 25% YoY Earnings Growth Led By Operating Profit Growth & Decline In ProvisionsSteady Loan Growth Stable NIM & Solid Asset Quality Metrics Were Key HighlightsMacro Environment Continues To Be Fairly Stable For LendersShould See Relatively Stable Performance From SBISBI Top Pick, Don’t See A Sharp Outperformance From Current LevelsCiti On SBISell Call, Target Raised To `701/ShQ4 PAT Boosted By Few One-offsQ4 Wage Revision Impact Est & Guided At `54,000 Cr Came In Significantly LowerAt Core Level, Spike In Non-Interest Income & Contained Opex Led To PPoP BeatI-T Refund Interest `1,300 Cr Supported NII BeatCredit Growth Was Robust At 5% QoQ With Gained Traction In Corp, Besides RetailBernstein On SBIMarket Perform, Target `780/ShA High RoA & Multiple SurprisesMulti-quarter High RoA Of 1.36% As Key Highlight, Helping Drive Full Year RoA >1%Rise In NOI Gains & Continuation Of Low Credit Costs Helped Report PAT GrowthNIM Improved Sequentially By 8 bpsIncrease In Yield On Advances Outpacing Rise In Cost Of DepositsHSBC On SBIHold Call, Target Raised To `900/ShNIM Improvement Was Led By LDROpex Was Lower Than Guidance, Led By Reversals In Pension ProvisionsRevise EPS By 8.1/12.2/8.6% For FY25e/26e/27eUpgrade NIM Outlook & Lower Cost Ratio EstStock Already Trading At Premium MultiplesJefferies On SBIBuy Call, Target `810/ShReported Profit Much Higher Than EstWhile NII Growth Of 3% Was A Tad HigherMajority Of Beat Is Led By Lower Staff Costs, Higher Treasury GainsSome Of These Tailwinds May Not Be Recurring In NatureLoan Growth Stays Around 15-16% Mark; Deposits Rose By 11% YoYSlippages Remain Low & Gross/Net NPLs Are Down MarginallyIncred On SBIAdd Call, Target `1,000/ShPosted Superior Q4 PAT, Despite In-Line Operating PerformanceNIM Expanded By 8 bps QoQ As SBI Enjoys Ample LiquidityLDR AT 75% Providing Lending Dominance At Competitive Pricing Across SegmentsConsistent Delivery Of +1% RoA/+16% RoE To Command A Valuation PremiumSRFKotak Instl Eq On SRFDowngrade To Add, Target Cut To `2,360/ShQ4 Did Improve Significantly QoQ, But Lagged ExpectationsTimeline For A Strong Recovery Is Also Pushed Back Amid Intense China CompetitionCut FY2025-26 EPS By 14-18% As Tone Down Expectations, Particularly On Margin FrontJefferies On SRFUnderperform Call, Target `2,085/ShMgmt Provided An Optimistic Growth Guidance For Chemicals  Despite A Miss In FY24Refgas Biz Outlook Is Challenged By Lower Exports To The USSee Chinese Competition In RoWMgmt Expects Soft PF Margin In FY25Cut FY24/25 PAT Est By 6%/3%Valn Doesn't Adequately Discount The Protracted Downcycle In Key Chemicals SegmentMS On SRFOverweight Call, Target `2,555/ShSRF Addressed Concerns Around Demand & Margins In Its VerticalsCo Pointed To A Gradual Improvement Over Course Of FY25Ops Leverage From Previous InvestmentsGradual Greenshoots In Pricing Will Be Key To Support 20% Growth In Its Chem SegmentMOSL On SRFNeutral, Target `2,100/ShChemical Business Expected To Witness 20% Growth In FY25Significant Growth Expected In H2FY25Positive Operating Leverage Can Lead To Margin Expansion In FY25Expects Packaging Business Margin To Remain Under PressureManagement Plans To Incur A Total Capex Of`2,200 Cr In FY25BPCLCiti on BPCLBuy Call, Target `760Reported A Refining-Led Miss In Q4, With QoQ Recovery In EBITDAPre-tax Profit Was Correspondingly 20% Below EstimatesNet Income Was 39% Below Due To `1,800  Cr Impairment Of Investment In ArmFull Year FY24 EPS Was, Nonetheless, Very Strong At `125/ShMarch 2024 BVPS Stood At `350/Sh & FY24 RoE Was 42%Asian PaintsCiti On Asian PaintsSell Call, Target `2,600/ShPrice Cut (2.4% In Q4) Bundled With Downtrading Led To Revenue Decline YoYWhile GM Improved By 120 Bps YoY, EBITDA/PBT Declined By 9%/7% YoYEBITDA/PBT Decline Led By Higher Investment In Brand/MarketingPAT Flat YoY Due To Lower TaxMgmt Expects Double-digit Volume Growth & 18- 20% EBITDA Margin In FY25Punjab National BankMS On PNBUnderweight Call, Target `70/ShCore PPoP Missed Est Owing To Higher Employee Related ProvisionsAsset Quality Was Steady And Coverage ImprovedCET 1 Ratio Increased QoQUnderweight On Expensive ValuationsTata PowerHSBC On Tata PowerDowngrade To Reduce, Target Raised To `300/ShReported Earnings Missed Consensus EstExceptional Other Income Supported ProfitabilityBelieve Future Earnings Growth Is Dependent On Government ApprovalsFuture Earnings Growth Dependent On Competitive Intensity & Coal PricesUBLBoFA Sec On UBLDowngrade To Underperform, Target Cut To `1,850/ShTrim Earnings Est By 2-7%Stock Rally/Current Valuation Capture Near-/Mid Term UpsideExpected Earnings Recovery Could Be Protracted Amidst A Volatile Business EnvironmentNeed To Keep Investments ElevatedBase Case Of Low Double-digit/Teens EBITDA Margin Over FY25-27 EstKajaria CementsHSBC On KajariaBuy Call, Target `1,450/ShFY24 Was A Year Of Margin Recovery Despite Soft Volumes.Expect Better Volume Growth In FY25 With New CapacitiesThree-year plan unveiled, suggesting penetration led by double-digit tile growthMahindra & Mahindra Financial ServicesGS On M&M FinDowngrade To Sell, Target Cut To `233 From `269/ShDowngrade On Back Of Elevated Credit Costs Given Low ECL CoveragePCR On Stage 3 At An Average Of 63% Which Is LowSee Higher Cost To Income Ratio At 43.5% Vs SHMF At 27.7%Loan Growth Has Moderated From 25% In FY24 To 17%/15% In FY25/FY26Cut Earnings By 9%/7% On A/C Of Higher Operating ExpensesCut Earnings Est On Lower Disbursal Growth & Marginally Higher Credit CostsLower-than-guided-RoA Of 2.2% In FY25Expect Co To Deliver Avg RoAs Of 1.8% Over FY25-FY26Believe Would Likely De-Rate Further To 11.6x FY25 EPS/1.3x FY25 BVPSMS On CyientOverweight Call, Target `2,250/ShMgmt Cautious, Pragmatic Approach To Back-Ended Guidance For FY25Mgmt Confidence In Margin Performance In FY25 Regardless Of Quarterly VariationsConsideration Of Tuck-In Acquisitions For White SpacesGrowing Captives, A Sign Of Market OpeningOil Marketing CompaniesMS On OMCsIndian Fuel Refiners Reported Good Quarterly EarningsMore Importantly, FY24 Earnings Highlights Structural Shift To Higher ProfitabilityRefinery Hardware Investments Are FructifyingBPCL Had Best Outperformance In Margin, While HPCL Gained Fuel Market Share\n       ",
    "State Bank of India (SBI), country’s largest lender, is in the process of hiring around 12,000 employees for information technology (IT) and other roles, Chairman Dinesh Khara said on May 9. These new employees, Khara said, will be given some exposure around banking and some of them would be later shifted to IT and other associate roles.“Around 11,000 to 12,000 employees are in the hiring process. These are general employees, but we actually are having a system where at our associate level and officers' level around 85 percent of them are engineers. We give them some exposure to understand banking and thereafter we start channelising them into various associate roles and some of them will be channelized in IT,” Khara said.Also read: SBI Q4 net profit rises 24% to Rs 20,698 cr, GNPA lowest in 10 yearsFor the financial year ended March 2024, the bank had a total employee count of 2,32,296, falling from 2,35,858 in FY23.Khara also said that the bank is also specifically looking at hiring new employees for technology skills. “Of late, we have started hiring for technology skills,” Khara said.Q4 numbersThe bank on May 9 reported 24 percent rise in net profit at Rs 20,698 crore for the quarter ended March 31, 2024, aided by strong loan demand. SBI reported net profit of Rs 16,695 crore in the year-ago period. The profit surpassed estimates of Rs 13,400 crore by analysts.SBI's interest earned grew 19 percent to Rs 1.11 lakh crore in the reported quarter as against Rs 92,951 crore a year ago.The bank's asset quality improved in the March quarter. The gross non-performing asset (GNPA) of SBI came in at 2.24 percent as against 2.78 percent last year, while net NPA came in at 0.57 percent compared to 0.67 percent last year. At the post results press conference, Dinesh Khara, Chairman, SBI, said that the GNPA is the lowest in 10 years at 2.24 percent.In Q4FY24, total income rose to Rs 1.28 lakh crore from Rs 1.06 lakh crore in the year-ago period, while operating expenses grew at a relatively slower rate at Rs 30,276 crore from the year-ago period's Rs 29,732 crore.The overall provisions nearly halved to Rs 1,609 crore from Rs 3,315 crore in the year-ago period.\n       ",
    "State Bank of India (SBI), the country’s largest lender, on May 9 reported 24 percent rise in net profit at Rs 20,698 crore for the quarter ended March 31, 2024, aided by strong loan demand. SBI reported net profit of Rs 16,695 crore in the year-ago period.The profit surpassed estimates of Rs 13,400 crore by analysts.SBI's interest earned grew 19 percent to Rs 1.11 lakh crore in the reported quarter as against Rs 92,951 crore a year ago.The public lender declared dividend of Rs 13.7o per share for FY24. The share of the bank closed for trading on May 9 at Rs ,819.65, up 1.14 percent.The bank's asset quality improved in March quarter. The gross non-performing asset (GNPA) of SBI came in at 2.24 percent as against 2.78 percent last year, while net NPA came in at 0.57 percent compared to 0.67 percent last year. At the post results press conference, Dinesh Khara, Chairman, SBI, said that the GNPA is the lowest in 10 years at 2.24 percent.SBI loan growth remained strong in the March quarter, and it clocked one of the best growth in over eight quarters. Here, Khara said: \"Credit growth has been robust across all segments. RAM crossed Rs 20 trillion in FY24, Corporate segment healthy growth at 16 percent year on year growth.\" In FY25, Khara said that the lender would be able to sustain a similar credit growth. \"We will be able to maintain a credit growth trajectory of 15-16 percent that we had in FY24. Deposit growth would be around 13-14 percent,\" said Khara.\"Credit growth is at 15.24 percent YoY with domestic advances growing by 16.26 percent YoY. Corporate advances and agri advances cross Rs 11 lakh crore and Rs 3 lakh crore, respectively,\" said SBI in a stock exchange filing.The bank also saw an impressive 36-quarter low in terms of ratio between gross and net NPAs.In Q4FY24, total income rose to Rs 1.28 lakh crore from Rs 1.06 lakh crore in the year-ago period, while operating expenses grew at a relatively slower rate at Rs 30,276 crore from the year-ago period's Rs 29,732 crore.The overall provisions nearly halved to Rs 1,609 crore from Rs 3,315 crore in the year-ago period.On the Reserve Bank of India's draft for provisioning against infra projects, Khara said: \"Incremental provisions will not be significant. We will be able to absorb and if this becomes a reality, we will be looking at repricing the loan.\"\n       ",
    "Real estate developer TCG Real Estate has secured a funding of Rs 714 crore from State Bank of India (SBI) for its World Trade Centre project in Gurugram, according to documents accessed by CRE Matrix, a real estate data analytics firm.The company is developing a business park ‘World Trade Centre’ off NH-8, Sohna Road in Gurugram. The project envisages development of 1 million square foot of leasable area. These funds will be utilised towards the development of World Trade Centre in Gurugram.According to the documents, the funding of Rs 714 crore is secured in the form of a loan from SBI for a tenure of 72 months or six years. The annual rate of interest payable is 9.6 percent.Documents showed that the Energetic Construction Private Limited has secured a loan of Rs 714 crore from SBI for the World Trade Centre project in Gurugram. TCG Urban Infrastructure Holding Pvt. Ltd. is the promoter of Energetic Construction Pvt. Ltd.The deed of Hypothecation was executed between the Energetic Construction Private Limited in favour of SBICAP Trustee Company Limited on March 28, 2024, the documents showed.Also Read: Gurugram: Dwarka Expressway set to boost real estate opportunities along corridor, property prices may riseThere was no immediate response from the SBI and the TCG Real Estate on the development. The copy will be updated after receiving a response.Spreading over a land of 7.94 acres, the World Trade Centre in Gurugram comprises of a total leasable area of 10,13,168 square feet consisting of office block and retail block in the form of four towers.The office block will have a leasable area of 9.4 lakh sqft while the retail block will have 72,407 sqft leasable space. The scheduled commercial operation date is October 2027. The estimated cost of the project is Rs 1211.86 crore, the documents showed.Also Read: Virat Kohli leases out 12 office spaces in Gurugram for annual rental of Rs 1.27 croreAccording to documents, construction period of the project is 48 months and the moratorium period is of 12 months. In case of irregular payment upto 60 days an annual penal interest of two percent will be charged. If the irregular payment exceeds 60 days, then an annual penal interest of five percent will be applicable on the outstanding amount for the period of irregularity, the loan documents showed.\n       ",
    "The country's largest lender, the State Bank of India, on April 26 partnered with HCLSoftware, the software business unit of HCLTech, for the bank's digital transformation.\"As part of the five-year agreement, HCLSoftware will deploy the HCL Unica platform to enable SBI to digitally transform its customer interaction framework and provide hyper-personalized communication across the bank’s diverse digital marketing channels, while adhering to the Digital Personal Data Protection Act (DPDPA) and other stringent security requirements,\" the bank said in a press release.HCL Unica, with its advanced Customer Data Platform, AI capabilities and comprehensive campaign management tools, would leverage real-time data to significantly improve SBI’s ability to engage with its customers. \"It will help facilitate complex, multi-channel digital marketing campaigns, enhancing customer engagement precision and relevance,\" the release saidSBI's tech journeyThe lender's chairman, Dinesh Khara, in a event in Mumbai in October 2023 said that the lender will launch the You Only Need One (YONO) 2.0 in nine months. \"Of our 480 million customers, 70 million are on the YONO (platform). We have 10 million logins per day and Rs 1 trillion in assets. Ninety-seven per cent of the bank’s transactions are now non-branch,\" Khara said.\n       ",
    "Financial Services Institutions Bureau (FSIB) on April 24 said it has recommended the name of Rana Ashutosh Kumar Singh as managing director of State Bank of India (SBI).The FSIB said it has concluded its evaluations for the position of Managing Director at the State Bank of India (SBI), interfacing with a total of 16 candidates over April 23 and 24.\"Keeping in view their performance in the interface, overall experience and the extant parameters, the Bureau recommends Rana Ashutosh Kumar Singh for the position of MD in SBI,\" said FSIB in a statement.The Bureau has also recommended Asheesh Pandey for the position of MD & CEO in Indian Bank.The final decision on the FSIB recommendation would be taken by the Appointments Committee of the Cabinet headed Prime Minister Narendra Modi.\n       ",
    "The State Bank of India (SBI) has refused to disclose under the RTI Act the details of the electoral bonds furnished to the Election Commission (EC), claiming that it is personal information held in a fiduciary capacity, even though the records are in the public domain on the poll panel's website.Holding that the electoral bonds scheme was \"unconstitutional and manifestly arbitrary\", the Supreme Court directed the SBI on February 15 to furnish the complete details of the bonds purchased since April 12, 2019 to the EC, which would publish the information on its website by March 13. Holding that the electoral bonds scheme was \"unconstitutional and manifestly arbitrary\", the Supreme Court directed the SBI on February 15 to furnish the complete details of the bonds purchased since April 12, 2019 to the EC, which would publish the information on its website by March 13.On March 11, the court dismissed the SBI's petition seeking an extension of the deadline and ordered it to disclose the details of the electoral bonds to the EC by the close of business hours on March 12. RTI activist Commodore (retired) Lokesh Batra approached the SBI on March 13 seeking the complete data of the electoral bonds in the digital form, as provided to the EC after the Supreme Court's order.The bank denied the information citing two exemption clauses given under the Right to Information (RTI) Act -- section 8(1)(e) that is related to records held in a fiduciary capacity and section 8(1)(j) that allows withholding personal information. \"Information sought by you is containing details of purchasers and political parties and hence, cannot be disclosed as it is held in fiduciary capacity disclosure of which is exempted under sections 8(1)(e) and (j) of the RTI Act,\" the response furnished by the central public information officer and deputy general manager of the SBI said on Wednesday.Batra had also sought the details of the fees paid by the SBI to senior advocate Harish Salve to defend its case against the disclosure of the electoral bonds' records, citing that the records are held in a fiduciary capacity and the information is personal in nature. It is \"bizzare\" that the SBI denied the information that is already on the EC's website, Batra told PTI.On the question of Salve's fee, he said the bank has denied information that involves taxpayers' money. The EC published the data furnished by the SBI on its website on March 14, with the details of the donors and political parties that redeemed the bonds.On March 15, the apex court pulled up the SBI for not furnishing the complete information by withholding the numbers unique to each electoral bond that would help match the donors with the recipient political parties, saying the bank was \"duty-bound\" to reveal the information. A five-judge bench headed by Chief Justice D Y Chandrachud said it had directed the disclosure of all the details of the bonds, including the names of the purchasers, amounts and dates of purchase.All details have to be furnished by the SBI, the CJI observed, as the court admonished the bank for furnishing incomplete information, a day after the EC put out the entire list of entities that purchased the bonds for making political donations. The SBI had said a total of 22,217 electoral bonds of varying denominations were purchased by the donors between April 1, 2019 and February 15 this year, of which 22,030 were redeemed by political parties.\n       ",
    "The Reserve Bank of India’s liquidity coverage ratio (LCR) review framework would help banks manage liquidity efficiently, State Bank of India chairman Dinesh Khara has said.“In my assessment, banks were keeping as much as Rs 50,000 crore for extra liquidity. Expect the LCR framework to help banks have better and more efficient liquidity management,” Khara said in an interaction with CNBC-TV18.Recently, RBI governor Shaktikanta Das said the central bank would soon issue a draft circular to review the LCR for banks.“A need has arisen to undertake a comprehensive LCR review for banks. A draft circular will be issued for stakeholder consultation,” Das said.LCR refers to the proportion of highly liquid assets held by banks to ensure that they meet their short-term obligations. It helps banks to meet their financial requirements in the short term.Also read: RBI to issue draft circular on LCR review for banks, says governorKhara added that the state-owned bank hoped to exceed the guidance it gave for FY24 on credit growth.“Based on the current environment, we should get to see better credit growth numbers in FY25,” Khara said.On the net interest margin, Khara said SBI should be able to maintain NIM at the current level.In the December quarter, SBI’s NIM was at 3.22 percent. The lender reported a credit growth of 14.38 percent on a year-on-year basis.\n       ",
    "SBI Card on March 21 has partnered with Titan Company Limited, to launch Titan SBI Card.  The Card offers benefits across many lifestyle categories.\"With features that include cashbacks, Titan gift vouchers and Reward Points, cardholders can avail exclusive benefits of over Rs 2 lakh worth per annum. One can enroll for the card in a completely digital mannervia SBI Card SPRINT by visiting SBI Card website https://www.sbicard.com/ or Titan stores,\" said SBI Card in a stock exchange filing.Categories and BenefitsThe Titan SBI Card offers curated benefits on high value spend categories such as jewellery, watches, and eyewear.The card offers 7.5 percent cashback on Titan in watches category; Taneira in women ethnic wear category; Titan EyePlus in eyewear category; and other non-jewellery Titan brands.Cardholders are eligible for 5 percent cashback when they shop using Titan SBI Card from Mia, Caratlane, and Zoya across their offline and online stores. Additionally, from Tanishq, they get Titan gift vouchers worth 3 percet value of the spends.Abhijit Chakravorty, MD & CEO, SBI Card said that there is a growingpropensity of Indian consumers towards aspirational lifestyle and products. \"We are delighted to introduce Titan SBI Card, a specialised credit card that caters to the lifestyle spending needs of our customers. This launch holds great significance for us since it also marks the start of our partnership with Titan, a giant in the premium retail category. We hope our customers willappreciate this new addition to our already robust premium portfolio and leverage it to derive maximum benefits as they spend through it,\" he added.Also Read | Nomura cautious on NBFCs amid regulatory action, shares 'reduce' call on SBI Cards, M&M FinancialC K Venkataraman, MD, Titan Company Limited, said that India is on thetrajectory to become the third largest consumer market, with consumer spending growing YoY across the retail ecosystem. \"In fact, at Titan, we have witnessed a significant surge in demand from our consumers across different segments. Our consistent growth trajectory acrosscategories, is reflective of the confidence that our consumers have in our value proposition. We are delighted to partner with SBI Card to launch this unique co-brand card which will further bolster the aspirations of our consumers. Through this card, we would like to empower ourcustomers by offering them exciting benefits while shopping across their favourite Titan brands. Additionally, spearheading Titan’s commitment to the society and its eco-conscious drive, we are also happy to plant a tree for every approved card,\" he added.Also Read | Wearables to play key role in Titan's plan to hit Rs 10,000 cr consumer sales target in biz segmentAdditional BenefitsCardholders will receive 12,000 Reward Points upon payment of joining fee.Travel Benefits: Eight complimentary domestic airport lounge visits in a year (Maximum of 2 visits per quarter) and four complimentary international airport lounge visits in a year (Maximum of 2 visits perquarter).Fuel Surcharge: One percent fuel surcharge waiver (Valid for transactions of amount ranging from Rs 500 to Rs 3,000 & maximum surcharge waiver amount of Rs 100 per billing statement month per credit card account.)SBI Card and Payment Services reported an eight percent rise in its net profit at Rs 549 crore in the December quarter of FY 24, from Rs 509 crore recorded in the year-ago period.Titan Company reported standalone net profit of Rs 1,040 crore for the December quarter of FY24, up 9.5 percent from the same quarter of the previous financial year.\n       ",
    "Future Gaming and Hotel Services, the company owned by Santiago Martin, has emerged as the top donor to political parties via electoral bonds, according to the published on the Election Commission website on March 14.The company bought electoral bonds worth Rs 1,300 crore approximately between 2019 and 2024. The poll panel uploaded the data on its website as received from the State Bank of India (SBI) after the Supreme Court's directions.Who is Santiago Martin?From his humble beginnings to his current stature as a lottery king, Martin's journey has been a rollercoaster ride. Born in a modest family, Martin began dabbling in the lottery business at the age of 13, according to his LinkedIn profile, laying the foundation for what would later become his empire.The business, according to his profile on the professional networking site, has reported an average annual growth of 109 percent, with a professional strength of more than 1,000 committed staff and more than 260 stockiest in all lottery playing states. Besides the lottery business, his interests range from real estate, construction, alternative energy, visual media entertainment, textiles and yarn, hospitality, health care and education, software and technology, property development, agro and building materials.Future Gaming and Hotel Services, the company that featured as the top electoral bond donor, operates gaming facilities, including casinos, electronic gaming centres and other forms of gaming establishments. It offers a range of games such as slot machines, card games, and other electronic gaming options.As founder and chairman of the Martin Group of Companies, Santiago Martin and his companies have faced legal scrutiny and controversies over the years for allegations of irregularities. The company has been under the scanner of multiple investigation agencies including the Central Bureau of Investigation (CBI), the Enforcement Directorate (ED) and the Income Tax Department in 2022 and 2023.Key businesses of Martin GroupLottery Operations: His company Martin Lottery Agencies Ltd operated various lottery schemes across different states in India. The lottery business faced regulatory challenges and controversies over the years, including legal battles and allegations of irregularities. According to his LinkedIn profile, the marketing network of buyers and sellers of lotteries spans across India – with a presence largely in the South, the North East, West Bengal, Punjab and Maharashtra. Real Estate Development: The Martin Group is involved in real estate development, including residential, commercial, and mixed-use projects.Hospitality: Martin’s diversified portfolio encompasses real estate, hospitality and entertainment from luxury resorts to state-of-the-art multiplexesEntertainment and Gaming: Future Gaming and Hotel Services within the Martin Group is involved in entertainment and gaming ventures.Despite his accomplishments, Martin remains a fiercely private individual, eschewing the limelight for a more reclusive existence. Martin's early life and background are not extensively documented in public, and information about his upbringing, education and family is limited.In a landmark ruling on February 15, 2024, a five-judge Constitution bench had scrapped the Centre's electoral bonds scheme that allowed anonymous political funding, calling it \"unconstitutional\" and ordered disclosure of donors, the amount donated by them and the recipients.\n       ",
    "In big relief to debt-ridden PC Jeweller, country's largest lender, State Bank of India (SBI) has accepted  the One Time Settlement (OTS) proposal submitted by the company, the company informed the stock exchanges on March 13.The terms of OTS includes cash and equity component, release of securities and mortgaged properties, the company said. The development is significant as P C Jewllers has been in talks with lenders led by SBI for an out-of-court settlement for a long time.The company owes over Rs 3400 crores to a clutch of lenders.  PC Jeweller's troubles began in February 2023, when banks decided to recall loans advanced to it after it was revealed in a filing that the company had defaulted on loans worth Rs 3,466 crore from banks and financial institutions. Loan recall is a process where the source lender requests the return of the amount advanced to the recipient or borrower.The company, in its annual report for fiscal 2021-22, stated that it had borrowed money from 14 banks, including SBI, Indian Bank, Union Bank and Punjab National Bank. In the annual report, the company said it owed the banks Rs 3,278 crore, which included the interest and the base amount.The largest lenders are SBI with Rs 1,060 crore outstanding, Union Bank of India with Rs 530 crore, Punjab National Bank with Rs 478 crore and Indian Bank with Rs 226 crore.In June 2023, SBI moved an insolvency plea against PC Jeweller Limited, National Company Law Tribunal (NCLT) issued notice in the plea and sought for PC Jewller's response. In response to SBI's plea, PC Jeweller filed a 26 volume response to its 19 volume plea.On  January 9, the NCLT was on January 9 informed that there have been certain developments in settlement talks between  SBI and PC Jeweller over repayment of the latter's loan.Senior counsel Nagesh, who appeared for SBI further told the court that the  top management of is presently considering the settlement offer made by PC Jeweller. Lawyers for PC Jewller and SBI thus jointly sought for an adjournment of the case. The NCLT has accordingly adjourned it to January 29 for further consideration on the outcome of settlement talks.On December 12, the parties jointly told NCLT that the settlement talks were underway  and sought for deferment of hearing. The jewellery company has offered to pay a sizeable chunk of its outstanding dues spread over a period of three years along with an upfront payment. PC Jeweller owes over Rs. 3,000 crore to SBI.In November 2023, it was reported that SBI took control of two prime properties in New Delhi, citing default in payments. \n       ",
    "Bernstein downgraded shares of the State Bank of India to 'market-perform' citing limited upside and raised its target price for the stock to Rs 780 from Rs 710 on the bank's willingness to improve its capital levels. The broking firm also highlighted factors that would drive underperformance in public sector banks, compared to their private peers.At 10.34am, shares of SBI traded 0.1 percent higher at Rs 788.95. The stock has gained over 33 percent in the past six months.Bernstein said that although public sector banks have outshone private lenders in the past three years, going ahead, investors should switch to private sector banks. The broking firm sees a less promising trajectory for state-run banks as they struggle with weaker deposit growth and much lower liquidity buffers resulting in a weaker earnings growth compared to private banks.Bernstein said that the liquidity headroom is a lot lower than what the loan-to-deposit ratio might suggest, given the higher investments for public banks are a result of higher deposits and cannot be reduced to be on par with private banks.Aggressive pricing in loans and deposits by public banks is forcing a growth-margin tradeoff that will result in muted earnings growth. So, even if public sector banks squeeze out the remaining liquidity buffers to match growth, the higher loan growth will not translate into earnings growth, said Bernstein.The brokerage firm said that with the recent rally, the market cap to pre-provision operating profit (PPOP) ratio for public banks is more than 0.6X that of private banks, despite their deposit growth rates remaining less than 0.6X of private banks.Also Read | Price-volume action in banking stocks signal resurgence; PSU lenders outperform "
]