[
    "Motilal Oswal's research report on Shriram Transport FinanceSHTF’s PAT declined 17% YoY to INR7.3b (8% miss) in 3QFY21. In 9MFY21, NII and PPOP were largely flat on a YoY basis, while PAT declined 24% due to elevated credit costs. n We increase our FY22E/FY23E EPS estimate by ~7%/~5% to factor in higher AUM and lower opex. Our FY21E/FY22E/FY23E credit cost estimate stands at 2.8%/2.4%/2.5%. Buy with a TP of INR1,575/share at 1.4x FY23E P/BV.Outlook We upgrade our FY22E/FY23E EPS estimates by ~7%/~5% on the back of better loan book growth and lower opex. Maintain Buy with a TP of INR1,575 per share at 1.4x P/BV (FY23E).For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.  Read More",
    "Umesh Revankar, MD and CEO of Shriram Transport Finance, is hopeful that growth and profitability will improve in the second half of the current fiscal year. But government spending in the next two quarters will be very crucial for revival of economic activity, he tells Neha Bothra in an interview. The NBFC's main focus is to ensure asset quality does not deteriorate, and Umesh expects net interest margin to improve by 20 bps (basis points) in the coming quarters. During this interaction, Umesh discusses growth challenges, business outlook, and puts to rest talks of a possible merger with group companies. It is not being considered and you can say it is on the backburner, he clarifies. Edited excerpts:What helped you get back on the growth track after the COVID shock?One advantage we have is all our customers are sourced directly by us. We don't engage any intermediary, so our executive’s relationship with each and every customer is an important enabler. We asked our executives to stay connected with each customer over the phone.For quite some time during the lockdown, our executives strived to keep in touch with the customer without really talking about the EMI payment, it was just to see their well-being, to understand how the business is likely to move and we realized that there was a loss of demand for goods and essential goods transportation. So, we encouraged the customer, when things started opening up, that opportunity was there to make an earning.That’s how the constant connectedness with customers helped us bring back business quickly when the lockdown was lifted and our customers were on the move earning again. Complete engagement with customers helped us come back to normal.What is your business outlook and are you seeing improvement in demand?For the January-March quarter, as far as the new businesses is concerned, I expect the demand for commercial vehicles, especially in February and March, to go up considerably because government spending has gone up, which also drives infrastructure activity, and that will also push construction sector as some concession given on stamp duty will increase activity and demand. So, Q4 should be good. And, with the pent-up demand, we expect the growth could be anywhere between 15-20 percent.When total transportation activity in the economy increases, Shriram Transport Finance being the largest player, will get higher market share as the company also enjoys the highest branch network in India.Do you expect government spending to pick up in areas like construction and infrastructure?I definitely believe that when government spending goes up, at any point of time, it reaches the customer directly, and translates into business activities in areas like, infrastructure, and road construction. The materials purchased for construction of roads constitute around 10 percent, but other things go into it like labour, transportation, demand for steel, and this creates a big movement. So, I believe the government is going to spur activity and employment, and areas like infrastructure and real estate are important, as they are the largest employer for unskilled and semi-skilled people.Many such people are in need of a job now because they are the ones who lost a job in the pandemic, and that huge demand will in turn drive consumption. So, I feel government spending is very critical for the next two quarters -- January to June -- as normally by July the monsoon starts and then work on many large infra and real estate projects slows down. So, January to June, government spend would be crucial for all kinds of economic activity.Are you looking at any fund-raising to meet the anticipated increase in demand?Right now, we are not planning anything for at least a couple of months. But, post that if the liquidity stays like this and if the price point is right, we may consider raising funds, but that will be to meet growth requirements for subsequent two years. I feel the next couple of years are going to be big growth years for established players. But, we have not planned anything now.It will depend on the growth triggers as things become clearer after a couple of months. So, if we expect just 10-15 percent kind of growth, then we may not really need to raise capital. But, if it is 15 percent plus for the next couple of years, then we will consider if the market is good. A lot depends on how government spending, economic activity and execution influence economic growth from here.What are the main pockets that will contribute to the sustainable growth momentum in the medium term?One thing that has helped us is the rural market. In the last year or two, the rural market never stopped contributing to growth, even during COVID-19. It was active even in April-May-June when our country was under lockdown -- because it was the harvesting time and post-harvest, the grains have to be moved to mills, from mills to the mandis, and so the activity was continuous. In the last two years, we had reasonably good rains also. Therefore, the agricultural output has been higher year-on-year.That has created an opportunity for building rural infrastructure, which will be self-sustainable because rural areas sometimes become too dependent on urban areas to provide employment, basic facilities like schools, hospitals and the like. Many move to the urban market to fulfil the requirements, but the rural facilities have to become strong for good balance. We believe that over the next 5-10 years, there will be continuous growth in the rural and urban market and the growth can be double-digit over this period. I'm not talking about one or two years. This year, the growth maybe 5-6 percent, but in the next couple of years, we should be growing anywhere between 12-15 percent, that's what I believe.What about the second half of the fiscal year in terms of growth outlook?Second half is looking good. There are two things, which are more sustainable. The second half typically sees 60 percent contribution to the economy because of the higher output, festive period, holiday spends, etc. Since the impact of COVID-19 is not much in the second half, it should be much better than the first half.Also, if I were to compare last year's second half growth to this year’s second half, then by that comparison also it should be decent, as economic growth was softening a little back then. So, on both -- profitability and growth -- the second half of the year should be better.And what about asset quality? Are you wary of some negative surprises in this area?Asset quality by and large is steady and we should do well here. If you factor in the Stage-3 numbers (the riskiest pool of stressed assets) and the Supreme Court decision, in the corresponding period last year, it was around 8.9 percent. So, if we improve from that to 7.6 percent, it is going to be a sizeable improvement in our asset quality.What are the top focus areas right now?We are focusing mostly on improving NPL (non-performing loans) figures. Ever since the moratorium was lifted in August and some of the customers requested for restructuring, our focus has been on keeping a good track on collections, ensuring recovery, and improvement in profitability rather than growth in the immediate period up to March 2021. Post that, we'll focus more on growth.What is your expectation on the cost of funds and margins, going forward?Cost of funds should come down by 25-30 bps incrementally over this quarter and next quarter put together. So, that should help us in expanding our net interest margin by 20 bps, which will also add to our bottom line.There’s an opportunity to convert into a bank. What are your thoughts?See, there are certain advantages and disadvantages. The advantage is that if you have a big network through the country, you will be able to get resources for savings and that will reduce costs, the benefit of which can be passed on to the customer. That's one way to look at it.On the other hand, you have to see if there are any benefits as per your business model, because you will have to maintain SLR (statutory liquidity ratio) and CRR (cash reserve ratio) and then you have to raise fresh resources, keep bank resources, and also interbank loan limitations from a number of banks. So, if at all I have to borrow from the bank for more than 3 years, then I will need to find a replacement for that bank loan. So, I have to find some other source for longer term. Otherwise, I have to get a special forbearance from the RBI (Reserve Bank). A large NBFC (non-banking financial company) will have to think of all this.If it is a small NBFC or a small startup bank, then one is starting fresh and that certainty makes things easier. Since my asset size is more than Rs 1 lakh crore, whatever I need is of reasonably large size. So, special forbearance has to be there and if the RBI is open to forbearance, then we can consider becoming a bank.But I also have to look at my shareholders’ comfort -- if the shareholders say they are more comfortable staying as an NBFC, then I will have to listen to that as well because bank ROEs (return on equities) are lesser than that of NBFCs. So, we need to look at the shareholders and also the comfort of staff and employees as NBFC employees are specialised in specific activities, but bank employees have to provide a much wider range of services.Are you enthusiastic about this option keeping the pros and cons on balance?We are looking into it, and if we are convinced, and if the RBI is open to forbearance, then we will look at it, otherwise we do not want to look at that kind of possibility. You can't have a goal which you know for sure you won’t reach. While the road map is there, one needs to be very clear, otherwise there is no point in being on the road you don’t want.The regulatory angle has been a sensitive area for NBFCs and the views are largely divided. Where do you stand?I believe that NBFCs, especially the large ones, are as highly or tightly regulated as any bank. We will look at the cost and benefits of converting into a bank. Additional costs should not become a burden for the shareholders or others. Otherwise, we are tightly monitored by the RBI, and being an NBFC, I don't think we are anyway less supervised by the RBI.At what stage is the plan to merge group firms? Has it been put on the back burner?If at all we feel by combining we have better synergies coming out, and can provide better service to the customer, then we will see. Also, we need to seriously consider and ensure a better return to shareholders. So, in summary, it is not being considered and you can say it is on the back burner.\n       ",
    "Prabhudas Lilladher's research report on Shriram Transport FinanceQ2FY21 earnings stood mixed with better clarity on asset quality expected to emerge in forthcoming quarter. While provisioning run-rate declines and collections gain pace, our FY21 EPS estimates stand higher by 9%. With additional provision of Rs23bn pushing ECL coverage to ~40%, provisions run-rate now has come down to Rs7bn as against Rs10-11bn over past two quarters. Going ahead, we believe H2FY21 would see run-rate slightly inching higher as we factor zero payments from 4.5% of customers and higher LGDs for Stage 2 assets. Besides, we expect somber 5% AUM growth YoY for FY21 with constrained capital market access and continued collections focus, same should pick-up to 10-14% levels over FY22-23. With fluid NPA movement clouded by moratorium and old pools, we maintain conservative NPA estimates at 8-9% and credit costs at 280-200bps over FY22-23. Said that, SHTF’s unique customer base characterized by driver-owner segment focused on inter-state transport activity in rural markets is expected to witness faster recovery.OutlookWe reiterate Accumulate rating on the stock valuing at 0.9x PBV multiple at Sep’22E arriving at price target of Rs809.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.  Read More",
    "ICICI Direct's research report on Shriram Transport FinanceRecommendationBuy Shriram Transport Finance in the range of Rs 730-745Target: Rs 875Stop Loss: Rs 665Time frame: Three monthsDerivatives & Quantitative OutlookThe NBFC space has remained largely range bound in the last few months with stocks like Shriram Transport Finance underperforming its peers. Recent shoring up of capital through QIP in July addresses its concerns on liquidity and volatility in asset quality. We believe the stock has significant room for upsides. After remaining range bound for some time, the recent up move is likely to continue.Like most stocks, open interest in Shriram Transport Finance has also declined substantially during the sharp decline seen in February and March. The OI has come down from 7 million shares to just over 2 million shares in March. However, since then, the stock has seen gradual OI build-up with the current OI the highest seen in the last six months at 5 million shares. We believe long additions were seen in the stock and prices should see follow up movement.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.  Read More",
    "The annual general meeting (AGM) for Shriram Transport Finance (STFC) held on August 19 began as a routine affair. What unfolded next was anything but.The minority shareholders of STFC, an asset financing non-banking finance company, voted against a resolution to re-appoint Puneet Bhatia, co-managing partner and India head of private equity major TPG Capital Asia as a director on the board. The shareholders cited Bhatia’s low attendance in board meetings as the reason.Shareholders voting out a board member in India is rare. Typically, shareholders, except when they vent their disagreement to promoters or management, are silent spectators at AGMs. Using the power of their vote at company AGMs is unusual.JN Gupta, Founder of proxy advisory firm SES, said the STFC case is one of its kind. “It reinforces the trend that shareholders have started realising the importance of their vote and no longer voting with their feet,” said Gupta, a former executive director of market regulator Sebi.“Gone are the days when shareholders used to disinvest due to issues and when nobody used to ask questions. Stewardship guidelines of SEBI will bring far-reaching changes the way companies are governed. Figurative and ornamental directors are no longer valued,” said Gupta.Proxy advisors heardThe episode also shows that shareholders might be finally taking proxy advisory firms seriously. The decision to oust Bhatia who headed the private equity group for GE Capital India prior to joining TPG Asia in April 2002 came after most proxy advisory firms advised shareholders to vote against the proposition. These firms raised red flags over the low attendance of Bhatia in board meetings.In 2019-20, Bhatia’s attendance percentages in STFC board meetings, audit committee and corporate social responsibility meetings was less than 50 per cent, according to the proxy advisory firms.The voting outcome was overwhelmingly one-sided. Overall 57 per cent of the shareholders voted against the resolution. Promoters voted 100 percent in favour of Bhatia’s reappointment. But among the public institutions, 83 percent didn’t want Bhatia on the board.To be sure, the reason for Bhatia’s ouster isn’t serious enough to alarm STPC’s investors. “One needn’t read too much into this case. The reason why Bhatia wasn’t given a go-ahead by the shareholders is his low attendance. But this is a lesson to board members that they need to participate aggressively,” said an analyst who tracks financial services.An email sent to Shriram Group seeking response on the issue remained unanswered at the time of filing this story. An email sent to Bhatia seeking his response on the matter remained unanswered till the time of filing this copy.Episode-2: Promoters bat for BhatiaThe story didn’t end with Bhatia’s ouster. While shareholders voting against the re-appointment of a prominent board member itself was rare, what came after was even more dramatic. A week after shareholders rejected Bhatia’s re-appointment as a board member, Shriram Group renamed Bhatia to the board.It defended its decision through an unusual press release.Titled as “Shriram Group appreciates TPG’s contribution to the Group,” the press release termed shareholders’ decision to vote against Bhatia “unfortunate”. “It was unfortunate that recently some of the shareholders voted against his continuance as a director, possibly solely relying on attendance not being very high for the board meetings,” the Group said.The group defended Bhatia saying he has been representing TPG on the boards of the various companies in the Shriram Group and has been adding a lot of value.“We, the promoter, the management of both SCL and STFC wish to place on record our appreciation of his efforts that have been put in by him for over a decade, spanning over 15 years since 2006. He has been a director of STFC since 2006, when the first investment from TPG flowed into the Shriram Group, till date,” the group said.Unusual press statementGupta said this press release appears to be a PR exercise by the company to mitigate the impact of the defeat of resolution by shareholders by detailing the contribution of Bhatia, which ideally should have been given in notice.The promoters and the key strategic partner, Sanlam, a financial services groups based in South Africa, backed the candidature of Bhatia the past and will do so in future also, the note said. “Bhatia has requested some time to consider our request. We plan his formal induction into the Board of STFC at a mutually convenient time, where we expect all the stakeholders to also back him.”Wanted: good governanceThe question here is whether promoters finding backdoor entry to a board member whose re-appointment has been rejected is in the true spirit of good governance?Experts are of the view that even though there is nothing illegal in promoters re-appointing a board member on the board using their quota, doing so without shareholder approval doesn’t amount to good governance.“There nothing illegal if a company appoints a person on the board through the nomination route if the Articles (of Association) permit. But, if they appoint a person on the board who has been already rejected by the shareholders without shareholder approval, it is absolutely not good governance,” Gupta said. “The re-appointment has to be done through the shareholders after convincing them about the merit of inducting the person on the board.”According to Jayant Thakur, a chartered accountant who specializes in securities law, Section 161(1) of the Companies Act, 2013, makes it clear that Board may have powers under Articles to appoint an additional director but that can be of a person \"other than a person who fails to get appointed as a director in a general meeting,”.“Thus, the intent and spirit clearly are that Board ordinarily shouldn’t disrespect the views of shareholders and appoint a person rejected by them,” Thakur said.The other point is the general principle whether Promoters appointing their nominee is in consonance with principles of good corporate governance. Here, it is often missed that Promoters have as many rights of governance as public shareholders have.“Appointing a person as their representative as their nominee is as much assertion of their governance rights as others do for their own. In this sense, just as promoters ensuring all board members are their nominees would be wrong, so would be wrong that they are unable to have any nominee on the board. A sense of proportion is thus to be kept in mind while dealing with such matters which is not all about strict letter of law but rather matters of intangible issues of values,” said Thakur.\n       ",
    "YES Securities' research report on Shriram Transport FinanceA healthy operating performance with PPOP coming in-line with expectation. Miss on NII (decline in NIM) was made up by cost containment (driven partially by structural measures). Additional covid-related prov. of Rs9.6bn weighed on earnings, while asset quality was stable due to standstill. Cumulative covid buffer at Rs18.7bn (1.7% of on-book AUM). Conservative built-up of prov. also reflected in ECL cover of 39% on Stage-3 assets and 3.7% on Stage 1&2 assets. 71% and 73% of borrowers paid in June and July respectively. However, collection efficiency was lower at 50-55% as many customers paid partial installments. Management believes many such customers are retaining cash for lockdown uncertainty or to support business operations. Collection trends are expected to improve in August and September. After moratorium ends, the company will deploy its usual recovery methods (including repo threat) which should drive-up collections. In worst case, management sees restructuring requirement for 5-10% of borrowers. No further additional prov. requirement seen if covid situation does not worsen; implying normalization of credit cost in H2. While excess liquidity will be carried for a while, NIM is expected to improve by Q4 FY21 with easing incremental funding cost. Extant BS liquidity (Rs97bn), unused bank lines (Rs20bn), branch activation for deposits, improving funding availability and rising collections place SHTF comfortably for meeting liability repayments and business requirements. Notwithstanding that SHTF caters to riskier customers segment (owner-drivers), company’s covid buffer stands higher than peers, thus cushions future P&L outcomes.OutlookEven if significant delinquencies flow in ensuing quarters, the incremental credit cost requirement may not be very large (PPOP can absorb). Expect near-normal credit cost in FY22. Retain BUY.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.  Read More",
    "Emkay Global Financial's report on Shriram Transport FinanceWe continue to like SHTF during recent uncertain times as it is backed by a superior provision coverage of ~38.5%, Covid-19-related buffer provisions of Rs18.7bn (~1.7% of AUM) and Tier-I adequacy of ~20% (post Rs15bn rights issue). It has a unique customer base with a moat. Demand for used vehicles is likely to remain benign amid the slowdown. During Q1FY21, disbursements declined ~92% YoY (-90.9% qoq), whereas AUM grew by ~5.1% yoy (+1.8% qoq) to Rs1117.5bn. SHTF reported a sharp surge in provisions of ~89.7% yoy (-5.7% qoq) to Rs10.6bn, including Covid-19-specific provisions of Rs9.6bn. On the liquidity front, it is well placed with a cash balance of Rs73bn. SHTF managed to maintain its momentum in recoveries (part payments). On customer count terms, the company has collected from 84% of the borrowers in March, 23% in April, 52% in May, 71% in June and 73% in July. In value terms, collection efficiency remains at ~50-55%. We expect collection momentum to improve further.OutlookWe maintain our estimates unchanged, however, incorporate the rights issue of Rs15bn into our estimates and roll forward our TP to Sept’22E. We maintain Buy (OW in EAP) with a revised TP of Rs792 (Rs730 earlier), corresponding to ~1x P/adjusted book Sept’22E.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.  Read More",
    "Prabhudas Lilladher's research report on Shriram Transport FinanceQ1FY21 earnings proved beat on most parameters, however, the moratorium dispensation is still masking the true asset quality picture. Quarter surprised positively on 2%QoQ AUM growth to Rs1117bn driven by similar growth in used CV financing. We reckon pent-up demand and better rural scenario aided used CV traction. Same translated into higher than expected NII although Co. could not escape NIM compression on account of excess liquidity on BS and notional loss on investments. With good part of book falling under moratorium, Q1FY21 NPAs declined 50bpsYoY/40bpsQoQ to 7.98%. Jul-month still recorded improved collections with 73% of customers either paying in part or full but recoveries still remain elusive. Hence, Co. holding cumulative Rs18.7bn COVID-related provisions created over Q4-Q1. With recent Rs15bn rights issue, Rs77bn on-BS liquidity, undrawn bank lines of Rs20bn and Rs19.5bn GoI funds, Co. expects liquidity pressures to ease aiding NIM reversals to pre-COVID levels.OutlookWe maintain our reservations on growth (somber demand as lockdowns get extended restricting intra state activity, lower utilization levels) and asset quality (moratorium overhang) with imminent NIM pressures. Our FY21-FY22 growth target at 5%/10%YoY remains almost unchanged; we expect healthy 16%YoY growth for FY23 led by used CV financing. NPAs at 8-9% remain unchanged, however, we tweak credit costs estimates slightly higher to 300bps (earlier 260-270bps) for FY21. Consequently, our EPS estimates stand higher by 8% for FY21 but lower 4-9% over FY22-23E. With return profile yet to see a strong momentum, we reiterate Accumulate rating on the stock and rollover PBV multiple to Sep’22E to 1x arriving at price target of Rs805 (earlier Rs793.)For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.  Read More",
    "Motilal Oswal 's research report on Shriram Transport FinanceShriram Transport Finance (SHTF)'s 1QFY21 PAT halved to INR3.2b (6% miss). While growth was muted, collection efficiency improved MoM. SHTF also cut opex by 30% QoQ. Collection efficiency, in terms of the number of customers/value, improved drastically to 73%/53% in Jul'20 from 52%/30% in May'20. Despite this, the company took additional INR9.6b COVID-19 provisions, taking the total COVID-19 provision buffer to INR18.7b (i.e., 1.8% of loans).OutlookWe modestly increase FY21 estimates to factor higher AUM and lower opex. Our credit cost estimate of 3.5% for FY21 remains unchanged. Buy, with TP of INR945 at 1x PBV FY22E.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.  Read More",
    "A trend seems to have emerged among listed companies of raising funds via rights issue. Many companies, including the likes of Mahindra & Mahindra Financial Services, PVR, Shriram Transport Finance, Aditya Birla Fashion, Reliance Industries (RIL), have offered their shareholders a chance to solidify their holding at a time when investor confidence is riding high despite the rising number of COVID-19 cases in the country.Ample liquidity due to stimulus packages from central banks and relatively cheap valuations in the aftermath of COVID-19-led crash could have been the fillip companies needed to opt for rights issue as the preferred means of raising funds as opposed to qualified institutional placements (QIP), experts suggested.\"It is understood that when valuations are stretched, companies usually raise capital via QIP route. And when shares are reasonably priced or are undervalued, promoters generally raise additional capital for growth through a rights issue, giving a chance to existing shareholders to buy the stock at a discounted price,\" said Nirali Shah, Senior Research Analyst, Samco Securities.According to Shah, investors should not always view raising funds as a quick fix to a bleeding balance sheet but should rather concentrate on why the company is raising funds. In many cases, companies use the funds for capital expenditure which is a telling sign that the management is optimistic about the growth prospects of the company.\"...raising of funds also shows the management’s confidence in the growth of their company. It is not always the case that additional capital is raised only because the company’s balance sheet is bleeding. Capital can also be raised to accentuate growth and expansion,\" she said.A rights issue is a mechanism for listed firms to raise additional capital by inviting existing shareholders to buy new shares proportionate to their existing holding at a discount to the prevailing market price.Also Read: Rights issue bandwagon: M&M Financial, PVR, Shriram Transport & ABFRL gainPurpose of recent rights issue by companiesMahindra & Mahindra Financial Services is the latest firm to float a rights issue on D-Street. The company plans to raise Rs 3,089 crore and will issue 61,77,64,960, fully paid-up equity shares of the face value of Rs 2 each at Rs 50 per share for the same, which is a near 70 percent discount to its last traded price. The issue will open for subscription July 28, and the closing date is August 11.According to the management of the company, the rights issue is their way of thanking shareholders in the company's silver jubilee year. And thankful they were, as the scrip climbed over 10 percent on July 20, the announcement date. Although, the sharp rise can also be attributed to the stellar returns the company posted for the quarter ended June 2020.The pricing of the issues was also hailed by analysts Moneycontrol spoke to. They believe that the company has multiple moats including a strong rural presence. Efficient cost control along with low borrowing cost also puts the company is a favourable position“The announcement of the rights issue at a steep discount of Rs 50 against July 17's closing of Rs 207 per share is likely to be taken positively by the market. More than the rights issue, the steady growth in business along with signs of improvement in the niche segment of the company is likely to aid stock rally on a short-term basis,” Dinesh Rohira, Founder-CEO,  5nance.com told Moneycontrol.Earlier this month, India’s largest operator of multi-screen theatres, PVR also announced a Rs 300 crore rights which opened for subscription on July 17 and will close on July 31. The price of the issue was fixed at Rs 784 per equity share.According to media reports, the Ajay Bijli-owned firm intends to utilise the net proceeds from the issue towards repayment or prepayment of the principal and or interest of certain borrowings availed by the company. PVR may also use the proceeds for general corporate purposes.PVR, which has 176 properties and a total of 845 screens across India, had completed a Qualified Institutional Placement (QIP) in October 2019. The fundraising round led to an inflow of Rs 500 crore.Part of the QIP proceeds was utilised towards prepayment of existing debt obligation.Shriram Transport Finance launched its Rs 1,500 crore rights issue on 16 July at a price of Rs 570 per share. The rights issue will close on 30 July.Even though the lender did not reveal the purpose of raising funds, it said that its promoter entities will be subscribing to the entire portion of rights shares they are eligible for.“Our promoter and Shriram Financial Ventures (Chennai) Pvt. Ltd, a member of our Promoter Group have undertaken to fully subscribe to their Rights Entitlement and shall not renounce their rights, except to the extent of any renunciation inter-se between our Promoter and other members of the Promoter Group,\" the company had said in an exchange filing.BNP Paribas Arbitrage acquired 1.47 lakh Shriram Transport Finance Rights Entitlement (RE) shares at Rs 107.73 per share on July 21 via open market transactions, bulk deals data available on the NSE showed.Aditya Birla Fashion and Retail Ltd also came out with a Rs 995 crore rights issue this month. The issue opened for subscription on July 8 and will close on July 22.The main objectives of the fundraising are to cut leverage, strengthen the balance sheet and for general corporate purposes, including working capital, the apparel company, which owns brands including Louis Philippe, Van Heusen, Peter England, and Pantaloons, said.Experts Moneycontrol spoke to advised subscribing to the issue given ABFRL's strong management as well as its growth prospects once the pandemic is contained and the economy fully re-opens.\"The rights issue is structured similarly to that of Reliance Industries where shareholders will have to make payments in three tranches. As the lockdown is gradually lifted, retail stocks seem to be in a rebound mode. The factors like manageable leverage, consistent execution capability, healthy cost-cutting initiatives and strong parentage might help ABFRL emerge much stronger from the current crisis,\" said Gaurav Garg, Head of Research at CapitalVia Global Research Limited- Investment Advisor.Disclaimer: The views and investment tips expressed by investment expert on Moneycontrol.com are his own and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Disclosure: Reliance Industries Ltd. is the sole beneficiary of Independent Media Trust which controls Network18 Media & Investments Ltd which publishes Moneycontrol.",
    "Commercial vehicle financier Shriram Transport Finance Co Ltd (STFC), the flagship entity of Chennai-headquartered Shriram Group, has engaged eight merchant bankers to launch a Rs 1,500 crore rights issue and prepare for any COVID-19 related uncertainties, sources in the know told Moneycontrol.This is the firm’s first attempt in a decade to raise funds via equity markets. Ajay Piramal-led Piramal Group owns 20 percent stake in Shriram Capital, which in turn holds around 26 percent in STFC.“The kick-off for the proposed rights issue took place on June 22 and the firm has shortlisted JP Morgan, ICICI Securities, HSBC, BNP Paribas, Citi, Credit Suisse, SBI Capital and Axis Capital as merchant bankers,” one of the persons cited above said.The plan is to launch the rights issue in the next few weeks and close the deal before July end, he added. A second person confirmed the names of the shortlisted merchant bankers and the launch timeline.Sales in the commercial vehicle segment have plummeted post the outbreak of COVID -19 with medium to heavy commercial vehicles taking it on the chin. For instance, Ashok Leyland reported an unprecedented 90 percent year-on-year drop in domestic sales for May 2020.COVID-19 VaccineFrequently Asked QuestionsA vaccine works by mimicking a natural infection. A vaccine not only induces immune response to protect people from any future COVID-19 infection, but also helps quickly build herd immunity to put an end to the pandemic. Herd immunity occurs when a sufficient percentage of a population becomes immune to a disease, making the spread of disease from person to person unlikely. The good news is that SARS-CoV-2 virus has been fairly stable, which increases the viability of a vaccine.There are broadly four types of vaccine — one, a vaccine based on the whole virus (this could be either inactivated, or an attenuated [weakened] virus vaccine); two, a non-replicating viral vector vaccine that uses a benign virus as vector that carries the antigen of SARS-CoV; three, nucleic-acid vaccines that have genetic material like DNA and RNA of antigens like spike protein given to a person, helping  human cells decode genetic material and produce the vaccine; and four, protein subunit vaccine wherein the recombinant proteins of SARS-COV-2 along with an adjuvant (booster) is given as a vaccine.Vaccine development is a long, complex process. Unlike drugs that are given to people with a diseased, vaccines are given to healthy people and also vulnerable sections such as children, pregnant women and the elderly. So rigorous tests are compulsory. History says that the fastest time it took to develop a vaccine is five years, but it usually takes double or sometimes triple that time.“Considering the fragile business environment, STFC is looking to improve its capital adequacy ratio and debt-to-equity ratio and boost its lending business via this rights issue, “ said the first of the two persons.“They want to create a capital buffer and believe this is the right time to raise capital, get a competitive edge and move ahead of smaller rivals,” added the second person.Both the persons spoke to Moneycontrol on condition of anonymity.In response to an email query, ICICI Securities, HSBC, Citi and Credit Suisse declined to comment. Response from BNP Paribas, SBI Capital, Axis Capital & JP Morgan is awaited.An email response from STFC has been sought and the article will be updated once the response is in.STFC had last tapped the equity markets in January 2010, when it raised Rs 584 crore via a qualified institutional placement (QIP). Peer Mahindra & Mahindra Finance is also looking to raise up toRs 3500 crore via the rights issue route.Battling the COVID-19 environmentSTFC reported a 70 percent dip in its consolidated net profit at Rs 223.38 crore for the March quarter as it provided a substantial amount for provisions.  The non-banking financial company had reported a net profit of Rs 746.04 crore during the corresponding quarter a year ago. The promoters hold 26.25 percent stake in STFC and the company counts marquee global names like Fidelity Group, T Rowe Price, Invesco and South Africa’s Sanlam Life Insurance as its investors. Its products include commercial vehicle loans, life insurance, business loans, working capital loans and deposits.\"The company has used relevant indicators of moratorium, considering various measures taken by the government and other authorities along with an estimation of potential stress on probability of defaults and loss given defaults due to COVID-19 situation,\" it said.Based on such assessment, the company has made additional expected credit loss provision of Rs 909.64 crore on account of COVID-19 impact in the financial statement, it added.Brokerages believe many non-banks will seek fresh equity capital to pre-empt any worsening due to COVID-19. They estimate around $3.5bn-4.5bn of equity raising from this segment. The reasons include risk mitigation, cash conservation, confidence or growth capital and opportunity capital.\n       ",
    "Prabhudas Lilladher's research report on Shriram Transport FinanceOnly when we thought asset quality was on mend and liquidity overhang subsiding for SHTF, the pandemic shocks knocked both the aforesaid parameters yet again putting near term earnings under pressure. Q4FY20 witnessed 70%+ decline in PAT both YoY/QoQ to Rs2.2bn (PLe:Rs7.9bn) largely on account of Rs9.1bn COVID provisioning. Business trends stood weaker than expectations for 81-day quarter with AUMs at Rs1097bn (PLe:Rs1117bn) growing flattish QoQ (5% up YoY) led by slowing pace of used CV financing with avg growth of 1.4% over H2FY20. Disbursals at Rs109bn de-grew 5%QoQ as used CV disbursals were down 4%. While used CV has steadily risen, now at 86% of overall mix, SHTF stands as a bigger beneficiary of cyclical upturn on the used CV finance side. However, near term COVID led business impact looms large led by lower fleet utilization levels (50-70% Jun'20 and ahead), 70% AUMs under moratorium (May'20) & 80-90% (Jun-Aug'20), Rs80bn repayment obligations (Jun-Dec'20) and therefore liquidity maintenance taking precedence. While collection efficiency at 52% (May-end) does not stand sacrosanct with customers not paying in entirety, we believe asset quality pain to stay pronounced for FY21.OutlookAgainst this backdrop, we trim our growth estimates sharply to 4/10% (earlier 7/16%), maintain high order NPAs at 9%/8.2% & tweak credit costs estimate to 2.6% / marginally lower over FY21/FY22 resp. Consequently, our EPS estimates now stand lower by 31% for FY21 but marginally higher in FY22. As return profile takes a hit, RoEs fall below 15% respectable mark for FY22 prompting us to downgrade stock to Accumulate (earlier BUY). We assign multiple of 1x to BV of FY22 arriving at a price target of Rs809 (earlier Rs940).For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.  Read More",
    "YES Securities' research report on Shriram Transport FinanceQ4 FY20 for SHTF was tepid, characterized by marginal AUM accretion (1% qoq and 5% yoy), a flat NIM/NII (adjusted for notional FV change due to adverse currency movement), controlled opex growth, a small correction in Gross Stage-3 ratio (coverage ratio improved) and large Covid-related provisions (Rs9.1bn, 0.8% of AUM) dragging earnings. Collection efficiency in April and May was around 15% and 30% respectively, and the management expects significant uptick in June with increasing customers being able to deploy vehicles. SHTF did not seek moratorium from lenders till 31st May as it had robust liquidity. For the second phase (June-August), company has approached its bankers and expects most of them to provide consent. As on May 31, liquidity buffer stood at Rs.57bn. In Q2 FY21 and Q3 FY21 debt repayments are ~Rs40bn, which would be taken care by expected moratorium from banks/fresh funding (healthy sanction pipeline), improving collections and sustained traction in retail deposits (all branches activated), in addition to the aforesaid cash buffer. Capital position of SHTF is strong with Tier-1 capital at 18% and D/E at 5x. With the impact of Covid being inculcated in ECL model, the credit cost run-rate will remain elevated in coming quarters. Management expects worst case to be 3%.OutlookRetain BUY rating with a 12m TP of Rs880. Believe SHTF is better placed than peers on capital position and potential recovery in collection efficiency during June-August (resilient client base). SHTF trades at 0.9x/5.4x FY22 ABV/EPS. Visibility of RoA climbing back above 2% in FY22 will re-rate valuation.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.  Read More",
    "Motilal Oswal 's research report on Shriram Transport FinanceSHTF’s 4QFY20 PAT declined 70% YoY to INR2.2b (65% miss). While operating profit missed our estimates by 8% due to lower-than-expected NII, higher COVID-19 related provisions of INR9.1b led to the PAT miss. PAT declined 2% YoY in FY20 while RoA/RoE stood at 2.3%/15%. The company collected money from 84%/23%/52% of its customers in Mar/Apr/May’20 and in value terms it stood at ~15%/30% of Apr/May’20 collections. NIMs declined 38bp QoQ to 6.76% as the currency movement on forex borrowings and higher excess liquidity impacted margins. GS3 remained stable YoY and declined 36bp QoQ to 8.36%. We downgrade our EPS estimates by 11% for FY21E on the back of lower loan book growth. Our channel checks indicate that the used CV and driver-cum-operator segments (which are SHTF’s target segments) are doing much better than other segments in CV financing.OutlookWe believe risk-reward at the current level is favorable, Buy with a TP of INR960 at 1x PBV FY22E. In the current environment, the outlook on credit cost remains uncertain. We downgrade our EPS estimates by 11% for FY21E on the back of lower loan book growth. Maintain Buy with a TP of INR960 at 1x PBV FY22E.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.  Read More",
    "Emkay Global Financial's report on Shriram Transport FinanceOn operational front, SHTF delivered on expected lines, with the overall AUM growing at 5% yoy (+0.8% qoq) to Rs1097.5bn. Disbursements declined by 9.1% YoY (4.7% qoq) amid Covid-19 lockdowns, impacting the second half of March'20. Share of Used Vehicle in the total AUM has inched up to ~85.6% against 85% last quarter and ~83.3% last year.Net interest income remained flat on a yoy basis to Rs19.2bn, however, margins witnessed a sharp dip at ~676bps against ~714bps last quarter due to an elevated cost of funds during the quarter.OutlookEarnings conference call is scheduled on Thursday, June 11, 2020, at 8am IST, dial in number would be +91 22 6280 1216. The stock is trading at 0.7x FY22E P/Adjusted BV and 5.1x FY22E P/E. We have a Buy rating on the stock, with a TP of Rs679.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.  Read More",
    "Shriram Transport Finance Company on Wednesday reported a 70 percent dip in its consolidated net profit at Rs 223.38 crore for the quarter to March 2020.The non-banking financial company had reported a net profit of Rs 746.04 crore during the corresponding January-March quarter a year ago.Income during the quarter under review grew by 7.5 percent to Rs 4,173.04 crore as against Rs 3,883.38 crore in the same period of the preceding fiscal, Shriram Transport Finance said in a regulatory filing.\"The company has used relevant indicators of moratorium, considering various measures taken by government and other authorities along with an estimation of potential stress on probability of defaults and loss given defaults due to COVID-19 situation,\" it said.Based on such assessment, the company has made additional expected credit loss provision of Rs 909.64 crore on account of COVID-19 impact in the financial statement, the NBFC said.For the full fiscal year, net profit was nearly flat at Rs 2,501.84 crore as against Rs 2,563.99 crore in the preceding fiscal.Income in FY20 rose to Rs 16,582.63 crore from Rs 15,556.66 crore.Further, the company also declared that the interim dividend of Rs 5 per equity share paid in November 2019 shall be the final dividend for 2019-20 in order to conserve cash resources to face the challenges and the contingencies created by COVID-19.Its shares closed 2.57 percent up at Rs 635.45 apiece on the BSE.\n       ",
    "Prabhudas Lilladher's research report on Shriram Transport FinanceWe did highlight a quarter ago that SHTF balance sheet is on the path of mend and Q3FY20 healthy earnings set corroborates our stance. Amidst sectoral headwinds and funding challenges, SHTF put up decent 5%YoY AUM growth, remaining flat QoQ largely led by used CV loans that grew healthy 7.5%YoY/ 1.5%QoQ. The used CV mix inched up 207bps YoY to 85% supporting margins and growth alike. While funding pressures sustained for past couple of quarters, Q3 witnessed slight higher overseas borrowing costs coupled with excess balance sheet liquidity denting margins (719bps vs 714bps QoQ). Said that, this stood largely offset with sharp decline in credit costs by 86bps QOQ. With GNPAs declining 9bps QoQ and absolute GNPAs steady QoQ (mere 4% up YoY), asset quality stress has peaked out for SHTF. Management cited confidence with improved kharif and anticipation of better rabi crop, sustained used CV vehicle enquiries and rural cash flows remaining intact. While NIMs should witness slight pressures (7.2% by FY22), the same should rightly be offset by controlled credit costs (~200bps by FY22). This coupled with 14% AUM CAGR should translate into healthy 2.3% RoA and 15% RoEs over FY20-22E. While we slightly tweak down our AUM estimates (14% CAGR from 16% earlier over FY20-22E), pruning down of credit costs 1.9%-2.07% (earlier 2.1%) is generating 2-3% EPS uptick over FY20-22E. As SHTF stands as a bigger beneficiary of cyclical upturn on the used CV finance side, we reiterate BUY recommendation, valuing the stock at 1.5x PABV Sep-21E.OutlookOur price target stands at Rs1,444 (earlier Rs1,441); stock trades at attractive valuation largely pricing in all the concerns.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.  Read More",
    "Shriram Transport Finance on Thursday said it is looking to raise up to Rs 1,000 crore through bonds. The base size of the issue is Rs 200 crore with an option to retain oversubscription aggregating up to Rs 1,000 crore, the company said in a release.This is the second tranche of bonds to be issued by the non-banking finance company.\"The funds raised will be used for onward lending, financing and for repayment/ prepayment of interest and principal of existing borrowings of the company and for general corporate purposes,\" the release said.It is offering three- and five-year bonds with monthly, annual and cumulative interest payment options and seven-year bonds with monthly and annual interest payment options.The bonds will be offering a coupon in the range of 8.52-9.10 per cent under various interest payment options.The tranche-II issue will open for subscription on January 6 and is scheduled to close on January 22.The bonds will be listed on the National Stock Exchange and the BSE.\n       ",
    "Close to 50,000 commercial vehicles have been seized by financiers across India, reported the Business Standard, quoting data from Delhi-based Indian Foundation of Transport Research and Training (IFTRT). “There are about 150 repossession yards across the country and most of them are overflowing with commercial vehicles. These vehicles are lying with financers,” the article quoted SP Singh, senior fellow at IFTRT, as saying. The report compares the current slowdown to the ones in 2008-09 and 2012-13, and highlights a worrying trend that shows 40 percent vehicles being less than one year old. Moneycontrol could not independently verify the report. The ongoing slowdown and the tepid economic growth have dampened freight demand. For transporters, idling fleet and high operating costs (fuel, tyre and toll charges) have made the business unviable, which, in turn, is affecting loan payments, the report stated, adding that some had voluntarily surrendered their vehicles fearing default. But, for those looking to surrender, the task has not been easy, with banks demanding clearance of pending dues first, the report said, adding that even those looking to sell their vehicles were being offered half the rate for what they had paid just a year back. TT Srinivasaraghavan, Managing Director at Sundaram Finance, told the paper that the company had seen a rise in the number of repossessions off late but was quick to add that it was “in the 100s and not in 1,000s”. Even at Shriram Transport Finance, the largest financier of user commercial vehicles, things are stable. MD and CEO Umesh Rvankar told the daily that he was seeing no ‘increased activity’ on repossessions. Top officials at various non-banking financial companies (NBFCs) told the paper that a lender might opt for repossession if the default was for 70 days and it sensed no intent to pay, but there are cases of a delay of 120 days without the vehicle being seized. Banks and NBFCs are resorting to repossession only as a last resort, they added, as this does not benefit them, especially in a dull market. As per Srinivasaraghavan, the problem will continue until September 2020.\n       ",
    "To achieve the $5 trillion economy target, the government, earlier this year, constituted a high-level task force earmarking Rs 100 lakh crore for infrastructure projects by 2024-25.The task force, headed by the economic affairs secretary, will draw up a 'National Infrastructure Pipeline' of Rs 100 lakh crore, the finance ministry said in a statement. This would include greenfield and brownfield projects costing above Rs 100 crore each.The infrastructure sector has a big multiplier impact on the economy and experts feel that select stocks in the sector are likely to hog the limelight. However, for India to achieve its target of $5 trillion, economy might need participation from the private sector as well.“This Taskforce basically has a duty to identify and initiate projects that are technically viable and also economical. The government will also try to have those projects on priority which will accelerate job growths and will also show some rural connection where distress of income is high,” Pritam Deuskar, Fund Manager, Bonanza Portfolio Ltd told Moneycontrol.“Majority of these will be in Road projects that will connect first to industrial corridors and B group cities. We believe L&T, Dilip Buildcon, and KNR Construction can benefit from these road projects,” he said.Also, approximately 500 cities need to be connected for water supplies but there could be technical challenges too and also job creation and employment in infra projects and thereby in companies in Industrial MIDCs, business bays and SEZs become a priority.“Cement companies like UltraTech can also have good benefit from these projects. There will be affordable housing companies indirectly benefiting from these developments,” added Deuskar.The road to reach $5 trillion economy would be a combination of growth in domestic consumption, private capex, government capex and exports, suggest experts.“Domestic consumption, private capex, govt. capex and exports are not mutually exclusive. Capex has a multiplier impact on domestic consumption as well. With slowing down of domestic consumption and global trade wars hurting Indian global trades, key expectation for immediate GDP growth is on capex revival in the economy,” Shailendra Kumar, Chief Investment Officer - Narnolia Financial Advisors told Moneycontrol.“With low capacity utilisation levels for most of the private sector companies, all eyes are on the government measures for demand revival including infrastructure investments,” he said.Here is a list of the top 10 brokerage bets in the infrastructure space post June quarter results, with an investment horizon of 1 year:Brokerage Firm: Angel BrokingKEI Industries Ltd: Buy | Target Rs 556 KEI Industries current order book (OB) stands at Rs 4,414 crore (segmental break-up: out which EPC is around Rs 2,210 crore and balance from cables, substation & EHV). Its OB grew strongly in the last 3 years due to strong order inflows from State Electricity Boards, Power Grid, etc.KEI’s export (FY19 – 16 percent of revenue) is expected to reach a level of 20 percent in the next two years with higher-order execution from current OB and participation in various international tenders.Angel Broking expects KEI to report net revenue CAGR of 15 percent to Rs 5,632 crore and net profit CAGR of 22 percent to Rs 269 crore over FY2019-21E.GMM Pfaudler Ltd: Buy | Target: Rs 1570 GMM Pfaudler Limited (GMM) is the Indian market leader in glass-lined (GL) steel equipment used in corrosive chemical processes of agrochemicals, specialty chemical, and pharma sector.The company is seeing strong order inflow from the user industries which is likely to provide over 20 percent growth outlook for the next couple of years.GMM is likely to maintain the over 20 percent growth trajectory over FY19-21 backed by capacity expansion and cross-selling of non-GL products to its clients.Shriram Transport Finance: Buy | Target: Rs 1385 Shriram Transport Finance (SHTF's) primary focus is on financing pre-owned commercial vehicles. Angel Broking expects AUM to grow at CAGR of 13 percent over FY2019-21E led by pick up in infra/ construction Post 2019 elections, macro revival and Ramping up in rural distribution.Angel Broking expects STFC to report RoA/RoE to 2.7%/17.6% in FY2021E respectively. At CMP, the stock is trading at 1.2x FY2021E ABV and 6x FY2021E EPS, which the brokerage firm believes is reasonable for a differentiated business model with return ratios.M&M Ltd: Buy | Target: Rs 724 M&M is an India-based company, operating in nine segments: automotive, farm equipment, IT services, financial services, steel trading & processing, infrastructure, hospitality, Systech and Others (comprising logistics, aftermarket, two-wheelers, and investment).Angel Broking expects M&M to report healthy top-line and bottom-line growth over long period mainly due to healthy growth in automobile segment like Utility Vehicles (on the back of new launches and facelift of some models) and healthy growth in Tractors segment driven by strong brand recall and improvement in rural sentiment.Brokerage Firm: Sharekhan L&T: Buy | Target: Rs 1765L&T’s strong order backlog and healthy bidding pipeline provide comfort on achieving a 14 percent CAGR in consolidated net earnings over FY19-FY20.Sharekhan believes that L&T, being a quasi-domestic infrastructure play, is expected to benefit over the next five years, as the incumbent government envisages Rs. 100 lakh crore investments in infrastructure till 2024. It fine-tuned their estimates for FY20-FY21E.IRB Infrastructure: Buy | Target: Rs 150 Sharekhan believes that the induction of GIC as a financial partner for IRB resolves key issues of high leverage and easing of funding requirement of under-construction projects.On account of the removal of key hangovers mentioned above and improved growth outlook, we upgrade the stock to a buy with an unchanged target of Rs 150.The Ramco Cements: Buy | Target: Rs 870Sharekhan has fine-tuned our estimates for FY20-FY21 factoring in a marginal improvement in operating margins during FY20-FY21E on the back of strong pricing growth witnessed in Q1FY20.Ramco is well-placed to benefit in catering to the incremental demand emanating in Southern India with capacity expansions lined up.UltraTech Cements: Buy | Target: Rs 5000 Sharekhan has raised its net earnings estimates for FY20-FY21 factoring in a better pricing environment and improving the profitability of acquired units.The brokerage firm continues to believe that UltraTech, being a market leader, will benefit from the government’s focus on infrastructure and affordable housing segments.KNR Construction: Positive | Target Rs 293Sharekhan expects that an improvement in execution, receipt of appointed dates for the remaining projects and a likely betterment in sector outlook from H2 FY20 onwards would enable a re-rating KNR’s valuation multiples.Disclaimer: The views and investment tips expressed by investment expert on Moneycontrol.com are his own and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.",
    "Motilal Oswal's research report on Shriram Transport Finance1QFY20 PAT of INR6.3b was in line with our estimates. Disbursements declined ~9% YoY to INR122b driven by ~65% decline YoY in new vehicle disbursements. After two quarters of decline, used vehicle disbursements grew 3% YoY to INR113b. As a result, AUM grew 2% QoQ/ 6% YoY to INR1.06t. Growth in M&LCV remains healthy at 15% YoY, while it was subdued in other products. Tractor finance AUM declined 13% YoY. Portfolio mix remained largely stable QoQ with HCV comprising 46% of AUM and M&LCV/passenger vehicles comprising 22-23% of AUM each. During the quarter, SHTF raised ~INR35b in foreign currency borrowings. As these borrowings were at a higher cost, the overall cost of funds increased ~65bp QoQ to 9.2%. However, the company managed to pass this on to borrowers, resulting in calc. NIM remaining largely stable at 8%. Asset quality was largely stable with GNPL ratio of 8.5%. However, PCR declined 250bp QoQ to 32%.OutlookThe recent liquidity crisis has hit NBFCs hard and SHTF is no exception. Although the company diversified into newer sources like retail NCDs and ECBs, it has had to calibrate disbursements. As liquidity still remains tight, AUM growth is likely to pick up only in 2HFY20, in our view. Margins should be largely stable, while credit costs should settle at 2-2.2%. We keep our PAT estimates for FY20/FY21 largely unchanged. Maintain Buy with a TP of INR1,300 (1.4x FY21E BVPS).For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.  Read More",
    "Motilal Oswal 's research report on Shriram Transport FinanceOur analysis of Shriram Transport Finance's (SHTF) FY19 annual report indicates that the company has diversified its borrowing mix by raising INR100b from ECBs and retail NCDs (largely equal). But, these sources have been more expensive - the total landed cost of ECBs is ~10%, while that of retail NCDs is 9-10%. In addition, securitization deals have become dearer - the interest cost range of assets of 48-60 months maturity (which comprise half of total sell-downs) increased from 6.9-8.2% in FY18 to 8.3-10.4% in FY19. The annual report also provides several interesting disclosures on the asset quality front. After nearly doubling in FY18, slippages were largely stable YoY at INR66b in FY19. However, there has been a sharp increase in bad debt write-offs in FY19 - up 60% YoY to INR23.4b. Also, while Stage 3 assets (NPLs) have witnessed ~100bp improvement to 8.4% in FY19, it masks a deterioration in Stage 2 assets, which increased from 13% of total loans in FY17 to 18% in FY18 and 19% in FY19. Other key highlights: (a) SHTF has positive ALM with 38% (36%) of domestic loans + investments maturing in less than one year v/s 40% (38%) domestic liabilities (Borrowings + Deposits) in FY19 (FY18), (b) FY18 PAT upgraded by INR8.93b (+57%) on transition to Ind-AS from IGAAP, led by lower credit costs and additional revenue recognition, (c) Outstanding assets increased 16-17% for FY17/18 as the securitization pool needs to be recognized on the balance sheet, and (d) Network expansion remains healthy with 335/2,800+ branch and employee addition. With tight liquidity and calibrated disbursements, we expect AUM growth to pick up only in 2HFY20. Margins should remain largely stable.OutlookAsset quality trends will have to be closely monitored, and thus, credit costs in FY20. We have cut estimates by 10%+ for FY20-22 due to lower AUM growth and pressure on margins. Maintain Buy with a TP of INR1,300 (1.4x June 2021 BVPS).For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.  Read More",
    "Amid a slew of negative news, including a deep slowdown in the commercial vehicle segment, a soft Q4 and the recent stake sale by long-standing stakeholder Piramal, we are revisiting our investment thesis on Shriram Transport Finance. We feel the correction in the stock price (close to 28 percent decline in the past one year) merits attention of long-term investors.Soft performance in Q4 FY19Q4 FY19 turned out to be an exceptionally weak quarter that saw a\n                                    "
]