[
    "Tata Consumer shares slipped over five percent in trade on April 24, a day after the FMCG player's earnings show.Brokerages stayed bullish on Tata Consumer, despite the FMCG player's net profit falling under the Street's estimates, as EBITDA margins surpassed expectations.The owner of Tetley Tea and Ching's Secret noodles brands reported a net profit of Rs 217 crore for the fiscal fourth quarter, a fall of 19 percent from Rs 269 crore a year ago. Revenue increased 8.5 percent on-year to Rs 3,927 crore in the three months ended March 31.Brokerage house CLSA noted that higher depreciation and amortisation charges led to a miss of 6 percent on the pre-exceptional PAT, while Morgan Stanley said that the organic topline growth was lower than its estimates.The lower topline was a result of weaker growth in the India Beverages segment, as per Morgan Stanley. For the quarter, India Beverages grew 3 percent on-year and tea volumes remained flat.Also Read | Tata Consumer Q4 net profit falls 19% to Rs 217 croreThe tea business saw a margin share loss, while the market share of salt segment improved around 50 basis points. During February and March, the salt business reached its highest-ever market share of around 39.9 percent.Tata Consumer delivered an EBITDA margin of 16 percent, which was 90 basis points higher when compared to a Moneycontrol poll, which foresaw the EBITDA margin at 15.1 percent. The EBIDTA margin was the highest in 14 quarters.Morgan Stanley said the margin growth was aided by the Tata Group firm's strong expansion in the non-branded segments and its international business.The international brokerage reiterated its 'overweight' call on the firm, with a target price of Rs 1,305 per share. From the previous session's closing price, this indicates an upside of 11 percent.\"Tata Consumer continues to drive growth via innovation, distribution expansion and foray into new segments,\" Nuvama Institutional Equities said. The brokerage retained its 'buy' call, with a target price of Rs 1,400 per share, implying a 19 percent upside.CLSA, however, maintained its 'underperform' call, with a target price of Rs 1,288 apiece. This is 9.8 percent higher than the previous session's close.Over the past six months, shares of the Tata Group company have gained more than 30 percent. In comparison, the Nifty 50 index has gained around 15 percent.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Tata Consumer Products Ltd’s (TCPL) India Foods business grew 20 percent in the last quarter of FY24, continuing its double-digit growth trajectory.The business witnessed a volume growth of 4 percent with a 50 bps increase in salt market share. The food business LFL (Like for Like) revenue grew 11 percent. Like for like (LFL) growth is a measure of growth in sales, adjusted for new or divested businesses. (LFL Revenue Growth excludes Capital Foods. Volume growth also excludes Capital Foods.)For e-commerce, the India Foods business saw a 70 percent YoY growth in FY24.Salt revenue increased by 5 percent in the quarter driven by a 3 percent rise in volume and favorable product mix. Throughout FY24, salt revenues rose by 9 percent, with a volume increase of 4 percent. As part of the company's focus on premiumization, value-added salts experienced a 34 percent growth in FY24, comprising 9 percent of the India salts business. Salt touched its highest-ever market share of 39.9 percent in Feb-Mar’24.The Tata Sampann portfolio recorded a robust growth of 42 percent for the quarter. The full-year revenue growth for Tata Sampann was 45 percent. Tata Soulfull grew 42 percent in FY24.Tata Simply Better (plant based meat) introduced three new products- keema, biryani and chunks.Capital Foods’ products are now available at 95 percent of TCPL distributors.On April 23, the company reported a net profit of Rs 217 crore for the fiscal fourth quarter, a fall of 19 percent from the year-ago period. Revenue increased 8.5 percent to Rs 3,927 crore in the three months ended March 31, Tata Consumer said in an exchange filing. \n       ",
    "In the fiscal year 2024, the premium and sub-premium segments drove over two-thirds of Tata Consumer Products Limited's (TCPL) India Tea revenue growth.Key brands like Gold, Premium, and Tetley Green showed strong performance, reflecting a notable shift in consumer preferences towards higher-quality offerings, according to the company's filing.Tata Consumer maintained its market leadership in tea sales through E-commerce. They introduced Tata Tea Gold liquid premix and new flavors of Tata Coffee Gold on E-commerce platforms. Overall, India-branded tea sales grew by 7.3 percent in value.Also read: Tata Consumer Q4 net profit falls 19% to Rs 217 cr, firm declares dividend of Rs 7.75 per shareIn an investor presentation, the company mentioned that its moving annual total (MAT) market share for tea decreased by 30 basis points in volume and 50 basis points in value over the past year. MAT is the total value of a variable, such as sales figures for a product, over the course of the previous 12 months.Regarding the tea market environment, TCPL noted that tea prices in North India fell by 8 percent year-on-year due to abundant global supply, impacting Indian exports and domestic prices. South India experienced a 15 percent decrease in tea prices compared to the previous year. Kenyan tea prices remained stable year-on-year and quarter-on-quarter.In international markets, the US Regular Black Tea market declined by 2.7 percent in value, while the UK market saw a healthy 15 percent growth. The Canadian market also witnessed growth, with Canada Regular Black Tea up by 3.4 percent and Canada Speciality Tea by 5.3 percent.Also read: Tata Consumer completes Capital Foods integration, expands market reachOn April 23, the company reported a net profit of Rs 217 crore for the fiscal fourth quarter, down 19 percent from the same period last year. Revenue increased by 8.5 percent to Rs 3,927 crore for the three months ended March 31, as per Tata Consumer's exchange filing.\n       ",
    "Tata Consumer Products has completed the integration of Capital Foods, maker of Ching’s Secret and Smith & Jones food ingredients, within just 60 days of acquisition.The company said in an exchange filing that both back end and front end integration has been completed. Tata Consumer is leveraging their GTM (Go-to-market) strategy to deliver growth across channels while delivering on cost synergies.In January, TCPL had finalized deals to acquire full ownership of Capital Foods, known for brands like Ching’s Secret and Smith & Jones, as well as Organic India, a company specializing in organic teas and health foods. The acquisition costs Rs 5,100 crore for Capital Foods and Rs 1,900 crore for Organic India, with potential additional payments based on the companies' financial performance.TCPL aimed to integrate these acquisitions within the next three to four months, utilizing its distribution network to expand the reach of these brands domestically and internationally.TCPL unites the food and beverage interests of the Tata Group under one umbrella. The company’s portfolio includes tea, coffee, water, beverages, salt, pulses, spices, ready-to-cook and ready-to-eat offerings, breakfast cereals, snacks and mini meals.“Our recently announced acquisitions- Capital Foods and Organic India will be significant value creators for the company, enabling expansion into high growth, high margin categories. The front end and back-end integration for Capital Foods was completed within 60 days of transaction close. The transaction for Organic India closed on 16th April and we will focus on fast tracking integration of the business to unlock value.” said Sunil D’Souza, Managing Director & CEO of Tata Consumer Products in a statement.On April 23, the company reported a net profit of Rs 217 crore for the fiscal fourth quarter, a fall of 19 percent from the year-ago period. Revenue increased 8.5 percent to Rs 3,927 crore in the three months ended March 31, Tata Consumer said in an exchange filing.\n       ",
    "Tata Consumer Products Ltd, the owner of Tetley tea and Ching's Secret noodles brands, reported a net profit (attributable to owners) of Rs 217 crore for the fiscal fourth quarter, a fall of 19 percent from Rs 269 crore in the year-ago period.Revenue increased 8.5 percent to Rs 3,927 crore in the three months ended March 31, Tata Consumer said in an exchange filing on April 23.Revenue was largely in line but profit missed estimates. An average of six brokerage polled by Moneycontrol had pegged a revenue growth of 4.8 percent on-year at Rs 3,989 crore. The bottom line was expected to grow 13.4 percent to Rs 329 crore.The EBITDA margin was at 16 percent, up 190 basis points. EBITDA is short for earnings before interest, taxes, depreciation, and amortisation. One basis point is one-hundredth of a percentage point.\"In India, we solidified our Sales & Distribution infrastructure; our total reach has expanded to 4 million outlets as of March ’24. We implemented split routes in all 1 million + population towns and have seen significant improvement in assortment and growth. We are strengthening our Rurban focus and are deepening reach into rural areas. Alternate channels (modern trade and e-commerce) recorded significant momentum and continue to be strong growth drivers.\" said Sunil D’Souza, Managing Director & CEO of Tata Consumer Products.The India Packaged Beverages business delivered 2 percent revenuegrowth. The company continued to retain market leadership in tea in the E-commerce channel. Coffee continued its strong performance with a revenue growth of 45 percent for the quarter.Nourishco (RTD business) recorded revenue growth of 13 percent during the quarter, bringing FY24 growth to 33 percent.The company's sales & distribution infrastructure was further strengthened, expanding total reach to 4 million outlets as of March 2024. The reach was further deepened through the addition of 1300+ distributors in FY24, primarily in Rurban markets.Alternate channels continued to fuel our growth and innovation agenda Ecommerce channel grew 35 percent and Modern Trade recorded 9 percent growth in FY24. E- commerce accounted for 11 percent of India business in FY24, up from 9 percent last year.For the quarter, the International business revenue grew 7 percent (+5 percent constant currency).Tata Starbucks added 29 net new stores during the quarter and entered 6 new cities. This year saw the highest store addition at 95 stores. This brought the total number of stores to 421 across 61 cities.On BSE, Tata Consumer Products Limited closed trading on April 23 at Rs 1173.25 on BSE, up 0.07 percent from the previous day’s close.\n       ",
    "Tata Consumer Q4 FY24 earnings are set to beat the consumer sector blues, with industry-leading revenue growth in mid-single digit and robust margin expansion resulting in an even faster profit growth.The Tata group’s consumer staples firm will report its fiscal fourth quarter and full year earnings on April 23. Analysts expect the revenue growth to be the highest among industry peers, helped by beverage sales, rising volumes in salt, and acquisition of Capital Foods, owner of Ching's Secret brand.Tata Consumer revenue will grow by 4.8 percent on-year to Rs 3,989 crore, an average of six brokerage polls by Moneycontrol shows. The growth in bottom line is likely to be around 13.4 percent higher on-year at Rs 329 crore.The EBITDA margin is likely to expand 100 basis points on-year, supported by benign tea costs and stable salt cost. EBITDA is short for earnings before interest, taxes, depreciation, and amortisation. One basis point in  one-hundredth of a percentage point.Over the past six months, the Tata Consumer Products stock has risen around 33 percent against  a 15 percent rise in the benchmark Nifty during the period.Also Read | FIIs rush in for power sector shares in April, sell off FMCG, IT stocksThe Tata group company is expected to deliver a better 5-year volume CAGR than other players. The firm’s gross margins might see a steady improvement as a result of its healthy growth and market penetration of its international business, analysts said.Nuvama Institutional Equities said Tata Consumer’s growth will continue its strong trajectory. Capital Foods will contribute to the topline for around two months in Q4, the brokerage said.The consumer staples sector is likely to clock a subdued revenue growth in the March quarter on muted demand environment. The rural demand continued to languish, dragging volumes. Low farm income and the rise of unorganised competitors are also hurting larger companies' sales.Yet, the industry, including Tata Consumer, will see low to mid-single digit growth, instead of a fall in volumes, as a result of price cuts and increases in grammage, analysts have said.Gross margins across the FMCG universe will see a small increase. Consumer companies have increased their share of advertisements and promotion spends to bolster brand image and market share over the past few quarters.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "The market went into the red after a green sweep for five weeks in a row and fell more than 2 percent at the end on March 15. Given the nervousness in the Street, bears took the plunge, paving the road for more volatility with a negative bias in the coming sessions. Experts see support for the market barometer at 21,900-21,850 and, below this, the bears will have a wider room to run the riots. On the higher side, the Nifty may face resistance at 22,200-22,300 and a decisive close above this may charge the bulls to drive the index to record highs.For the week ended March 15, the Nifty 50 declined 470 points to 22,023 and formed a long bearish candlestick pattern which resembles Evening Star kind of a pattern (not the exact one) on the weekly charts with high volumes.On the downside, there are visible multiple bottoms on the hourly chart in the range of 21,900 to 21,850, coinciding with the 50EMA (exponential moving average), suggesting critical support, Rajesh Bhosale, technical analyst at Angel One said. \"Further decline below this level may trigger another round of significant selling, potentially pushing prices towards the previous swing low of 21,500, aligning with the 89EMA.\"Going ahead, he advised caution and asked traders to refrain from attempting to catch the falling knife and, instead, wait for clear bullish reversal signals before considering aggressive long positions.Jigar Patel, senior manager of equity research at Angel One, also feels that on the downside, 21,850 stands as a crucial support level, and a breach of this level might push the index towards the 21,600 level.The current breakdown would only be invalidated if the index closes above 22,200, said Patel, who feels the market uncertainty will likely dissipate by the end of the month, allowing the markets to resume their primary upward trend.Moneycontrol collated a list of top 10 stocks from experts, with 3-4 weeks perspective. The closing figure of March 15 is considered for the stock return calculation.Expert: Shrikant Chouhan, Head Equity Research, Kotak Securities.ICICI Prudential Life Insurance Company: Buy | LTP: Rs 567 | Stop-Loss: Rs 545 | Target: Rs 610 | Return: 7.4 percentAfter the remarkable up move of the last few sessions, the counter witnessed short-term correction from the higher levels. However, closing above the important retracement levels suggest bullish continuation chart formation.Therefore, the counter is likely to resume its uptrend from the current levels in the near term.L&T Technology Services: Buy | LTP: Rs 5,419 | Stop-Loss: Rs 5,210 | Target: Rs 5,790 | Return: 7 percentPost decline from the higher levels, the counter rebounded from its demand zone and witnessed a steady recovery from the lower levels. Additionally, on the daily charts, the counter has given a breakout from its sloping channel formation. The up moves in the counter suggest a new leg of bullish trend from the current levels.Bharti Airtel: Buy | LTP: Rs 1,220 | Stop-Loss: Rs 1,170 | Target: Rs 1,300 | Return: 7 percentThe counter is into a rising channel chart formation with a higher low series pattern on a consistent basis. After a sharp uptrend rally, the counter comfortably closed above its previous swing high. In addition, on daily charts the counter has formed bullish continuation chart formation, which indicates strong up move to persist in the near term.Expert: Riyank Arora, technical analyst at Mehta EquitiesUPL: Buy | LTP: Rs 475 | Stop-Loss: Rs 440 | Target: Rs 505 | Return: 6 percentThe stock has touched its major support mark of Rs 460 on its daily charts and is forming a potential double bottom reversal pattern. The overall volume in Friday's session was nearly 1.5 times the average (10-day) volume.At the current market price of Rs 475, the risk is minimal, and the stock is looking poised for a good upside move towards Rs 500 - Rs 505 zone.Action Construction Equipment: Buy | LTP: Rs 1,241 | Stop-Loss: Rs 1,190 | Target: Rs 1,330/1,420 | Return: 7 percentThe stock has successfully re-tested its anchor VWAP (volume-weighted average price) support mark of Rs 1,220 and managed to hold well above the same. From a broader perspective, the stock has a minor resistance near Rs 1,330 mark, above which the next hurdle would be somewhere near Rs 1,420 levels.On its hourly charts, the stock is forming a potential higher low at around Rs 1,200 levels. The risk-reward looks favourable on the buy side at the current market price with a set stop-loss at Rs 1,190 mark for potential targets of Rs 1,330 and Rs 1,420.Expert: Om Mehra, technical analyst at SAMCO SecuritiesPidilite Industries: Buy | LTP: Rs 2,868 | Stop-Loss: Rs 2,770 | Target: Rs 3,050 | Return: 6 percentThe stock formed higher highs and higher lows in the daily chart. It is trading above 20 and 50 DMA (days moving average) indicating strength in price action.The positive crossover is indicated in MACD (moving average convergence divergence) while RSI (relative strength index) stands at 70 levels.The stock is sustaining above the Rs 2,800 levels (crucial resistance) with decent volumes pointing out buying interest among short-term traders.Hence, based on the above technical structure, one can initiate a long position at CMP Rs 2,868 for a target price of Rs 3,050. The stop-loss can be kept at Rs 2,770.Tata Consumer Products: Buy | LTP: Rs 1,212 | Stop-Loss: Rs 1,155 | Target: Rs 1,310 | Return: 8 percentAfter a decent correction, the stock reveals a strong recovery, forming a sturdy base around Rs 1,160 levels. The stock is currently trading above the 20 SMA (simple moving average) indicating positive momentum. The daily chart reveals price is ticking up with a rise in trading volumes. The RSI is gradually inching higher suggesting bullishness in stock.Hence, based on the above technical structure, one can initiate a long position at CMP Rs 1,212 for a target price of Rs 1,310. The stop-loss can be kept at Rs 1,155.Expert: Jigar Patel, senior manager - equity research at Anand RathiITC: Buy | LTP: Rs 419 | Stop-Loss: Rs 390 | Target: Rs 475 | Return: 13 percentAfter reaching a peak near Rs 475 mark on January 4, 2024, ITC has experienced a significant decline of 16 percent. However, in the subsequent 18 trading sessions, ITC has shown stability by avoiding further declines and has instead consolidated within a range of Rs 400-416. Notably, in the previous trading session, there was notable buying interest observed at lower levels, accompanied by substantial trading volume.From a technical standpoint, the formation of a bullish AB=CD pattern on the daily chart of ITC within the mentioned price zone of Rs 400-416. Interestingly, this zone also coincides with the 0.382 percent retracement level of a price swing that occurred between January 2023 and July 2023, as indicated on the chart.Additionally, it has formed complex structure forming on the daily RSI indicator, resembling a 'W shape' below the 30 level, which suggests a potentially lucrative buying opportunity.Thus, one can buy in the zone of Rs 415-425 with an upside target of Rs 475 and a stop-loss would be placed near Rs 390 on a daily close basis.Britannia Industries: Buy | LTP: Rs 4,974 | Stop-Loss: Rs 4,790 | Target: Rs 5,250 | Return: 5.5 percentFollowing a peak near Rs 5,386 level, Britannia experienced a significant decline of almost 11 percent in its value. However, over the past couple of months, Britannia has stabilized around Rs 4,800 levels, forming a prolonged support base. Notably, this level coincides with the 200-day exponential moving average (DEMA) and represents a 50 percent retracement of its previous upward movement from November 2023 to December 2023, as depicted in the provided chart.Additionally, a bullish AB=CD pattern has emerged near Rs 4,800 level, further confirming positive market sentiment. Furthermore, the daily stochastic indicator indicates a bullish divergence, suggesting a favourable outlook for theTherefore, investors may consider initiating buy positions within the range of Rs 4,950-4,980, targeting an upside objective of Rs 5,250, with a stop-loss set at Rs 4,790 on a daily closing basis.Aegis Logistics: Buy | LTP: Rs 381 | Stop-Loss: Rs 355 | Target: Rs 430 | Return: 13 percentOn March 7, 2024, Aegis Logistics reached a high of Rs 455. Since then, it has experienced a significant decline of 21.5 percent in its price. Presently, the stock has found support at the 200-day exponential moving average (DEMA). Additionally, on the hourly chart, a bullish BAT pattern has formed in the range of Rs 360-370 levels, coinciding with the vicinity of the 200 DEMA.Furthermore, on the indicator front, the hourly RSI has displayed a complex structure near the oversold zone, indicating a bullish stance.Given these technical indicators, investors may consider buying in the zone of Rs 375-385, with an upside target set at Rs 430. A prudent stop-loss strategy would involve placing it near Rs 355 on a daily closing basis.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Shares of several Tata group firms fell up to 10 percent on March 11 amid reports that Tata Sons was unlikely to go for an initial public offering in near future. In the week gone by, the IPO buzz led to several group stocks surging up to 36 percent.The four best-performing stocks in the BSE500 pack were all from the salt-to-software conglomerate but as reports went from Tata Sons' \"imminent\" listing to \"improbable listing\", investors booked profits in several stocks.Tata Sons is registered as a CIC with the Reserve Bank of India and has been classified as an \"upper layer\" NBFC, which requires the company to list on exchanges within three years of being notified.The RBI issued a notification to this effect for Tata Sons in September 2023, which means Tata Sons has to list by September 2025.Follow our market blog to catch all the live actionThe parent company of several Tata group firms, however, is reportedly considering various avenues to adhere to RBI norms.Last week, Spark Capital identified Tata Chemicals as the only potential play in the IPO and the stock had surged 36 percent. The stock, however, plunged over 10 percent in early deals after reports said an IPO was unlikely.Tata Investment Corp stock fell to 5 percent lower circuit and Tata Technologies and Tata Consumer Products stock fell around 3 percent each. Tata Teleservices fell 2 percent, and Tata Steel and Tata Power Company stocks were down over a percent. While Indian Hotels Company stock fell nearly a percent, Tata Motors shares were also down half a percent.Also Read | Tata Chemicals stock plunges 10% as Tata Sons seeks options to avoid IPOIf launched, Tata Sons' IPO was estimated to be the biggest ever, even supassing Life Insurance Corporation of India’s Rs 21,000 crore offer. Spark’s report said Tata Sons could be valued at Rs 7-8 lakh crore through the IPO, based on the current market capitalisation of group companies.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "By Vidnyan Sawant, HOD - Research at GEPL CapitalAfter consolidating for two months, the Nifty index is now displaying signs of breaking out, reaching fresh all-time highs and forming higher tops and higher bottoms on the monthly timeframe, indicating bullish strength for the longer term.On the weekly charts, the Nifty has been consistently hitting record highs over the past three weeks and maintaining levels near the top, indicating strong confidence among market participants.In the shorter term, particularly on the daily timeframe, the index has been exhibiting a positive structure with higher highs and higher lows, while finding solid support at the 34-day EMA (exponential moving average) for the past three months.Key technical indicators such as the relative strength index (RSI) are also favourable, with readings above 65 across daily, weekly, and monthly intervals, signaling positive momentum.Looking forward, immediate resistance levels are noted at 22,780, representing Fibonacci Extension levels, with further resistance at 23,000. Crucial support levels are identified at 22,000 and 21,800.Given the current chart patterns, a strong bullish phase is anticipated. It is recommended to consider buying at the current market price, with potential upside targets ranging from 22,780 to 23,000 levels. To effectively manage risks, it is advised to implement a strict stop-loss at 22,000 on a closing basis.Here are three buy calls for the next 2-3 weeks:ICICI Prudential Life Insurance Company: Buy | LTP: Rs 583.6 | Stop-Loss: Rs 533 | Target: Rs 696 | Return: 19 percentICICI Prudential Life has demonstrated remarkable resilience, notably since hitting its 52-week low in March 2023. The stock has been consistently advancing within a bullish trajectory. In a recent noteworthy development, the stock has broken out of a Flag and Pole chart pattern, coinciding with a downward sloping channel originating from its September 2021 all-time high. This breakout was accompanied by a significant surge in trading volume, surpassing the 21-week average volume, indicating positive momentum.Additionally, ICICI Prudential Life has maintained its position above both the 12-week and 26-week exponential moving averages (EMA), further consolidating the bullish trend.Momentum indicators such as the RSI and Moving Average Convergence Divergence (MACD) support this bullish sentiment. The MACD has signaled a positive crossover, while the RSI stands at a robust 60, indicating the strength of the trend by substantial momentum.Looking forward, there is an anticipation of further price ascent towards Rs 696 mark. It is recommended to set a stop-loss at Rs 533, strictly based on the closing basis.Shriram Finance: Buy | LTP: Rs 2449.55 | Stop-Loss: Rs 2,249 | Target: Rs 2,885 | Return: 18 percentSince March 2022, Shriram Finance has demonstrated a robust price structure, characterized by a consistent upward trend. Notably, in June 2023, the stock broke out of a volatility contraction pattern (VCP), leading to the formation of higher highs and higher lows. This trend signifies a bullish momentum.Moreover, Shriram Finance has shown a strong adherence to the 12-week and 26-week moving averages, indicating the strength of the prevailing trend.The momentum of Shriram Finance is further supported by the RSI, which has consistently remained above 60 across various timeframes. This suggests sustained strength in the upward trajectory of the stock.Furthermore, when comparing Shriram Finance to the Nifty through a ratio chart, there's a continuous upward trend, indicating persistent outperformance compared to the broader market.Going ahead, we expect the prices to go higher till the level of Rs 2,885, the bullish view will be negated if we see prices sustaining below Rs 2,249 level.Tata Consumer Products: Buy | LTP: Rs 1,261.55 | Stop-Loss: Rs 1,163 | Target: Rs 1,518 | Return: 20 percentTata Consumer Products demonstrates a robust price structure, with a clear uptrend observable since October 2001, characterized by higher highs and higher lows over the long term. Presently, the stock is maintaining its position above the congestion zone and is trading at its all-time high, indicating significant strength in the current uptrend.The trend support is further strengthened by the stock's ability to remain above both the 12-week and 26-week moving averages. Additionally, a bullish crossover on the MACD indicator occurring in positive territory adds momentum to the ongoing upward trend, affirming the bullish sentiment surrounding Tata Consumer Products.Moreover, when analyzing Tata Consumer Products against the Nifty using a ratio chart, a continuous upward trend is evident, suggesting sustained outperformance compared to the broader market.Looking forward, there is an anticipation of further price ascent towards Rs 1,518 mark. It is recommended to set a stop-loss at Rs 1,163, strictly based on the closing basis.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "The Nifty 50 index showed volatility throughout the session on March 6 but closed on a strong note. The short-term trend appears positive, as the index concluded the day above the 21-day EMA (exponential moving average) of 22,120 on the daily chart.The momentum indicator RSI (relative strength index) shows a bullish crossover, indicating a positive momentum for the short term. The bulls are likely to maintain control as long as the index stays above 22,350.Looking ahead, there is potential for the Nifty to reach a level anywhere between 22,600 and 22,700 on the higher end.The Bank Nifty index remains under the influence of a bullish trend, approaching its all-time high levels. The ongoing bullish sentiment is evident, backed by a robust support zone at 47,500-47,400 that serves as a defensive line for the index.Anticipated to surpass its historical highs in the next few trading sessions, the Bank Nifty sets its sights on upside potential targets at 49,000/50,000 in the near term.Here are three buy calls for short term:Axis Bank: Buy | LTP: Rs 1,125 | Stop-Loss: Rs 1,095 | Target: Rs 1,265-1,290 | Return: 15 percentAxis Bank has exhibited a robust breakout on the daily chart, breaking free from a parallel uptrend channel with significant volumes. Supporting the bullish momentum, the momentum indicator RSI has undergone a positive crossover.The lower-end support is firmly established at Rs 1,095, serving as a cushion for the bulls. Upside potential targets for the stock are set at Rs 1,160 and Rs 1,185.Zensar Technologies: Buy | LTP: Rs 563.5 | Stop-Loss: Rs 520 | Target: Rs 610-630 | Return: 12 percentZensar Technologies has exhibited a robust bullish reversal, forming a compelling candle on the daily chart alongside a sharp surge in volumes. The stock is positioned for a breakout from a falling trendline, strategically placed at Rs 575.Notably, Zensar Technologies has surpassed its 20-day moving average with breakthrough volumes, underscoring the stock's inherent strength. The lower-end support is firmly established at Rs 520, serving as a cushion for the bulls. Upside potential targets for the stock are set at Rs 610 and Rs 630.Tata Consumer Products: Buy | LTP: Rs 1,220 | Stop-Loss: Rs 1,178 | Target: Rs 1,280/1,300 | Return: 6.5 percentTata Consumer Products has been exhibiting an upward trend, forming higher highs and higher lows on the weekly timeframe. The stock recently experienced a breakout from a consolidation phase on the daily chart, signaling increased optimism.Furthermore, the overall trend remains positive as the stock is trading above the crucial moving average on the daily timeframe. The daily RSI has crossed into bullish territory, reinforcing a positive short-term momentum.In the near term, the stock is poised to trade with a positive bias. Investors may consider initiating a long position with a potential target set at Rs 1,300. On the downside, a support level is identified at Rs 1,178.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "KR Choksey's research report on Tata Consumer ProductsFor Q3FY24, TATACONS’ consolidated revenue grew by 9.5% YoY/ 1.9% QoQ to INR 38,039 Mn, driven by strong performance across India and International business. Revenue was 1.3% lower than our estimate but remained at healthy levels. Revenue for 9MFY24 grew by 11.0% YoY to INR 112,789 Mn. EBITDA for the quarter was INR 5,724 Mn, a growth of 26.2% YoY/ 6.6% QoQ, largely in line with our estimate. EBITDA margin expanded by 199 bps YoY/ 66 bps QoQ to 15.0%, led by improved profitability across businesses. For 9MFY24, EBITDA grew by 23.0% YoY to INR 16,545 Mn while EBITDA margin expanded by 144 bps YoY to 14.7%, mainly driven by strong improvementin international and non-branded margins. Q3FY24 PAT was INR 2,789 Mn, a decline of 20.7% YoY/ 17.6% QoQ, impacted by exceptional items of INR 915 Mn. Adj. PAT was at INR 3,704 Mn (+35.6% YoY/ +5.0% QoQ). For 9MFY24, PAT was flattish YoY at INR 9,337 Mn while Adj. PAT grew by 35.8% YoY to INR 10,449 Mn. TATACONS’ focus on driving growth through organic as well as inorganic expansion will lead to continuing double-digit topline growth in the medium term. Organic growth will be driven by distribution expansion, innovation and premiumization. TATACONS will continue to see margin improvement due to improving international margins, improving scale of the Growth businesses and continued cost rationalization. The addition of Capital Foods (CF) and Organic India (OI) will ramp up the share of high-growth businesses and improve profitability due to the superior margins of the acquired business and further integration benefits.OutlookWe have valued TATACONS on a SOTP basis based on FY26E segmental EBITDA for all businesses except Starbucks which is valued on FY26E Revenue basis. For India Business (excluding CF and OI), we apply an EV/EBITDA multiple of 40.0x; for OI, we apply an EV/EBITDA multiple of 40.0x; for CF, we apply an EV/EBITDA multiple of 44.0x; International Business, we apply an EV/EBITDA multiple of 15.2x; and for Starbucks business, we apply an EV/Revenue multiple of 2.9x. Accordingly, we revise our target price to INR 1,352 per share (INR 1,322 earlier), an upside of 17.1% over the CMP. Accordingly, we reiterate a “BUY” rating on the shares of Tata Consumer Products Ltd.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Tata Consumer Products - 22022024 - kr ",
    "Net Sales at Rs 3,803.92 crore in December 2023 up 9.48% from Rs. 3,474.55 crore in December 2022.Quarterly Net Profit at Rs. 278.87 crore in December 2023 down 20.72% from Rs. 351.76 crore in December 2022.EBITDA stands at Rs. 631.97 crore in December 2023 up 25.74% from Rs. 502.59 crore in December 2022.TATA Cons. Prod EPS has decreased to Rs. 3.00 in December 2023 from Rs. 3.79 in December 2022.TATA Cons. Prod shares closed at 1,166.20 on February 07, 2024 (NSE) and has given 39.20% returns over the last 6 months and 60.15% over the last 12 months.",
    "Net Sales at Rs 2,352.22 crore in December 2023 up 9.24% from Rs. 2,153.31 crore in December 2022.Quarterly Net Profit at Rs. 280.91 crore in December 2023 up 18.4% from Rs. 237.26 crore in December 2022.EBITDA stands at Rs. 443.11 crore in December 2023 up 19.27% from Rs. 371.51 crore in December 2022.TATA Cons. Prod EPS has increased to Rs. 3.02 in December 2023 from Rs. 2.56 in December 2022.TATA Cons. Prod shares closed at 1,166.20 on February 07, 2024 (NSE) and has given 39.20% returns over the last 6 months and 60.15% over the last 12 months.",
    "KR Choksey's research report on Tata Consumer ProductsTATACONS announced 2 separate acquisitions: (1) 100.0% equity shares of Capital Foods, owner of the brands ‘Ching’s Secret’ and ‘Smith & Jones’, in a phased manner, with 75.0% to be acquired upfront and the balance 25.0% to be acquired within the next three years. Enterprise value on ‘no cash/no debt basis’ for 100.0% stake is INR 51 Bn, valuing Capital Foods at 6.8x FY24E Net Sales. (2) 100% of the equity share capital of Organic India from Fabindia Ltd. at an enterprise value on a ‘no cash/no debt basis’ of INR 19 Bn, along with an additional earn out for the shareholders linked to FY26E audited financials of the Target Company. The transaction values Organic India at 5.2x FY24E Net Sales. Both acquisitions are expected to be completed by Q4FY24E, with operational integration to be completed in 3-4 months after closing. These 2 acquisitions will lead to significant double-digit revenue growth and margin accretion in the near term for TATACONS. EPS breakeven is expected to be achieved in the 2 nd year of operations (based on an assumed mix of debt and equity funding by TATACONS). TATACONS plans to finance the acquisitions through a combination of cash reserves on the balance sheet, debt in the form of commercial papers/ debentures, and equity issuance through Rights Issue or any other mode (subject to Board approval on 19th January 2024).OutlookWe have valued TATACONS on a SOTP basis. For India Business, we apply an EV/EBITDA multiple of 43.5x (earlier 38x) to FY26E EBITDA; for International Business, we apply an EV/EBITDA multiple of 15.2x (unchanged) to FY26E EBITDA; and for Starbucks business, we apply an EV/Revenue multiple of 2.9x (earlier 3.2x) to FY26E Revenue. Accordingly, we revise our target price to INR 1,322 per share (INR 1,066 earlier), an upside of 16.1% over the CMP. Accordingly, we reiterate a “BUY” rating on the shares of Tata Consumer Products Ltd.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Tata Consumer Products - 18012024 - kr ",
    "HighlightsTata Consumer Products Ltd’s (TCPL; CMP: Rs 1,139; Market capitalisation: Rs 105,768 crore; Rating: Overweight) India branded business, which accounts for 15 percent of consolidated revenues, has grown in double digit.With two recent acquisitions, the share of the branded foods business is likely to be higher. TCPL will now be present\n                                    ",
    "Sharekhan's research report on Tata Consumer ProductsTata Consumer Products Limited (TCPL) is set to acquire Capital Foods and Organic India, which fit well within key growth platforms, including premiumization and value accretion in the portfolio. There is significant potential to leverage TCPL’s strong distribution network, global presence and increasing scale with scope for operating efficiencies to drive profitability. Acquisitions would be done at combined enterprise value (EV) of Rs. 7,000 crore; and funded through a mix of internal accruals/debt/equity. It will be earnings accretive in FY26E (in mid-single digits based on calculations).OutlookStock trades at 58x/52x its FY2025E/26E EPS. Acquisitions will add strong value to portfolio and earnings in the medium to long run. We maintain a Buy with a revised PT of Rs. 1,315.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Tata Consumer Products - 16012024 - khan ",
    "Tata Consumer Products traded in the red as the FMCG company signed a definitive agreements to acquire a 100 percent stake in Capital Foods, the owner of Ching’s Secret and Smith & Jones, and Organic India in a phased manner.At of 12.55 pm, Tata Consumer Products was trading at Rs 1,143.1, down 1.37 percent on the NSE from the previous session.The enterprise value on a \"no cash/no debt basis\" for 100 percent of Capital Foods is Rs 5,100 crore. While  75 percent of the equity shareholding will be acquired upfront, the remaining 25 percent will be acquired within the next three years.Follow our market blog to catch all the live updatesThe Tata Group company also signed definitive agreements to acquire up to a 100 percent stake in Organic India, an organic brand spanning food and beverages and herbal and traditional supplements. The enterprise value of a \"no cash/no debt basis\" for 100 percent of Organic India is Rs 1,900 crore.The company said its board will meet on January 19 to consider fundraising via debt issues and equity issues through rights issues.The recent acquisitions of Capital Foods and Organic India come as bad news for the company’s return on equity (RoE) and return on capital employed (RoCE), said Alok Shah of Ambit Capital. He assumes borrowing worth Rs 5,000 crore against immediate acquisition cost of Rs 5,725 crore and cash balance of Rs 1,500 crore.In a note to investors, he said, \"This (borrowing) will be arranged via rights issue too which would lead to higher equity base, impacting return ratios.\" This could lead to net profit cut of 10 percent in FY26 and RoCE dip of 350-400 basis points.Also Read | Tata Consumer's acquisitions seem like good buys but its valuation screams 'goodbye'In a note, JM Financial wrote that the immediate task following the acquisition would be to leverage Tata Consumer’s distribution scale to unlock value in the estimated total addressable market to improve profitability. “This, in our view, could take a couple of more years of work versus the management’s guidance of breaking even in year two,” said the brokerage.The FMCG player’s share price jumped almost 20 percent over the past month. In comparison, the Nifty 50 index gained around 2.8 percent during the same time period.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Tata Consumer Products on January 12 announced two big acquisitions — Capital Foods and Organic India — for Rs 7,000 crore but its pricey valuation indicates that the good news may already be in the price.Tata Consumer's trailing-12-month price-to-earnings ratio of 54x is in-line with its peers despite a lower pace of sales and profit growth as well as single-digit return on equity (RoE). Its return on capital employed (RoCE) is also significantly lower than peers.Low RoE indicates that a company generates relatively little return on shareholder's equity. A low RoCE indicates that a company is not using its capital efficiently. Both are keenly monitored by investors.The recent acquisitions of Capital Foods and Organic India come as further bad news for RoE and RoCE, said Alok Shah of Ambit Capital. He assumes borrowing worth Rs 5,000 crore against immediate acquisition cost of Rs 5,725 crore and cash balance of Rs 1,500 crore.In a note to investors, he said, \"This (borrowing) will be arranged via rights issue too which would lead to higher equity base, impacting return ratios.\" This could lead to net profit cut of 10 percent in FY26 and RoCE dip of 350-400 basis points, he added.One basis point is one-hundredth of a percentage point.Also Read: Tata Consumer plans to raise funds for Capital Foods acquisition via CPS/ rights issue, says Sunil D'SouzaTata Consumer's sub-par performanceWhen it comes to topline growth, Tata Consumer has struggled to keep pace with its peers as it has not been able to create strong enough brands. It has also been losing market share in tea and salt businesses. So, its strategy has been to acquire brands, which burns cash, analysts said.\"They haven't created many consumer brands like other FMCG biggies, so the new acquisitions will help in rapid growth of its portfolio of brands,\" said Sreedhar Prasad, former partner and head of consumer business at KPMG in India.Tata Consumer has been scouring for new acquisitions for quite some time now. Over the past year, it had been in talks to acquire Bisleri and Haldiram's as well.Also Read: MC India Inc CEO Survey: Executives strap in for unchanged inflation, interest ratesTata Consumer’s growth push started in 2020 when as part of a restructuring it acquired brand and sales and distribution network of consumer food business of Tata Chemicals, which included primarily Tata Salt and Tata Sampann. It then acquired PepsiCo's stake in NourishCo and 100 percent stake in Soulfull Cereals.The company has also been spending significant time in streamlining its business and simplifying its corporate structure. It recently merged Tata Coffee and TCPL Beverages into it. Most of these businesses do not offer margin accretive opportunities, analysts say.Tata Consumer's operating margins have remained in 10-13 percent band over the past 10 years.Also Read: HCL Tech Q3 beats estimates, all eyes on WPI inflation & more | Market MinutesWill Capital Foods and Organic India help? According to Ambit's Shah, the company had no choice but to expand its total addressable market via the inorganic route.\"Organically, except for water, there were no revenue/margin/RoCE accretive scalable opportunities in its current portfolio. Acquisitions of Capital Foods and Organic India optically fits well as it fills whitespaces in Tata Consumer's food and beverages portfolio,\" he said.According to Prasad, the game will now intensify in omnichannel distribution. That is how the company can propel growth.\"OI is a niche brand with good acceptance among premium customers, while Capital Food's Ching's has had a clear positioning in the Indo-Chinese space. It now depends on how aggressive will TCPL be in scaling these using their pan India distribution,\" he said.Also Read: India Inc CEO Survey: 53% believe India will soon become a competitive manufacturing hubTata Consumer has total reach of 3.8 million outlets, with 1.5 million being direct reach. It has over 10,000 channel partners including distributors and sub-distributors.Capital Foods is expected to clock Rs 936 crore gross revenue in FY24, with around 50 percent gross margin and 20 percent EBITDA margin. On the other hand, Organic India grosses Rs 350 crore annually with high quality products focused on sustainable living and 55 percent gross margin.While Tata Consumer now has a good bouquet of products in its portfolio, its high valuation seems to have factored in all the good news. Till the synergies and execution efficiencies are clearly visible, further multiple rerating seems unlikely, said analysts.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Tata Consumer Products, which on January 12 announced its plans to acquire a 100 percent stake in Capital Foods, is looking to raise funds for the acquisition via CPS/ rights issue, said Sunil D'Souza, Managing Director and Chief Executive Officer of Tata Consumer Products, in an interview to CNBC-TV18.Capital Foods' revenue is likely to scale in \"high double-digits\" over the next few years, he said, adding, \"We expect the current businesses of Tata Consumer to scale well.\"The company expects to fortify its pantry platform and increase the scope of its product line through the acquisition, the CEO & MD said.Commenting further on the acquisition of Capital Foods, which markets its products under Ching’s Secret and Smith & Jones, D'Souza said: \"The acquisition of Ching’s, Smith & Jones completes the entire cuisine breadth of TCPL’s portfolio, there is an immediate margin synergy of 400 bps with Capital Foods.\"“We believe this is a good strategic and financial fit. It will open up significant market opportunities in the fast-growing non-Indian cuisines segment, leveraging the sales and distribution platform that we have built. The strong brand recall of Ching’s Secret and Smith & Jones coupled with our operational strength across channels makes us extremely confident of driving topline growth and realizing cost synergies,\" he added.D'Souza said he expects the deal to be EPS accretive from the second year.Earlier this week, TCPL announced the acquisition of Organic India, a health and wellness company supported by Fab India, for an enterprise value of Rs 1,900 crore. \"Organic Foods can be at a high-teens margins on a steady state, ex-synergies,\" he said.\n       ",
    "Tata Consumer Products on January 12 said it will acquire up to 100 percent stake in Organic India, a Fabindia-owned business that sells tea, infusions, herbal supplements and packaged foods, for Rs 1,900 crore in an all cash deal.\"The Board of Directors approved the acquisition of up to 100 percent of the equity share capital of Organic India Private Limited. The company, thereafter, has entered into a share purchase agreement (SPA) with Fabindia Limited to acquire up to 100 percent of the company’s equity share capital,” Tata Consumer Products  said in an exchange filing.On December 19, Moneycontrol was the first to report that Tata Consumer had edged ahead of rival suitors like ITC and emerged as the front-runner for the deal.The announcement came shortly after Tata Consumer Products' first acquisition of the day, where it said it will buy 100 percent stake in Capital Foods, which markets its products under Ching’s Secret and Smith & Jones brands, for Rs 5,100 crore in an all cash deal.ALSO READ: Tata Consumer hits 52-week high amid reports of acquiring Capital Foods, Organic IndiaEstimated turnover of Organic India for FY24 is approximately Rs 360 crore to Rs 370 crore. In the last three fiscals, the company has seen a gradual decline in sales from Rs 394.8 crore in FY21 to Rs 324.4 crore in FY23.The deal values the company at a little over five times its FY24 sales. Against FY23 sales, the company is valued at nearly six times its sales. Tata Consumer is valued at 12 times its FY23 sales and 11.5 times its FY24 (annualised) sales.The Total Addressable Market (TAM) for the categories that Organic India is present in is Rs 7,000 crore in India and Rs 75,000 crores in international markets where Tata Consumer has a strong presence, teh company said.Organic India is a brand with a geographical footprint covering over 48 countries, substantially from India and the USA. Its product portfolio spans premium and high growth categories focused on sustainable living.“This transaction aligns well with Tata Consumer’s overall strategic objectives and presents exciting market opportunities in the rapidly growing Health & Wellness segment,” said Sunil D’Souza, MD & CEO, Tata Consumer Products.\n       ",
    "Tata Consumer Products on January 12 said it will be buying 100 percent stake in Capital Foods, which markets its products under Ching’s Secret and Smith & Jones brands, for Rs 5,100 crore in an all cash deal.\"The Board of Directors approved the acquisition of 100 percent of the issued equity share capital of Capital Foods Private Limited. The Company, thereafter, has entered into Share Purchase Agreement (SPA) and Shareholders’ Agreement (SHA) with the existing promoters and shareholders of the target company to acquire the entire issued equity share capital in a phased manner,\" said Tata Consumer in an exchange filing.The FMCG company added that 75 percent of the equity shareholding will be acquired upfront and the balance 25 percent shareholding will be acquired within the next three years.ALSO READ: Tata Consumer hits 52-week high amid reports of acquiring Capital Foods, Organic IndiaEstimated turnover of Capital Foods for FY24 is approximately Rs 750 to Rs 770 crore. The same was Rs 706 crore in FY23, Rs 574 crore in FY22 and Rs 667 crore in FY21.As per FY24 estimated sales, the company is valued at about 7 times. As per FY23 sales, the deal values the firm at 7.22 times. As of last closing price, Tata Consumer is valued at 12 times its FY23 sales and 11.5 times its FY24 (annualised) sales.\"Ching’s Secret is a market leader in Desi Chinese across its product categories - Chutneys, Blended Masalas, Sauces and Soups. Smith & Jones is a fast-growing brand catering to in-home cooking of Italian and other western cuisines,\" Tata Consumer said in a separate press release.Tata Consumer said this acquisition will enable it to expand its product portfolio and further strengthen its pantry platform. The overall size of the categories in which Capital Foods operates in is estimated at Rs 21,400 crore.“We believe this is a good strategic and financial fit. It will open up significant market opportunities in the fast-growing non-Indian cuisines segment, leveraging the sales and distribution platform that we have built. The strong brand recall of Ching’s Secret and Smith & Jones coupled with our operational strength across channels makes us extremely confident of driving topline growth and realizing cost synergies,\" said Sunil D’Souza, MD & CEO, Tata Consumer Products.As per data available on Tracxn, founder of the company, Ajay Gupta, holds 9.45 percent in the company while the rest is held by private equity funds General Atlantic and Artal Asia.\n       ",
    "The market is expected to consolidate in the 21,500-21,850 range in near term, though there was strong rebound on January 4 after two days of downfall, experts said, adding that the decisive climb above previous record high can open doors to reach 22,000 but below 21,500, there may be steep fall towards 21,300.On January 4, the Nifty 50 rallied 141 points to 21,659, and the BSE Sensex jumped 491 points to 71,848, while the Nifty Midcap 100 and Smallcap 100 indices reported strong performance after consolidation, rising 1.7 percent and 1 percent.Stocks that recorded better performance than the broader markets on Thursday included India Cements, Tata Consumer Products, and Indian Hotels. India Cements surpassed its Rs 275 hurdle intraday but could not sustain above the same, which seems to be crucial for further sharp upside, and finally settled at Rs 273, the highest closing level since October 10 last year, up nearly 4 percent. The stock has formed long bullish candlestick pattern on the daily charts with robust volumes and traded above all key moving averages (20, 50, 100, and 200-day EMA - exponential moving average).Tata Consumer Products jumped 3.7 percent to end at record closing high of Rs 1,125.55 after three-day consolidation and formed strong bullish candlestick pattern on the daily timeframe with healthy volumes. The stock remained in higher highs, higher lows formation for several months now and traded above all key moving averages.Indian Hotels extended uptrend for third consecutive session after several days of consolidation and rallied 2.5 percent to end at record closing high of Rs 462.80 on the NSE. The stock has formed bullish candlestick pattern on the daily scale with above average volumes, and traded above all key moving averages.Here's what Shrikant Chouhan of Kotak Securities recommends investors should do with these stocks when the market resumes trading today:India CementsThe counter has given a breakout of its Symmetrical Triangle chart pattern with a strong bullish candlestick. Moreover, on the daily charts, it has formed a higher bottom formation, therefore the structure of the counter indicates further bullish momentum from the current levels.Unless it is trading below Rs 260, positional traders can retain an optimistic stance and look for a target of Rs 292.Tata Consumer ProductsAfter the robust rally on the daily scale, the stock went into the consolidation mode. However, the recent breakout in the stock is representing a bullish continuation pattern signifying a new leg of up move from the current levels.For positional traders, Rs 1,080 would be the trend decider level. Trading above the same uptrend formation will continue till Rs 1,200. However, if it closes below Rs 1,080 traders may prefer to exit from trading long positions.Indian HotelsThe stock has given a breakout of its triangle chart pattern with a strong bullish candlestick. Additionally, on the daily charts, it has formed a higher bottom formation, hence the structure of the counter indicates further bullish momentum from the current levels.For the traders, Rs 445 would be the key support level to watch out. Above which the uptrend structure will continue until Rs 495.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Tata Coffee's proposed merger with parent company Tata Consumer Products Ltd (TCPL) will come into effect from January 1. Simultaneously, Tata Coffee’s plantation unit will be demerged and amalgamated into another Tata group unit TCPL Beverages & Foods, the company said on December 28.The merger of all businesses of Tata Coffee with Tata Consumer Products, was proposed as part of a reorganisation plan in line with the company’s plan of unlocking synergies and efficiencies.The board of directors of the companies have acknowledged that all the conditions have been duly fulfilled, including “filing of the certified copies of the order with the registrar of companies in form INC-28.”“With the Scheme becoming effective on January 1, 2024, the Company will get dissolved without winding-up, and accordingly the office of all Directors and Key Managerial Personnel of the Company shall stand vacated on that date, without further course of action,” said Tata Coffee in a filing with the exchanges.The record date for the company to determine the shareholders of TCL who will be eligible to receive shares in Tata Consumer Products, which will be allotted pursuant to the demerger and the amalgamation, is January 15, 2024.Follow our market blog to catch all the live actionTata Coffee and Tata Consumer Products shares hit their 52-week on December 28 at Rs 309.05. The shares settled at Rs 308.4, higher by 1.41 percent. Tata Consumer Products stock settled near the day’s high, at Rs 1,048.55 apiece, up 2.12 percent.The plantation business of Tata Coffee will be demerged into TCPL Beverages & Foods, the remaining business of TCL, consisting of its extraction and branded coffee business, will be merged with TCPL, noted the company in a filing with the bourses.Shareholders of Tata Consumer Products, Tata Coffee, and TCPL Beverages and Foods gave their nod to a restructuring proposal during a vote conducted in 2022. Existing shareholders will be issued one equity share for every 22 equity shares held in Tata Coffee by TCPL, as part of the reorganisation scheme.\n       ",
    "Motilal Oswal's research report on Tata Consumer ProductsTea production for the current season (Feb-Oct’23) declined 1% YoY to 1,133m kg vs. 1,366m kg in CY22. During the current season, production in North India (contributes to ~84% of total tea production in India) was down 2% YoY at 948m kg due to a 3%/2% YoY decline in Assam/West Bengal (contributes to ~52%/30% of total tea production). However, production in South India was up 3% YoY at 185m kg. All-India tea production during the first flush (Feb-Jun’23) declined 1% YoY, dragged down by an 11%/4% YoY decline in Apr’23/Jun’23 but was partially pulled up by 16% YoY growth in Mar’23. (First flush produces best-quality output of entire tea season; it contributed to ~33% of the whole tea cycle volume in CY22.) During the second flush (Jul-Sep’23), all-India tea production declined ~6% YoY, due to a 17%/4% decline in Sep’23/Aug’23. Jul’23 production rose 6% YoY. The production decline was mainly attributed to unfavorable climatic conditions, especially scanty rainfalls in Assam and West Bengal. As per IMD, Assam/West Bengal received 19%/22% lower than normal rainfall during the monsoon season 2023 (Jun-Sep’23). All-India tea production in CY23 is expected to be muted YoY, owing to belowaverage rainfall in major tea producing states such as Assam, West Bengal, Kerala and Karnataka.OutlookWe expect a revenue/EBITDA/PAT CAGR of 10%/15%/22% over FY23-26 and arrive at our SoTP-based TP of INR1,110. We reiterate our BUY rating.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Tata Consumer Products - 15 - 12 - 2023 - moti ",
    "Motilal Oswal's research report on Tata Consumer ProductsTata Consumer Products (TATACONS) reported ~11% YoY revenue growth, driven by a strong traction in India food business (up 16% YoY) and NourishCo (up 25% YoY). EBIT grew 22% YoY to INR4.4b in 2QFY24 led by a healthy performance of the International business (EBIT up 60% YoY due to pricing interventions and savings from restructuring).OutlookWe retain our FY24/FY25 EPS estimates. Reiterate BUY with an SoTP-based TP of INR1,040.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Tata Consumer Products - 04 - 10-2023 - moti "
]