[
    "Tata Consultancy Services (TCS) on September 12 informed that it has partnered with the United States-based wholesale grocery and supply chain giant C&S Wholesale Grocers, Inc to build a new operations platform on Google Cloud and help it reduce its carbon footprint while enhancing customer experience.TCS will help reduce C&S’s carbon footprint by migrating its data centre workloads to the carbon-neutral infrastructure of Google Cloud.Amit Bajaj, President, TCS North America, said, “The TCS-designed platform will enable more predictable deliveries, especially during seasonal peaks, helping distributors and retailers better manage their inventory while ensuring that the products most in demand are supplied on time. Additionally, the solution helps support C&S’s sustainability goals of reducing food waste and carbon emissions.”A statement released by the company read: “C&S has partnered with TCS to reimagine its operations platforms, including customer experience and grocery distribution. TCS will lead the company-wide project and help C&S establish a new cloud-based architecture that will unify its current systems.”C&S’s new operations platform will use Artificial Intelligence (AI) and Machine Learning (ML) to monitor traffic patterns and identify optimal distribution routes, thereby reducing food waste and achieving greater fuel efficiency.Kirsten Kliphouse, President – Americas, Google Cloud, said, “Through its work with Google Cloud and TCS, C&S will apply innovative technologies like AI, ML, and data analytics to modernise its extensive distribution network and operations while running its business on the cleanest cloud in the industry.”The predictive platform is expected to “help C&S provide best-in-class tools and capabilities to its employees to achieve operational excellence and growth ― much of which is made possible by bringing self-service solutions to IT and customer service touchpoints”.Further, the deployment will also offer C&S the scalability needed to drive long-term business growth while helping it streamline its operations by providing the infrastructure flexibility to support the company’s sustainability initiatives and growth strategy.Bob Palmer, Chief Executive Officer, C&S Wholesale Grocers, Inc, said: “…. Both TCS and Google Cloud are making it possible to implement a platform that supports our operational sustainability goals to ensure a healthy planet now and for future generations.”Sudhakar Lingineni, Chief Information Officer, C&S Wholesale Grocers, Inc, said: “Our collaboration with TCS and Google Cloud will accelerate C&S’s digital transformation strategy.”\n       ",
    "Tata Consultancy Services (TCS) launched TCS Pace Port Toronto, its fifth global research and co-innovation centre.Spanning 16,000 square feet, Pace Port Toronto provides companies with access to the latest technologies and ”breakthrough thinking” from TCS Research labs, start-ups, VCs, entrepreneurs, and academia including the University of Toronto as well as TCS’ network of Pace Ports in New York, Pittsburgh, Amsterdam, and Tokyo, a company statement said on Wednesday.\"Plugging into this collective ecosystem of innovators and intellectual property through TCS’ Co-Innovation Network (COINTM) will enable Canadian companies to embrace a hybrid approach to collaborative innovation to set the pace of transformation in their industry”, it said.Chief Technology Officer, TCS, Ananth Krishnan, said, Establishing a Pace Port in Toronto North America’s fastest growing tech market — is part of a long-term TCS strategic plan for Canada that includes innovation labs, growing and reskilling our workforce, and our ongoing work with schools to support STEM education.TCS Pace Port hubs around the world include over 4,000 researchers and innovators, more than 2,300 start-up partners, over 30 innovation labs, and 67 academic partners, it was stated.\n       ",
    "Trading activity in the domestic equity market this week will be influenced by a host of macroeconomic data announcements, including inflation number for June, first quarter earnings from companies, global trends and foreign funds movement, analysts said.Besides, other key factors like rupee-dollar trend and Brent crude oil price will also guide market sentiments, they added.“This week, participants will first react to TCS numbers. Besides, macroeconomic data viz. IIP and CPI on July 12 and WPI on July 14 will be in focus. Apart from domestic factors, global cues like performance of the US markets, crude movement etc will remain on the radar,” said Ajit Mishra, VP – Research, Religare Broking Ltd.India’s largest IT services firm Tata Consultancy Services (TCS) on Friday reported a 5.2 per cent year-on-year rise in consolidated net profit to Rs 9,478 crore for the first quarter ended June 30.It reported a 16.2 per cent growth in revenue at Rs 52,758 crore for the quarter, with all the big geographies and business segments reporting strong numbers, but it was operating profit margins, which slid down to 23.1 per cent — much lower than the aspirational band of over 26 per cent — that hurt the profit growth.Brokerage firm Prabhudas Lilladher said the company has missed on both revenue and margins in the June quarter results.On the earnings front, ACC, HCL Technologies, Jindal Steel and Power, MindTree, Federal Bank and HDFC Bank will announce their Q1 numbers during the week.“… IIP and CPI numbers will be announced on 12th July whereas WPI will be announced on 14th July. On the global front, US CPI number, IIP and job numbers will be key factors,” said Santosh Meena, Head of Research, Swastika Investmart Ltd.Apart from this, FIIs’ behaviour and direction of the rupee and crude oil prices will be other important factors, he added.Last week, the BSE Sensex advanced 1,573.91 points or 2.97 per cent, while the NSE Nifty climbed 468.55 points or 2.97 per cent.Apurva Sheth, Head of Market Perspectives, Samco Securities, said, “This week is going to test the market in a number of ways as a multitude of important events are lined up. The USA’s much-anticipated inflation numbers and the jobless claims data will keep the global markets on their toes.” “The inflationary problem is not just restricted to the West, thus the Indian inflation numbers… will also keep the markets back home busy,” he noted.Quarterly results will influence market sentiment. The management commentary on future earnings growth trajectory will be of interest to Dalal Street, Sheth added.Disclaimer: Moneycontrol is a part of the Network18 group. Network18 is controlled by Independent Media Trust, of which Reliance Industries is the sole beneficiary. ",
    "The first earnings season for the financial year 2023 will kick start tomorrow and as has become customary over the past few quarters, India’s largest IT services provider Tata Consultancy Services (TCS) will open the innings this time too.Experts look forward to a healthy on-year revenue growth for the Indian IT services sector that was aided by a secular demand environment, healthy deal wins, and mergers and acquisitions. They expect a steady sequential USD-reported revenue growth but it may be affected by adverse cross-currency and seasonality for a few companies in the sector.For the bellwether of Indian IT services sector, TCS, the expectation is that the company will report a consolidated revenue growth of 15-16 percent on-year and 4-5 percent on-quarter for the first quarter ended June 2022. The company is expected to log in consolidated revenues of Rs 55,600 crore for the quarter.The consolidated profit after tax (PAT) for the largest Indian IT services company, is expected to rise by 10 percent on-year but is likely to remain flat on a sequential basis. TCS is expected to post a bottomline of Rs 9,800 crore.The company had recorded a consolidated net profit of Rs 9,008 crore during the corresponding period of last financial year when its consolidated revenues stood at Rs 45,411 crore. TCS had registered a PAT of Rs 9,926 crore during January to March 2022 period on revenues of Rs 50,591 crore.USD and constant currency revenuesExperts expect the dollar revenues for the company to grow by close to 11 percent on year and ~2 percent sequentially while constant currency (CC) revenues are expected to grow by 3.5 percent sequentially.“We expect CC revenue growth of 3.7 percent QoQ (2.3 percent QoQ in USD) on strong momentum in digital transformation programs while we expect growth to be broad based across verticals”, a report from the brokerage firm Phillip Capital said.A report from Emkay Research expect 2.1 percent sequential revenue growth in US dollar terms as its factors in 190 basis points cross-currency headwinds.Service line revenue mix between change the business and run the business is likely to remain similar to global tech spending. “TCS has diversified its presence across verticals, geographies and service lines and is likely to be beneficiary of large cost-takeout deals and vendor consolidation deals,” a report from ICICI Securities said.MarginsAn uptick in wages and travel and visa costs is likely to impact the margins during the quarter both on a yearly and sequential basis.The EBITDA (earnings before interest, tax, depreciation and amortization) margin is likely to dip 190 bps on-year and 140 bps on-quarter to 26 percent.“Margins are expected to decline by 140 bps sequentially due to wage hikes, travel costs while supply side pressures are likely to be offset by the currency depreciation,” a report from Phillip Capital said.The brokerage expects the EBIT margin to trip to 23.6 percent for the reported quarter compared to 25.5 percent during the same quarter a year ago and 25 percent in the quarter ended March 2022.ICICI Securities has worked out an EBIT margin of 23.5 percent, while Motilal Oswal Financial Services forecasts it at 23.9 percent.Key things to watch out forThe experts will be closely watching the management’s comments on the demand trends in key verticals like BFSI, Retail, Manufacturing and Communications along with the deal intake/pipeline in Q1. Another key parameter to watch out for will be the price environment considering high inflation and tight labor markets as well as margin outlook, supply side challenges and attrition.Experts at Emkay Research will also be looking for updates on regional markets outlook, any impact on tech spending from higher energy prices, inflation and potential economic slowdown/recession and if there are any delay/deferral/cancellation of projects due to macro uncertainties, high inflation and supply chain disruptions.However, according to Motilal Oswal Financial Services, TCS remains best positioned to benefit from the long-term structural tailwinds in Tech Services and should see a relative pickup in growth as the base effect and increased aggression aid it.TCS shares traded flat ahead of earnings on  Friday. It was up 0.29 per cent on BSE.Disclaimer: The views and investment tips of investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Tata Consultancy Services (TCS), India's largest IT services company had come out with its fourth buyback offer (till date) on March 9 and the offer  drew to a close today (March 23).As per the latest regulatory data available on the BSE website (updated till 4.00 pm on March 23), at the closure of the offer, shareholders had tendered a total of 301 million shares through this buyback.Through this offer, TCS intended to buy back 40 million shares, or close to 1.1 percent, of its equity at a price of Rs 4,500 per share which is at a premium of over 21 percent to the closing price of Rs 3,708.25 (BSE) on March 23.The Rs 18,000-crore buyback by TCS which is by far the biggest offer by an IT company in India, generated strong interest from shareholders as is evident from over 7.5 times over-subscription to the issue size.As per the details shared initially for the buyback entitlement, TCS had said that in the reserved category for small shareholders, the ratio of buyback will be \"1 equity share for every 7 equity shares held on the record date\" while in the general category for all other eligible shareholders, the ratio of buyback will be \"1 equity share for every 108 equity shares held on the record date\".Notably, this is TCS' fourth buyback and, in the earlier three buybacks, Tata Sons was the biggest beneficiary. Experts tracking the company said citing precedence, that Tata Sons, the promoter of the company stands to gain the most from the buyback if it has participated in the offer.In 2020, TCS bought back more than 53 million shares at Rs 3,000 a share and 33.33 million shares were accepted under the offer including Tata Sons’ 33,325,118 equity shared. In 2017 and 2018 as well, it undertook two buybacks and the size was around Rs 16,000 crore each. At the end of September 2021, TCS had cash and cash equivalents of Rs 51,950 crore on its balance sheet.The latest move comes after Tata Sons bought Air India from the government for Rs 18,000 crore. The firm will pay Rs 2,700 crore to the government and the rest will go to paying debt. Tata Sons holds a 72 percent stake in TCS currently.Experts are of the opinion that share buyback by the corporates has become the most tax-efficient way of returning money to shareholders since the government has started taxing dividends in the hands of the receivers. As per the applicable tax rates, the effective tax on dividend now comes to 30 per cent for large shareholders since it becomes part of their income. Compared to this, a company pays only 20 per cent tax on share buyback depending the difference between the market price and the issue price.Analysts say share buybacks also typically improve earnings per share and return surplus cash to shareholders while also supporting the stock during sluggish market conditions.In September 2021, Infosys announced a buyback of Rs 9,200 crore while in January 2021 Wipro conducted a Rs 9,500 crore buyback. In 2018, HCL Tech had undertaken a Rs 4000 crore buyback.The premium of the offer price compared to the current market price was not so much when the buy-back was announced. Experts say that the premium became much more pronounced due to the recent correction in the market. Investors tend to take advantage of this arbitrage by buying shares from the markets and tendering them in the buyback offer.\n       ",
    "IT major Tata Consultancy Services (TCS) on March 5 released the dates of its Rs 18,000-crore share buyback offer, which was announced in January this year. The offer will open on March 9, and the window will close at 5 pm on March 23, it said.Sharing details of the buyback entitlement, TCS said that in the reserved category for small shareholders, the ratio of buyback will be \"1 equity share for every 7 equity shares held on the record date\".In the general category for all other eligible shareholders, the ratio of buyback will be \"1 equity share for every 108 equity shares held on the record date\".Notably, this will be TCS' fourth buyback and, in the earlier three buybacks, Tata Sons was the biggest beneficiary.In 2021, TCS bought back more than 53 million shares at Rs 3,000 a share and 33.33 million shares were accepted under the offer. In 2017 and 2018 as well, it undertook two buybacks and the size was around Rs 16,000 crore each. At the end of September 2021, TCS had cash and cash equivalents of Rs 51,950 crore.The latest move comes after Tata Sons bought Air India from the government for Rs 18,000 crore. The firm will pay Rs 2,700 crore to the government and the rest will go to paying debt. Tata Sons holds a 72 percent stake in TCS currently.In September 2021, Infosys announced a buyback of Rs 9,200 crore while in January 2021 Wipro conducted a Rs 9,500 crore buyback. In 2018, HCL Tech had undertaken a Rs 4000 crore buyback.Analysts say share buybacks typically improve earnings per share and return surplus cash to shareholders while also supporting the stock during sluggish market conditions.\n       ",
    "Fitch Ratings on December 15 said it has upgraded the Long-Term Foreign- and Local-Currency Issuer Default Ratings (IDR) on IT services giant, Tata Consultancy Services Limited (TCS) to 'A' from 'A-'. The outlook is stable.\"The upgrade reflects Fitch's reassessment of the linkages between TCS and Tata Sons Private Limited (TSOL), which holds 72% of TCS, based on Fitch's updated Parent and Subsidiary Linkage (PSL) Rating Criteria,\" the rating agency said in its release.The agency further added that it now rates TCS at the same level as its Standalone Credit Profile (SCP) of 'a' as set out in the criteria for a stronger investee of an investment holding company (IHC) such as TSOL, where it believes that the IHC will not weaken the credit quality of the investee by taking out cash or other assets.TCS shares, meanwhile, were trading over 1 percent lower at Rs 3,576.35 apiece on the BSE, at the time of writing this report.Fitch's key assumptions within its rating case for TCS are as below -- Revenue to grow by 11%-15% annually in FY22 and FY23- Operating EBITDA margin of 26%-27% (FY21: 27%)- Capex/sales ratio at around 2% (FY21: 2%)- Distribution of most of the pre-dividend free cash flow (FCF) via cash dividends and share buybacks.\n       ",
    "IT major Tata Consultancy Services (TCS) on November 2 announced it has joined the iconic British racing team Jaguar Racing as title sponsor ahead of the 2021-22 ABB FIA Formula E World Championship.With this announcement, the Jaguar Formula E team has been rebranded as Jaguar TCS Racing with immediate effect.\"During this multi-year partnership, TCS and Jaguar will create a dynamic platform that will drive research and innovation while steering towards advanced concepts and electric vehicle (EV) technologies,\" a press release noted.TCS will leverage its leadership in technology transformation and experience working with premier players in the EV value chain, to help Jaguar TCS Racing become a catalyst for electrification, pushing towards low carbon emissions and sustainable mobility, it said.The partnership will see the creative use of data and insights from the racetrack to shape the wider growth, development, and transformation of the entire electric vehicle ecosystem, TCS further added.This sponsorship will add to the IT sector behemoth's global portfolio that includes TCS New York City Marathon, TCS London Marathon and TCS Amsterdam Marathon.Notably, TCS will become the first Indian IT company to associate with Formula E. The only other Indian company which is associated with the motorsport championship for electric cars is Mahindra & Mahindra.Meanwhile, the partnership between TCS and Jaguar Land Rover dates back to 2012. The two companies have led joint initiatives in areas such as connected product engineering and digital transformation.\n       ",
    "TCS (CMP: Rs 3,935 Market Cap: Rs 1,455,817 crore) has reported a soft quarter with lower-than-expected growth, modest margin performance and a spike in attrition. While the stock may underperform in the near term on account of its strong run-up (outperforming Nifty in the past three months), we believe healthy order inflow, robust outlook and convincing road map will help the company address supply-side issues. The valuation discount to mid-cap also presents a long-term opportunity. Should\n                                    ",
    "Tata Consultancy Services (TCS) reported results for the quarter ended September almost at par of analysts’ estimates led by robust volumes.Ahead of the results, TCS closed 1.1 percent higher at Rs 3,935.65. It hit an intraday low of Rs 3,900.00 and a high of Rs 3,989.90.We have collated a list of top ten takeaways from TCS Q2 results:Net Profit- IT major Tata Consultancy Services' second-quarter earnings were lower than analysts' expectations by 1% as profit rose 7 percent sequentially to Rs 9,624 crore. TCS reported a net profit of Rs 9,008 crore in the previous quarter.Profit was estimated at Rs 9,731 crore on revenue of Rs 47,466 crore for the quarter, according to an average of estimates of analysts polled by CNBC-TV18.Total Revenues-Total revenues increased by 16.8 percent on a YOY basis to Rs 46,867 crore compared to Rs 40,126 crore reported in the same quarter last year. Revenue rose 3.0 percent on a QOQ basis.Dividend Per Share-Tata Consultancy Services informed BSE that the Board of Directors of the company at its meeting held on October 8, 2021, have declared a Second Interim Dividend of Rs 7 per Equity Share of Re. 1 each of the Company based on the record date of October 19, 2021.Further, the company has informed that the Second Interim Dividend will be paid to the equity shareholders of the Company on November 03, 2021.Segment Revenue-There was not much difference in contribution of sectors to the revenue compared to previous quarter. BFSI remained the largest contributor to the revenue at 39% (40% previous quarter).“We are using the growth tailwind to invest in strengthening relevant capabilities and building out a comprehensive portfolio of offerings that caters to a broader set of stakeholders in the enterprise across business cycles, strengthening our brand, and making our business more resilient.” Rajesh Gopinathan, CEO and MD TCS said.The strong and sustained demand environment is a once-in-a-decade opportunity to position TCS as the preferred growth and transformation partner for its customers, he said. According to him, this is the most sustainable pathway to create longer term value for all its stakeholders.Operating Margin-The operating margin remained flat 25.6 percent on a QoQ basis while it reduced marginally by 0.6% on a YOY basis.Segment Growth-Strong double digit revenue growth on a YOY basis was visible across verticals in the September quarter.Manufacturing vertical grew by (+21.7%), followed by Life Sciences and Healthcare (+19%), Retail and CPG (+18.4%) and BFSI (+17%). Communications & Media (+15.6%) and Technology & Services (+14.8%) witnessed accelerated growthN Ganapathy Subramaniam, Chief Operating Officer & Executive Director, said, “TCS BaNCS®, Quartz SmartLedgers™, TwinX™ and TCS Cognix™, all had marquee wins during the quarter and are increasingly driving business and operating model transformations in many markets.” He also added, “We are pleased with our overall delivery performance during the quarter, where several large complex programs across verticals went live”.Market across geographies-North America grew the most among all markets at +17.4%. UK and Europe grew by +15.6% and +13.5% respectively. Among emerging markets, India led from the front and grew +20.1%, followed by Latin America +15.2%, Middle East & Africa +13.8% and Asia Pacific +7.6%.Deal Wins and Patents-5 New Clients were added in $100Mn+ category taking the total customers to 54; 17 new clients in $50Mn+ category, taking the total to 114 clients in this bracket.TCS has applied for 6,169 patents as at the end of 2nd Quarter, including 180 applied during the quarter, and has been granted 2,100 patents. Human Resource-Total employee strength at the end of Q2 stood at 528,748 on a consolidated basis, with net additions of 19,690 employees during the quarter. Women make up 36.2% of the employee base.Attrition Rate-The company continues to enjoy best in class employee retention rate. Though the attrition rate for the quarter jumped 3.3% to 11.9% from 8.6% in last quarter, it is still low compared to the industry.“By focusing on organic talent development and by linking learning with careers, we have kept employee satisfaction levels high” said Milind Lakkad, Chief HR Officer. He also added that a record number of 43,000 fresh graduates were added in the last six months.\n       ",
    "Tata Consultancy Services has launched TCS Pace Port Amsterdam, a co-innovation and advanced research centre.Bringing together an ecosystem of partners from academia, government institutions, start-ups and technology providers, Pace Port Amsterdam will serve as a hub for TCS teams to co-innovate with European customers, a TCS statement said on Friday.\"The centre will also provide rapid prototyping capabilities with a clear focus on building greater futures by finding and creating sustainable solutions\", it said.Pace Port Amsterdam is the third co-innovation centre by TCS, after New York and Tokyo, in a global network of physical-digital innovation hubs. \"TCS believes that collaborative innovation, harnessing the collective knowledge of an ecosystem of partners can help companies realise their purpose and build a greater future, \"said Sapthagiri Chapalapalli, Head, TCS Europe.\"Our new Pace Port at Amsterdam will serve as a European innovation hub that helps our clients build long-term sustainability,which is a core driver of purposeful business.\"\"The global network of TCS Pace Ports ignites collaborative experimentation, research, rapid product prototyping, and continuous learning pushing current boundaries and driving business transformations through the application of cutting-edge digital technologies\", the statement added.\n       ",
    "IT major Tata Consultancy Services (TCS) has named Samir Seksaria as the company’s Chief Financial Officer (CFO). Seksaria is replacing V Ramakrishnan, fondly known as Ramki, as he is set to retire on April 30, after a 40-year-long illustrious career.Seksaria who was appointed after a Board of Directors meeting on April 12, will take charge on May 1.Seksaria started his career in TCS in 1999 and spent his early years in consulting assignments involving regulatory compliance and M&A spin-offs, amongst others. He moved to Corporate Finance in 2004 and played a critical role in the company’s IPO. Prior to being appointed as CFO, he was heading the financial analytics, planning and business finance functions.\"I am pleased to welcome Samir in his new role. During the past two decades, Samir has played an exemplary role in the company’s financial transformation journey involving simplification, cash management, planning and forecasting, and contract structuring,\"  said Rajesh Gopinathan, CEO & MD, TCS.\"I look forward to working closely with our clients, partners, business units and associates towards creating value for all our stakeholders as TCS powers ahead in its journey of transformative growth,\" said Seksaria.\n       ",
    "TCS (CMP: Rs 3,246 Market Cap: Rs 1,218,230 crore) reported a good quarter with strong traction in revenue, stable margin, record deal win and pipeline and reassuring commentary on the supply side.The stock has marginally outperformed the Nifty in the past three months (4 per cent rise against a flat Nifty) but has underperformed the BSE IT index.With the technology sector on a structural upswing, a sector leader like TCS now provides multi-year earnings visibility. Hence,\n                                    ",
    "Tata Consultancy Services (TCS) became the first major IT services company to announce a pay increment for financial year 2021-22. The salary hike would come into effect from April 2021, a TCS spokesperson said on March 19.\"We can confirm that we are on track to give increments to all associates across our geographies effective April 2021, in line with our benchmarks,\" the company said in a statement.\"This step is a reflection of our steadfast commitment to our associates,\" the TCS spokesperson added.This would be the second salary hike which the company would implement within a span of six months. The previous pay increment cycle was delayed due to the outbreak of COVID-19 pandemic in March last year.With the salary hike rolled out in October 2020 and the upcoming hike on April 2021, TCS employees will get around 12-14 percent average increment and this will be in line with the company norms, according to sources familiar with the development.Along with the salary increment, TCS will continue to offer promotions as per the regular promotion cycle.The company's peer Accenture had announced employees a one-time bonus, which would be a week’s worth of their base pay, on March 18.US-based IT major Cognizant has promoted 24,000 employees globally and rolled out wage hikes based on performance for 1.6 lakh employees, Rajesh Nambiar, Chairman and Managing Director, Cognizant India, said in a statement.Infosys, Wipro and HCL Tech rolled out salary hikes for their employees between October 2020 and January 2021.\n\t  \n  ",
    "Highlights- Strong growth in a seasonally weak quarter- Positive YoY growth ahead of guided time line- Broad-based growth across verticals and geographies- Improvement in operating margin despite wage hike- Attrition at all-time low- Confident of a strong FY22- A core portfolio stock to buy on any weakness TCS (CMP: Rs 3,120, Market Cap: Rs 1,171,081 crore) had been alluding to a multi-year technology up-cycle and Q3 FY21 was an early glimpse of the same — the company has\n                                    "
]