[
    "Citi has hiked the target price for Tech Mahindra's shares to Rs 1,150 from Rs 1,095 while also maintaining its 'Sell' rating. Although Citi expressed confidence in Tech Mahindra's goals for the coming years, it remains cautious.The current market price of Tech Mahindra is much higher than the target set by Citi. In the previous session, Tech Mahindra's shares closed flat at Rs 1,400. Tech Mahindra's shares have been gaining in the past four sessions.The company's shares have gained 9 percent in the past six months, keeping pace with the Nifty 50 which gained almost 10 percent during the same period.Follow our live blog for all the market actionCiti is confident that Tech Mahindra will achieve top-line growth surpassing the peer average by FY27, coupled with EBIT margins of around 15 percent. The company's EBIT margin or operating margin came in at 7.4 percent in Q4 FY24 which was an improvement from the previous quarter's 5.4 percent.Tech Mahindra is committed to improving both growth and margins, with a strong emphasis on organic growth. Management's focus on \"scale at speed\" highlights its priorities and determination to drive the company forward, said Citi in a note.Also Read | Tech Mahindra's Q4 earnings miss prompts brokerages to cut growth targetsDespite these ambitious targets, Citi notes that turnarounds in large-cap IT companies have historically been challenging. The key to Tech Mahindra’s success, according to Citi, will be the effective execution of its strategies. While the management is confident in meeting its FY27 targets, the market will be closely watching how these plans unfold in the coming quarters, Citi said.Tech Mahindra reported a 41 percent fall in net profit to Rs 661 crores year-on-year for Q4 FY24, driven by a slowdown in key verticals including telecom, communications, media and entertainment. Sequentially, net profit was up by 29.5 percent.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. \n       ",
    "Sharekhan's research report on Tech MahindraThe management has outlined a strategic plan over the next three years to enhance the company’s sustainability and predictability in terms of growth and profitability. The company aims to achieve a turnaround in FY25, stabilize in FY26 and start reaping returns in FY27. The company aims to achieve topline growth above peers in FY27 with an EBIT margin exceeding 15% while achieving $250 million in savings each year for the next three years. Additionally, the company’s focus would be to drive organic growth and build internal capabilities to reach the FY27 milestone. The company aims to reach an operating margin of 15% in FY27 from 6.1% in FY24 using margin levers such as fresher hirings, Subcon optimization, offshore mix, and utilization, among others. Cost savings under Project Fortius is going to be the big driver to drive a $250m average savings per year.OutlookWhile the near-term macro uncertainties would provide limited headroom for growth and margin recovery until FY25. However, the well-defined and articulated roadmap for FY27 outlines the company’s focused vision, with the ultimate key being execution. Further, the company’s strategy to diversify its portfolio, lessen reliance on the CME vertical, and pursue growth opportunities in other key sectors are steps in the right direction and should offset the persisting weakness in the communication vertical while emerging as credible competitor in other verticals especially Financial services. We have upgraded the company to Buy with a revised price target of Rs. 1,715 (raised target multiple to 25xFY26E) to factor probable business recovery on account of a well-defined and articulated roadmap for FY27 supported by gradually receding headwinds and leveraging of the group’s synergies and ecosystems. At CMP, the stock trades at 27.5/20.3x its FY25/26E EPS.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Sharekhan_TechMahindra-Jun21_2024 ",
    "Indian IT stocks were unfazed on June 21, with TCS, Infosys, HCL Technologies, Wipro, LTIMindtree rising over 1 percent each even after Accenture narrowed its revenue guidance for FY24 due to macroeconomic uncertainties. Analysts see Accenture's Q3 results as slightly positive for domestic IT stocks, thanks to a rise in small deals and a rebound in consulting growth.So far this year, shares of Tech Mahindra and Wipro have surged up to 9 percent, while Infosys and TCS have slipped by up to 1 percent. In comparison, the benchmark Nifty 50 index has surged by 8 percent during the same period.Morgan Stanley highlighted some positive data points from Accenture's Q3 results, including the return to growth in strategy and consulting, and an increase in smaller deals. However, they remain cautious about the return of discretionary spending, noting it is still 'elusive.'ALSO READ: Accenture lowers revenue forecast again as tough macro economy weighsNomura, too, retained a cautious stance on the revival of discretionary spending but is optimistic about order book growth driven by large projects. Accenture's new order bookings rose by 22 percent YoY in Q3, driven by 23 large deals worth over $100 million each. Bookings in consulting and managed services increased by 4 percent and 2 percent, respectively.\"While revenue growth for large-caps should improve in FY25F (+2.9 percent YoY vs FY24F (+1.3 percent YoY), we expect it to be driven by cost take-out deals. We have a 'buy' rating on Tech Mahindra in largecaps and Coforge, Birlasoft, eClerx in midcaps. Conversely, we have a 'reduce' rating on TCS, Wipro, LTIMindtree, and Mphasis,\" Nomura added.Similarly, analysts at Kotak Institutional Equities expect some elation in Indian IT stocks. \"Strong bookings numbers and acceleration in growth rates from a decline to a positive aided by inorganic growth may spur some excitement given the buoyancy of the sector on any positive indications on demand,\" they said.Accenture's Q3 revenue was $16.47 billion, down from $16.56 billion a year ago, with flat operating margins YoY. The company, which follows a September-August financial year, tightened its full-year revenue guidance to 1.5-2.5 percent from the previous 1-3 percent. Given that a significant portion of Accenture's workforce is based in India, its results are often seen as indicative of broader trends in the Indian IT sector.Going ahead, Accenture expects revenue growth from the consulting business to turn positive in Q4FY24 after five consecutive quarters of a YoY decline. Accenture noted that, while the industry’s long-term technology spending trends remain intact, client cautiousness due to macro uncertainties is weighing on tech spending in the near-term.ALSO READ: Accenture’s tepid outlook implies more pain for Indian IT even in FY25Having said that, the company's artificial intelligence (GenAI) portfolio continued to grow, with bookings reaching $900 million for the quarter, contributing to a total of $2 billion in bookings — the largest in the IT services industry. Accenture and TCS are the only two big IT companies that have so far declared revenue from this nascent technology.Nomura analysts believe that this rise in GenAI signalled enterprises need to further invest in cloud adoption and data standardisation to harness its true potential. \"It views GenAI as any other new technology wave and hence, would adopt previously proven playbook of being an early mover in investing in the technology and advising clients, and adopting the tech,\" they noted.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "IT companies within the Nifty 50 index -- Tech Mahindra, LTIMindtree, HCL Tech, and TCS -- dominated the list of stocks that saw a surge in rating upgrades by brokerages over the last three months (March-May). Despite continuing to face challenges such as muted demand and weak discretionary spending, analysts believe that IT stocks have potentially bottomed out, reaching a favourable buying position.Tech Mahindra witnessed the most substantial increase in upgrades, with 'Buy' calls rising from 13 to 22 in the previous quarter. TCS followed suit with a notable increase of 4 'Buy' calls, reaching a total of 29, the highest among its peers. Similarly, LTIMindtree and HCL Tech each received 3 additional 'Buy' calls, bringing their tally to 16 and 21, respectively.According to the IT sector's Q4 FY24 financial results, BFSI, retail, hi-tech, and communication verticals showed persistent weakness, while manufacturing, energy, and utilities fared relatively better. The FY25 revenue guidance also fell short of expectations, indicating a slower recovery path towards normalisation. However, the earnings were on expected lines, with no unusual surprises, said experts.On the upside, margins improved in Q4 FY24 for most companies (except HCL Tech and LTIMindtree) due to higher utilisation, an offshore shift, and reduced discretionary expenses.Market experts are bullish on IT stocks, citing several reasons for their optimism. These factors highlight a potential resurgence in the sector and its attractiveness to investors.Comfortable valuationsMarket experts believe that IT stocks have bottomed out and are now at attractive valuations.Emkay Global noted that the correction in IT stock prices over the last few months has made valuations more reasonable. \"We prefer large caps over mid-caps, considering relative valuation,\" the brokerage said, adding that its top picks in large caps include Infosys, HCL Tech, Wipro, Tech Mahindra, TCS, and LTIMindtree.\"IT counters have not performed in the last 1.5-2 years. I think it is time for them to lead the rally from here,\" said Kunal Rambhia, Fund Manager & Trading Strategist at The Streets.Per technical indicators, the BSE IT index had a very strong support zone at 33,300, from where the buying is expected to continue until 36,000-36,500. On Friday, 7 June, the IT index jumped 3.4 percent to end at 35,909. After delivering negative monthly returns from March to May, the index has gained over 8 percent in June.Strong deal pipelineThe deal pipeline remained robust across the IT industry in Q4 FY24. Total Contract Value (TCV) growth was strong, despite a slight moderation due to fewer mega deals signed by Tier-1 players. Infosys and TCS reported strong bookings, bolstered by large and mega deals, while Wipro and Tech Mahindra experienced muted TCV.\"A positive aspect reported was that deal sizes and wins were on a good, comfortable trajectory, providing visibility for the next year,\" said Rishubh Vasa, Research Analyst at Indsec Securities & Finance.Political uncertainty shifts investment focus to ITWith the Indian general election results not coming in as expected, it has led to concerns that the new government could struggle to accomplish its goals without a full majority. This has put pressure on infrastructure spending and government investments. As a result, funds would now flow into the IT sector.US interest rate cut speculations: A potential boonGrowing hope of a rate cut by the US Federal Reserve has triggered a fall in US bond yields, positively impacting IT stocks. Lower bond yields generally create a favourable environment for IT stocks due to reduced borrowing costs and shifts in investor preferences toward growth-oriented investments.Interest rate cuts will ease client pressure and boost spending, benefiting the IT sector, said Vasa. However, these cuts will take time and likely begin after the US general elections clarify the political landscape.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Digital solutions provider Comviva, a Tech Mahindra subsidiary, on Monday announced the appointment of Rajesh Chandiramani as CEO and whole-time director, effective June 1, 2024.Chandiramani took over the baton from Manoranjan 'Mao' Mohapatra, who retired in May 2024. Mohapatra will continue to serve on the Comviva Board as a non-executive director, according to a company statement.Chandiramani previously held senior leadership roles at Tech Mahindra, where he served as the business unit head for strategic markets in the UK, Europe, the Middle East, Africa, Asia Pacific, Japan, and India within the Communications, Media & Entertainment (CME) vertical.On the appointment, Atul Soneja, chairman of the company's board, said, \"Under his guidance, we look forward to further strengthening our position as a global leader in customer experience and data monetisation solutions, delivering unparalleled value to our clients and stakeholders.\"\n       ",
    "IT company Tech Mahindra on Thursday said it has partnered with Japanese broadcaster Fuji TV to develop and produce content across genres for the global entertainment industry.The partnership will combine Fuji TV's original content with Tech Mahindra's localisation and animation services, according to a company statement.\"We have partnered with Fuji TV to bring their content library in various local languages to Indian audiences...We see great potential in developing IPs catering to the Indian, Japanese, and other major content markets,\" Harshvendra Soin, President, Asia Pacific and Japan Business, Tech Mahindra, said.Tech Mahindra said in the statement it will assist Fuji TV in localising its content for the Indian audience through dubbing, subtitling, and animation services.It will also help Fuji TV in licensing its content to OTT and PayTV platforms in India and Japan.Fuji Television Network executive vice president Toru Ota said the goal is to not only expand business in the Indian market but also to create innovative content that has the potential for global reach.\n       ",
    "Equity benchmarks BSE Sensex and Nifty 50 continued their northward journey for the third straight session on May 18, while the Nifty Midcap 100 index rallied for seven days in a row, with approximately 1,582 shares advancing and 638 shares declining on the NSE. The upward move towards a record high is expected to be seen in the coming sessions. Here are some trading ideas for the near term.Rajesh Palviya, Senior Vice President Research (Head Technical Derivatives) at Axis SecuritiesAurobindo Pharma | CMP: Rs 1,202.4Aurobindo is in a strong uptrend across all time frames, forming a series of higher tops and bottoms, indicating a positive bias. It has registered an all-time high at Rs 1,212, indicating bullish sentiments. The stock has decisively broken out over the past five months' consolidation range (Rs 1,180-985) on a closing basis, indicating the resumption of the prior uptrend.The stock has been well placed above its 20, 50, 100, and 200-day SMA (simple moving average), and these averages are also inching up along with the price rise, which reaffirms the bullish trend. The daily, weekly, and monthly strength indicator RSI (relative strength index) is in positive terrain, justifying rising strength across all time frames.Investors should buy, hold, and accumulate this stock with an expected upside of Rs 1,285-1,330, with a downside support zone of Rs 1,165-1,145 levels.Strategy: BuyTarget: Rs 1,285, 1,330Stop-Loss: Rs 1,145TVS Motor Company | CMP: Rs 2,191.5With the past couple of sessions' up move, TVS has decisively broken out of the past couple of months' multiple resistance zone at Rs 2,180 levels, indicating a positive bias. Rising volumes over the past couple of weeks signify increased participation at breakout zones.The daily and weekly strength indicator RSI is in positive terrain, which justifies rising strength on short to medium-term time frames. Investors should buy, hold, and accumulate this stock with an expected upside of Rs 2,300-2,385, with a downside support zone of Rs 2,100-2,060 levels.Strategy: BuyTarget: Rs 2,300, 2,385Stop-Loss: Rs 2,060Indian Railway Finance Corporation | CMP: Rs 173.25Since the past three months, IRFC was consolidating within Rs 165-130 levels. However, with the current week's strong gains, the stock has witnessed a strong breakout at Rs 165 levels. This breakout is accompanied by huge volumes, indicating increased participation.The stock has been well placed above its 20, 50, 100, and 200-day SMA, and these averages are also inching up along with the price rise, which reaffirms the bullish trend. The daily, weekly, and monthly strength indicator RSI are in positive terrain, which justifies rising strength across all time frames.Investors should buy, hold, and accumulate this stock with an expected upside of Rs 197-218, with a downside support zone of Rs 164-155 levels.Strategy: BuyTarget: Rs 197-218Stop-Loss: Rs 155Osho Krishan, Senior Analyst - Technical & Derivative Research at Angel OneMTAR Technologies | CMP: Rs 2,042.3MTAR Technologies has seen a decent rebound in the last couple of trading sessions, soaring nearly 14 percent in the week ending May 18. Additionally, the counter substantially surpassed its major short-term EMAs (exponential moving averages) on the daily time frame chart, suggesting inherent strength.Simultaneously, with the recent move, the counter witnessed a ‘Symmetrical Triangle’ pattern breakout, indicating a bullish quotient in the counter. On the technical parameters, the MACD (moving average convergence divergence) has seen a positive crossover, adding robust development to the counter.Hence, we recommend buying MTAR Technologies around Rs 2,020-2,000, with a stop-loss at Rs 1,900, and a target at Rs 2,180-2,200.Strategy: BuyTarget: Rs 2,180, 2,200Stop-Loss: Rs 1,900Paras Defence and Space Technologies | CMP: Rs 774.85Paras witnessed a decisive spurt in price volume in the last couple of trading sessions, soaring over 10 percent on a WoW basis. The counter is in a cycle of higher highs, higher lows in the current financial year, hovering above all its major EMAs on the daily chart, adding a bullish undertone.From a technical standpoint, the counter has witnessed an ‘Inverted Head & Shoulder’ pattern breakout, backed by decent volumes. On the oscillator front, the 14-period RSI (relative strength index) and MACD both signal a continuation move, suggesting a potential upside journey in a comparable period.Hence, we recommend buying Paras around Rs 750-740, with a stop-loss at Rs 700 and a target at Rs 845-850.Strategy: BuyTarget: Rs 845-850Stop-Loss: Rs 700Tata Communications | CMP: Rs 1,807.60Tata Communications has nosedived from its lifetime high of the Rs 2,084 zone to below its 200 SMA on the daily chart, eroding almost 20 percent. However, after the correction, the counter stabilized near its previous consolidation zone and started retracting in the last couple of sessions. The stock price has seen a decent move to surpass the critical zone of the 200 SMA and is now eyeing a gradual reversal over a period of time.On the oscillator front, the 14-period RSI and MACD both signal a reversal from the oversold terrain, suggesting a potential upside journey in a comparable period.Hence, we recommend buying Tata Communications around Rs 1,800, with a stop-loss at Rs 1,700 and a target at Rs 1,960-2,000.Strategy: BuyTarget: Rs 1,960-2,000Stop-Loss: Rs 1,700Vinay Rajani, CMT, Senior Technical & Derivative Analyst at HDFC SecuritiesMishra Dhatu Nigam | CMP: Rs 476.55MIDHANI has broken out from the multiple top resistance of Rs 455 and has been sustaining above it. Resistance has been taken out with a jump in volumes, confirming the bullish trend. It has been forming higher tops and higher bottoms on the daily and weekly charts.It is placed above all important moving averages, indicating a bullish trend on all time frames. Indicators and oscillators have been showing strength in the current uptrend.Strategy: BuyTarget: Rs 525Stop-Loss: Rs 450Computer Age Management Services | CMP: Rs 3,316.95CAMS has been consolidating in the range for the last four consecutive weeks. The primary trend of the stock has been bullish as the stock is trading above all important moving averages. Indicators and oscillators like RSI and MACD have been showing strength in the current uptrend.Strategy: BuyTarget: Rs 3,600Stop-Loss: Rs 3140Tech Mahindra | CMP: Rs 1305.65On April 26th, Tech Mahindra broke out from the downward sloping trendline on the daily chart. The price rise was accompanied by a rise in volumes. Post-breakout, it witnessed a correction and reached a gap support on the daily chart.After taking support in the gap, the stock resumed its primary uptrend. Indicators and oscillators have turned bullish on the daily charts.Strategy: BuyTarget: Rs 1,380Stop-Loss: Rs 1,215Axis Bank | CMP: Rs 1,143.75Axis Bank registered a running correction and now seems to have resumed its uptrend. It has taken support near its previous swing high on the daily chart.The primary trend of the stock has been bullish with higher tops and higher bottoms. The stock is placed above all important moving averages, indicating a bullish trend on all time frames.Strategy: BuyTarget: Rs 1,210Stop-Loss: Rs 1,048Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Vineet Nayyar, the former executive Vice Chairman of Tech Mahindra has passed away at 85 years of age.Nayyar was at the helm of Tech Mahindra during the crucial buyout of Satyam by Mahindra and oversaw the subsequent merger.\"It saddens me to share the news of the passing of Vineet Nayyar this morning,\" Mahindra Group Chairman Anand Mahindra posted on X (formerly Twitter).Mahindra further wrote that he would personally be most grateful to Nayyar for his vision in exhorting us to establish the Mahindra University, on the campus of the erstwhile Satyam Computer. \"Thank you for your friendship. You will always live on in our hearts,\" Mahindra further wrote on the social media platform.IT industry body Nasscom also expressed condolence on X. \"We will always remember the significant contributions of Vineet Nayyar, former Executive Vice Chairman of Tech Mahindra. His visionary leadership and dedication have left an indelible mark on the industry. Our deepest condolences to his family, friends, and colleagues. His impact and achievements have carved a lasting legacy,\" Nasscom posted.Former MD and CEO of Tech Mahindra, CP Gurnani too shared the grief and said, \"Heartbreaking news... India has lost one of its finest leaders today.. #VineetNayyar... Personally it's like losing the light that has led me for decades... He was friend, philosopher, brother, guide & statesman par excellence... My heart and thoughts with Reva and family. #OmShanti.\"Nayyar was born in 1939 and had completed his master's in development economics from Williams College, Massachusetts. He career started with the Indian Administrative Services, holding several senior positions including that of a District Magistrate, Haryana Agriculture Secretary and Director, Department Of Economic Affairs in the Central Government.Vineet Nayyar was the founding Chairman & Managing Director of state-run Gas Authority of India (GAIL). After moving to the private sector, he served as the Managing Director of HCL Corp and as the Vice Chairman of HCL Technologies.\n       ",
    "Shares of information technology companies were trading firmly in the green on May 16 after a softer-than-expected US April inflation print fanned hopes of a rate cut by the Federal Reserve in September.In addition, the growing hopes of a September rate cut also triggered a fall in US bond yields, which was another positive for IT stocks. A decrease in bond yields generally creates a favourable environment for IT stocks due to lower borrowing costs, increased present valuations, and shifts in investor preferences toward growth-oriented investments.Consequently, shares of HCLTech, LTIMindtree, Infosys, Coforge, Tech Mahindra, L&T Technology and Mphasis rose 1-3 percent. The uptick in IT stocks lifted the Nifty IT index over a percent higher to register its biggest gains in two months.Follow our market blog for live updatesThe US inflation print rose 0.3 percent on month in April, lower than the Dow Jones estimate of a 0.4 percent spike. The softer inflation print, after three straight months of hotter-than-expected inflation growth came as a breather for global markets. It also fueled hopes that it might now give the US central bank the leeway to charter its rate cutting trajectory from September.As per the CME FedWatch tool, investors are now pricing in a 53.1 percent possibility of getting a rate-cut in September, higher than the 46.3 percent expectation a month ago.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "The stock market halted its downtrend on Friday and Nifty 50 managed to defend the 21,900 mark. As long as the index holds this level, the rangebound trade may continue, with attempts towards 22,200-22,300. If it closes below 21,900, Nifty 50 may then correct up to April lows of 21,776, according to experts.The 21,900 mark coincides with the rising support trendline, low of the big bearish candle on May 9 as well as the lower end of the Bollinger band.Overall, the trend is still in control of the bears. For the week ended May 10, the Nifty 50 fell 1.87 percent to 22,055 and formed a large bearish candlestick pattern on the weekly timeframe following Doji candlestick pattern formation in the previous session.\"Thursday's low coinciding with the 89EMA at 21,900 serves as immediate support, followed by previous swing lows in the 21,800 - 21,700 range,\" Rajesh Bhosale, technical analyst at Angel One.On the upside, the zone between the 20 and 50EMA, around 22,200 - 22,300 presents a formidable obstacle, he feels.Jigar S Patel, senior manager - equity research at Anand Rathi said the index is nearing the lower boundary of an upward channel, and a breach could signal deeper market concerns. \"Looking ahead, a drop below 21,900, the previous swing low of 21,777, may induce market panic.\"Conversely, the FIIs' long-short ratio in index futures at around 32 percent suggests an oversold market nearing a potential rebound. Hence, he feels the resistance is expected at 22,300, and closing above the same may be potentially confirming a bottom until election results.He advised traders to remain light from here on as the market is now approaching the final phases of the election.Moneycontrol collated a list of top 10 stock picks recommended by experts from a 3-4 week perspective. The stock price of May 10 is considered for the calculation of returns.Expert: Vinay Rajani, CMT, senior technical & derivative analyst at HDFC SecuritiesOil India: Buy | LTP: Rs 619 | Stop-Loss: Rs 590 | Target: Rs 725 | Return: 17 percentThe stock has been consolidating in the narrow range for last 6 sessions. Primary trend of the stock has been bullish as it has been forming higher tops and higher bottoms.The stock is placed above all important moving averages, indicating bullish trend on all time frames. Indicators and oscillators have been showing strength in the current uptrend.Tech Mahindra: Buy | LTP: Rs 1,264 | Stop-Loss: Rs 1,215 | Target: Rs 1,380 | Return: 9 percentOn April 26, the stock broke out from the downward sloping trendline on the daily chart and price rise was accompanied by higher volumes. Post breakout, stock witnessed correction and reached a gap support on the daily chart. After taking support in the gap, stock resumed its primary uptrend. Indicators and oscillators have turned bullish on the daily chart.Axis Bank: Buy | LTP: Rs 1,120 | Stop-Loss: Rs 1,048 | Target: Rs 1,210 | Return: 8 percentThe stock registered running correction and now seems to have resumed its uptrend. Stock has taken support near its previous swing high on the daily chart. Primary trend of the stock has been bullish with higher tops and higher bottoms. The stock is placed above all important moving averages, indicating bullish trend on all time frames.Expert: Amol Athawale, VP-technical research at Kotak SecuritiesIndus Towers: Buy | LTP: Rs 330.55 | Stop-Loss: Rs 320 | Target: Rs 355 | Return: 7 percentAfter the gradual decline in the counter from the higher levels, the downward momentum had stopped. On daily charts, the counter has found support and reversed its trend from its important retracement zone along with decent volume activity. The formation suggests a revival of the uptrend from the current levels.GSFC: Buy | LTP: Rs 223 | Stop-Loss: Rs 215 | Target: Rs 240 | Return: 7.6 percentAfter a short-term correction, Gujarat State Fertilizers & Chemicals (GSFC) stock reversed from its important support levels. The technical indicators like RSI (relative strength index) are also indicating further up trend from current levels, which could boost the bullish momentum in coming horizon, making it a favourable candidate on risk and reward basis.Expert: Riyank Arora, technical analyst at Mehta EquitiesIREDA: Buy | LTP: Rs 165 | Stop-Loss: Rs 157.50 | Target: Rs 192 | Return: 16 percentIndian Renewable Energy Development Agency (IREDA) stock has touched its major anchor VWAP (volume weighted average price) support mark of Rs 162.95 on its daily charts. With the RSI (14) being near 49, it is expected that the stock should pick up momentum in the upcoming few trading sessions.Contraction in price movement and volatility is indicating that we might see a surge in IREDA towards Rs 192 and above in a few days. A strict stop-loss should, however, be kept at the Rs 157.50 mark to manage risk well.National Aluminium Company: Buy | LTP: Rs 174 | Stop-Loss: Rs 164 | Target: Rs 195 | Return: 12 percentThe stock has re-tested its breakout mark of Rs 170.45 on its daily charts. With the RSI (14) being around 47 and witnessing a minor uptick and the overall trend being positive on the metal stocks, it is expected that National Aluminium should eventually head higher towards a target of Rs 195 and above.The stock has also made a Bullish Harami pattern on its daily charts, which is indicating the possibility of a good upside move in the stock. A strict stop-loss should, however, be kept around Rs 164 to manage risk well.BPCL: Buy | LTP: Rs 618.65 | Stop-Loss: Rs 590 | Target: Rs 650 | Return: 5 percentThe stock has formed a Bullish Harami candlestick pattern on its daily timeframe charts. With volumes being nearly 3 times its average (30 days) volume and the RSI (14) around 54 with a minor uptick, it is expected that the stock should head higher towards Rs 650 and above.A set stop-loss should be kept at Rs 590 mark to manage risk well on BPCL. The strong technical structure and bullish price action make the stock a good low-risk candidate at current levels.Expert: Om Mehra, technical analyst at Samco SecuritiesVedanta: Buy | LTP: Rs 411 | Stop-Loss: Rs 392 | Target: Rs 448 | Return: 9 percentVedanta stock is forming higher highs and higher lows indicating a sustained uptrend. The stock is placed well above its short-term (20-day) moving averages suggesting bulls are in total control.The RSI comfortably holding 67 levels is gradually inching higher indicating strength in the stock. The earlier resistance has now transitioned into a support level.Hence, based on the above technical structure, one can initiate a long position at CMP Rs 411 for a target price of Rs 448. The stop-loss can be kept at Rs 392.SAIL: Buy | LTP: Rs 157 | Stop-Loss: Rs 145 | Target: Rs 173 | Return: 10 percentSteel Authority of India (SAIL) stock has experienced a correction from its peak and has established strong support at the 38.2 percent Fibonacci retracement level. The RSI has stabilized, holding above 50 levels.Additionally, the stock continues to trade above the 50-day daily moving average (DMA).Hence, based on the above technical structure, one can initiate a long position at CMP Rs 157 for a target price of Rs 173. The stop-loss can be kept at Rs 145.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "During the last one year, as of the March quarter, Tech Mahindra, Tata Consultancy Services, HDFC Life Insurance Co, Hindustan Unilever Ltd and LTI Mindtree Ltd saw most rating upgrades from brokerages.On the other side were UPL, Tata Motors, Nestle India Grasim Industries and Sun Pharmaceutical Industries with most downgrades, according to Moneycontrol's Analyst Tracker.Most upgradesAccording to the tracker, Tech Mahindra had 21 buy calls, 10 hold calls and  14 sell calls against 14 buy calls, 12 hold calls and 7 calls in Q4FY23. Analysts at Mirae Asset recently highlighted the management's three-year strategic roadmap of \"improving profitability, new capital allocation plans and higher RoCE of more than 30 percent.\"Mirae sees FY25 to be a year of turnaround for the company and the company continuing the journey next year by concentrating on more business from the most important clients and cutting down costs.Mirae Asset upgraded their recommendation on the stock from \"hold\" to \"add.\"Another tech stock that gained favour with analysts was TCS. It had 28 buy calls, compared to 22 buy calls during the same period last year.The number of hold calls fell from 13 to 10 while sell calls stayed steady at 10.Analysts at JP Morgan said that they believe the stock is a cross-cycle champion that will benefit from \"cost takeout deals in the short term and discretionary digital transformation deals in the medium term\".The brokerage firm feels there's room for profit margins to grow, and it expects earnings to increase by 4 percent due to an 80 basis points improvement in margins this year.The stock with the third most upgrades during the quarter was Hindustan Unilever. In a March 2024 report on consumption, analysts at BNP Paribas noted that the home care division was now seeing higher competitive intensity. \"While the near-term growth prospects appear muted, margin improvement is set to drive earnings growth,” the report said. BNP Paribas has a neutral rating on the stock.TCS and Tech Mahindra shares have gained over 20 percent in the last one year. On May 10, TCS closed at Rs 3,895.00 and Tech Mahindra at Rs 1,264. HUL stock has fallen around 6 percent in the last one year.Most downgradesIn terms of downgrades, UPL continues to see downgrades from analysts. The stock has fallen over 31 percent in the last one year.According to Moneycontrol's analyst tracker, UPL has 17 buy calls, 7 hold calls and 7 sell calls against 23 buy calls, 7 hold call and 2 sell calls. In a February 2024 report, post the Q3 earnings, analysts at Nuvama downgraded the stock from buy to reduce due to disappointing Q3 results with \"persistent losses, much below estimate and consensus.Though margin pressure—amid falling raw material prices and higher discounts to collect payments—shall subside in FY2025, the brokerage said that it still sees a risk of credit rating downgrades and pressure on balance sheet. Similarly, analysts at DAM Capital also downgraded the stock to a sell as they believed that UPL's realisations would continue to remain under pressure.MOSL analysts had downgraded Tata Motors to ‘neutral’ in March as they saw limited upside to the stock because of the price factoring in most of the positive triggers.As per Moneycontrol's analyst tracker, the stock has 24 buy calls, 4 hold calls and 5 sell calls against 28 buy calls, 2 hold call and 4 sell calls. Tata Motors was trading at Rs 1,047 on May 10, gaining around 100 percent in the last one year.Nestle India  stock has 24 buy calls, 4 hold calls and 5 sell calls against 28 buy calls, 2 hold call and 4 sell calls. Analysts have mostly remained positive on the stock, despite some downgrades. In a recent report, Axis Securities said it was positive on the company despite the challenging environment of slow demand recovery and volatile raw material prices.According to the brokerage, the company has consistently delivered resilient performance, led by efforts towards rural penetration, focus on innovation and premiumisation of the core categories \"We believe Nestle has all the right levers for long-term sustainable growth,\" the report added. Stock for Nestle India has gained over 14 percent in the last one year , trading at Rs 2,527.10 on May 10.\n       ",
    "Indian IT services majors reported soft but broadly in-line Q4 results, with the outlook for FY25 not inspiring much confidence either. Hence, Moneycontrol's list of companies with maximum ‘sell’ calls or maximum pessimism features three IT stocks, including Wipro and LTIMindtree.According to analysts at Kotak Securities, demand outlook and macro uncertainty continue to be weak in FY25. This has led to a reset of both growth and margin expectations, which in turn has led to muted growth guidance for all IT firms, and a weaker margin outlook for some.\"Recovery hopes have been pushed back to FY26,\" the brokerage said. However, stock price corrections in the past few months have made valuations more palatable, it added.Follow our market blog to catch all the live actionMoneycontrol analysis shows that out of the 46 analysts that have coverage on Wipro stock, 24 have a 'sell' call, 13 have a 'hold' call, and only 9 analysts are bullish with 'buy' calls. The pessimism stems from the fact that Wipro has been underperforming compared to the rest of its large-cap IT peers.Analysts do not expect this trend to reverse anytime soon as the company continues to face challenges from a subdued economic environment.Why is Wipro the company with maximum pessimism in April?1. Weak guidance: The weak revenue growth guidance by Wipro's management for Q1FY25 at -1.5- 0.5 percent in constant currency (CC) terms was slightly disappointing, according to Sharekhan. Further the sudden change in CEO adds another layer of delay in recovery in the near-term before the potential turnaround in the medium- to long-term.2. Demand, discretionary slowdown: Wipro's management said that the market has not changed fundamentally in terms of demand. Although it is witnessing some stabilisation in BFSI, the slowdown in discretionary spending continues, especially in smaller projects. It is said that near-term margins are likely to remain range-bound.3. CEO change: In April 2024, Thierry Delaporte resigned as the Chief Executive Officer (CEO) of Wipro and he was replaced by Srinivas Pallia, a 32-year veteran of the company. Motilal Oswal expects its FY25 revenue growth to be one of the lowest among Tier-1 IT Services peers.\"We reiterate our Neutral rating as we look forward to: 1) the execution under the new CEO, and 2) a successful turnaround from its struggles over the last decade, before turning more constructive on the stock,\" the brokerage said.4. Execution lag: Axis Securities said that Wipro lags in execution capabilities to capitalise on growth compared to peers, despite a strong deal pipeline and superior financial structure.5. Deal conversion lag: The slower ramp-up in large deals, delay in executions, and lack of immediate mega deal alternatives would keep Wipro's top-line growth unstable, said Prabhudas Lilladher.\"The conversion from TCV to revenue remains a challenge, as the larger part of its portfolio has high concentration on discretionary spends which is weighing on its performance due to project ramp down, and in some cases, it is difficult to replenish the projects that are having similar size and scope,\" it said.It is worth noting that while several brokerages have maintained a 'sell' or 'hold' rating on Wipro, they have raised the target price on the stock given in-line revenue, EBITDA Margin, PAT, and deal wins in Q4.Also Read | Hindustan Zinc stock soars 11% to 52-week high as positive China data lifts zinc pricesOther IT firms with maximum pessimism in AprilMoneycontrol analysis shows that LTIMindtree and Tech Mahindra are other IT stocks that saw maximum pessimism in the month gone by.Out of the 41 analysts that have a coverage on LTIMindtree, 15 have a 'sell' rating, 10 hold, and 16 have a 'buy' call on the stock, translating to a 61-percent pessimism. As for Tech Mahindra, of the 45 brokerages, 14 have a 'sell' call, 10 hold, and 21 'buy' calls.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Tech Mahindra witnessed the highest number of brokerage analyst upgrades among Nifty 50 stocks in the past month after the IT company unveiled a strategic vision for a business turnaround over the next three years. 'Buy' calls on Tech Mahindra stock increased from 14 to 21, while 'hold' calls dropped to 10 from 13 and ‘sell’ calls dropped to 14 from 18.In its Q4 earnings, Tech Mahindra spelt out a three-year plan to achieve over 15 percent growth in operating profit and higher revenues by 2026-27, focusing on client accounts, restructuring, and new investments.Brokerages noted Tech Mahindra's efforts to address client-specific engagement issues and maintain a solid deal pipeline. However, uncertainty in demand could impact revenue growth momentum in the near term.Medium-term outlook positive Morgan Stanley double upgraded Tech Mahindra's rating from ‘underweight’ to ‘overweight’, and increased its price target to Rs 1,490 from Rs 1,190. The brokerage sees Tech Mahindra's medium-term outlook as positive, with growth, margins, and capital allocation supporting the floor at Rs 1,150.Describing it as a ‘self-help story’, Morgan Stanley highlighted the management's clear vision till fiscal year 2027. Key catalysts include margin improvement, revenue growth, and diversification away from the Telecom vertical.Domestic brokerage Prabhudas Lilladher too highlighted the growth strategy that aims to diversify the portfolio away from communication business towards high-growth service lines and scaling up major accounts.But execution challenges lingerHSBC viewed Tech Mahindra's new turnaround plan as sensible but added that the challenge lies in its execution amid the current macroeconomic conditions. The brokerage said that margin expansion depends on pyramid improvement and maintaining average pricing, considering the lacklustre sector outlook. HSBC kept its 'hold' rating on the stock with a price target of Rs 1,300.Similarly, Nuvama expressed caution regarding Tech Mahindra's ambitious targets, foreseeing significant near-term challenges in achieving them. The brokerage said that the steps required will entail substantial short-term pain. As a result, Nuvama has reduced its FY25/26 target by 2 percent/1.5 percent, and assigned a 'reduce' rating with a price target of Rs 1,000.Tech Mahindra Q4 net profit declined 40.9 percent year-on-year to Rs 661 crore due to a slowdown in key verticals, although it saw a 29.5 percent sequential increase. Consolidated revenue for Q4FY24 fell 6.2 percent year-on-year to Rs 12,871 crore.Emkay noted the company's emphasis on its 'Speed at scale' strategy, focusing on scaling large accounts, leveraging synergies from past acquisitions, upgrading cost structures significantly, and enhancing organisational predictability.The company management views FY25 as a turnaround year, followed by a stable performance in FY26, with full benefits realised by FY27. The company is eyeing an operating margin of 15 percent by FY27, expecting average benefits of $250 million annually.Meanwhile, major IT stocks like Infosys, TCS, HCL Tech, Wipro, and LTI Mindtree witnessed minimal changes in brokerage calls post-earnings. Infosys currently has 33 buy calls, 8 holds, and 7 sells, slightly up from 31 buys, 8 holds and 7 sells a month ago.Similarly, TCS saw its buy calls increase from 26 to 28, while hold and sell calls remained unchanged at 10 each from last month. Wipro's current figures stand at 9 buys, 13 holds, and 24 sells, compared to 9 buys, 13 holds, and 22 sells earlier.HCL Tech's current numbers are 21 buys, 15 holds, and 7 sells, compared to 20 buys, 15 holds, and 9 sells previously. LTI Mindtree's current statistics show 16 buys, 10 holds, and 15 sells, slightly changed from 13 buys, 13 holds, and 16 sells previously.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "ICICI Securities's research report on Tech MahindraTech Mahindra (TechM) has reported slightly better-than-estimated revenue performance with 0.8% QoQ CC decline, led by traction in BFSI vertical in Q4FY24. It reported TCV growth of 31% QoQ with EBIT margin at 7.4%. However, its largest vertical communications continues to be a no-show with 2.7% QoQ decline. The Q4 highlight was the 3-year plan laid out by the CEO (Mohit Joshi) with granular steps to execute its 3-pronged strategy of 1) accelerated growth, 2) margin improvement and 3) aligning organisation. All this is likely to dampen growth and margin volatility that currently weighs on TechM. The EBIT margin target of exceeding 15% by FY27 was built in our model. We tweak FY25E EPS by 3.8% based on strategy update stating FY25 may be the key turnaround year. Henceforth, we expect steadiness and predictability in margin and growth, steady uptick in TCV and no more one-offs.OutlookWe continue to value the stock at 20x on FY26E EPS of INR 65 to arrive at our TP of INR 1,350. We upgrade to ADD from HOLD before.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Tech Mahindra_26042024_ICICI Securities ",
    "Prabhudas Lilladher's research report on Tech MahindraTECHM reported revenue of USDa1.55b, down 0.8% QoQ in CC and down 1.6% in reported terms, below consensus of 1.4% decline. The decline was led by the communication vertical (-2.7% QoQ) along with the continued initiatives to de-risk its client mix. Ex-comm, the enterprise business also was muted, down 1% QoQ, led by Manufacturing and Retail, down 1% and 10%, respectively. The EBIT margin saw an improvement of 40 bps QoQ, in line with consensus. Despite the weakness in topline growth, the deal TCV reported was strong at $500m (+31% QoQ), aided by two large $100m deals each in 4Q.OutlookThe stock is currently trading at 20x FY26e, we are assigning P/E of 19x to FY26e with a target price of INR 1,135. With that we assume coverage on TechM with a “HOLD” rating.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Tech Mahindra - 26042024 - prabhu ",
    "Motilal Oswal's research report on Tech MahindraTech Mahindra (TECHM) reported 4QFY24 revenue of USD1.48b, down 0.8%QoQ in CC and below our estimate of +0.7% QoQ CC. CME remained weakand declined 2.8% QoQ despite a low base. Enterprise growth was mixed,with retail declining 9.6% QoQ and BFSI growing well at 3.5% QoQ.TECHM had another quarter of low profitability, with adj. EBIT margin at7.4%, 100bp below our estimate of 8.4%. 4Q TCV remained weak atUSD500m (+31% QoQ/-15% YoY).OutlookWe remain Neutral on the stockwith a TP of INR1,210 (18x FY26E EPS).For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Tech Mahindra_26042024_Motilal Oswal ",
    "Net Sales at Rs 10,411.00 crore in March 2024 down 4.82% from Rs. 10,938.50 crore in March 2023.Quarterly Net Profit at Rs. 527.40 crore in March 2024 down 22.06% from Rs. 676.70 crore in March 2023.EBITDA stands at Rs. 970.90 crore in March 2024 down 13.54% from Rs. 1,123.00 crore in March 2023.Tech Mahindra EPS has decreased to Rs. 5.39 in March 2024 from Rs. 6.93 in March 2023.Tech Mahindra shares closed at 1,190.30 on April 25, 2024 (NSE) and has given 4.22% returns over the last 6 months and 18.31% over the last 12 months.",
    "Net Sales at Rs 12,871.30 crore in March 2024 down 6.17% from Rs. 13,718.20 crore in March 2023.Quarterly Net Profit at Rs. 661.00 crore in March 2024 down 40.86% from Rs. 1,117.70 crore in March 2023.EBITDA stands at Rs. 1,472.60 crore in March 2024 down 30.32% from Rs. 2,113.50 crore in March 2023.Tech Mahindra EPS has decreased to Rs. 7.48 in March 2024 from Rs. 12.67 in March 2023.Tech Mahindra shares closed at 1,190.30 on April 25, 2024 (NSE) and has given 4.22% returns over the last 6 months and 18.31% over the last 12 months.",
    "Shares of Tech Mahindra hit a 10 percent upper limit at Rs 1,309.30 after the company's CEO and MD Mohit Joshi on April 25 unveiled a three-year roadmap to turn around the IT services major’s slowing business, with an aim to drive better revenue growth than peer average and optimising margin improvement by FY27.Tech Mahindra shares have gained over 7 percent so far in April after having seen negative monthly returns consecutively in February and March.Joshi said that the turnaround will be happening in phases based on the fiscal year. In FY25, Tech Mahindra will be in a ‘turnaround phase’, when the focus will be on anchoring the new organisation, investing into key accounts, markets and service lines. At this stage, the work will be to integrate front-end portfolio companies, focus on turbocharge programme for key account growth and starting Project Fortius for cost optimisation.Joshi laid down his ‘Vision 2027’ to focus on organisational restructuring, phased business improvements and investments, along with utilising synergies with the larger Mahindra Group businesses.Also Read | Tech Mahindra Q4 results: Net profit declines 40.9% YoY to Rs 661 crore, revenue drops by 6.2%The company introduced Project Fortius, a program in which the management will work on multiple levers over the next three years to drive margin growth.FY26 will be the ‘Stabilisation Phase’ for the company, where the investments will continue, and Project Fortius is expected to progress on cost savings.By FY27, the company expects to start ‘Reaping Returns’ with improved long-term structural mix and continued improvement in pyramid.The company will further double down on building its telco, manufacturing, BFSI and AI verticals.By FY27, Tech Mahindra has set a goal to expand EBIT margin to 15 percent and have higher topline growth as compared to peer average of top six-seven IT services players.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions ",
    "Information services player Tech Mahindra's fiscal fourth-quarter earnings came short of estimates, prompting brokerages to cut growth targets for the IT company.The company's net profit rose 29.50 percent to Rs 661 crore, falling short of Moneycontrol's estimate of Rs 709.47 crore. Revenue fell 2 percent sequentially to Rs 12,871 crore against estimates of Rs 12,926 crore.Continued slowdown across key verticals, including telecom, communications, media and entertainment, pulled the company's Q4 earnings down.Brokerage Jefferies expects weak near-term growth for Tech Mahindra, based on the company's weak order book and headcount declines. Jefferies cut its growth estimates by 4-9 percent and margins to FY26/27. The brokerage also slashed its price target for the stock to Rs 1,065 and retained its \"underperform\" call.Follow our market blog for live updatesCLSA said the earnings highlight chinks in the company’s armour. The brokerage cut its EBIT margin and EPS targets by 13 percent and 12 percent, respectively, for FY25 and FY26. CLSA has a “buy” call on the stock with a price target of Rs 1,589.To bring about a turnaround, Tech Mahindra CEO and MD Mohit Joshi unveiled a three-year roadmap to drive better revenue growth than peer average and optimising margin improvement by FY27.Joshi's FY27 strategy aims to take the company ahead of its peers’ average growth and to a 15 percent EBIT margin.According to brokerage HSBC, the turnaround plan looks sensible but its execution remains challenging, especially in the current macroeconomic backdrop.The brokerage said Tech Mahindra's margin expansion is highly contingent on pyramid improvement, while maintaining average pricing, as the outlook for the sector remains lacklustre.HSBC has stuck to its “hold” call, with a price target of Rs 1,300.Nuvama, too, is cautious on Tech Mahindra's ambitious targets. The targets are achievable but the steps needed to achieve them will cause significant near-term pain, it said.Nuvama trimmed its FY25/26 target by 2 percent/1.5 percent. The brokerage has a “reduce” rating on the stock with a target of Rs 1,000.On April 25, shares of Tech Mahindra settled 5 percent higher at Rs 1,250 on the NSE.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.\n       "
]