[
    "UltraTech Cement is set to present its earnings report for the first fiscal quarter of FY25 on July 19. Sequentially, India's largest grey cement, ready mix concrete and white cement manufacturer is expected to deliver a subpar performance in Q1FY25 despite a rise in volumes, primarily due to weak prices, and a decline in average realisations that will impact earnings.According to a Moneycontrol poll, UltraTech Cement's net profit is expected to slump 30 percent QoQ to Rs 1,733 crore. Revenue is also seen falling 13 percent sequentially to Rs 17,962 crore.On a year-on-year basis, however, net profit and revenue are seen rising 2.5 percent, and 1.3 percent, respectively.The most optimistic estimate sees Ultratech Cement's net profit rising 19 percent on-year, respectively. But the most pessimistic projection suggests that net profit might sink eight percent YoY.What factors are driving the earnings?Demand Slowdown: The slowdown in construction activities during the general elections in April and May adversely impacted cement sales in these months. Scorching heat, labour shortages, and unseasonal rain in some regions further dented demand during Q1FY25.Muted prices: Cement prices entered Q1F25 with a steep hike announcement in some regions, but with lower-than-historical average demand and a sudden ramp-up of M&As among large players, sustaining any price hike became impossible. Hikes implemented in April were reversed during May and June due to soft demand and stiff competition.Decline in realisations: According to analysts at Motilal Oswal, blended realization is likely to decline around three percent YoY. Price realisation in cement refers to the average revenue a company earns per unit sold. It helps gauge the average income per ton, with higher realisation indicating better profitability per unit.High Costs: The cement maker's depreciation/interest expenses are estimated to increase up to eight percent on-year likely causing a negative operating leverage, which occurs when a company's fixed costs are high, causing profits to decline disproportionately as sales decrease.Combined with lower price realisations, this can significantly hamper net earnings.According to analysts at BOBCAPS, UltraTech Cement's growth stayed at a higher single digit after a very strong Q4FY24 as the company focuses on retaining prices at relatively better levels than its peers.\"Volume growth of around 8.5 percent is despite strong competition from the peer set. Operating efficiencies likely to move margins into positive territory,\" it said.What to look out for in the quarterly show?Analysts will be keeping a close eye on management commentary on the demand scenario amidst a seasonally weak quarter, price sustainability amidst intensifying competition, and consolidation in the sector.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Shares of cement stocks- Ambuja Cements and Ultratech inched higher on July 15 after Morgan Stanley rolled out bullish views for the two industry majors. The brokerage firm upgraded Ambuja Cements to 'overweight', raising its price target to Rs 775. Alongside, it also raised the target price for Ultratech Cement to Rs 13,620, while retaining its 'overweight' call on the stock.Reacting positively to the bullish views, at 10.13 am, shares of Ambuja Cements were trading at Rs 685.15 and Ultratech Cement at Rs 11,731.05 on the NSE, both up over 1 percent.Morgan Stanley believes in the near-term, the industry may move sideways due to limited upside triggers. However, the brokerage feels the medium-term outlook for the sector and the two majors, remain robust, thanks to demand-led margin expansion which is still intact.Follow our live blog for all the updatesOn that account, the Morgan Stanley also expects with stocks with capacity share gains and cost improvement capabilities to do well. Likewise, the brokerage believes a bull case is in play for Ultratech Cement and Ambuja Cements.This comes after brokerage firm Nomura double upgraded Ambuja Cements to a 'buy' rating last week, factoring in the company's aggressive capacity expansion.Along with this upgrade, the brokerage firm had also raised its price target for Ambuja's stock from Rs 500 to Rs 780, marking a significant increase of nearly 56 percent.Nomura attributed this sharp rise in the price target to Ambuja's entry into newer markets and its industry-leading volume growth.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Prabhudas Lilladher has come out with its first quarter (April - June’ 25) earnings estimates for the CEMENT sector. The brokerage house expects Ultratech Cement to report net profit at Rs 1,806.2 crore up 5.9% year-on-year (down 24% quarter-on-quarter).Net Sales are expected to increase by 2.1 percent Y-o-Y (down 11.1 percent Q-o-Q) to Rs 17,601.4 crore, according to Prabhudas Lilladher.Earnings before interest, tax, depreciation and amortisation (EBITDA) are likely to rise by 12.9 percent Y-o-Y (down 18.3 percent Q-o-Q) to Rs 3,284.4 crore.Disclaimer: The views and investment tips expressed by investment experts on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Prabhudas_Cement ",
    "Sharekhan's research report on UltraTech CementUltratech’s board recently approved making a financial investment to purchase up to 7.06 crore equity shares of The India Cements at a price up to Rs. 267 per share constituting a 23% stake in India Cements. The transaction is valued at Rs. 1885 crore valuing India Cements at an EV/tonne of $90/tonne. As of now, an open offer is not triggered as it does not breach 25% stake. However, further stake acquisitions to control majority ownership in India Cements cannot be ruled out. The investment follows the recent acquisition of Penna Cements by Ambuja and can be viewed as Ultratech’s strategic move to secure its regional and market leadership.OutlookUltraTech is well poised to benefit from a strong demand environment led by government spending on infrastructure and rising demand from the housing sector. Industry consolidation, structural demand drivers and softening fuel prices provide operational profitability growth tailwinds. Although, movement of cement prices would remain a key monitorable in the near to medium term. Currently, we have not factored in India Cements stake acquisition in our financials awaiting further clarity on its future plans with respect to further stake acquisitions. At CMP, the stock is trading at an EV/EBITDA of 22.8x/18.5x its FY2025E/FY2026E earnings, which we believe provides further room for upside. Hence, considering its long-term growth potential, we maintain our Buy rating on the stock, with a revised PT of Rs. 13,000 owing to strong earnings growth outlook over FY2024-FY2026E.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.UltraTech-Jun28_2024 ",
    "UltraTech Cement's share price rose marginally in the early trade on July 1 after the company commissioned additional capacity at Tadipatri, Andhra Pradesh units.At 09:26am, UltraTech Cement was quoting at Rs 11,699.90, up Rs 38.60, or 0.33 percent, on the BSE.\".... commissioned additional 3.35 mtpa clinker along with 1.8 mtpa grinding capacity at its existing unit situated at Tadipatri, Andhra Pradesh,\" company said in its release.This addition in capacity forms part of the 22.6 mtpa capacity expansion announced in June, 2022.Furthermore, with debottlenecking, the company has increased the capacity of its griding unit at Jharsuguda, Odisha by 0.4 mtpa taking it to 4.5 mtpa.As a result, the company’s total cement capacity has reached 154.86 mtpa.Catch all market action in our live blogICICI Securities in its June 28 report has downgraded the stock to reduce from hold with Target Price of Rs 10,553 (R 10,411 earlier).In June UltraTech board approved buying another 3.4 percent equity in India Cements to complete the targeted acquisition of 23 percent for a total consideration just above Rs 1,900 crore.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "ICICI Securities research report on UltraTech CementUltraTech Cement (UTCEM) has purchased ~23% stake in South-India major India Cements (ICEM) from investor Mr RK Damani and family for a cash consideration of ~INR 19bn (valued at ~USD 91 EV/t). While the deal objective is stated to be a ‘non-controlling financial investment’, we see it as a smart ‘foot in the door’ move towards a potential acquisition bid for ICEM. With acquisition of a controlling stake appearing to be a ‘long shot’ and Street’s misplaced judgement of seeing the deal as a potent positive for pricing outlook (citing odds of rising consolidation), we stay neutral on the deal.OutlookAlthough we value the 23% stake at INR 142/share of UTCEM (being the difference in EV/t of UTCEM and the current deal), we are not convinced on assigning a higher valuation multiple to UTCEM, citing the underlying competitive intensity despite rising industry consolidation. Hence, we downgrade the stock to REDUCE (from Hold) with TP of INR 10,553 (INR 10,411 earlier).For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.UltraTech Cement - 28062024 - isc ",
    "The Street cheered Ultratech Cement's acquisition of a 23 percent stake in Chennai-based India Cements for Rs 1,889 crore, pushing the stock to a record high of Rs 11,875 per share on June 27. Analysts predict this deal could lead to a larger stake purchase and establish a new 'Thalaiva' (dominant player) in the Southern market.This move came two weeks after the Adani Group's Ambuja Cements announced its acquisition of Penna Cements, a South India-based company, for Rs 10,422 crore.Investec analysts noted that Ultratech's acquisition could boost its capacity share in South India from 11 percent to 18 percent, particularly enhancing its presence in Telangana, where it previously had no operations.ALSO READ: Moneycontrol Pro Panorama | UltraTech cements its no1 positionIndia Cements currently has a cement production capacity of 14.5 million tonnes per annum (MTPA) and a clinker capacity of 11.13 MTPA. This complements Ultratech's existing capacities in the South, which include 2 MTPA in Telangana, 5 MTPA in Tamil Nadu, and 10.6 MTPA in Andhra Pradesh.CLSA analysts view this transaction as a strategic entry point for Ultratech, likely to increase industry consolidation and pricing power. Meanwhile, BofA analysts suggest that the investment could enhance Ultratech's market prospects in the South, potentially leading to a majority stake in the future.Ultratech, India's largest cement producer, acquired 70.5 million shares of India Cements at an average price of Rs 268 each from Radhakishan Damani and related entities in two block deals. Despite speculation of a hostile takeover, Ultratech described the purchase as a 'non-controlling financial investment.'Tushar Chaudhari, a research analyst at Prabhudas Lilladher, commented that the deal could benefit both companies. Ultratech could secure a strategic cement supply agreement to expand its market share in the underserved Andhra Pradesh and Telangana regions, while India Cements could see improved financial performance as volumes increase.ALSO READ: UltraTech makes big move on India Cements. What next?\"We remain optimistic about industry leaders, expecting Ultratech and Ambuja Cement to continue gaining market share. Smaller, less efficient players will face challenges, leading to ongoing consolidation in the cement industry. Strong balance sheets will benefit the leading companies, though competition will also intensify,\" he added.So far this year, shares of Ultratech Cement surged over 11 percent, while India Cements rose by 13 percent. In comparison, the benchmark Nifty 50 index jumped by 9 percent during the same period.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "UltraTech Cement, the crown jewel of the Kumar Mangalam Birla group, plans to acquire 23 percent in India Cements for up to Rs 1,890 crore. The deal involves purchasing 70.6 million shares of India Cements at Rs 267 each. This transaction, described by UltraTech as a \"non-controlling financial investment,\" is expected to be finalised within a month, according to a stock exchange filing.Read: Potential hostile takeover by UltraTech brewing in India Cements?Here’s a snapshot of how the two cement companies fared in terms of key financial metrics and stock performance.India Cements earningsThe company reported its fifth consecutive quarterly loss in the March 2024 quarter, with revenue continuing to decline year-on-year for the fourth straight quarter. The company, ranked tenth largest in the cement sector, is grappling with working capital shortages. This has been exacerbated by intense price competition following the Adani Group's entry into the industry through the acquisition of Ambuja Cements Ltd and ACC Ltd in 2022.As of March 2024, all shares held by promoters, led by managing director N Srinivasan, were pledged with banks, up from 45 percent at the end of December 2023. In response to these challenges, India Cements has been actively taking steps to alleviate its working capital constraints, including asset sales. The company's Q4 performance reflects these efforts, showing some improvement according to experts.The management anticipates significant relief in working capital following the recent sale of non-core and core assets such as land and a grinding plant. They have expressed cautious optimism regarding demand and pricing trends and clarified their intention not to sell further core assets for business funding, focusing instead on operational efficiencies. The management has sounded confident about resolving working capital issues and improving business operations in the coming quarters. But analysts remain watchful given the company's historical performance relative to peers. ultra vs india cementUltraTech Cement earningsIndia’s largest cement manufacturer reported a strong revenue growth in Q4, driven by robust demand across key markets. Improved operating leverage, favorable fuel prices, and effective cost controls contributed to margin expansion.UltraTech Cement is aggressively pursuing acquisitions to achieve its ambitious target of increasing capacity from 147 million tonnes per annum (mtpa) to 200 mtpa. In December 2023, the company announced the acquisition of Kesoram Industries' cement assets for Rs 7,600 crore. This transaction, awaiting regulatory approvals in 2-3 quarters, includes two integrated cement units in Karnataka and Telangana with a total grinding capacity of 10.75 million tonnes (MT). Additionally, UltraTech expanded into Jharkhand through the acquisition of Burnpur Cement, adding 0.5 MT grinding capacity.In FY24, UltraTech invested around Rs 9,200 crore in capital expenditures, increasing its domestic manufacturing capacity to about 141 MT (excluding Kesoram). The company plans to maintain a similar capex run-rate next year and aims to achieve a total capacity of around 157 MT by March 2025.Analysts expected strong demand for cement from from rural and infrastructure sectors, alongside increasing orders from urban real estate. The management is optimistic about a prolonged favorable demand environment in the cement sector.UltraTech's expansion plans for phases 2 (22.6 mtpa) and 3 (21.9 mtpa) are progressing as scheduled, aiming for completion by FY2027. Coupled with the acquisition of Kesoram (10.75 mtpa), this will elevate its total cement capacity to 195.4 mtpa (including overseas capacities). UltraTech is well-positioned to capitalise on the expanding cement demand expected over the next 4-5 years, with a positive outlook on profitability and balance sheet strength. ultra vs india cementStock price performanceIn 2023, UltraTech Cement significantly outperformed India Cement in terms of stock performance. However, this year both stocks are closely aligned, with each gaining around 11 percent.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "The announcement by UltraTech Cement to acquire a 23 percent stake in India Cements has sparked discussions about a potential hostile takeover.The acquisition of shares in the South India-based cement maker will place UltraTech in a significant position within India Cements, a company long associated with its owner N Srinivasan who, along with other promoter group members, holds only a 28.42 percent stake.The Stakes and the PlayersAs the largest manufacturer of cement in India, the Kumar Mangalam Birla-led UltraTech's move can be seen as a calculated effort to consolidate its dominance in the market. On the other hand, India Cements, with its historical significance and strong market presence, represents a valuable addition to any portfolio.Srinivasan, a prominent figure in the Indian cement industry and the vice-chairman and managing director of India Cements, now finds himself in a delicate position. With less than 29 percent stake, his control over the company is vulnerable. The difference between UltraTech’s newly acquired 23 percent stake and Srinivasan’s stake is slim, heightening the possibility of a power struggle.UltraTech’s plans to pick up a major stake in India Cements comes at a time when its biggest rival in the cement industry - the Adani group - has been rapidly increasing its size and scale with acquisitions. Last week, Adani group announced that it will acquire Penna Cements for over Rs 10,000 crore, adding 10 million tonnes per annum capacity to its portfolio. Last year, it bagged a controlling stake in Sanghi Cements.India Cements has a capacity of over 15.5 mtpa.Aditya Birla group itself became the biggest cement manufacturer in the country when it acquired UltraTech from L&T in 2004.While UltraTech in its stock exchange filing has labeled this stake purchase as a financial investment, analysts believe that the rationale behind the move could be to thwart the ambitions of any other corporate rival from making a acquisition move on India Cements.Large conglomerates such as Adani group and JSW group have been eyeing inorganic growth opportunities in the sector, where demand is expected to grow at a strong pace in the coming years, driven by rising infrastrudture spends by the Indian government and a revival of private sector capex.While UltraTech did not disclose the names of the India Cements shareholders from whom it intends to purchase the stake, the public shareholding of India Cements is dominated by three main investors with Dmart founder Radhakishan Damani holding the biggest chunk of 20.78 percent stake, followed by ELM Park Fund Ltd holding a 5.58 percent stake and LIC, which holds a 3.6 percent stake.As much as 20 percent equity stake in India Cements was sold in the block deal window on Thursday, 27 June.Hostile Takeover: A Real Possibility?A hostile takeover occurs when an acquiring company seeks to gain control of a target company against the wishes of its management. The relatively close stakes between UltraTech and Srinivasan suggest that UltraTech could potentially pursue this route. If UltraTech decides to increase its stake further, it might challenge Srinivasan’s control and push for changes in the management and strategic direction of India Cements.While the acquisition of a 23 percent stake will not trigger a mandatory open offer of 26 percent from public shareholders, as the stake purchase is below the threshold of 25 percent needed to exercise control under Sebi regulations, UltraTech can go ahead and announce a open offer to acquire stake from the public shareholders if it intends to take over control of the company.Additionally, the broader context of the Indian cement industry should be considered. The sector has seen consolidation over the past few years, with major players looking to enhance their capacities and market share through acquisitions. UltraTech’s recent move could be interpreted as part of this larger trend, positioning itself more favourably in an increasingly competitive market.The Road AheadThe coming months will be crucial in determining whether this acquisition will lead to a hostile takeover. Stakeholders and market analysts will be watching closely as both companies navigate this complex situation. For now, the possibility of a hostile takeover at India Cements remains speculative, but given the stakes and the players involved, it cannot be ruled out.Emails sent to UltraTech Cement, India Cements and Radhakishan Damani did not elicit a response till the time of publishing.\n       ",
    "UltraTech Cement shares gained in the morning trade on June 26 after the Aditya Birla-led cement player to acquire a stake in UAE-based RAK Cement (RAKWCT).On May 27, UltraTech Cement announced that it had made an offer to acquire 18.8 crore shares or a 31.6 percent stake in RAKWCT. However, in a filing with the bourses, the firm announced it amended its offer.\"This offer was revised to 12.5 crore shares of RAKWCT representing 25 per cent of the share capital of RAKWCT,\" said UltraTech in the filing.At 9.20 am, shares of the cement player were quoting Rs 11,042.15 on the NSE, up 1.8 percent from the previous close.Follow our live blog to catch all the updatesThe offer was made by UltraTech Cement Middle East Investments Limited, the firm's wholly owned subsidiary which is based in UAE.UltraTech announced on April 15 that UCMEIL plans to invest in 29.39 percent of the equity shares of RAKWCT, a listed company on the Abu Dhabi stock exchange.For the quarter ended March, UltraTech Cement posted a 35 percent surge in net profit, beating estimates, on the back of robust demand for the building materials and lower operating costs.Profit for the Aditya Birla Group company climbed to Rs 2,258.58 crore in the January-March period from Rs 1670.10 crore a year earlier.Over the past year, UltraTech Cement shares have jumped around 35 percent as compared to a 25 percent rise in the frontline index.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Here's a quick look at the stocks that will be in focus in trade on Wednesday, covering significant fund-raising activities, major deals, and key appointments announced by companies after market hours on Tuesday:Stocks To WatchCE Info SystemsPromoter Rakesh Kumar Verma is likely to sell a 0.9% stake in the company via block deal, reports CNBC-Awaaz, quoting sources. The floor price of the deal is Rs 2,293.20 per share, with an offer size of Rs 114.6 crore.Sanghi IndustriesPromoter Ambuja Cements and Ravi Sanghi will sell up to a 3.52% stake in Sanghi via offer for sale on June 26-27. The floor price for the OFS has been fixed at Rs 90 per share.UltraTech CementUltraTech Cement Middle East Investments Limited, the company's wholly-owned subsidiary in the UAE, has revised its offer to buy 1,25,039,250 shares of Ras Al Khaimah Co. for White Cement and Construction Materials PSC (RAKWCT), representing 25% of the share capital of RAKWCT, against the offer made for 1,58,049,610 shares (31.6% stake) earlier.Mahindra & Mahindra Financial ServicesVivek Karve has resigned as Chief Financial Officer of M&M Financial Services and Financial Services Sector, as he decided to pursue personal, social, and professional interests beyond full-time employment.Yes BankThe lender said shareholders will consider raising funds via the issue of debt securities on August 23.NTPCThe meeting of the Board of Directors of the company will be held on June 29 to consider the issue of non-convertible debentures (NCDs) up to Rs 12,000 crore, subject to approval of shareholders in the ensuing Annual General Meeting.RattanIndia EnterprisesVijay Nehra has resigned as the Chief Operating Officer (COO) of the company, effective June 24.Adani Ports and Special Economic ZoneSushant Kumar Mishra has ceased to be CEO-Logistics due to internal restructuring, effective June 25. Divij Taneja is appointed as CEO-Logistics from the same date.Akme Fintrade IndiaThe company will list its equity shares on the bourses in the trade-for-trade segment on June 26. The final issue price has been fixed at Rs 120 per share.DEE Development EngineersThe company will make its debut on the bourses on June 26. The issue price has been fixed at Rs 203 per share.SMC Global SecuritiesShareholders have approved the re-appointment of Subhash Chand Aggarwal as the Chairman and Managing Director of the company for another term of 5 consecutive years, effective January 29, 2025.GlaxoSmithKline PharmaceuticalsThe company has received an order from Maharashtra GST authorities, raising a GST demand worth Rs 71.65 crore for FY20, on premium charges paid to Thane Municipal Corporation in relation to land sale. The company says the order has no impact on GSK.Zee Entertainment EnterprisesThe National Company Law Tribunal (NCLT) has allowed the withdrawal of the implementation application for the composite scheme of arrangement with Sony.SME Listing on June 26Durlax Top Surface, Falcon Technoprojects India, GEM Enviro ManagementBulk DealsDCB BankIndia First Life Insurance Company has bought a 0.64% stake in the bank at an average price of Rs 140.15 per share. However, DSP Mutual Fund sold 0.54% of shares in the bank at the same price.Dodla DairyPineBridge Investments Asia Limited A/C PB Global Funds-PineBridge India EQ Fund bought 1.38% of shares in Dodla Dairy at an average price of Rs 1,000 per share. However, Mylktree Consultants LLP offloaded a 1.23% stake in the company at the same price.Jupiter WagonsCopthall Mauritius Investment has bought a 0.8% stake in the company at an average price of Rs 652 per share.Happiest Minds TechnologiesPromoter Ashok Soota sold a 6% stake in Happiest Minds at an average price of Rs 834.87 per share.Restaurant Brands AsiaGoldman Sachs Funds - Goldman Sachs India Equity Portfolio sold a 0.97% stake in the company at an average price of Rs 104.05 per share.Le Travenues TechnologySteadview Capital Master Fund bought a 0.5% stake in the Ixigo operator at an average price of Rs 163.83 per share.Stocks Trade Ex-dividendAegis Logistics, Welspun Living, Digital Fibre Infrastructure TrustF&O BanGNFC, Indus Towers, Punjab National Bank, SAIL\n       ",
    "India's infrastructure and capex boom through projects like the PM Gati Shakti is creating opportunities in the stock market as well, Morgan Stanley said, listing out key names that it is bullish on.Analysts at Morgan Stanley have cited Larsen & Toubro, NTPC, Titagarh Rail Systems and Ultratech Cement as among the key names benefitting from the government spend on infrastructure. The capex boom is also expected to dampen inflation, and boost corporate profitability, according to the analysts.A Morgan Stanley note informed investors that the momentum that India's infrastructure development has seen over the last decade is projected to continue. Analysts expect infrastructure investments to rise from 5.3 percent of GDP in FY24 to 6.5 percent of GDP by FY29, reflecting a robust 15.3 percent compound annual growth rate (CAGR). This increase will result in cumulative spending of approximately $1.45 trillion over the next five years, the note said.This surge in infrastructure investment is expected to enhance overall investment rate and foster a period of sustained, high, productive growth.Follow our market blog to catch all the live actionBeneficiaries of India's infra push1. Larsen & Toubro (L&T)According to Morgan Stanley, increased government spend on infrastructure projects would likely benefit L&T significantly. Additionally, a moderation in steel and other material prices could improve the company’s cost structure.An overall improvement in the economy, leading to higher-than-anticipated private capex, would also be a positive driver for L&T.However, a slowdown in government-led infrastructure capex is a key risk for the company's prospects, so is a slowdown in the execution cycle which could hamper project completion and profitability. Geopolitical risks could lead to slower execution of projects, and a sharp increase in material costs could squeeze margins.2. NTPCAccording to Morgan Stanley, the potential upside for NTPC includes faster capacity addition driven by stronger power demand and improving health of State Electricity Boards (SEBs), value-accretive acquisitions, and value unlocking in subsidiaries.On the downside, risks involve delays in commissioning, fixed cost under-recovery due to coal or machine availability issues, investments in non-core businesses, and value-decreasing acquisitions.3. Titagarh Rail SystemsFor Titagarh Rail Systems, Morgan Stanley's base case is derived from a target P/E of 35x for September 2026 earnings. This multiple is considered fair, given strong earnings visibility from a large backlog and improving return ratios, which are the best among peers, the foreign brokerage said.An improvement in freight margins and a faster-than-expected ramp-up in passenger coach execution are significant positive drivers for Titagarh. Additionally, an acceleration in passenger segment margins beyond expectations would further enhance the company's financial performance, said analysts.Also Read | Goldman Sachs has a Sell on Tata Tech, VinFast reliance a vulnerabilityHowever, supply chain issues could affect the freight business and hamper execution. A slowdown or delay in wagon tendering and ordering for passenger coaches could hurt operating margins.Additionally, delayed execution of contractual obligations could lead to liquidated damages, which would negatively affect the company's financial health.4. Ultratech CementMorgan Stanley believes that despite near-term uncertainties, the medium-term demand visibility for Ultratech Cement remains strong. The brokerage note has identified several factors that could drive the stock's performance, including continued demand and a sharp decline in input prices.However, a weaker-than-expected demand offtake is possible if the macroeconomic situation worsens, and a rise in input prices could increase overall costs without corresponding higher realizations, thus denting company's profitability.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "The benchmark indices recorded a historic high and closed the session with gains exceeding 3 percent on June 3, with about 1,496 shares advancing and 825 shares declining on the NSE. The market sentiment is likely to be positive in the coming sessions. Here are some trading ideas for the near term.Mehul Kothari, DVP – Technical Research at Anand RathiDalmia Bharat | CMP: Rs 1,858After peaking near the Rs 2,060 mark on April 4, 2024, Dalmia Bharat experienced a significant downturn, with a decline of approximately 360 rupees, equating to roughly 17-18 percent. However, in the subsequent two trading sessions, Dalmia Bharat demonstrated resilience by avoiding further drops and instead reversed around the middle Bollinger band. Notably, in the prior trading session, there was considerable buying activity observed at lower price levels, suggesting investor interest in purchasing the stock at these levels.From a technical perspective, the daily DMI (Daily Movement Index) indicator has given a bull cross, indicating a potential shift in momentum and presenting an attractive buying opportunity. Consequently, traders are advised to consider buying Dalmia Bharat within the range of Rs 1,830-1,860, with an anticipated upside target of Rs 2,000 and a stop-loss placed at Rs 1,765 based on a daily closing price.Strategy: BuyTarget: Rs 2,000Stop-Loss: Rs 1,765UPL | CMP: Rs 528After a period of consolidation in the approximate range of Rs 505-530, UPL has successfully broken out of a bearish trendline that had persisted for five months. The stock is now comfortably maintaining its position above this trendline, indicating a strong upward movement. From an indicator perspective, the weekly Stochastics has given a bull cross near 60 levels, which is a positive sign for potential gains. Based on this analysis, we recommend that traders and investors consider taking a long position in the range of Rs 520-530. The target for this upward move is set at Rs 580, with a stop-loss placed at Rs 498 based on a daily closing price.Strategy: BuyTarget: Rs 580Stop-Loss: Rs 498Aether Industries | CMP: Rs 814Following a correction of roughly 60 rupees, equating to a notable 7 percent downturn, Aether Industries has shifted its course away from the prior support mark of Rs 800. This support level notably coincides with the lower Bollinger band, implying a potential rebound, particularly given the bullish crossover on the stochastic indicator on the daily scale, signifying an appealing opportunity.Consequently, investors are advised to contemplate purchasing within the range of Rs 805-820, envisioning an upward trend with a target price of Rs 875. To manage risk effectively, it is recommended to implement a stop-loss order near Rs 780, centered on daily closing figures, to mitigate potential losses.Strategy: BuyTarget: Rs 875Stop-Loss: Rs 780Jay Thakkar, Vice President & Head of Derivatives and Quant ResearchReliance Industries | CMP: Rs 3,021Reliance has provided a breakout from the falling channel with a clear bullish crossover in its momentum indicator MACD (Moving Average Convergence Divergence) on both the hourly and daily charts. The stock is now likely to see good support in the Rs 2,980 to Rs 2,950 range.Strategy: BuyTarget: Rs 3,200, Rs 3,260Stop-Loss: Rs 2,950UltraTech Cement | CMP: Rs 10,470UltraTech has provided a breakout from sideways consolidation with a bullish crossover on its momentum indicator MACD.Strategy: BuyTarget: Rs 11,000, Rs 11,200Stop-Loss: Rs 10,100Bajaj Finance | CMP: Rs 6,916Bajaj Finance seems to have completed the right shoulder of the Bullish Head and Shoulders pattern. Currently, it has taken good support at the lower Bollinger band and completed the right shoulder. The move prior to this was an impulse move on the upside, hence the probability of an upside is higher.Strategy: BuyTarget: Rs 7,250, Rs 7,400Stop-Loss: Rs 6,744Pravesh Gour, Senior Technical Analyst at Swastika InvestmartABB India | CMP: Rs 8,728ABB India is displaying classical bullish momentum and forming a Flag pattern on the daily chart. The overall structure is highly attractive, as it is trading above all its moving averages. The RSI (Relative Strength Index) is favourably positioned, and the MACD is reinforcing the current strength. On the upside, Rs 9,000 is the immediate resistance. Breaking this level could lead to a rise towards Rs 9,500+ in the near term. On the downside, Rs 8,100 is a key support level in case of any correction.Strategy: BuyTarget: Rs 9,604Stop-Loss: Rs 8,100J Kumar Infraprojects | CMP: Rs 775J Kumar Infraprojects is emerging from a Symmetrical Triangle pattern formation on the daily chart while on a weekly basis it has witnessed a breakout of a Bullish Flag formation with strong volume. The overall structure is very lucrative as it trades above all its important moving averages. On the upside, Rs 800 is an immediate resistance area; above this, we can expect a run-up towards Rs 850+ levels in the near term. On the downside, Rs 700 is major support for any correction. The momentum indicator RSI is also positively poised, whereas MACD is supporting the current strength.Strategy: BuyTarget: Rs 884Stop-Loss: Rs 700JSW Energy | CMP: Rs 659JSW Energy has witnessed a breakout of a Triangle pattern formation on the daily chart. It has formed a base at around Rs 590-600 levels. The structure of the counter is very lucrative, as it is trading above all of its moving averages. On the upside, Rs 700 is an immediate psychological resistance level; above this, we are expecting a move towards the Rs 740+ level. On the downside, Rs 600 is a major support, and below this, Rs 590 is the next important support.Strategy: BuyTarget: Rs 744Stop-Loss: Rs 590Indus Towers | CMP: Rs 364Indus Towers is emerging from a prolonged consolidation phase on the daily chart. On the weekly chart, it has broken out of a Bullish Flag pattern accompanied by significant volume. It has retested its last breakout level at around Rs 320 and started a new leg of the rally towards Rs 400. The overall structure is highly attractive as the stock is trading above all key moving averages. On the upside, Rs 380 is an immediate resistance level. Surpassing this, we can anticipate a rally towards Rs 400+ levels in the near term. On the downside, Rs 330 serves as a major support level for any potential correction. The RSI is positively positioned, and the MACD supports the current strength.Strategy: BuyTarget: Rs 408Stop-Loss: Rs 330Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Disclosure: Moneycontrol is a part of the Network18 group. Network18 is controlled by Independent Media Trust, of which Reliance Industries is the sole beneficiary. ",
    "Ultratech Cement announced that it made an offer to acquire a 31.6 percent stake in UAE-based RAK Cement Co for White Cement and Construction Materials PSC (RAKWCT).RAK Cement Co will be acquired through Ultratech's UAE-headquartered wholly-owned arm, UltraTech Cement Middle East Investments Ltd.The offer period shall open from May 28 and shall remain open up to June 24.This comes after the cement manufacturer previously disclosed plans to invest $10.10 million (around Rs 839.52 crore) to acquire 29.39 percent equity share capital of RAK Cement Co.Through the acquisition, Ultratech seeks to leverage its expertise in white cement manufacturing to expand RAK Cement's business locally, regionally, and globally.Abu Dhabi Stock Exchange-listed RAK Cement Co, incorporated in September 1980, has reported a turnover of Rs 576.30 crore in 2023, a growth of over 7 percent from the previous year. Its turnover stood at Rs 537.40 crore in 2022 and Rs 482.50 crore in 2021.UltraTech has a consolidated capacity of 138.39 MTPA of grey cement, operating in 23 integrated manufacturing units, 29 grinding units, one clinkerisation unit, and 8 bulk packaging terminals.The cement manufacturer reported better-than-expected earnings for the March quarter of FY25. Its net profit rose 35 percent on year to Rs 2,258.58 crore, beating Moneycontrol's estimate of Rs 1,976.58 crore. The growth was attributed to strong demand for building materials and reduced operating costs. On the other hand, revenue also jumped 9.4 percent on-year to Rs 20,418.94 crore.On May 27, shares of Ultratech Cement settled flat at Rs 10,225.50 on the NSE.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "The market continued its higher highs formation for the 11th straight session and reached a fresh record high above 23,100, but the bears pulled the Nifty 50 down below the 23,000 mark on a closing basis on May 27. The BSE Sensex and Nifty 50 closed moderately lower, forming a bearish candlestick pattern on the daily charts. Meanwhile, the market breadth was negative for another session as approximately 1,420 equity shares declined against 877 shares advancing on the NSE. The index is likely to be rangebound with resistance at 23,100-23,200 and support at 22,800 in the coming sessions, while volatility is expected to be elevated ahead of the Lok Sabha election results. Here are some trading ideas for the near term:Pravesh Gour, Senior Technical Analyst at Swastika InvestmartPrudent Corporate Advisory Services | CMP: Rs 1,730Prudent Corporate Advisory has broken out of a long consolidation period on the weekly chart. A breakout from this consolidation suggests a potential shift in market sentiment and an increased likelihood of a sustained move in the price. On the daily chart, the counter has experienced a V-shaped recovery from the last breakout level at Rs 1,500, and starts a new leg of the rally towards Rs 1,800.The overall structure of the counter is very lucrative, as it is trading above all its important moving averages. The momentum indicator RSI (relative strength index) is also positively poised, whereas MACD (moving average convergence divergence) is supporting the current strength.On the upside, Rs 1,800 is an important psychological level; above this, we can expect a move towards Rs 1,900+. On the downside, a cluster of moving averages around Rs 1,580 is a strong demand zone during any correction.Strategy: BuyTarget: Rs 1,944Stop-Loss: Rs 1,580Hindustan Petroleum Corporation | CMP: Rs 557HPCL appears to be emerging from a prolonged consolidation phase, marked by robust trading volumes and a breakout from a triangle pattern. Analysing its daily chart reveals a classical structure. The pattern indicates a primary target of Rs 580, with potential for further gains towards Rs 620.For downside protection, Rs 510 serves as an immediate support level. The MACD indicator reinforces the current bullish momentum, complemented by a positive positioning of the RSI indicator.Strategy : BuyTarget: Rs 624Stop-Loss: Rs 510Gravita India | CMP: Rs 1,139Gravita India has witnessed a breakout of a long trendline with strong volume and closed above Rs 1,100 levels. A cluster of moving averages formed a base at Rs 900 levels, making the counter lucrative on a long-term basis.On the higher side, Rs 1,200 acts as a susceptible level; above this, we can expect a long move towards Rs 1,280+ in the shorter to longer timeframe, while on the lower side, Rs 1,050 serves as an important support during any correction.Strategy: BuyTarget: Rs 1,284Stop-Loss: Rs 1,050Exide Industries | CMP: Rs 494On the daily chart, Exide has witnessed a breakout of a long consolidation formation with huge volume, while on the weekly chart, it has broken a Flag formation pattern. The counter has a classic structure because it is trading above all of its significant moving averages.On the upper side, Rs 500 is an immediate resistance; above this, we can expect a big move till Rs 540+ in the shorter time frame, while on the downside, Rs 460 is the demand zone for any correction. The momentum indicator RSI is also positively poised, whereas MACD is supporting the current strength.Strategy: BuyTarget: Rs 544Stop-Loss: Rs 460Jay Thakkar, Vice President & Head of Derivatives and Quant ResearchReliance Industries | CMP: Rs 2,932.5Reliance Industries seems to have completed a three-wave corrective fall in a downward sloping parallel channel. The stock has taken good support at the lower end of the channel and has started to form higher tops and higher bottoms. The momentum indicator has also reversed and provided a bullish crossover on the daily charts, thus indicating a short-term uptrend and higher probability of an upward breakout from the falling channel.In the event of an upward breakout, Reliance is likely to inch towards Rs 3,100 levels, whereas on the lower side, Rs 2,870 is now an immediate support. The stock has seen good short covering since mid-April; however, the long additions may come only once there is a strong breakout from the falling channel.Strategy: BuyTarget: Rs 3,100Stop-Loss: Rs 2,870UltraTech Cement | CMP: Rs 10,225.5UltraTech has provided a breakout from the falling channel and has provided a convincing close above the same. The momentum indicator MACD has also turned bullish and shown positive divergence, which is bullish in the short to medium term. On the upside, the stock is likely to surpass its all-time high levels and inch towards Rs 10,750 to Rs 11,000 levels.On the lower side, it has strong support at Rs 9,950 levels. The stock has witnessed good short covering from the lower end of the falling channel, and with this breakout, it has seen some long additions as well. Hence, until Rs 9,950 levels are not broken, the overall short to medium-term outlook remains positive on UltraTech Cement.Strategy: BuyTarget: Rs 10,750, 11,000Stop-Loss: Rs 9,950Axis Bank | CMP: Rs 1,187Axis Bank has once again formed a lifetime high, clearly indicating that the overall trend is bullish. The momentum indicator MACD has again come back into the buy mode, whereas it is already in the buy mode on the weekly chart. The stock is inching towards Rs 1,240/1,280 levels from here on. On the lower side, it has crucial support near Rs 1,140 levels, and till those levels are held, the overall trend remains bullish. After short covering in the April series, the stock has seen good long buildup in the May series.Strategy: BuyTarget: Rs 1,240, 1,280Stop-Loss: Rs 1,140Ashish Kyal, CMT, Founder / CEO of Waves Strategy AdvisorsJBM Auto | CMP: Rs 2,117JBM Auto has been moving higher and is intact in a strong uptrend. In the previous session, it closed with a massive gain of 7.67 percent. On the daily chart, in the previous session, prices formed a bullish candle. The price was moving in a rectangular range over the last few days, indicating accumulation in the stock. It has now closed above this trading range, resulting in a bullish breakout of the rectangular pattern.KST (know sure thing) has turned above the signal line and is also trading above the zero line, which is a positive sign. We can expect good momentum to continue in this stock. Support is placed at Rs 2,000.In short, the trend for this stock is positive. Use dips towards Rs 2,080-2,100 as a buying opportunity for a move towards Rs 2,370-2,400 levels as long as Rs 2,000 holds on the downside.Strategy: BuyTarget: Rs 2,370, 2,400Stop-Loss: Rs 2,000Automotive Stampings and Assemblies | CMP: Rs 896.55Automotive Stampings formed a large bullish candle in the previous session with a surge in volume. It closed the previous session on a positive note with a huge gain of 9.60 percent. On the chart, we can see that the prices have been consolidating between a range of Rs 802-920. Resistance as per this is near Rs 920 levels.Additionally, prices closed near the upper band of the Bollinger Bands. A sustainable close above the upper band will resume an uptrend. In short, the trend is positive. Any break above Rs 920 can lift prices higher towards Rs 1,030. On the downside, support is placed at Rs 865 levels.Strategy: BuyTarget: Rs 1,030Stop-Loss: Rs 865Paras Defence and Space Technologies | CMP: Rs 894.7Paras Defence has been moving higher recently and is intact in a strong uptrend. In the previous session, it closed with a gain of 4.14 percent. On the daily chart, prices formed a bullish candle in the previous session. Recently, prices have broken out of the consolidation range with huge volumes. We have shown the ADX (average directional index) indicator, which gives an indication if the stock is trending or in a trading range. The ADX of this stock is 25.18, indicating a trending market. Closest support is placed at Rs 840.In short, the trend for this stock is positive. Use dips towards Rs 880 as a buying opportunity for a move towards Rs 980 levels as long as Rs 840 holds on the downside.Strategy: BuyTarget: Rs 980Stop-Loss: Rs 840Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Disclosure: Moneycontrol is a part of the Network18 group. Network18 is controlled by Independent Media Trust, of which Reliance Industries is the sole beneficiary. ",
    "The market reported an intraday all-time high with the Nifty 50 surpassing the 23,000 mark for the first time but failed to sustain above it at close on May 24. The benchmark indices, the BSE Sensex and Nifty 50, closed flat with a negative bias, though they clocked 2 percent gains for the week, forming a strong bullish candlestick pattern on the weekly charts. However, market breadth remained in favour of the bears as approximately 1,374 equity shares declined against 884 shares advancing on the NSE. The 23,000 level is expected to play a key role in the Nifty's further direction, and sustaining this level can take the index towards the upper band of the Rising Channel (i.e., 23,100-23,200), followed by 23,500, with support at 22,800. Here are some trading ideas for the near term:Vinay Rajani, CMT, Senior Technical/Derivative Analyst at HDFC SecuritiesUltraTech Cement | CMP: Rs 10,231UltraTech has broken out from the downward sloping channel on the weekly charts. The price breakout is accompanied by a jump in volumes. Cement stocks have regained momentum, which is expected to continue. The stock is placed above all important moving averages, indicating a bullish trend across all time frames. Indicators and oscillators are showing strength in the current uptrend.Strategy: BuyTarget: Rs 11,000Stop-Loss: Rs 9,762Central Depository Services | CMP: Rs 2,145.55CDSL has been consolidating in a range for the last 5 weeks. The primary trend of the stock is bullish as it has been forming higher tops and higher bottoms on the weekly chart. It is placed above all important moving averages, indicating a bullish trend across all time frames.Strategy: BuyTarget: Rs 2,320Stop-Loss: Rs 2,000Axis Bank | CMP: Rs 1,174Axis Bank registered a running correction and now seems to have resumed its uptrend. The stock has taken support near its previous swing high on the daily chart. The primary trend of the stock has been bullish with higher tops and higher bottoms. It is placed above all important moving averages, indicating a bullish trend across all time frames.Strategy: BuyTarget: Rs 1,260Stop-Loss: Rs 1,117Rajesh Palviya, Senior Vice President Research (Head Technical Derivatives) at Axis SecuritiesAshok Leyland | CMP: Rs 210.70Ashok Leyland is in a strong uptrend across all time frames, forming a series of higher tops and bottoms, indicating a positive bias. It has registered an all-time high at Rs 219, indicating bullish sentiments. It is well placed above its 20, 50, 100, and 200-day SMAs (simple moving averages), and these averages are also inching up along with the price rise, reaffirming the bullish trend.The daily, weekly, and monthly strength indicators (RSI) are in positive terrain, which justifies the rising strength across all time frames. The weekly \"Bollinger Band\" buy signal shows increased momentum. Investors should buy, hold, and accumulate this stock with an expected upside of Rs 230-245, with a downside support zone of Rs 204-200 levels.Strategy: BuyTarget: Rs 230, 245Stop-Loss: Rs 204, 200ISGEC Heavy Engineering | CMP: Rs 1,188On the daily chart, ISGEC has confirmed a \"Cup & Handle\" formation breakout at Rs 1,150 levels on a closing basis. This breakout is accompanied by huge volumes, showing increased participation. The stock is well placed above its 20, 50, 100, and 200-day SMAs, and these averages are also inching up along with the price rise, reaffirming the bullish trend.The daily, weekly, and monthly strength indicators (RSI) are in positive terrain, which justifies the rising strength across all time frames. Investors should buy, hold, and accumulate this stock with an expected upside of Rs 1,285-1,380, with a downside support zone of Rs 1,100-1,050 levels.Strategy: BuyTarget: Rs 1,285, 1,380Stop-Loss: Rs 1,100, 1,050Bharat Electronics | CMP: Rs 297Bharat Electronics is in a strong uptrend across all time frames, forming a series of higher tops and bottoms, indicating a positive bias. It has registered an all-time high at Rs 299, indicating bullish sentiments. The stock is well placed above its 20, 50, 100, and 200-day SMAs, and these averages are also inching up along with the price rise, reaffirming the bullish trend.The daily, weekly, and monthly strength indicators (RSI) are in positive terrain, which justifies the rising strength across all time frames. The weekly \"Bollinger Band\" buy signal shows increased momentum. The huge rising volumes over the past three weeks signify increased participation in the rally. Investors should buy, hold, and accumulate this stock with an expected upside of Rs 313-345, with a downside support zone of Rs 280-265 levels.Strategy: BuyTarget: Rs 313, 345Stop-Loss: Rs 280, 265Rajesh Bhosale, Technical Analyst at Angel OneMetropolis Healthcare | CMP: Rs 1,970.75For the past two years, Metropolis prices have been consolidating within a range of Rs 1,200 to 1,900, forming a base. In the week ending May 24, prices finally broke out above this range, confirming a bullish \"Rounding Bottom\" reversal pattern. This upward movement has been supported by strong volumes, and on the daily chart, prices are comfortably trading in a \"higher top higher bottom\" formation, indicating that every dip is being bought.Additionally, prices are well above key averages, and oscillators are positively aligned, supporting a buy recommendation. Considering all the above factors, we have a strong bullish view on this counter. Hence, we recommend buying Metropolis around Rs 1,970 - 1,960, with a stop-loss at Rs 1,820 and a target of Rs 2,220 - 2,250.Strategy: BuyTarget: Rs 2,220, 2,250Stop-Loss: Rs 1,820Rashtriya Chemicals and Fertilisers | CMP: Rs 157Rashtriya Chemicals has achieved a significant bullish breakout by closing above the key resistance level of Rs 155, which has held for the past three months. By surpassing this hurdle, the prices have confirmed both an 'Inverse Head and Shoulders' and an 'Ascending Triangle' breakout on the daily chart. This breakout is supported by a surge in volumes and a large bullish candle.Prices have established a strong base on the 200 SMA and have now moved above the Super Trend indicator, indicating strong momentum in the near term. Given the buzz in this space, we expect this stock to take the lead. Hence, we recommend buying RCF around Rs 156 - 153, with a stop-loss at Rs 145 and a target of Rs 173.Strategy: BuyTarget: Rs 173Stop-Loss: Rs 145IRB Infrastructure Developers | CMP: Rs 72.55After reaching new highs around Rs 72 in February, IRB Infrastructure prices entered a correction phase where any rally towards Rs 72 was met with selling pressure. Now, after three months, this range has been broken with prices closing above this hurdle, confirming a continuation 'Cup and Handle' pattern breakout. The prices are now in uncharted territory, indicating strong bullish sentiment.Additionally, the volume activity has increased, and momentum, after a recent cooldown, is once again pointing upward, supporting the bullish outlook. Known for its momentum moves, we expect strong trending activity in this stock in the near term based on these formations. Hence, we recommend buying IRB around Rs 72 - 70, with a stop-loss at Rs 65.8 and a target of Rs 80.Strategy: BuyTarget: Rs 80Stop-Loss: Rs 65.8Jigar S Patel, Senior Manager - Equity Research at Anand RathiSumitomo Chemical India | CMP: Rs 440Sumitomo Chemical India has recently faced a significant decline in its stock price and is currently trading around Rs 418, which is close to its 200-day exponential moving average (DEMA). This proximity to the DEMA suggests that the stock might find support at this level, as the 200-day DEMA is commonly regarded as a crucial indicator of long-term trends and support. Additionally, technical analysis reveals that the daily Moving Average Convergence Divergence (MACD) indicator has formed a bullish crossover. This occurs when the MACD line crosses above the signal line, indicating a potential shift from a downward trend to an upward trend.Moreover, a bullish Bat pattern has appeared on the weekly chart. This harmonic pattern typically signifies a reversal in the market, suggesting that the recent downtrend may be nearing its end and an upward movement might be forthcoming. These combined indicators—the support level near the 200-day DEMA, the bullish MACD crossover, and the bullish Bat pattern—suggest a potentially favourable buying opportunity for investors.Based on these positive technical signals, we recommend that traders and investors consider entering long positions in Sumitomo Chemical within the price range of Rs 430-Rs 440. The target for this trade is Rs 495, which represents a substantial potential gain from the current levels. To manage risks effectively, we advise setting a stop-loss at Rs 405 on a daily closing basis.Strategy: BuyTarget: Rs 495Stop-Loss: Rs 405Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "KR Choksey's research report on UltraTech CementUltraTech Cement reported strong numbers which beat our estimates across the board. The revenue reached INR 2,04,189 Mn, marking a 9.4% YoY increase, driven mainly by a 17.0% YoY growth in premium product sales. EBITDA of INR 41,139 Mn increased by 23.8% YoY, primarily due to lower-than-expected employee expenses and other expenses; EBITDA margins expanded by 234 bps YoY. PAT increased by 27.1% YoY to INR 22,581 Mn due to better-than-expected operational performance; PAT margins increased by 213 bps YoY.OutlookWe apply an increased multiple of 16.5x to FY26E EBITDA, aligning with the Company's ability to deliver improved profitability, prompting us to raise our Target Price (TP) to INR 10,776 per share and upgrade our rating to ACCUMULATE.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.UltraTech Cement - 06052024 - kr ",
    "Geojit Financial Services research report on UltraTech CementUltraTech Cement Ltd is the largest cement manufacturer in India. It produces grey and white cement and ready-mix concrete (RMC). Revenue grew 9.4% YoY to Rs. 20,419cr in Q4FY24 aided by rise in cement and RMC sales volume. However, domestic realisation declined due to fall in cement prices across regions. In Q4FY24, EBITDA stood at Rs. 4,250cr (up 23.4% YoY). The EBITDA margin expanded 230bps YoY despite increases in costs. This expansion was mainly driven by an increase in revenue. Adjusted PAT attributable to shareholders improved 39.9% YoY to Rs. 2,330cr.OutlookThe company witnessed strong rebound in demand in Q4FY24. With the improved sector outlook, Ultratech’s capacity expansion plans and cost efficiency measures will benefit the company’s profitability. However, we believe that the company is currently trading at high valuation levels and therefore, we upgrade our rating on the stock to HOLD with a revised target price of Rs. 10,670 based on 15.5x FY26E EV/EBITDA.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.UltraTech Cement - 06052024 - geo ",
    "Sharekhan's research report on UltraTech CementUltraTech Cement (UltraTech) reported strong standalone operational performance beat for Q4FY2024 driven by higher volumes and lower opex/tonne. Standalone revenues were up 9.4% y-o-y at Rs. 19,805.9 crore, led by 11% y-o-y growth in cement volumes while blended realisations were lower 2% y-o-y. Blended standalone EBITDA/tonne at Rs. 1186 (up 11.1% y-o-y) was higher than our estimate of Rs. 1027/tonne. On the critical operating cost front, power & fuel costs declined 18.5% y-o-y per tonne basis (down 10.5% q-o-q).OutlookUltraTech is well poised to benefit from a strong demand environment led by government spending on infrastructure and rising demand from the housing sector. The company remains on track concerning its capacity expansion plans through organic and inorganic routes. Industry consolidation and structural demand drivers provide operational profitability growth tailwinds for the company. At CMP, the stock is trading at an EV/EBITDA of 19.5x/15.7x its FY2025E/ FY2026E earnings, which we believe provides further room for upside. Hence, considering its long-term growth potential, we maintain our Buy rating on the stock, with an unchanged PT of Rs. 11,900 owing to strong earnings growth outlook over FY2024-FY2026E.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Sharekhan_UltraTech020524 ",
    "ICICI Securities research report on UltraTech CementUltraTech Cement’s (UTCEM) exemplary performance in Q4FY24 highlights the virtues of operating leverage – as sales volumes accelerated 11% YoY/28% QoQ (vs 7-8% YoY industry growth). While realisation was the obvious casualty (down 6% QoQ), better fixed costs apportioning kicked in ~INR 250/t tailwind (on QoQ basis), driving 15% EBITDA beat. That said, the overhang of the underlying weakness in cement prices (and its uncertain outlook) is compelling us to prune FY25E EBITDA by ~9%.OutlookHowever, we largely retain estimates for FY26 giving credence to management’s new resolve to prune operating cost by ~INR 200-300/t over FY25-FY27. With current valuation of 16x FY26E EV/EBITDA (at par with our target multiple) fully factoring in these benefits, we retain HOLD (TP unchanged at INR 10,411).For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.UltraTech Cement - 30042024 - isc ",
    "Prabhudas Lilladher's research report on Ultratech CementUltratech Cement (UTCEM) reported strong operating performance in 4Q, led by 11% YoY volume growth. EBITDA per ton of Rs1,185 was higher than PLe of Rs1,007/t led by lower P&F and other expenses. UTCEM expects some moderation in industry demand in FY25 and expects industry to witness high single digit growth led by an improved momentum in private sector housing. With its 15-17mtpa capacity getting commissioned in FY25E, we expect UTCEM to grow faster than industry. Cost efficiencies are expected to improve for UTCEM over next few years led by an increase in green power mix, AFR %, blending ratio, and higher volumes driving operating leverage. We expect UTCEM revenue/ EBITDA/ PAT to deliver CAGR of 12%/24%/27% over FY24-26E.OutlookThe stock is trading at EV of 17.6x/14.7x FY25E/FY26E EBITDA. Maintain ‘BUY’ with revised TP of Rs11,608 (earlier Rs11,332) valuing at 17x EV of Mar’26E EBITDA.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.Ultratech Cement - 30042024 - prabhu ",
    "Sharekhan's research report on UltraTech CementThe company reported strong standalone operational beat for Q4FY2024, aided by higher than expected volume growth and lower opex per tonne. It is poised to outpace industry demand growth rates during FY2025 while opex cost curve is expected to tread lower over the next three years. Capacity expansion plans remain on track to achieve almost 200 mtpa global capacities by FY2027 end. Net debt to be further trimmed down by FY2025 end.OutlookWe maintain a Buy on UltraTech with an unchanged PT of Rs. 11,900, considering its long-term growth potential led by structural demand drivers.For all recommendations report, click hereDisclaimer: The views and investment tips expressed by investment experts/broking houses/rating agencies on moneycontrol.com are their own, and not that of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions.UltraTech Cement_30042024_Sharekhan ",
    "Ultratech Cement posted strong revenue and profit in Q1, driven by double-digit volume growth and lower costs. However, declining prices were a concern due to erratic cement pricing across the country. The management expects subdued demand this fiscal year but does not anticipate a prolonged slowdown.The company reported strong financials, with consolidated net profit at Rs 2258 crore, up 36% YoY and 27% QoQ, and consolidated sales at Rs 20,419 crore, up 9.4% YoY and 22% QoQ. EBITDA stood at Rs 4,250 crore, up 25% QoQ and 23% YoY, with consolidated net debt at Rs 2,779 crore as of March 31.Domestic grey cement sales grew by 11% YoY and 31% sequentially to 33.22 million tonnes, while smaller segments such as white cement and ready mix also saw growth; though cement exports dipped slightly.Brokerage viewsAfter the results, most brokerages maintained their ratings. Dolat Capital upgraded the stock to buy from accumulate, setting a revised target price of Rs 11,485 per share. Nuvama maintained a hold rating with a target price of Rs 10,024 per share. Jefferies India retained its buy rating but marginally lowered the target price to Rs 11,500 from Rs 11,560 per share.Nomura maintained a buy rating and raised the target price by 20 percent to Rs 12,000. B&K Securities also kept a buy rating with a target price of Rs 11,189 per share.Following are the analysts' notes on Ultratech Stock post earnings:Nomura: Ultratech aims to achieve a cement capacity of 200MT or more, with a projected growth to 183MT (excluding Kesoram) by FY27, representing a 9 percent CAGR from FY24-27. Phase 3 expansion plans include adding 22MT capacity at USD72/t with an estimated IRR of 15 percent. The company awaits regulatory approvals for the acquisition of Kesoram, which is expected to be completed by March 2025, taking Ultratech's capacity to over 190MT by FY27F. The management is confident about achieving the 200MT capacity organically.Despite recent price increases, lower consumption in the election quarter may lead to moderated prices, with a projected 1% sequential decline in blended realisation. Volume moderation in the election quarter may result in 7 percent higher fixed costs in 1QFY25F, leading to an expected moderation in EBITDA/t to Rs 1,080/t in 1QFY25F.Jefferies India: Ultratech's performance in the fourth quarter surpassed expectations, with EBITDA growing by 24 percent YoY and 26 percent QoQ. This was despite weak prices being balanced out by slightly better volumes (+11% YoY), increased other operating income, and reduced overheads.The management emphasised targeted cost savings of Rs 200-300 per ton in the medium term to drive profitability. We have adjusted our FY25 EBITDA estimate downward by 2 percent, but maintain our FY26 estimates. This adjustment is due to our revised expectation of flat price growth YoY (previously estimated at +1-2 percent YoY), anticipating margin expansion in FY25 as cost-saving initiatives from the second half of FY24 continue into FY25.Dolat Capital: Ultretech's capacity is set to increase from 146.2/152.7 million tonnes per annum (mtpa) in FY24/Q1FY25 to 162.4/184.9 mtpa by FY25E/FY26E. With additions like 10.75 mtpa from Kesoram and 5.4 mtpa from overseas, the total consolidated cement capacity will reach 199.6 mtpa by FY27E, supporting future growth. Healthy operating cash flow (averaging Rs 144.6 billion/year over FY24-FY26E) and free cash flow (averaging Rs 34.6 billion/year over FY24-FY26E) will lead to deleveraging.Ultratech, as the largest player in the Indian cement industry, has a significant advantage. Additionally, we anticipate issuing approximately 5.97 million new equity shares (2 percent) to Kesoram Industries' shareholders in FY26E.B&K Securities: Ultratech continued its double-digit volume growth for the second consecutive year, surpassing industry averages. Rapid capacity utilisation post-commissioning reflects strong brand and distribution. Despite short-term moderation, positive demand trend is expected due to a housing cycle upturn and ongoing infrastructure projects. Capacity growth aligns with industry trends, while cost efficiency measures enhance profitability outlook.Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ",
    "Aditya Birla Group flagship UltraTech Cement, Sajjan Jindal-promoted JSW Cement, Lakshmi Mittal-run ArcelorMittal and a dozen other companies have set sights on Vadraj Cement, formerly owned by ABG Shipyard, according to an Economic Times report.The report stated that these companies have secured creditors’ debt of about Rs 8,000 crore. Moneycontrol couldn't independently verify the report.Other potential buyers include Nirma Group, JK Cement, a Naveen Jindal group entity, and Oaktree Capital, the report said.AM Mining India, a joint venture between ArcelorMittal and Nippon Steel, Oaktree Capital-backed India Opportunities XII Investments, and Nirma group-backed Nuvoco Vistas Corporation submitted expressions of interest (EoIs) for the assets. Jindal Panther Cement, a Naveeen Jindal group company, and PN Group-promoted CN Infrabuild also gave separate EoIs, the report added.UltraTech Cement posted a 35 percent surge in net profit in the fourth quarter of FY24, beating estimates on the back of robust demand for building materials and lower operating costs. The company plans a capex of Rs 9,500 crore for FY25.IPO-bound JSW Cement is actively looking for acquisitions in a bid to expand its capacity, as a spur in infrastructure activity has caused bigger players in the industry to consolidate in a race to gain greater market share.\n       ",
    "Net Sales at Rs 19,805.91 crore in March 2024 up 9.3% from Rs. 18,121.02 crore in March 2023.Quarterly Net Profit at Rs. 2,251.95 crore in March 2024 up 36.46% from Rs. 1,650.26 crore in March 2023.EBITDA stands at Rs. 4,174.43 crore in March 2024 up 24.92% from Rs. 3,341.57 crore in March 2023.UltraTechCement EPS has increased to Rs. 78.14 in March 2024 from Rs. 57.24 in March 2023.UltraTechCement shares closed at 9,700.90 on April 26, 2024 (NSE) and has given 18.23% returns over the last 6 months and 30.09% over the last 12 months."
]