[
    "Net Sales at Rs 4256.33 crore in December 2023 up 1.42  from Rs. 4196.80 crore in December 2022.Quarterly Net Profit at Rs. 556.39 crore in December 2023 down 40.33  from Rs. 932.39 crore in December 2022.EBITDA stands at Rs. 871.65 crore in December 2023 up 0.38  from Rs. 868.33 crore in December 2022.Britannia EPS has decreased to Rs. 23.11 in December 2023 from Rs. 38.71 in December 2022.Britannia shares closed at 4925.25 on February 19 2024 (NSE) and has given 9.20  returns over the last 6 months and 10.59  over the last 12 months.",
    "Net Sales at Rs 4102.36 crore in December 2023 up 2.27  from Rs. 4011.17 crore in December 2022.Quarterly Net Profit at Rs. 538.36 crore in December 2023 down 29.8  from Rs. 766.93 crore in December 2022.EBITDA stands at Rs. 842.47 crore in December 2023 up 0.5  from Rs. 838.24 crore in December 2022.Britannia EPS has decreased to Rs. 22.35 in December 2023 from Rs. 31.84 in December 2022.Britannia shares closed at 5006.20 on February 06 2024 (BSE) and has given 7.44  returns over the last 6 months and 8.20  over the last 12 months.",
    "Britannia Industries  shares gained 2.3 percent in early trade on February 7 as earnings report for the quarter ended December 2023 were in line with estimates despite the net profit falling 40 percent onyear.However the net profit in base quarter included an exceptional gain due to the joint venture agreement with (France s) Bel SA for the cheese business.On February 6 Britannia reported a 40 percent fall in its consolidated net profit at Rs 556 crore for the third quarter of this fiscal compared to a net profit of Rs 932 crore a year ago. A poll of six brokerages predicted net profit at Rs 566 crore.As of 9.25 am shares of Britannia Industries were trading at Rs 5120.8 apiece on the NSE.The muted growth in Q3 FY24 comes on the back of a high base some price cuts high competition and low singledigit volume growth.Shares of Britannia Industries settled at Rs 5015 on the NSE down 2.14 percent on February 6.Follow our market blog to catch all the live updatesRevenue from operations rose marginally to Rs 4256 crore from Rs 4196 crore in the same quarter last fiscal. Analysts had expected revenue growth at 3 percent YoY at Rs 4303 crore for the quarter.In a report Nuvama Institutional Equities said that Britannia Industries  focus states outperformed other regions in terms of growth despite a generally subdued rural demand. The FMCG major continued to expand its direct reach in an attempt to accelerate its rural journey. It partnered with more than 29000 rural distributors during the quarter. International business performed well with robust doubledigit growths across key markets. It actioned judicious price corrections (over the last 12 months) which helped it maintain competitiveness and gain market share  the brokerage said.Also Read   Britannia Q3 results  Consolidated PAT plunges 40  to Rs 556 crore but marginally misses estimatesNuvama reiterated its  hold  rating on the stock with a target price of Rs 5110 which implied a 0.3 percent downside.In its conference call Britannia Industries management noted that inflation cool ahead of expectations. The rural area still remains to be a concern and the firm s strategy will be focused on driving market share.Over the past six months shares of the FMCG major have risen 7.62 percent. In comparison the benchmark Nifty 50 index has given investors returns of around 12 percent during the same time period.",
    "Britannia Industries Ltd on February 6 is likely to report a 2 percent yearonyear jump in consolidated net profit for the quarter ended December 2023. The net profit is seen at Rs 566 crore as per a poll of six brokerages as against Rs 556.8 crore in the yearago period.Analysts see muted growth in Q3 FY24 on the back of a high base (anniversarisation of price hikes) some price cuts high competition and low singledigit volume growth. This will restrict revenue growth at 3 percent YoY at Rs 4303 crore for the quarter.On the lower end of the range Kotak Institutional Equities and Axis Securities expect 12 percent growth in topline while BNP Paribas  estimate is on the higher side.It is also important to note that Britannia had an exceptional gain of Rs 359 crore in the base quarter. If that is included then net profit in Q3 FY23 works out to about Rs 932 crore. In that case this quarter s net profit estimate looks like a fall of 39 percent YoY.The net profit in base quarter included an exceptional gain due to the joint venture agreement with (France s) Bel SA for the cheese business.Volume growth and marginCompetition from unorganised local players is expected to keep volumes under check. Axis and Kotak peg volume growth at 1 percent while Motilal and Yes Securities see it at 3 percent. Meanwhile JM Financial expects volume growth at 4 percent YoY.Since there is no major risk on the commodity front brokerages expect gross margin to improve by an estimated 60 basis points sequentially. One basis point is onehundredth of a percentage point. However EBITDA margin at 19.23 percent is expected to decline on a YoY and QoQ basis. We estimate EBITDA margin to decline 110 70 bps qoq yoy off a high base (1) lower employee costs boosted EBITDA margin in Q2 FY24 and (2) Q2 FY23 EBITDA margin was aided by wheat forward covers and about 4050 bps benefit pertaining to prior period PLI incentives  Kotak Institutional Equities noted.According to analysts investors will be on watch out for management commentary on rural demand environment raw material cost outlook market share trends update on core biscuits portfolio cheese portfolio and other adjacencies.",
    "The Nifty 50 index shows a strong and enduring bullish trend characterised by a consistent formation of higher tops and higher bottoms across various time frames including weekly and monthly charts. This pattern reflects a positive sentiment prevailing in the market for the medium to long term.The index has shown an impressive seven consecutive weeks of positive closing marked by green candlesticks. While the prior week saw a slight weakness the overall structural integrity remained intact with the formation of higher highs and higher lows. This resilience allowed the index to regain the bullish momentum.In the previous week the index formed an indecisive candlestick indicative of market uncertainty. However the current week showed a decisive move as the index not only overcame the indecision but also achieved a new life high of 21801.45. This successful breakout reaffirms the ongoing upward trajectory.An interesting technical observation is the presence of a base rally pattern on the weekly scale. This pattern characterised by a price action sequence of a rally followed by a base formation and then another rally signals a strong and optimistic market outlook. It suggests that despite shortterm fluctuations the overall trend remains positive.The index has now expanded its trading range with an upper boundary around 21800 to 22000 while support is observed in the range of 21700 to 21600.Here are three buy calls for next 23 weeks National Aluminium Company  Buy   LTP  Rs 128.60   StopLoss  Rs 121   Target  Rs 147   Return  14 percentNational Aluminium Company (NALCO) is riding high at its 52week peak maintaining a bullish trend since the low in September 2022 indicating positive momentum.After nearly 14 months within a rising channel the stock broke out last week with a surge in volume. The current week not only affirms this momentum but also sustains it with a followup closing implying a structural development that signals a continued upward path for the stock.The ADX (average directional index) study this week reveals a strong trend with the ADX line surpassing the 28 mark. This suggests the initiation of a new trend while the  DI (directional indicator) above 30 further emphasizes the stock s robust momentum for a sustained upward trajectory.Adding to the positive outlook the concept of mean reversion is evident. Dips towards the shortterm 12week EMA (exponential moving average) and 26week EMA consistently act as crucial support levels contributing to the stock s bullish stance.Looking forward there is an anticipation of further price ascent towards Rs 147 mark. It is recommended to set a stoploss at Rs 121 strictly based on the closing basis.Britannia Industries  Buy   LTP  Rs 5282   StopLoss  Rs 5017   Target  Rs 5810   Return  10 percentBritannia is currently trading at its alltime highs reflecting a robust upward trend with consistent higher highs and higher lows.After trading in a rising channel from April 2022 the stock underwent a healthy retracement forming a robust base over a sixmonth period. The recent breakout from this base pattern has propelled the stock to new life highs highlighting a strong chart structure and signaling potential for further upward movement.Notably during the retracement phase from the peak in July 2023 the stock found support at its 50week EMA emphasizing a resilient intermediate trend. With the stock holding above the 20week EMA the bullish momentum remains intact. The MACD (moving average convergence divergence) indicator has also recorded a positive crossover in the recent week within its positive territory further confirming the stock s strong momentum.Looking ahead we anticipate further upward movement in prices targeting Rs 5810 level. It is recommended to set a stoploss at Rs 5017 based on closing values.Aarti Industries  Buy   LTP  Rs 639.65   StopLoss  Rs 600   Target  Rs 736   Return  15 percentAarti Industries is currently positioned at its 52week high suggesting a significant positive trend with a rising price structure and strong underlying momentum.The stock s recent breakout from a downwardsloping channel which extended from the high in October 2021 to the low in July 2023 is a notable development. This breakout is supported by an increase in trading volume indicating robust buying interest and a potential shift in the stock s trajectory.Moreover the ADX study currently at 27 signifies a strengthening trend. The accompanying  DI (positive directional indicator) above 30 adds to the confirmation of a new uptrend. This suggests that AARTIIND is likely entering into a sustained bullish phase.The stock is trading comfortably above key moving averages such as the 12week and 26week EMA. This alignment with the moving averages reinforces the positive momentum and increases the confidence in the stock s upward trajectory.Looking ahead we anticipate further upward movement in prices targeting Rs 736 levels. It is recommended to set a stoploss at Rs 600 based on closing values.",
    "Consumer goods companies observed a slow recovery in rural demand during the September quarter. While urban markets performed better rural areas are expected to improve gradually balancing the overall picture.Demand in the FMCG market remained subdued in the JulytoSeptember quarter. Volumes in rural markets declined 1 percent on a twoyear CAGR basis while urban volumes increased by 3 percent on a twoyear basis.The demand was weaker than expected with  limited upward movement contrary to our and other companies  expectations  said Ajay Thakur analyst at Anand Rathi Institutional Equities.  While there was some improvement in Quarter 1 Quarter 2 did not show the anticipated growth partly due to uneven rainfall. The hope was for better numbers but challenges persist in the rural sector  he added.In a postearnings call Varun Berry Executive ViceChairman and Managing Director of Britannia Industries Ltd noted that the FMCG sector is experiencing a slowdown which is particularly evident in rural areas. Despite the company s ongoing efforts to expand into these regions and reach more villages there has been a noticeable deceleration in the rural economy he added.Increasing competition from smaller playersRohit Jawa CEO of Hindustan Unilever noted a surge in the number of local players in the market. In the tea segment the market value of small players has expanded to 1.4 times that of large players while in detergents it has surged to six times that of larger counterparts. Jawa highlighted that during an inflationary cycle with rising raw material prices regional players tend to withdraw from the market. Conversely in a deflationary environment they make a comeback. The impact of this heightened competition from regional and local players is evident affecting larger counterparts. However it s crucial to note that these smaller entities largely regional or local are not significantly eroding market shares.  said Thakur. The personal care segment which includes toothpaste hair oils and other personal care items has witnessed a modest improvement outperforming the overall market he added.OutlookAnalysts noted that there is optimism particularly with the upcoming festive season and the harvest which is expected to contribute to improved rural demand. The focus is on the crucial Q3 which is anticipated to indicate if an upswing is on the anvil. Several companies have a positive outlook for H2 over H1.For instance Titan is aiming for mid to highteen growth in the jewellery business with a focus on sustainable and consistent margins CFO Ashok Sonthalia told CNBCTV18 on November 6.   the second half of October has started pretty well for us our jewellery business and some of the other businesses. So we are pretty hopeful that we will have a good Quarter 3. Even on the solid base of last year s Quarter 3 we should be able to deliver some healthy group numbers  he added.With retail inflation hitting a fourmonth low there s optimism about aiding the recovery.  The overall decline in inflation is expected to boost consumption. The previous challenges in the rural sector largely attributed to inflation may see improvement.  said Preeyam Toila senior research analyst at Axis Securities. However the speed and extent of this rural recovery remain to be seen he added.HUL highlighted the importance of monitoring uneven monsoons and global commodity volatility. Despite a decline in raw material prices there may be fluctuation influenced by the ongoing IsraelHamas conflict it said.The company also pointed at a resilient consumer trend in urban metros. Numerous premium categories present significant opportunities it noted. The focus in Q3 is projected to be more on urbanled growth with rural areas showing a gradual improvement better than Q1 and Q2  said Toila. The outlook for Q3 suggests urban areas will likely outpace rural areas in terms of growth he added.         ",
    "The Nifty and the Bank Nifty have been consolidating within a range through the past week with lower low and lower high formation on i30 (intraday 30 minutes) time frame leaving the bulls fighting to regain strength.The strength in bulls can be confirmed in case the Nifty goes above 19450 19460 levels similarly for Bank Nifty the same can be seen above 44000 44100 zone.With the festive season on we can notice some action in pharma FMCG PSE and infrastructure. Nifty Smallcap and Midcap also have shown better strength compared to the largecap. So one can focus on these sectors to pick the quality stocks among them.Here are three buy calls for three different timeframes Granules IndiaFirst pick would be Granules India. The stock on weekly charts has reversed forming support at Rs 270 levels with momentum indicator RSI (relative strength index) trading at 60 plus which is sign of a fresh bullish trend starting.The downward sloping resistance trendline breakout can also be seen in the stock which puts it under the buy list for a target of Rs 450 and stoploss at Rs 315. The holding period for the stock will be 45 months.Britannia IndustriesThe second pick would be Britannia from the FMCG sector. The stock has been trading in a consolidated range for almost three months. One can buy in the range of Rs 46804700 for a target of Rs 49505000 while maintaining a stoploss at Rs 4550 leaving a risk to reward ratio of 1 2.5.The holding period for the stock will be about 23 months.Hindustan AeronauticsLast pick would be Hindustan Aeronautics (HAL) back by news flow. The stock has resumed its primary trajectory of bullish trend with base formation at Rs 1800 levels strongly holding on.It is a portfolio stock so one can hold for exponential gains with a trailing stoploss strategy based on current entry levels. One can keep a stoploss at Rs 1880 levels for a target of Rs 2700 for a period of 45 months.",
    "Prabhudas Lilladher s research report on Britannia IndustriesWe are increasing FY24 25 EPS estimates by 7.5 5.8  on account of margin beat in 2Q led by lower manpower cost and lesser impact of RM inflation due to soft prices of packaging and Palmoil. BRIT continues to gain share led by success of new launches (Jim Jam Pops 5050 Golmaal Makhana and Laughing cow cheese) and distribution expansion. BRIT has reported decline in sales of Rusk (unorganized competition) and has cut prices in select products averaging 1.5  for the portfolio. We expect tepid profit growth in 2H24 as against 24  PAT growth in 1H24 as 2H23 had 650bps higher gross margins on softened commodity costs gains from forward contracts and higher other operating income (including one time PLI arrears). We now build in EBITDA margins of 18.1  and 18.8  in FY24 25 as against 17.5  and 17.1  earlier. BRIT s long term growth drivers are intact with 1) rising distribution 2) improving innovation and entry in faster growing adjacencies 3) higher growth in focus states and 4) cost efficiency gains in manufacturing distribution and procurement.OutlookWe estimate 9.2  12.4  sales and PAT CAGR over FY2326. We value the stock at 45x Sept25EPS and assign a target price of Rs4801 (Rs4612 earlier). Retain Hold .For all recommendations report click here",
    "Emkay Global Financial s research report on Britannia IndustriesWe have upheld our positive stance on Britannia thanks to the management thrust on expanding TAM (now at  Rs1trn  11  of the Indian packaged food   beverage market) in adjacencies and preserving profitability. The focus ahead is likely to be on driving consumption in penetrated segments (biscuits bread rusk) while propelling penetration for cakes wafers and dairy products. As a consequence of the muted demand setting along with high revenue base and surge in regional competition Britannia has delivered a lackluster topline show with 1  revenue growth (0.2  volume growth)  but it surprised positively on EBITDA margin (up 340bps YoY to 19.7 ) which helped to clock 23  EBITDA and 19  adj. PAT growth.OutlookBuildingin the demand stress we cut topline by 3  for FY24E. We maintain BUY with new Sep24E TP of Rs5250 (on 48x PER).For all recommendations report click here",
    "Net Sales at Rs 4432.88 crore in September 2023 up 1.22  from Rs. 4379.61 crore in September 2022.Quarterly Net Profit at Rs. 587.59 crore in September 2023 up 19.12  from Rs. 493.28 crore in September 2022.EBITDA stands at Rs. 924.77 crore in September 2023 up 20.89  from Rs. 764.94 crore in September 2022.Britannia EPS has increased to Rs. 24.41 in September 2023 from Rs. 20.48 in September 2022.Britannia shares closed at 4397.30 on November 01 2023 (NSE) and has given 2.52  returns over the last 6 months and 16.09  over the last 12 months.",
    "Net Sales at Rs 4288.85 crore in September 2023 up 2.33  from Rs. 4191.03 crore in September 2022.Quarterly Net Profit at Rs. 570.49 crore in September 2023 up 15.82  from Rs. 492.55 crore in September 2022.EBITDA stands at Rs. 894.12 crore in September 2023 up 18.71  from Rs. 753.21 crore in September 2022.Britannia EPS has increased to Rs. 23.68 in September 2023 from Rs. 20.45 in September 2022.Britannia shares closed at 4400.80 on November 01 2023 (BSE) and has given 2.41  returns over the last 6 months and 16.87  over the last 12 months.",
    "Shares of Britannia gained 2.8 percent at open on November 2 a day after the multinational FMCG company announced its Q2FY24 earnings. At 9 20 am the stock was trading at Rs 4522.10.Follow our market blog for live updatesAs per a regulatory filing post market hours on November 1 Britannia Industries reported a 19.55 percent yearonyear increase in net profit to Rs 586.50 crore for the quarter ending September 2023. Revenue for the same period also grew 1.21 percent to Rs 4432.88 crore. Earnings before interest depreciation taxes and amortisation (EBIDTA) for Q2FY24 was Rs 872.4 crore in the September 2023 quarter a 22.5 percent YoY increase.Analysts are expected to update their ratings post the earnings call today. Morgan Stanley has an overweight call  on Britannia with a target price of Rs 5013 while Nomura has a buy call with a target price of Rs 5500.. According to analysts at Nomura while the Q2 demand remains challenging the strong margin delivery continues. Growth the report said was flat compared to estimate of 34 percent.In the post earning s analyst call the company said that new initiatives have revenue potential Of Rs 200 crore. While the structured cost efficiency programmes are doing well they will take measured pricing corrections wherever necessary.Also read  Britannia Q2  Net profit surges 19  to Rs 586 crore revenue up 1.2 Varun Berry MD and CEO Britannia Industries said   We delivered a good performance in a challenging environment on the back of 2 years of high inflation. We have progressed well on our digital journey with digital marketing gaining momentum and leveraging digitalization to enhance decision making   finetuning distribution reach. ",
    "Britannia Industries Ltd on November 1 reported a consolidated net profit of Rs 586.50 crore for the September quarter of FY24 registering a growth of 19.55 percent from Rs 490.58 crore posted in the same quarter a year back.The company s total revenue from operations increased 1.21 percent to Rs 4432.88 crore from Rs 4379.61 crore a year ago the company said in a regulatory filing.The company s earnings before interest depreciation taxes and amortisation (EBIDTA) or operating margin came in at Rs 872.4 crore in the September 2023 quarter witnessing a jump of 22.5 percent as against Rs 711.7 crore reported in the same period last year.According to a poll of brokerages Britannia s net profit was expected at Rs 549 crore and revenue at Rs 4474 crore.Britannia s consolidated sales for the quarter ended September stood at Rs 4370 crore up 0.76 percent compared with 4337 crore the same quarter a year ago.Costs of materials consumed have increased by 1.6 percent to Rs 2282.58 crore in the JulySeptember quarter compared to Rs 2245.94 crore recorded in the same quarter a year ago.The company s operating margin during the quarter rose to 18.04 percent compared to 15.07 percent during the same period a year ago.Commenting on the performance Varun Berry Vice Chairman   Managing Director said the company achieved strong results despite a challenging economic climate marked by two years of significant inflation. He attributed the success this quarter to the introduction of new products like Jim Jam Pops and 5050 Golmaal.Varun Berry said   We delivered a good performance in a challenging environment on the back of 2 years of high inflation. Our innovation this quarter was led by Jim Jam Pops and 5050 Golmaal delivering a robust performance. We also launched differentiated cheese formats this quarter making focused inroads to retail shelves. Our potential in rural continues to remain high and hence expansion in rural distribution continued despite reported rural slowdown. We have progressed well on our digital journey with digital marketing gaining momentum and leveraging digitalization to enhance decisionmaking   finetuning distribution reach. Berry also highlighted that they have made significant strides in developing advanced technological facilities marking progress in establishing superior factories and this includes the successful launch of new Greenfield facility in Bihar during the quarter alongside recent expansions in Uttar Pradesh and Tamil Nadu. We took strategic pricing corrections in some of our key brands   SKUs. As a result our market share recovered this quarter. With the ongoing strife in the Middle East   Russia the global commodity prices remain volatile. We are being watchful of the situation and its impact on our business. Our strategy will remain focused on driving market share while sustaining profitability  Berry also stated.On November 1 Britannia shares settled at Rs 4397.30 on the NSE which was up Rs 29.20 or 0.66 percent lower than the previous day s close.        ",
    "Britannia Industries is likely to report an 11 percent yearonyear rise in Q2FY24 net profit even on a marginal revenue expansion led primarily by benign input prices.Britannia Industries  fiscal second quarter net profit is expected to touch Rs 549 crore according to the average of four brokerage estimates. The dairy biscuits and FMCG company is likely to report a JulySeptember revenue of Rs 4474 crore rising by less than one percent from the same quarter a year ago.Sequentially net profit is expected to increase 19.5 percent while revenue will likely rise 10.1 percent quarteronquarter.Britannia s Earnings Before Interest Tax Depreciation and Amortisation (EBITDA) margin is expected to increase by 142 basis points onyear to 17.76 percent in the JulytoSeptember quarter.The company s gross margin is expected to expand 300 basis points onyear aided by a correction in input prices. However operating profit margin rise will be limited to 130 basis points onyear due to higher employee expenses and other expenses said brokerage firm Sharekhan.Also Read  Momentum fund manager says market throwing more  sell  than  buy  signalsMotilal Oswal expects a three percent volume growth in Q2 FY24 for Britannia.Demand remains weakAnalysts say demand has likely remained weak for Britannia Industries in the JulySeptember quarter. Domestic brokerage firm Prabhudas Liladher expects late Diwali and competition from unorganised players to keep volume growth under check. Operating environment is getting tough with pricing growth now off the table while demand is still soft  said JM Financial in a report.Also Read  ITC s cigarette revenue growth takes a drag  should investors be concerned Inflation in sugar and wheatPrices of key raw materials such as wheat and sugar have increased in the last one year. Sugar costs have increased four percent and six percent on a QoQ and YoY basis respectively. Wheat costs have surged six percent sequentially and seven percent on a YoY basis.Britannia Industries had increased prices in its cheese portfolio by four percent in June on the back of rising milk prices. The biscuit category has not seen any significant price hikes over the last six months.However Britannia took a steep MRP hike of around 24 percent along with grammage reduction in the last six months for Milk Bikis given the dairy inflation. On the contrary Britannia took price cuts of around 13 percent in butter in July.Earlier in the AprilJune quarter the company said that it was witnessing competition from unorganised players leading to price cuts and grammage hikes which resulted in a lowerthanexpected improvement in margins.Sharekhan says Britannia Industries is expanding its market share gap versus the number two player and is focusing on scaling up the adjacent categories including dairy and bakery products to drive consistent growth ahead.",
    "Margins for Godrej Consumer Products Limited Asian Paints and Britannia Industries could be affected on the back of rising palm oil crude and wheat prices said Motilal Oswal in a report dated September 15. In recent months palm oil prices have experienced a resurgence which could potentially affect margins for Godrej Consumer Products  said the domestic brokerage firm.An increase in Vinyl acetate monomer an ingredient used in paints increased 4.6 percent in the ApriltoJune quarter which may affect the company s margins said the brokerage firm.Britannia Industries would also face the heat as wheat and sugar prices have increased 4.6 percent and 7.2 percent on a quarteronquarter basis (QoQ) said Motilal Oswal.Also read  Small FMCG players regain Indian market share as raw material prices cool offHow have other commodities performed CrudeCrude oil prices have surged past  90 per barrel hitting a ninemonth high due to Russia and Saudi Arabia extending their supply cuts. Prices have steadily risen with an eight percent increase in Q2FY24 and a six percent increase on a monthonmonth.Palm OilMalaysian palm oil remains stable QoQ after a steep 54 percent drop from it s alltime high. Meanwhile palm fatty acid prices have risen 11.3 percent yearonyear and 6.5 percent quarteronquarter with an average price of  817 MT in Q2FY24. Palm oil is used in making soaps.AgricommoditiesErratic weather including monsoon rainfall deficits and heatwaves has greatly affected Kharif crop yields leading to inflationary pressures. Wheat tea coffee and maize prices have all seen sequential increases while prices of other agricultural commodities like Mentha oil and Copra have either stabilized or softened.Other commoditiesVinyl acetate monomer prices have risen 4.6 percent in Q2FY24. In the nonagricultural sector China s Titanium dioxide prices have remained stable QoQ in Q2FY24 with a 19.4 percent decline on a yearonyear (YoY) basis Liquid paraffin prices have decreased this quarter. Domestic gold prices surged by 16 percent YoY but remained unchanged compared to the previous quarter.",
    "Unilever said the Indian market is seeing a lot of aggression from small players in the FMCG sector after raw material prices cooled off forcing its subsidiary Hindustan Unilever (HUL) to focus on volumes and price cuts. The FMCG major shared the observations at the Barclays Global Consumer Staples Conference on September 6. The larger players take time to pass on the raw material prices benefits immediately. The smaller players have that bandwidth and capability because they cater only to the small market  said Preeyam Toila Senior Research Analyst at Axis Securities.Analysts also noted that fundamentally things remain the same. High commodity prices last year challenged smaller businesses due to limited working capital and insufficient inventory.  We re witnessing a trend reversal from last year when these players weakened  said an analyst requesting anonymity. Now the trend is stabilising and smaller businesses are regaining their lost market share in this adjustment phase he added.During the performance call for the June quarter Britannia also mentioned that their market share in biscuits remained unchanged as local competitors increased their presence. The competition varies by category. For Britannia numerous local competitors exist especially in the biscuit sector unlike HUL  said Toila. In their Q1 conference call HUL pointed out competition at the lower end of their product range. While their massmarket products face challenges their medium and premium ranges remain less affected he added.Analysts noted that some consumers prioritizse price over brand. Recently with local brands dropping prices significantly some consumers might revert to cheaper options after upgrading the previous year. While there s always a premium attached to global brands over local ones if this premium becomes excessively large consumers might opt for more affordable choices.  said an analyst requesting anonymity.  This doesn t imply a diminished brand loyalty but reflects a reaction to a widened price gap especially in times of high inflation and budget constraints  he added.        ",
    "Britannia Industries faced the maximum analyst downgrades in August due to increased competition thanks to soft raw material prices among other reasons. A month ago Britannia Industries had 30 buy recommendations  this fell to 24 in August. The number of sell calls on the biscuit stock also increased from two in July to six in August.Britannia shares dropped 6.8 percent in August while the benchmark Nifty50 fell 2.5 percent. In the same month the industry leader   ",
    "Advertisement spends of Fast Moving Consumer Goods (FMCG) Companies amped up in FY23 as compared to FY22 however advertisement spends as a percentage of revenue has held its ground showing no stark difference according to data compiled from Bloomberg.Advertisement spends as a percentage of revenue were lower in FY23 as high raw material prices in the first half of FY23 restrained FMCG companies from splurging on advertisements.  FMCG companies had reduced advertising spends in FY23 to maintain their EBITDA margin levels  said Alok Shah consumer analyst at Ambit Capital. He further said that advertisement spends are under the control of the company and can be altered unlike employee costs or raw material costs.Prices of key raw materials like palm oil wheat and sugar were up in Q1FY23. According to Incred Research palm oil prices surged 54 percent yearonyear (YoY) while wheat costs were up 21.5 percent on a YoY basis. Sugar prices increased 6.5 percent YoY in the same period.Another reason for reduced advertising expenditures was the diminished competitive landscape from local businesses. During periods of rampant inflation local players often withdraw from the market due to their inability to transfer the burden of soaring raw material costs onto consumers   a move that larger players can effectively execute.  If there is no competition there is no need for branding and advertising  said a consumer analyst who wishes to not be named.In FY23 raw material costs were easing but the demand was weak so there were hardly any new product launches said Shah.  There is no use launching new products when the demand for existing products is stagnant  he added.Interestingly while many were tightening their advertising budgets Britannia Industries and Godrej Consumer Products chose a different path cranking up their advertising investments. The secret behind this  Britannia Industries unleashed new products in the second half of the year. The company launched Winkin Cow rich milk shakes and coconut water in Q4FY24. It also launched a new orange flavour in croissants. Britannia Industries  advertisement spends increased 61 percent in FY23 as compared to FY22.Godrej Consumer Products Limited increased its advertisement spends after the acquisition of Raymond s FMCG business. The company s advertisement spends increased 20 percent in FY23 as compared with FY22.Has it reached preCOVID 19 levels Advertising spends as a percentage of revenue are near the preCOVID 19 levels but have not reached that point. As raw material costs are easing the companies will spend more on advertising going ahead  said the consumer analyst on condition of anonymity. He also said that the number in FY24 would be greater than FY23.",
    "Axis Securities report on Britannia IndustriesBRIT Q1FY24 Results were below our estimates on account of flat volume growth and lowerthanexpected gross and EBITDA margins expansion. Moreover competition intensified amidst the lower raw material prices. However the management has guided volume recovery in FY24 on account of rural expansion increase grammage and price cuts. EBITDA margins are likely to remain at the current level and the management does not expect meaningful recovery owing to price cuts along with higher adspends and increased startup costs on account of continued capacity expansion in the company s existing plants (Ranjangaon   Dairy expansion Bihar and Orissa)   Though Q1FY24 results were below our estimates we believe the worst is behind for the company as 1) Raw material prices of palm and packaging costs are in a downward trajectory (though they are still firm for wheat and sugar prices) 2) Ruralled distribution expansion and focused approached in Hindi belt region is expected to help the company gain market share and 3) Rural revival is expected in the coming quarters supporting recovery. Moreover BRIT s longterm prospects remain strong as the management has a proven execution track record robust portfolio planning through NPD in core and adjacencies and a focus on continued distribution expansion in direct as well as rural markets.OutlookBased on the above thesis we estimate Revenue EBITDA PAT CAGR of 11  12  13  over FY2326E and maintain our BUY rating on the stock with a revised TP to Rs 5110 share vs. the TP of Rs 5300 share earlier. The revised TP implies an upside of 10  from the CMP.For all recommendations report click here",
    "Prabhudas Lilladher s research report on Britannia IndustriesWe cut FY24 FY25 EPS estimates by 12.7  9.0  on account 1) sustained pressure on rural demand 2) price cuts and grammage correction to remain competitive amidst rising regional unorganized competition and 3) normalized adspends   higher depreciation (new units including Ranjangaon). Innovations have been a mixed bag with dairy innovations being 10  of sales and overall innovations contribution at 4  (Jim Jam Pops   Multigrain rusks launched). While BRIT has wheat futures for next four months timely rollover could be key given that wheat prices may firm up in 2H24. We now build in EBITDA margins of 17.6    17.9  in FY24 25 (18.8    18.5  earlier) vs 17.4  in FY23 (one time PLI gains of  50bps for FY23 and 240bps in 4Q23). BRIT s long term growth drivers are intact with 1) 28k rural preferred dealers 2) rising share of MT sales with improved mix 3) higher growth in focus states and 4) cost efficiency gains in manufacturing distribution and procurement.OutlookWe estimate 8.8  9.6  sales and PAT CAGR over FY2325. We roll over to 45x Jun25EPS and assign a target price of Rs4500 (Rs4800 earlier). Hold.For all recommendations report click here",
    "Sharekhan s research report on Britannia IndustriesBritannia Industries (Britannia s) Q1FY2024 results were below our expectation mainly on account of lowerthanexpected sales volume growth (stood flat versus 45  expected) and OPM at 17.2  versus  18  expected. Revenue and PAT grew by 8  and 35  yoy respectively. With required grammage corrections and lowering of inflation Britannia expects the volume growth trajectory to gradually improve in the quarters ahead (expects it to be in high singledigits). Correction in the rawmaterial prices coupled with costefficiency measures and better operating leverage would help OPM to remain at 1718  in the coming quarters.OutlookBritannia s stock price has corrected by 12  from its recent high and trades at 52x 43x its FY2024E FY2025E earnings. We maintain our Buy rating on the stock with a revised PT of Rs. 5415.For all recommendations report click here",
    "Motilal Oswal s research report on Britannia IndustriesBritannia Industries (BRIT) s revenue was in line while profitability was slightly below our estimates at  INR4.5b (est. INR4.7b). GP margin and EBITDA margin expanded YoY due to moderating RM prices while they contracted 300 270bp QoQ because of PLI scheme in 4QFY23 and price cuts taken in 1QFY24. In response to the prevailing trend of smaller regional players offering more discounts and promotions due to the moderating RM prices BRIT also implemented price reductions to maintain competitiveness. Volume growth was flattish for the quarter due to slowdown in the traditional markets (both rural and urban). Management focused on cost reduction across verticals (7x targeted in FY24 from FY14 level).OutlookAlthough we like the structural investment case accompanied by healthy return ratios these are priced in at valuations of  52xFY24E EPS  45xFY25E EPS. We reiterate our Neutral rating on the stock with a TP of INR4600 (premised on 45x FY25E EPS).For all recommendations report click here",
    "Emkay Global Financial s research report on Britannia IndustriesBritannia s FY23 Annual Report showcases its 10year journey under Varun Berry with Company seeing 10  sales CAGR which bolstered by strategic actions for controlling costs has aided a 21  earnings CAGR. Amid accelerated packagedfood adoption Britannia has enhanced capex thrust (which albeit has a bearing on asset turns  but we see positive effect on Company margin and competitive positioning). Exposure to promoter group company so far has been limited. Post the weakerthanexpected Q1FY24 results (sales earnings growth at 8  36  was 4  3  below our estimate) we revise down our earnings estimates by 23 . Q1FY24 results suggest Management thrust on building margin over volume.OutlookWe now see FY2326E sales EPS CAGR at 10  15  respectively. We retain BUY with new Jun24E TP of Rs5550 on 50x PER.For all recommendations report click here",
    "",
    "Shares of Britannia Industries extended their marginal early losses and slumped nearly 4 percent as of afternoon trade on August 7 after the company s net profit and revenue for the AprilJune quarter missed the Street s expectations.The FMCG company reported a 37percent increase yearonyear in net profit to Rs 458 crore in the AprilJune quarter while revenue  grew 8 percent yearonyear to Rs 4064 crore. Despite the growth both the bottomline as well as topline missed analysts estimate of Rs 517 crore and Rs 4101 crore respectively.At 01.20 pm shares of Britannia Industries were trading 3.5 percent lower at Rs 4629.30 on the National Stock Exchange.Morgan Stanley has an  overweight  rating on the stock with a target price of Rs 5184.  Profit after tax was a miss on the estimates owing to higher depreciation and finance costs  the company said in a note.Nuvama Institutional Equities has a buy rating on the stock. .  The growth was robust on YoY basis but company missed expectations on profits due to price corrections undertaken during the quarter to tackle renewed local competition  the brokerage firm said in a report dated August 4.Britannia will conduct its Q1FY24 conference call at 10 am on August 7. Brokerages will review their ratings postconference call.In the ApriltoJune quarter commodity prices marginally softened and lead to an intensifying competition from local players. Britannia Industries took price cuts in order to remain competitive said Varun Berry executive vicechairman and managing director of Britannia Industries in an exchange filing.Berry said that Greenfields in Tamil Nadu and Uttar Pradesh were efficiently scaled up.  With capacity and capability enhancements planned in Ranjangaon Food Park we are well poised to further extract productivity and enhance competitiveness in these growing markets  said Berry."
]