[
    "The Narendra Modi government remains committed to privatising two stateowned banks and one general insurer. However these deals are unlikely to take place in this financial year   has learnt from informed sources.Finance Minister Nirmala Sitharaman while presenting the 202122 Union Budget had said that the privatisation of the three entities would be carried out this year. Other than IDBI Bank we propose to take up the privatisation of two public sector banks and one general insurance company in the year 202122  Sitharaman had said.However the government now plans to privatise these companies in 202223 a top official said. This process is about the privatisation of stateowned financial companies a new territory in terms of policy and a reversal of bank nationalisation. Also the finance minister has promised there will be no job losses as a result of privatisation. Framing the contours of the deal and finding a suitable buyer will take time  the official said.Sources confirmed that Central Bank of India and Indian Overseas Bank had been shortlisted for privatisation. The insurance company as yet unidentified could be one among National Insurance United India Insurance and Oriental Insurance.Additionally the Centre is confident that the ambitious divestment target of Rs 1.75 lakh crore this financial year will be met through share sales in Air India Bharat Petroleum Shipping Corporation of India Container Corporation of India Pawan Hans BEML Neelachal Ispat Nigam Ltd. and IDBI Bank as well as the listing of Life Insurance Corporation of India which is expected to be the country s largest initial public offering.Long process aheadThe official said the process of privatising the two banks and the insurance company will be a long one especially given that the government must find suitable buyers to ensure that no downsizing takes place in the two lenders.As shown in the attached chart after the names are finalised the proposal will be finetuned by a group of secretaries led by the Cabinet Secretary. It will then go to an empowered group of ministers before submission to the Union Cabinet headed by Prime Minister Narendra Modi.The Banking Companies (Acquisition and Transfer of Undertakings) Acts of 1970 and 1980 and the Banking Regulation Act will have to be amended. While work to bring about the legislative changes has started the amendments have not been scheduled to be tabled in the ongoing monsoon session of parliament.After the Cabinet s approval the finance ministry s Department of Investment and Public Asset Management will begin appointing transaction and legal advisors. The selected advisors will then help the government take forward the process of finding suitable buyers. This process will be carried out very carefully. The finance minister has promised no job losses and that promise will be kept  a second official said.Even as bank employee unions threaten to go on strike over the privatisation plans Sitharaman had said in March that no banks would be closed down and all steps will be taken to safeguard the interests of the staff in terms of salaries and pensions.Govt to move ahead with pending plansThe plans to privatise Air India Bharat Petroleum Shipping Corporation and Container Corporation have been pending since 2019. The COVID19 pandemic and the resultant economic slowdown have put a spanner in the works. However this also means that a lot of background work has already been done regarding these privatisation candidates. Last year and this year we have already done a lot of work towards fructifying these plans. In many cases the transaction and legal advisors have been appointed or are in the process of being appointed. We are confident that the target of Rs 1.75 lakh crore will be met  said the second official.Last week the Centre issued requests for proposals for the appointment of the bookrunning lead managers legal advisors share transfer agents and advertising agents for the planned LIC share sale. The size of the IPO is expected to be larger than ever before in the Indian markets. It is the endeavour of the government to attract investment from institutional investors both domestic and global in addition to retail investors  DIPAM had said.The Cabinet had also approved allowing the government and LIC to shed their 100 percent stake in IDBI Bank. The Reserve Bank of India does not consider IDBI Bank a stateowned lender because its majority shareholder is LIC and not the Central government.        ",
    "USbased IT major Accenture and India s oil and gas firm Bharat Petroleum Corporation Ltd (BPCL) have partnered for digitally transforming the latter s sales and distribution network.For this purpose Accenture will use data artificial intelligence (AI) and cloud technologies to build design and implement a digital platform IRIS the company said in a statement.The platform will integrate realtime data from across BPCL s countrywide network including more than 18000 fuel retail outlets 25000 tank trucks 75 oil installations and depots 52 liquefied petroleum gas (LPG) bottling plants and 250 additional industrial and commercial locations to provide a consolidated view of its extensive operations.The IRIS platform will subsequently trigger automated alerts and actions including rapid response to equipment failures or hazardous situations.According to the statement it will also empower the BPCL workforce of more than 100000 across the country to make faster and more accurate decisions including preventative maintenance. This can help increase sales at fuel retail outlets by minimizing infrastructure downtime and ensuring consistent fuel quality as well as improve the experience for customers.The new platform will be able to accept more than three million inputs per second from automated sensors cameras and Internet of Things (IoT) devices deployed at all key locations tracking performance based on key parameters such as fuel stock safety compliance and equipment health.Arun Kumar Singh Director (Marketing) and Director (Refineries) BPCL said in the statement  Digital transformation opens up new opportunities for the oil and gas industry. As an organization passionate about embracing change and leading the charge we look forward to leveraging technology to unlock tremendous value sustainable growth and improved efficiency.  With the deployment of this highly automated command and control platform called IRIS we will not only bolster our digital capabilities significantly but also improve customer experience and transform operations at scale. It will further ensure consistent and uniform delivery of BPCL s brand promises of innovation care and reliability to our customers  said Rahul Tandon Head Digital Transformation BPCL in the statement.        ",
    "Of all the companies and assets up for divestment in FY22 the Narendra Modi government expects to begin its privatisation programme with the two biggest marquee names   Bharat Petroleum (BPCL) and Air India.In fact the finance ministry s Department of Investment and Public Asset Management (DIPAM) the nodal body for divestment is confident that the privatisation of BPCL and Air India can be completed by JuneJuly 2021   has learnt. The (privatisation) processes of Air India and BPCL are at a more advanced stage compared to other names hence these will be the first off the blocks. We are targeting latefirst quarter earlysecond quarter to complete these deals  a top government official said.However while the Centre is confident of being able to finally go big on privatisation after years of delays there are some headwinds expected. The Bharatiya Mazdoor Sangh RSS affiliate has planned a phased nationwide agitation against the government s privatisation drive. The agitation is expected to go on from midMarch to midNovember. This is a matter for the political leadership to deal with. The top leadership in the government has given us its full backing to complete the privatisation plans  said the official.In her Union Budget 202122 speech on February 1 Finance Minister Nirmala Sitharaman had set an ambitious divestment target of Rs 1.75 crore. Unlike in the past when the divestment pipeline leaned towards initial public offerings (IPO) offers for sale mergers between two stateowned companies and share buybacks the FY22 pipeline will hinge upon privatisation and asset sales.Out of the Rs 1.75 lakh crore Rs 75000 crore is expected to come from the privatisation of stateowned companies while Rs 1 lakh crore is expected to come from the sale of stateowned financial entities and the planned IPO of LIC Ltd according to budget documents.Officials however say this breakup of the coming year s target is just on paper and rather fungible with the aim being to achieve the headline number. Once we have achieved some of the key transactions that we have taken forward now like BPCL and others these will be the first privatisations that could take place  DIPAM Secretary Tuhin Kanta Pandey had told   in a postbudget interview.The government is learnt to have been encouraged by the interest received from prospective buyers for the two companies. For BPCL expressions of interest (EOIs) are learnt to have been received from Vedanta Resources PLC Apollo Global and ISquared Capital. In case of Air India Ajay Singh of SpiceJet Tatas and Pawan Ruia of Ruia Group are learnt to have submitted physical EOIs.A grouping of investment company Interups Inc and a consortium of Air India employees were also interested in bidding for the national carrier. However Interups backed out of the bidding process.Air India BPCL and other candidates like Concor and Shipping Corp were part of the Centre s FY21 divestment plan and so was the LIC IPO. However the COVID19 pandemic put those plans on ice and the government is hopeful that these longpending plans can bear fruit.The privatisation of Pawan Hans NINL Ltd two unnamed stateowned banks and one unnamed stateowned general insurance company is also part of the pipeline for FY22.        ",
    "Privatisationbound Bharat Petroleum Corporation Ltd (BPCL) will buy out Oman Oil Company s shares in Bina refinery project in the next 10 days and is hoping to complete a separate sale of its stake in Numaligarh Refinery by the next monthend its directorfinance said on Tuesday. BPCL holds a 63.68 per cent stake in Bharat Oman Refineries Ltd (BORL) which built and operates a 7.8 million tonne oil refinery at Bina in Madhya Pradesh. Discussions (to acquire 36.62 per cent stake of OQ S.A.O.C) have concluded. We can come out with an announcement of the acquisition of the stake in next 10 days or so  BPCL Director (Finance) N Vijayagopal told reporters on an earnings call. OQ S.A.O.C. was formerly known as Oman Oil Company.Without giving details he said the deal details such as acquisition price will form part of the announcement likely in the next 10 days. BORL was incorporated in February 1994 to build a refinery at Bina in Madhya Pradesh. The unit initially could turn 6 million tonnes of crude oil annually into fuel which was subsequently raised to 7.8 million tonnes.Before the company is privatised BPCL will exit Numaligarh Refinery Ltd (NRL) by selling its 61.65 per cent stake to a consortium of Oil India Ltd and Engineers India Ltd Vijayagopal said. It is selling stake because the government had as per the Assam Peace Accord agreed to keep NRL in the public sector.Also Read  Oil India to pick up BPCL stake in Numaligarh refinery this fiscal The consortium of OIL and Engineers India Ltd will acquire 49 per cent and the rest 13.65 per cent will be sold to the government of Assam  he said adding the company board at its meeting on Monday approved the share purchase agreement. OIL currently holds 26 per cent equity in NRL while the government of Assam has around 12.35 per cent.The value for 61.65 per cent stake in NRL is reportedly around Rs 7000 crore.  NRL stake sale is happening at a rapid pace  he said.  Valuation is being done by valuers and if things go as planned the transaction will be completed by March 31.   NRL stake sale is happening at a rapid pace  he said.The completion of the transaction is subject to the deal getting requisite government approvals he noted. Post NRL sale BPCL would be left with three refineries at Mumbai Kochi in Kerala and Bina.The government is selling its entire 52.98 per cent stake in BPCL in the nation s biggest privatisation till date. Vedanta Group and private equity firms Apollo Global and I Squared Capital s Indian unit Think Gas have put in an expression of interest for buying the government stake.  gThe sale of NRL is the first step towards the disinvestment of BPCL. The government has already indicated that it expects to complete BPCL privatisation by the first half of the fiscal beginning April (202122).The sale is key to achieving the Rs 1.75 lakh crore disinvestment target set for 202122. BPCL will give the buyer ownership of around 15.33 per cent of India s oil refining capacity and 22 per cent of the fuel marketing share. BPCL will give the buyer ownership of around 15.33 per cent of India s oil refining capacity and 22 per cent of the fuel marketing share.NRL is looking to expand its refining capacity from 3 million tonnes per annum to 9 million tonnes a year at an investment of Rs 22594 crore. The project is expected to be completed by 2024. The expansion also involves setting up of crude oil pipeline from Paradip in Odisha to Numaligarh and a product pipeline from Numaligarh to Siliguri in West Bengal. The expansion also involves setting up of crude oil pipeline from Paradip in Odisha to Numaligarh and a product pipeline from Numaligarh to Siliguri in West Bengal.         ",
    "It was February 1 2020. As part of her budget Finance Minister Nirmala Sitharaman announced the highestever divestment target of Rs 2.1 lakh crore Rs 1.1 lakh crore more than the highest achieved divestment receipt of Rs 1 lakh crore in 201718. This was the time when the COVID19 pandemic had just come to Indian shores through travellers returning from China and Europe. The nationwide lockdown was still nearly two months away.Even the highly ambitious target for 202021 was considered achievable. Sitharaman had announced the planned initial public offering (IPO) of public sector behemoth Life Insurance Corporation of India. The cabinet had also cleared the privatisation of Bharat Petroleum Container Corp and Shipping Corp in November 2019. These along with Air India were expected to be completed in the current financial year.That did not happen and the reasons are well documented. Investors and potential buyers around the globe went into a mode of saving their financial firepower as the pandemic crippled economies including India.Nearly a year later the Finance Minister is again expected to announce a massive divestment target with the same five companies (four privatisation and one megaIPO) expected to form a bulk of the plans.PrivatisationWhen Prime Minister Narendra Modi came to power in 2014 he had made it clear that his administration would be proprivatisation in line with most economic right of centre governments around the world. It has been six years and the only sales of stateowned companies that have taken place at that time have been to other stateowned companies.To be fair the time taken to come up with a comprehensive privatisation plan is understandable. Governments whether centre or states are loath to let go of their PSUs and line ministries consider the PSUs their crown jewels or private fiefdom depending on the way you look at it.Officials from Niti Aayog and the Department of Investment and Public Asset Management the two departments most deeply involved in the divestment process admit to the long and sometimes difficult negotiations that take place to convince a ministry that their PSU will be privatised. The deciding factor has been the unwavering support for privatisation at PMO.DIPAM has already received expressions of interest for Air India and BPCL and the government seems confident that it can close both the deals in the first half of the coming year. Same goes for Shipping Corp whose EOIs have been invited recently. Only Concor s EOI is yet to be put into place. The centre has also revived the privatisation plans of Pawan Hans and will also put on the block Nilanchal Ispat Nigam Ltd.Market OfferingsAs a sustained bull run continued in the Indian markets the past few months the government was criticised by notable economists including former Reserve Bank of India Governor Raghuram Rajan. Rajan said earlier this month that given the levels markets were at the centre should go for more share sales.In January itself the centre has carried out the IPO of IRFC Ltd and offer for sale for SAIL Ltd. Other IPOs and OFSs being planned for the remainder of this fiscal year and the next fiscal year include Rashtriya Chemicals and Fertilizers RVNL BEML Ltd Midhani Ltd Telecommunications Consultants India Ltd among others.The biggest however will be the IPO of LIC Ltd. The centre has appointed an actuary who will calculate the valuation and implied book value of the insurance giant. Given the size of the company and complexity of its holdings it is a process that the government does not expect to be completed before the second quarter of 202122.        ",
    "Divestmentbound Bharat Petroleum Corporation (BPCL) is in advanced stages of discussions to acquire Oman s stateowned oil company OQ s stake in Bina refinery project in Madhya Pradesh for around Rs 19002000 crore    has learnt.According to a source close to the development the deal is likely to happen before the privatisation of BPCL. The company plans to merge Bina refinery also known as Bharat Oman Refineries (BORL) with itself. This is expected to raise the valuation of BPCL in the ongoing privatisation process and also provide tax advantage in selling petroleum products.According to BPCL annual report BPCL has given a loan of Rs 1254.10 crore to BORL and subscribed to share warrants of Rs 935.68 crore. BPCL has also subscribed to zero percent compulsorilyconvertible debentures of Rs 1000 crore.The decision to buy OQ s remaining stake in the Bina Refinery was taken by BPCL s board of directors in December.BORL posted a net loss for the year 201920 of Rs 803.5 crore as compared to a profit of Rs 106.71 crore during the previous year. In 201920 Bina refinery s crude oil intake was 7913 thousand metric tonnes (TMT) with average capacity utilization of 95 per cent.The talks for buying Oman s stake comes at a time when the government is looking to offload its entire stake in BPCL. The Centre s 52.98 percent stake in BPCL is valued at around Rs 47000 crore based on the current market cap.Three potential bidders including Vedanta Group and two private equity funds  Apollo Global and I Squared Capital have also expressed interest in BPCL.",
    "More than a year after approval by Cabinet the centre has invited expressions of interest for the privatisation of stateowned Shipping Corporation of India. The centre plans to offload its entire 63.75 percent stake and management control in the company.The Finance Ministry s Department of Investment and Public Asset Management aims to complete the transaction in the first half of the fiscal year 202122 informed sources told  . As per the preliminary information memorandum the last date of submission of EOIs by interested bidders is February 13 2021.As per the eligibility criteria Indian as well as foreign companies and alternative investment funds (AIFs) can bid for Shipping Corp. Other stateowned enterprises can also participate in the bid process. There seem to be no restrictions on whether prospective buyers should have previous experience in the maritime industry or not.As per the PIM the publiclylisted Shipping Corp has a fleet of 59 ships including container vessels dry bulk carriers very large crude carriers offshore supply vessels and others. Based on the company s share price in early trade on December 22 the centre s 63.75 percent is valued at Rs 2521 crore.The centre would of course like a healthy premium on its stake. However the PIM itself contains the risks and headwinds to the shipping industry due to Covid19. With the given forecast on economic activity seaborne trade which is directly linked with economic activity may also see a decline. However given the divergent dynamics of the shipping industry things may well take a different course during different time periods  the PIM said. It added that China s increasing ore production and spiking prices in the tanker segment constitute a  silver lining  for the industry.As per the PIM the short term implications for marine trade include a slowdown of major ports and delay of cargo leading to accumulations concerns reduced demand for shipping and cargo turnovers and financial challenges for ship owners following the fall in demand for shipping.The Union Cabinet had given approval for the privatisation of Shipping Corp Bharat Petroleum and Container Corp in November last year. Shipping Corp s privatisation was very much on DIPAM s agenda for this year along with the companies mentioned above and Air India as it sought to meet the highest ever divestment target of Rs 2.1 lakh crore.However the Covid19 pandemic and the nationwide lockdown in the first quarter of the fiscal year put paid to any chances of meeting that target even as the last date for Bharat Petroleum and Air India EOIs kept on being extended multiple times.        ",
    "What a difference a year can make In lateNovember 2019 as the Union Cabinet had cleared the privatisation of Bharat Petroleum along with other stateowned companies like Concor and Shipping Corp there was much optimism in the government regarding what could have been a blockbuster deal.Around the time the centre s 53.3 per cent stake in the oil marketing behemoth was valued at around Rs 59000 crore. Internally multiple officials in the government were hopeful of a 2030 per cent premium given its strong fundamentals oil marketing network and the attractiveness of other core businesses like refining pipeline and petrochemicals.In offrecord conversations with reporters they would speak about BPCL privatisation likely fetching the government close to Rs 80000 crore. It was said that this was a golden opportunity for the likes of Saudi Aramco Rosneft Total and Exxon Mobil to tap the huge Indian retail market for petroleum products.A global pandemic and an economic slowdown later things don t look quite so rosy. And though the government has said it has received a number of expressions of interest and will not extend the dates for submitting the same it is still some time before clarity emerges on whether a deal to privatise BPCL can be finalised or not. Though we have moved on to the next stage there is still some way to go before a buyer can be identified. The privatisation certainly won t happen this fiscal year  a senior government official told  On November 17 BPCL shares closed 4.4 percent lower. That would value the centre s 53 per cent stake at around Rs 45000 crore. And this time around officials aren t even remotely willing to hazard a guess on what sort of premium the government would get on its stake.A second official told   the transaction advisor Deloitte will take around 15 days to study the expressions of interest and gauge their eligibility. This will be followed by confidentiality agreements being signed with the eligible bidders and BPCL s books being opened to them. This process is expected to last 23 months after which bidders will place their financial bids. Only when the interested investors place their bids will we have a sense of the enterprise value of BPCL  said the official adding that the entire process could take upwards of six months.  has learnt that a number of global oil giants like Reliance its partners Aramco Rosneft and others have not submitted EOIs and hence are not interested for the time being. A PTI report had said private equity and pension funds have expressed interest in BPCL.For the eventual buyer of BPCL around 35.3 million tonne of refining capacity 16492 retail outlets and 72 million LPG customers will be on offer.The government s plan is to sell its entire shareholding in BPCL comprising 1.15 billion equity shares with the transfer of management control to a strategic buyer excluding the company s 61.65 per cent in the Numaligarh Refinery in Assam.The stake in Numaligarh refinery is expected to be sold to another public sector undertaking. A consortium of Oil India and Engineers India has shown interest in taking up BPCL s 48 per cent stake in Numaligarh. The remaining stake would be sold to the government of Assam to increase the state s share to 26 per cent in the venture.        ",
    "The Union Cabinet on Thursday hiked prices of various grades of ethanol for supply to oil marketing companies a move that will benefit sugarcane farmers and lead to higher blending of the clean fuel with conventional petroleum products.In a media briefing following the cabinet decision Information and Broadcasting Minister Prakash Javadekar said that the price of sugar juicebased ethanol was being increased by Rs 3.25 per litre to Rs 62.65 per litre that of ethanol  B Heavy  was being raised to Rs 57.61 per litre and  C Heavy  ethanol will fetch Rs 45.69 per litre. This is an increase of about Rs 2 to Rs 3.35 per litre for various grades. The GST and transportation costs will be borne by the oil marketing companies as is the norm  Javadekar said. In 2014 only 380 million litres of ethanol could be purchased by oil marketing companies. Last year it was 1.95 trillion litres  the minister said.The Modi government has had a long stated aim to increase ethanol blending with conventional fuels by oil marketing companies. The aim is to ensure that around 10 per cent of the total petroleum consumed in the country is blended with ethanol by 2022 and thereafter the target could be scaled up to 20 per cent blending by 2030.This was accompanied by differential prices for various grades of ethanol made from Cheavy and Bheavy molasses sugar juice direct sugar and from sources other than sugarcane such as broken rice and maize as feedstock.There was also an ambitious incentive of interest subvention costing about Rs 5000 crore to the Central government.Even then in the 201920 sugarcane season that ended in September India blended around 5.11 per cent ethanol with petrola far cry from the 2022 target of 10 per cent blending.News agency PTI in a recent report said that the petroleum and food ministries are of the view that ethanol production cannot be dependent on one feedstock that is sugarcane for achieving the target of 20 per cent ethanol blending with petrol by 2030. There is a need to look at other agrifeedstock such as rice maize sorghum and barley for the purpose.India currently has 4.26 billion litres of ethanol production capacity annually while the actual ethanol produces is much lower at around 2 billion litres. When all the new production capacities come onstream India will start producing 5.5 billion litres.However to achieve a 20 per cent blending target by 2030 this capacity and estimated production is inadequate as India will need around 10 billion litres of ethanol per year to meet the 20 per cent blending target.         ",
    "With half of 202021 gone the Centre is now picking up the pace of transactions for the remainder of the year Tuhin Kanta Pandey Secretary in the Department of Investment and Public Asset Management (DIPAM) told   in an exclusive interview. These plans include initial public offerings of RailTel IRFC Ltd and WAPCOS Ltd.Pandey also said that the government is trying its best to complete the privatisation of Shipping Corporation Concor Ltd Bharat Earth Movers Ltd and Central Electronics Ltd before March 31.Some assets which the Centre also hopes to divest this year include the Nilanchal Ispat Nigam Ltd plant in Odisha and the Salem and Bhadravathi steel plants of SAIL Ltd he said.Besides the government will make another attempt at selling Pawan Hans and some subsidiaries of Air India while Bharat Petroleum still remains the brightest and most attractive prospect. Pandey also added that it has been decided to not offer any more tranches of the two equity exchangetraded funds comprising PSU stocks and that the Centre has very limited  bandwidth  to continue supporting Air India.Excerpts Q. The COVID pandemic has led to delays in carrying out divestment transactions be in the markets or through strategic sales. What are your plans for initial public offerings and offers for sale in the coming months A  We have not been shy of using the opportunities in the market as soon as the markets recovered. In fact as early as July we came out with a bond ETF through which we raised Rs 10000 crore for the CPSEs which has come in handy in terms of not only improving sentiments but also their capital expenditure plans because one of the big targets that the Ministry of Finance has been working on and the finance minister is actually personally monitoring is the capex plans of our CPSEs.On the equity side we have used the opportunities and gone for offersforsale of Hindustan Aeronautics Limited and Bharat Dynamics Ltd. In both we have almost touched the maximum shareholding requirement. In the Indian stock market this year we account for about 40 percent of all OFSs in terms of value. Tuhin Kanta Pandey.Then in the case of Mazagon Docks initial public offering it s been a huge success even beyond our expectations. We have other IPOs planned. The draft red herring prospectus for the RailTel IPO has been filed with SEBI. We also have the IRFC IPO planned which will be a big one and will be having two components. The company will raise money for their own projects plus the government piggybacking to sell stake. And some smaller companies also might be in the offing. An IPO of WAPCOS may happen if everything is in order.Our strategy is that we will not be repeatedly coming on to the market with the same stock we are going to keep the interest of the longterm investors in mind and avoid the price overhang. Another important policy decision that we have taken is that we will not do further tranches of two equity ETFs. The repeated offerings there have been claimed to be as one of the reasons for the overhang.Q  So that is your plan in terms of IPO transactions. What about privatisation or  strategic sales   Before the pandemic you had planned to privatise Bharat Petroleum Air India Concor and Shipping Corp.A  I think regarding Air India we were proceeding at a very good pace before the pandemic. We had issued a new Expression of Interest we had worked out certain debt levels we have a very important condition of net current liabilities to be zero. I think there is very limited bandwidth the government has on continuously supporting Air India which even in the best of the times preCOVID was actually making big losses. We have to see whether it is affordable to put the taxpayers  money continuously. Almost about Rs 500 crore per month will be required for Air India to sustain its losses. If there are certain constraints that potential bidders are facing I think we should remove those constraints and move the transaction ahead. The postCOVID aviation market is also a consideration. We have to work in this new reality.Bharat Petroleum (BPCL) is promising and will continue to be the main focus of our attention. Both in terms of economy as well as in terms of the receipts to the government this is likely to be a good transaction and this is back on track. There has been some delay because of the pandemic. The investors sought more time hence we extended the EOI a few times. I hope there will be no further extensions.For Concor the EOI is ready and we are waiting for the railways to finalise their land lease policy which they will do soon. For Shipping Corp the EOI is at an advanced stage and I think we should be coming out with that in November.There are some more strategic sale transactions that we are planning. One is Nilanchal Ispat Nigam Ltd. It is a joint venture of six companies. Four of them are central PSUs and two are Odisha government PSUs. This particular plant has a huge potential in terms of the land mines and capacity. It could potentially reach 67 million tons of capacity right now it is less than one million tons. We have done some road shows and there is a tremendous amount of interest in this asset. The EOI will be out soon and we hope to conclude it before March 31.The plans for Central Electronics Ltd have also moved to an advanced stage. We also hope to conclude the sale of two steel plants of SAIL Ltd before March. These are Salem Steel Plant and VISP Bhadravathi. We will come out with a revised EOI of Pawan Hans and we will look at some of the subsidiaries of Air India as well particularly the groundhandling unit.There is also Bharat Earth Movers Ltd the EOI is just about ready. We will hive off some noncore land assets before the deal. The plan is to retain a 28 percent stake but sell a 26 percent stake and transfer the management control.Q  Out of the total divestment target of Rs 2.1 trillion this year Rs 90000 crore was expected to come from the IPO of LIC Ltd and the shedding of the Centre s stake in IDBI Bank. What is the progress on those A  The LIC IPO has got some parts. We have hired Deloitte and SBI Caps as preIPO advisors. They are working out all the details that LIC needs to do and prepare itself as a corporation for the public listing. There will be certain legislative amendments that the Department of Financial Services is working on. We have also to do an Indian embedded value and this is an essential requirement for any IPO particularly for an insurance company. We will be issuing a request for proposal soon to hire an actuarial firm to independently arrive at this embedded value. But in order to do that itself LIC will have to do certain software changes and they are addressing that issue. So I would say that there is a lot of preparation involved. But the good thing is that we have chalked out the deadlines and timelines for these processes. We are approaching this particular thing as a project.IDBI is very much on track. First we have to obtain an inprinciple decision of the cabinet for which we are getting ready. We are at a very advanced stage and once this decision is out we can move forward. Again it will involve a lot of structuring of the transaction.Q  How close can you get to the Rs 2.1 lakh crore target A  I have not made the guesstimates here. We have actually started working literally only from August. We are using all the opportunities but are not making any sweeping judgments on anything. Wherever the opportunities exist we will look at it stock by stock transaction by transaction and then we try and complete all those transactions. Strategic disinvestment transactions are very time consuming because they have to pass through a long due diligence process. Therefore to give some timeline of that kind because everything has to be done properly to give you a certain figure and trying to arrive at a figure at this stage I don t think it is possible for me. The big transactions if they fructify then obviously the achievement will be higher. All that we can say at this stage is that whatever disinvestments come on track we will conclude in a proper manner.        ",
    "Indian state refiners  petrol and diesel sales declined in the first half of July from the same period last month according to preliminary data as a renewed lockdown in parts of the country and rising retail prices hit demand.India on Friday became the third country in the world to record more than one million cases of the new coronavirus behind only the United States and Brazil as infections spread further into the countryside and smaller towns.Fuel demand growth in India the world s thirdbiggest oil importer and consumer plunged to historic lows in April when the federal government imposed a countrywide lockdown.Staterefiners  diesel sales which account for twofifth of overall refined fuel sales in India fell by 18 percent to 2.2 million tonnes (MT) in the first half of July from the same period in June and by about 21 percent from a year earlier according to data compiled by Indian Oil Corp.State companies  Indian Oil Corp Hindustan Petroleum Corp and Bharat Petroleum  own about 90 percent of India s retail fuel outlets.COVID19 VaccineFrequently Asked QuestionsA vaccine works by mimicking a natural infection. A vaccine not only induces immune response to protect people from any future COVID19 infection but also helps quickly build herd immunity to put an end to the pandemic. Herd immunity occurs when a sufficient percentage of a population becomes immune to a disease making the spread of disease from person to person unlikely. The good news is that SARSCoV2 virus has been fairly stable which increases the viability of a vaccine.There are broadly four types of vaccine   one a vaccine based on the whole virus (this could be either inactivated or an attenuated  weakened  virus vaccine)  two a nonreplicating viral vector vaccine that uses a benign virus as vector that carries the antigen of SARSCoV  three nucleicacid vaccines that have genetic material like DNA and RNA of antigens like spike protein given to a person helping  human cells decode genetic material and produce the vaccine  and four protein subunit vaccine wherein the recombinant proteins of SARSCOV2 along with an adjuvant (booster) is given as a vaccine.Vaccine development is a long complex process. Unlike drugs that are given to people with a diseased vaccines are given to healthy people and also vulnerable sections such as children pregnant women and the elderly. So rigorous tests are compulsory. History says that the fastest time it took to develop a vaccine is five years but it usually takes double or sometimes triple that time.Indian fuel demand had gathered pace from May when the lockdown was partly eased. But a spike in cases of coronavirus infection has led to authorities imposing fresh lockdowns and designating new containment zones in several states this week including the largely rural Bihar in the east and the southern tech hub Bengaluru.State companies  sales of petrol fell 6.7 percent to 880000 tonnes in the first half of July from the same period in June and by about 12 percent from a year earlier the data showed. Retail sales are down because of reimposed lockdown and higher retail prices  said Sri Paravaikkarasu director for Asia oil at consultancy FGE.India s diesel price has touched a record high of 81.35 rupees ( 1.09) a liter on Friday in New Delhi slightly higher than that of petrol.India s overall refined fuel demand includes consumption of fuel oil bitumen and liquefied petroleum gas (LPG).State retailers sold 6.5 percent more LPG in the first half of July from a year ago at about 1.075MT.Follow our full coverage of the coronavirus pandemic here. ",
    "India plans to completely fill its strategic petroleum reserve (SPR) by the third week of May by moving about 19 million barrels into the sites by then the managing director of the country s SPR said on Tuesday.India is moving the oil to the SPR to help the country s refineries reduce their excess crude as the lockdown to contain the outbreak of COVID19 the respiratory disease caused by the new coronavirus has dented transportation and industrial fuel consumption in Asia s thirdlargest economy.India s fuel demand in March declined by 17.8 percent the lowest in over two decades.India will be diverting cargoes for loading in April already bought by refiners Indian Oil Corp Bharat Petroleum Hindustan Petroleum and Mangalore Refinery and Petrochemicals Ltd. The refiners cut their crude processing after local fuel demand collapsed and are unable to store the excess oil themselves. As of now the plan is to fill the caverns by (the third week of May) before the arrival monsoon rains. We are buying oil from state refiners  H.P.S. Ahuja the managing director of the Indian Strategic Petroleum Reserves Ltd (ISPRL) said. ISPRL is responsible for building and filling of SPR sites.ISPRL wants to receive the cargoes before India s monsoon begins in May as the single point mooring system that can unload very large crude carriers (VLCC) at the port of Mangalore which will feed two SPR sites is shut during the threemonth rainy season.Reuters last month reported India planned to buy oil from the United Arab Emirates (UAE) and Saudi Arabia to fill its SPR to gain from low prices. We are taking advantage of low oil prices  he said adding most of these cargoes are linked to official selling prices (OSP) for April.Saudi Arabia drastically cut its OSPs for April to boost its oil sales after major producers failed to agree to extend a supply curtailment agreement that expired at the end of March.Ahuja said ISPRL hopes to receive the last oil cargo on May 21 while IOC supplied a VLCC containing oil from the UAE on Monday.The SPR is divided between three locations in southern India and can store about 37 million barrels of oil equivalent to about 9.5 days of India s oil demand. A portion of the SPR is already filled.The federal government has allocated about 38 billion rupees ( 498.18 million) for the oil purchases he said.Follow our full coverage of the coronavirus pandemic here. ",
    "ICICI Direct has come out with its second quarter (JulySeptember  19) earnings estimates for the Oil   Gas sector. The brokerage house expects Bharat Petroleum to report net profit at Rs. 1922.3 crore up 57.7  yearonyear (up 78.8  quarteronquarter).Net Sales are expected to decrease by 7.1 percent YoY (down 10.3 percent QoQ) to Rs. 76980.3 crore according to ICICI Direct.Earnings before interest tax depreciation and amortisation (EBITDA) are likely to rise by 38.8 percent YoY (up 54.1 percent QoQ) to Rs. 3358.7 crore.",
    "Shares of Bharat Petroleum (BPCL) plummeted more than 5 percent while shares of Hindustan Petroleum (HPCL) fell more than 3 percent intraday on May 21 despite the oil refining majors reporting strong Q4 numbers.BPCL in its BSE release said net profit for the quarter ended March 2019 grew 16.21 percent at Rs 3124.91 compared to Rs 2688.97 crore in the corresponding quarter last year.Revenue soared 10.33 percent to Rs 83941.67 crore from Rs 76080.39 crore on a yearly basis.Meanwhile HPCL reported a 70 percent jump in its fourthquarter net profit as inventory gains and rupee appreciation negated a dip in refinery margins.Net profit in JanuaryMarch came at Rs 2970 crore against Rs 1748 crore in the same period a year back said HPCL Chairman and Managing Director MK Surana.Brokerage firm CLSA has a sell rating on both companies with a target at Rs 300 for BPCL and Rs 210 for HPCL.According to CLSA BPCL s core performance has been weak accompanied by lowerthanexpected inventory gains. The brokerage said HPCL s refining was in line but the company missed on marketing.Deutsche Bank on the other hand has a buy rating on both oil refining majors with target at Rs 465 for BPCL and Rs 335 for HPCL.The brokerage has a buy rating for BPCL on an estimated 28 percent increase in refining segment EBITDA over FY1921 while it said that marketing has offset weak refining performance for HPCL.At 1149 hours BPCL was quoting at Rs 372.05 down 5.22 percent. HPCL was quoting at Rs 284.75 down 3.01 percent on the BSE.        ",
    "Ruchi Agrawal  ResearchAfter weak results from Indian oil corporation (IOCL) and Hindustan petroleum corporation (HPCL) Bharat petroleum corporation (BPCL) also reported a weak performance in Q3. Despite an uptick in revenue the operating and net margins declined sharply both yearonyear and sequentially. Gross refining margins (GRMs) dipped in line with global margin contraction. Substantial inventory losses ate away the quarter s profitability.GRMs for the nine months from April to December were at  5.25 per barrel (9MFY18   6.97). GRM for the quarter was  2.78 per barrel (Q3FY18  7.89) a sharp dip YoY. While there has been a weakness in GRMs globally with the Singapore benchmark at  4.5 per barrel (Q2   6.1) BPCL s GRMs saw a much greater impactEarnings before interest tax depreciation and amortisation (EBITDA) declined 77 percent YoY (69 percent sequentially) due to high inventory losses and input costs employee expenses and finance costs.A sharp uptick in crude prices since October 2018 led to high inventory losses during the quarter which was single main reason for the contraction in profits and margins. This also indicates a notsoweak core performance.Other expenses includes a foreign exchange gain during the quarter of Rs 659 crore (Q3FY18  Rs 172 crore gain) which led to a noticeable decline in the expenses.Volumes in the export business grew 55 percent sequentially (YoY   36.2 percent)Domestic volumes were largely flat YoY while there was 6 percent sequential improvementThe overall performance of the company appears weak much in line with expectations and other oil marketing companies. With volatile crude prices upcoming central elections and tweaking of marketing margins around elections we remain cautious on the company s performance.Follow  RuchiagrawalFor more research articles visit our   Research Page. ",
    "Global rating agency Moody s affirmed the Baa2 ratings on Bharat Petroleum Corporation and its subsidiary BPRL International Singapore (BPRL) on improving operating profile despite weak credit metrics with a stable outlook.The Singaporebased agency also expects a high likelihood of extraordinary support from the government in times of need and a very high level of dependence between the government and BPCL a situation which results in a twonotch rating uplift. We expect BPCL s credit metrics will weaken and stay at the weaker end of the tolerance level of its Ba1 baseline credit assessment  Vikas Halan a senior vicepresident at the agency said in a statement.He further said the ratings also remains constrained by the uncertainty around the government policy for the oil   gas sector especially in terms of pricing and sector consolidation.Moody s expects the company to moderate its dividend payments or adjust its capital spending over the next 1218 months such that its credit metrics will improve to levels more appropriate for its Ba1 baseline credit assessment.In the absence of such improvement its baseline credit assessment may come under pressure it said.The agency also noted that the operating profile has improved since the completion of its Kochi refinery in 2018 and its total refining throughput increased to 37.7 million tonne in FY18 from 34.4 million tonne in FY17.The company has also upgraded its refinery to use a higher proportion of heavy crude oil positioning it well to benefit from the increasing differential between light and heavy crude oil it said. Given its high dividend payouts and weak cash flow Ba1 assessment is unlikely to be upgraded to Baa3 over the next 1218 months. Also upward pressure may emerge over time if there is clarity around the government policy for the oil   gas sector and around BPCL s own financial policy for shareholder returns  it added.        ",
    "Saudi Aramco the world s largest oil company is seeking a majority stake in the proposed Rs 3 lakh crore oil refinery at Ratnagiri in Maharashtra according to a report by  .The report adds that one of the oil company s conditions include that most of the oil is sourced from Saudi Arabia.The Dhahranbased company has been in talks with Indian Oil Corporation Bharat Petroleum and  Hindustan Petroleum for months the report said. They have just drawn the starting line. Only after the negotiations have concluded you would know what Aramco has finally got  a source told the paper.The petrochemical project is a joint venture between the three Indian stateowned refiners. The Rs 3lakh project  has a refining capacity of 60 million metric tonnes per annum.In response to a request for comment by   Aramco confirmed the discussions. Saudi Aramco views India as an important strategic market and is a reliable and leading supplier of crude oil to India. We are looking at various opportunities in India which includes refining. We are in discussions with Indian counterparties in these potential ventures and hope to progress our cooperation and partnership further.  the company told the paper.The company did not provide details of the negotiation.One source speaking to   ruled out the possibility of giving Aramco a majority stake in the refinery. Giving Aramco the majority stake is just out of the question. If we can t have the majority stake in our own project on our own land then where  the source said.Maharastra Chief Minister Devendra Fadnavis last month assured that the project will be launched after negotiations with the stakeholders.Local fishermen and farmers are against the project because it hurts their livelihood Business Standard reports.        ",
    "Stateowned Indian Oil Corporation (IOC) and Bharat Petroleum Corporation Ltd (BPCL) may buy 26 percent stake each in gas utility GAIL India Ltd paying the government over Rs 20000 crore each to become integrated energy firms.Following Finance Minister Arun Jaitley s February 2017 Budget announcement of creating integrated oil majors IOC and BPCL had submitted separate proposals to buy the government s 54.89 percent stake in India s biggest gas marketing and transportation firm GAIL.A top source said since the government is not looking at actual merger of oil companies but only transfer of its ownership to a cash rich PSU the best option would be to split the 54.89 percent holding in GAIL equally between IOC and BPCL.At Friday s closing price of Rs 440.85 a share for GAIL on BSE the stake is worth close to Rs 41000 crore.In January this year Oil and Natural Gas Corp (ONGC) bought out government s 51.11 per cent stake in refiner Hindustan Petroleum Corp Ltd (HPCL) for Rs 36915 crore. But HPCL hasn t been merged with ONGC and continues to remain a separate listed company with the same board. After the buyout HPCL has become a subsidiary of ONGC which gets up to two seats on the company board.The source said IOC and BPCL too can follow the same model and split the government s stake equally among themselves. GAIL will become their subsidiary and will continue to operate as a listed company with an independent board. IOC and BPCL would get to appoint one director each on GAIL board.Like in case of ONGC s acquisition of HPCL the government would get to encash its holding in GAIL yet retain control over the company through IOC and BPCL.The source said the government has so far not taken any view on the proposals made by IOC and BPCL. How and to whom the stake would be sold will be decided after interministerial consultations he said adding that the option of splitting the stake equally among the two firms is one of the options that would be considered during such deliberations.Jaitley in the 201718 Budget had unveiled government s plan to create integrated public sector oil majors  through consolidation mergers and acquisitions  so as that the merged company has  capacity to bear higher risks avail economies of scale take higher investment decisions  and is  able to match the performance of international and domestic private companies .Following this ONGC expressed interest in taking over HPCL while IOC and BPCL said they keen on taking over GAIL to help add natural gas transportation and marketing business to their kitty.The government took up ONGC s proposal first and the transaction was completed at Januaryend this year.IOC the largest oil refiner and fuel marketing company in the country wanted to either acquire another refiner to add to its capacity or a gas company like GAIL.The firm feels it already has a fledging gas business in underconstruction liquefied natural gas terminals city gas distribution projects and gas marketing. And GAIL the nation s biggest gas transporter and marketing company would complement that.BPCL on the other hand too has natural gas ambitions and wrote to the oil ministry saying GAIL was its number one choice for acquisition. It listed Oil India Ltd the nation s second largest exploration firm as its number two choice.The government holds 66.13 per cent stake in OIL which at current market price is worth about Rs 18000 crore.Incorporated in August 1984 by spinning off gas business of ONGC GAIL (India) Ltd owns and operates about 11000km of natural gas pipelines in the country. It sells around 60 per cent of natural gas in the country.        ",
    "India s Bharat Petroleum launched a tender seeking a spot liquefied natural gas (LNG) cargo for delivery in January and a separate tender for three cargoes for May August and October trade sources said.Bharat seeks a spot cargo for Jan. 1921 delivery into the Dahej import terminal with bids due on or before Dec. 5 and the award due to be made on December 7 one trader said.In a parallel tender Bharat requires a cargo in May August and October. Bids for this tender must be submitted on or before Nov. 28 and the award is due on December 12 the trader said.        ",
    "Bharat Petroleum which has just been upgraded to a Maharatna company today said it has lined up capital expenditure of Rs 1.08 trillion for the next five years.The public sector oil retailer will spend the money on capacity expansion of refineries as well as marketing and upstream activities its chairman and managing director D Rajkumar told reporters at a postAGM press meet here late evening.The chairman said the company will focus primarily on going global to further expand the business especially in upstream activities.On the performance of the company in the year goneby he said both marketing and refinery businesses did well with the refinery capacity utilisation touching 112 per cent.On the upstream front also it has done relatively well he added.Explainer  How Daily Revision Of Petrol Diesel Prices WorksFrom the upstream business the first dividend from the Russian assets have already come which is roughly USD 27 million in the first quarter Rajkumar said.On the benefits of Maharatna status Rajkumar said it will help the company raise cheaper funds apart from giving it financial freedom. For instance this will empower our board to sanction investments of up to Rs 5000 crore in a single project which is fivetimes more than when we were a Miniratna company  he said.        "
]