[
    "Net Sales at Rs 16481.30 crore in June 2024 down 4.19  from Rs. 17202.80 crore in June 2023.Quarterly Net Profit at Rs. 2374.60 crore in June 2024 down 8.24  from Rs. 2587.80 crore in June 2023.EBITDA stands at Rs. 3858.10 crore in June 2024 down 3.61  from Rs. 4002.70 crore in June 2023.Wipro EPS has decreased to Rs. 4.54 in June 2024 from Rs. 4.72 in June 2023.Wipro shares closed at 557.20 on July 19 2024 (NSE) and has given 14.87  returns over the last 6 months and 33.32  over the last 12 months.",
    "Wipro shares fell as much as 8 percent on July 22 after the company delivered a weak Q1 FY25 performance with a 1 percent quarteronquarter (QoQ) decline in its consolidated revenue. This is particularly concerning when compared to its competitors TCS and Infosys which reported 23 percent QoQ growth.Wipro s Q1 FY25 revenue and guidance for Q2 FY25 fell below expectations. Citi Research said that the Q2 guidance is likely to disappoint investors who had higher expectations.Also Read   Wipro ADR falls over 10  after Q1 revenue misses estimatesThe company s consolidated revenue declined by 1.1 percent on quarter to Rs 21963.8 crore falling short of   s forecast of Rs 22229 crore. Bengalurubased Wipro also revised its revenue guidance for the Q2 FY25 suggesting a potential sequential decline of 1 percent or a slight growth of up to 1 percent (in constant currency terms).Nomura had a  Buy  call on Wipro with a target price of Rs 600 and Citi had a  Sell  call with Rs 495 as the target price.Follow our live blog for all the market actionHowever brokerages noted that the early recovery in discretionary demand could potentially boost Wipro s future performance.Nuvama said that Wipro has a long way to go in order to reach industry average growth. While the brokerage expects Wipro to continue underperforming its peers it also notes that its low valuation and high dividend yield help mitigate downside risk. Nuvama has maintained its  Hold  rating on Wipro. The brokerage increased the target price for the stock to Rs 530 Rs 460 as the BFSI segment continued to grow and consumer business also picked up.",
    "Here s a quick look at stocks likely to be in focus in Monday s trade covering quarterly earnings order wins and fundraising announced by companies after market hours on Friday and over the weekend Results TodayIDBI Bank Suzlon Energy Allied Blenders and Distillers Coforge Cyient DLM Dodla Dairy Fortis Malar Hospitals Indian Overseas Bank Jana Small Finance Bank Mahindra Logistics Mangalore Refinery   Petrochemicals Solara Active Pharma Sciences Spencers Retail Supreme Industries UCO Bank and Zensar Technologies will announce quarterly earnings on July 22.Quarterly EarningsReliance Industries Q1 (Consolidated YoY)Profit at Rs 17448 crore Vs Rs 18182 croreRevenue grows 11.5  to Rs 257823 crore Vs Rs 231132 croreEBITDA rises 2  to Rs 42748 crore Vs Rs 41906 croreEBITDA margin at 16.6  Vs 18.1 Jio Platforms profit jumps 11.7  to Rs 5698 crore Vs Rs 5101 croreJio Platforms revenue rises 12.8  to Rs 34548 crore Vs Rs 30640 croreReliance Retail Ventures profit increases 4.6  to Rs 2549 crore Vs Rs 2436 croreReliance Retail Ventures revenue climbs 8.1  to Rs 75615 crore Vs Rs 69948 croreOil to chemicals revenue spikes 18.1  to Rs 157133 crore Vs Rs 133031 croreOil   gas revenue surges 33.4  to Rs 6179 crore Vs Rs 4632 croreHDFC Bank Q1 (Standalone QoQ)Profit falls 2  to Rs 16174.8 crore Vs Rs 16511.85 croreRevenue rises 2.6  to Rs 29837.1 crore Vs Rs 29076.8 croreProvisions falls sharply to Rs 2602 crore Vs Rs 13511.6 croreGross NPA ratio increases to 1.33  Vs 1.24 Net NPA ratio rises to 0.39  Vs 0.33 Wipro Q1 (Consolidated QoQ)IT services revenue declines 0.8  to Rs 21896.3 crore Vs Rs 22079.6 croreIT services EBIT falls 0.4  to Rs 3605.7 crore Vs Rs 3619.5 croreMargin rises 10 bps to 16.5  Vs 16.4 Dollar revenue down 1.2  to USD 2625.9 million Vs USD 2657.4 millionCompany expects revenue from IT services business to be in range of  26002652 million in Q2 Vs Q1Kotak Mahindra Bank Q1 (Standalone YoY)Profit surges 81  to Rs 6249.8 crore Vs Rs 3452.3 croreRevenue rises 9.8  to Rs 6842.4 crore Vs Rs 6233.7 croreProvisions jump to Rs 578.5 crore Vs Rs 364.3 croreGross NPA ratio flat at 1.39  Vs 1.39  (QoQ)Net NPA ratio rises to 0.35  Vs 0.34  (QoQ)Union Bank of India Q1 (Standalone YoY)Profit increases 13.7  to Rs 3679 crore Vs Rs 3236 croreNet interest income grows 6.5  to Rs 9412 crore Vs Rs 8840 croreGross NPA ratio falls to 4.54  Vs 4.76  (QoQ)Net NPA ratio declines to 0.90  Vs 1.03  (QoQ)Yes Bank Q1 (Standalone YoY)Profit grows 46.7  to Rs 502 crore Vs Rs 343 croreNet interest income increases 12.2  to Rs 2244 crore Vs Rs 2000 croreGross NPA ratio flat at 1.7  Vs 1.7  (QoQ)Net NPA ratio drops to 0.5  Vs 0.6  (QoQ)JSW Steel Q1 (Consolidated YoY)Profit plunges 64.3  to Rs 867 crore Vs Rs 2428 croreRevenue rises 1.7  to Rs 42943 crore Vs Rs 42213 croreEBITDA declines 21.8  to Rs 5510 crore Vs Rs 7046 croreMargin dips 390 bps to 12.8  Vs 16.7 RBL Bank Q1 (Standalone YoY)Profit jumps 29  to Rs 372 crore Vs Rs 288 croreNet interest income increases 20  to Rs 1700 crore Vs Rs 1422 croreNet interest margin improves to 5.67  Vs 5.53 Gross NPA ratio rises to 2.69  Vs 2.65  (QoQ)Net NPA ratio flat at 0.74  Vs 0.74  (QoQ)JK Cement Q1 (Consolidated YoY)Profit jumps 66.9  to Rs 184.8 crore Vs Rs 110.7 croreRevenue rises 1.6  to Rs 2807.6 crore Vs Rs 2762.6 croreJSW Energy Q1 (Consolidated YoY)Profit surges 84  to Rs 534.2 crore Vs Rs 290.4 croreRevenue declines 1.7  to Rs 2879.5 crore Vs Rs 2927.9 crorePatanjali Foods Q1 (Standalone YoY)Profit zooms 199.6  to Rs 262.9 crore Vs Rs 87.8 croreRevenue falls 7.6  to Rs 7173 crore Vs Rs 7767.1 croreCreditAccess Grameen Q1 (Standalone YoY)Profit increases 14.8  to Rs 397.7 crore Vs Rs 346.3 croreRevenue rises 28.7  to Rs 926.8 crore Vs Rs 720.3 croreRoute Mobile Q1 (Consolidated YoY)Profit declines 11.5  to Rs 81.2 crore Vs Rs 91.7 croreRevenue rises 14  to Rs 1103.4 crore Vs Rs 967.3 croreICICI Lombard General Insurance Company Q1 (YoY)Profit spikes 48.7  to Rs 580.4 crore Vs Rs 390.4 croreGross premium written grows 19.8  to Rs 7931 crore Vs Rs 6622.1 croreCombined ratio at 102.3  Vs 103.8 Oberoi Realty Q1 (Consolidated YoY)Profit surges 81.7  to Rs 584.5 crore Vs Rs 321.6 croreRevenue jumps 54.4  to Rs 1405.2 crore Vs Rs 910 croreNippon Life AMC Q1 (Consolidated YoY)Profit zooms 41  to Rs 332.3 crore Vs Rs 235.7 croreRevenue increases 42.6  to Rs 505 crore Vs Rs 354.2 croreIndian Hotels Q1 (Consolidated YoY)Profit rises 10.2  to Rs 260.2 crore Vs Rs 236 croreRevenue increases 5.7  to Rs 1550.2 crore Vs Rs 1466.4 croreRPG Life Sciences Q1 (YoY)Profit grows 21.1  to Rs 26.8 crore Vs Rs 22.1 croreRevenue increases 11.9  to Rs 165.4 crore Vs Rs 147.8 croreSupreme Petrochem Q1 (YoY)Profit zooms 76.1  to Rs 121.9 crore Vs Rs 69.3 croreRevenue jumps 28.4  to Rs 1573.5 crore Vs Rs 1225.1 croreTejas Networks Q1 (Consolidated QoQ)Profit sinks 47.2  to Rs 77.5 crore Vs Rs 146.8 croreRevenue grows 17.8  to Rs 1562.8 crore Vs Rs 1326.9 croreStocks To WatchIndian Railway Catering and Tourism CorporationThe Government of India announced the upgradation of IRCTC from  Schedule B  to  Schedule A  category Central Public Sector Enterprises (CPSE).EMSThe company has received a Letter of Acceptance from the Uttarakhand Urban Sector Development Agency for the Development of Water Supply and Sewerage System in Vikas Nagar Dehradun. The order value is Rs 535.19 crore with EMS holding a 95  share along with another joint venture partner for an 18year operation and maintenance (O M) period.VedantaThe company closed its Qualified Institutions Placement (QIP) issue raising Rs 8500 crore by selling 19.31 crore equity shares at Rs 440 per share. Institutional investors including Morgan Stanley Societe Generale SBI MF Nippon MF ICICI Mutual Funds and Copthall Mauritius Investment participated.JSW InfrastructureIndia s secondlargest private commercial port operator acquired the Under Development Slurry Pipeline Project from JSW Utkal Steel a whollyowned subsidiary of JSW Steel for Rs 1700 crore. They will enter a 20year longterm takeorpay agreement to transport iron ore through the pipeline.Allcargo GatiTotal volume including surface and air express stood at 100000 tonnes in June 2024 marking a marginal MoM decline of 3  and a YoY decline of 2 . The company reported a 1  improvement in yield compared to the previous month driven by a better product mix.Oil and Natural Gas CorporationONGC Videsh signed a definitive Sale Purchase Agreement (SPA) to acquire 0.615  participating interest in the offshore Azeri Chirag Gunashli (ACG) oil field in Azerbaijan from Equinor. Additionally it will acquire 0.737  shares of the Baku Tbilisi Ceyhan (BTC) pipeline company through its subsidiary ONGC BTC. The acquisitions totaling up to USD 60 million are expected to complete in the coming months.Anant RajSubsidiary Anant Raj Cloud entered into a Memorandum of Understanding with Google LLC to collaborate on providing data center infrastructure managed services and cloud platforms to public and private enterprises. They also plan to develop innovative technological solutions for potential customers.HDFC Life Insurance CompanyThe Assistant Commissioner of Income Tax Mumbai issued an income tax rectification order reducing tax and interest demand for Assessment Year 202021 to Rs 1868.12 crore down from the previous demand of Rs 4178.8 crore.Jubilant PharmovaFollowing an audit in April 2024 the US Food and Drug Administration (US FDA) classified Jubilant Draximage Inc s radiopharmaceutical manufacturing facility in Montreal Canada as Voluntary Action Indicated.Indian BankThe Central Government has extended the term of office for Shanti Lal Jain as MD   CEO of Indian Bank from September 1 2024 to December 31 2024.Power Finance Corporation (PFC)The board appointed Sandeep Kumar as Director (Finance) effective July 11.SME Listing on July 22Three M Paper Boards Prizor Viztech Sati Poly Plast Aelea CommoditiesBulk DealsIndiabulls Housing FinancePlutus Wealth Management LLP purchased 13.5 lakh partly paidup equity shares of the housing finance company at an average price of Rs 67.9 per share.Navkar CorporationStallion Asset purchased a 1.14  stake in the company at an average price of Rs 125.37 per share.Stocks Turn ExDividendExide Industries Carborundum Universal Bemco Hydraulics Chembond Chemicals DHP India Divgi Torqtransfer Systems Happy Forgings Indian Metals   Ferro Alloys Swelect Energy Systems Swelect Energy Systems Taparia Tools Voltamp Transformers Xpro IndiaStock Trades ExDate for SplitNHC FoodsF O BanBalrampur Chini Mills Bandhan Bank GMR Airports Infrastructure Hindustan Aeronautics Hindustan Copper India Cements Piramal Enterprises SAIL Vedanta",
    "Wipro Ltd said it is seeing an uptick in discretionary spending within the Banking Financial Services and Insurance (BFSI) vertical despite a cautious overall demand environment. ...discretionary spending is coming back at least in the banking and financial services and it s also reflected in our BFSI growth sequentially as well  Chief Executive Officer Srinivas Pallia said in a postearnings conference call.This is in contrast to what the information technology (IT) sector in general and Wipro in particular is facing with overall discretionary spending remaining elusive.The statement is backed by data that shows that the BFSI segment s contribution increased to 34 percent in Q1 FY25 from 33.5 percent in the quarterago period. For the quarter ended June 30 the segment grew 0.3 percent sequentially.Also Read   Wipro s headcount increases by 337 in Q1 reverses decline after six quartersThe company also highlighted the fact that the BFSI vertical achieved sequential growth for two consecutive quarters.The BFSI vertical is one of the few verticals that were not impacted as much as others in Q1FY25 data shows. Consumer and Technology were the only other verticals that showed improvement sequentially out of the seven verticals in which the company operates.BFSI vertical s performance was reflected in the large deal bookings the company booked during the June quarter which stood at  1.2 billion. Nonetheless Wipro s total deal wins fell sequentially to  3.6 billion when compared to  3.8 billion it won in the previous quarter. We recorded another quarter of total large deal bookings over  1 billion with our largest win in the recent years. Our top accounts continued to grow accompanied by a growth in Americas 1 SMU BFSI and Consumer sectors  Wipro s new CEO Srinivas Pallia said.Shares of Wipro ended 2.8 percent lower at Rs 557 on July 19. The stock has risen over 16 percent so far in 2024.",
    "The American depositary receipts (ADRs) of Wipro fell over 10 percent on the NYSE on April 19 after the IT services company missed quarterly revenue expectations due to ongoing weakness in key regions like Europe and APMEA (Asia Pacific India Middle East and Africa).At 9 40 am Eastern Daylight Time Wipro s ADRs on NYSE were trading over 10 percent lower at  6.17.The company s consolidated revenue declined by 1.1 percent on quarter to Rs 21963.8 crore falling short of   s forecast of Rs 22229 crore.Wipro experienced growth in its Americas 1 market which includes Latin America. However revenue in the Americas 2 Europe and APMEA markets dropped on both sequential and annual basis.Also Read   Wipro Q1 Results  Net profit up 4.6  onyear to Rs 3003 crore  guidance raisedWipro s QoQ revenue decreased across most verticals. Health Energy Natural Resources and Utilities Technology Manufacturing and Communications saw a degrowth of  0.76.5 percent. Meanwhile Banking Financial Services and Insurance and Consumer segment grew 0.3 percent and 1.5 percent respectively.The consolidated net profit of Wipro for Q1 FY25 however increased 6 percent QoQ to Rs 3003.2 crore surpassing   s estimate of Rs 2953.Bengalurubased Wipro also revised its revenue guidance for the Q2 FY25 suggesting a potential sequential decline of 1 percent or a slight growth of up to 1 percent (in constant currency terms).  Revenue from our IT Services business segment to be in the range of  2600 million to  2652 million  Wipro said for Q2 FY25.Up until now most IT companies have maintained that the discretionary spending environment remains subdued.",
    "Wipro Ltd on 19 July reported its Q1 FY25 net profit rose 4.6 percent from a year ago to Rs 3003 crore beating market expectations. The IT company s AprilJune consolidated revenue fell 3.8 percent to Rs 21964 crore.A   poll of brokerage estimates had pegged Wipro s fiscal first quarter net profit to rise to Rs 2953 crore and revenue to fall to Rs 22229 crore.The company has guided sequential revenue growth in the range of 1 percent to 1 percent in constant currency (CC) terms. This comes after the company slashed the guidance last quarter in the range of 1.5 percent to 0.5 percent.India s top three IT companies are off to a robust start in Q1 FY25 marked by signs of recovery in discretionary spending and artificial intelligence (AI) deals picking up pace. To be sure these companies highlighted that they are not yet fully out of the woods yet and would require to watch out for a couple of quarters before calling it full recovery.India s largest IT firm Tata Consultancy Services (TCS) Q1 results met expectations with net profit rising 9 percent yearonyear to Rs 12040 crore. Infosys beat expectations and raised its FY25 revenue growth guidance to 34 percent. HCL Technologies posted strong numbers with the net profit rising 20 percent to Rs 4257 crore in Q1. We recorded another quarter of total large deal bookings over  1 billion with our largest win in the recent years. Our top accounts continued to grow accompanied by a growth in Americas1 SMU BFSI and Consumer sectors  said CEO Srini Pallia.Wipro CFO Aparna Iyer said the firm expanded operating margin to 16.5 percent in the AprilJune quarter up 42 basis points from the same quarter a year ago.  Our margin performance is also reflected in our EPSincrease of 10 percent YoY  she added.The Bengalurubased company won large deals worth   1.2 billion during the quarter down 3.6 percent onyear. The company s total deal wins stood at   3.3 billion down 11.8 percent onyear in constant currency terms.Wipro net added 337 employees during the quarter reversing the trend of declining headcount after six quarters. This addition takes the total to 234391 employees.Wipro s attrition rate declined marginally to 14.1 percent sequentially on a lasttwelvemonth (LTM) basis. In Q4 the attrition rate was 14.2 percent.The topline grew by 4.9 percent yearonyear (YoY) an 1 percent quarteronquarter (QoQ) in CC terms.The company s utilisation levels excluding trainees went up by 80 basis points (bps) to 87.7 percent in Q1 from 86.9 percent in the previous quarter.IT companies have been increasing their utilisation levels at a time when hiring has largely been paused as a result of tepid demand in recent quarters.This is a developing story please come back for more ",
    "Here s a quick look at stocks likely to be in focus in Friday s trade covering quarterly earnings order wins and acquisitions announced by companies after market hours on Thursday Results TodayReliance Industries Wipro UltraTech Cement Bharat Petroleum Corporation JSW Steel Union Bank of India ICICI Lombard General Insurance Company One 97 Communications (Paytm) Patanjali Foods Aether Industries Atul BEML Land Assets Blue Dart Express CreditAccess Grameen Fedbank Financial Services Indian Hotels JSW Energy Jubilant Pharmova Mahindra EPC Irrigation Nippon Life India Asset Management Oberoi Realty Orissa Minerals Development Company PVR Inox Route Mobile RPG Life Sciences Supreme Petrochem Stanley Lifestyles Tejas Networks Transformers and Rectifiers (India) and Vipul Organics will release their quarterly earnings on July 19.Results on SaturdayHDFC Bank Kotak Mahindra Bank RBL Bank Yes Bank Poonawalla Fincorp Aarti Surfactants Arihant Capital Markets Can Fin Homes Gravita India JK Cement Kirloskar Pneumatic Motisons Jewellers Netweb Technologies India Rossari Biotech Seshasayee Paper   Boards Shakti Pumps Sportking India and Zenith Health Care will announce their quarterly results on July 20.Quarterly EarningsInfosys Q1 (Consolidated QoQ)Profit down 20.1  at Rs 6368 crore Vs Rs 7969 croreOther income drops 72  to Rs 733 crore Vs Rs 2619 croreRevenue grows 3.7  to Rs 39315 crore Vs Rs 37923 croreEBIT increases 8.8  to Rs 8288 crore Vs Rs 7621 croreMargin expands to 21.1  Vs 20.1 Revenue in dollar terms grows 3.3  to USD 4714 million Vs USD 4564 millionRevenue growth in constant currency terms at 3.6 Raises revenue growth forecast for FY25 to 34  from 13 Retains operating margin forecast for FY25 at 2022 L T Technology Services Q1 (Consolidated QoQ)Profit declines 8  to Rs 313.6 crore Vs Rs 340.9 croreRevenue slips 3  to Rs 2461.9 crore Vs Rs 2537.5 croreEBIT dips 10.4  to Rs 383.6 crore Vs Rs 428.2 croreMargin drops to 15.6  Vs 16.9 Revenue in dollar terms down 3.3  at  295.2 million Vs  305.1 millionRevenue in constant currency down 3.1 Tata Technologies Q1 (Consolidated YoY)Profit declines 15.4  to Rs 162 crore Vs Rs 191.5 croreRevenue rises 0.9  to Rs 1269 crore Vs Rs 1257.5 croreEBITDA down 7.7  at Rs 231.1 crore Vs Rs 250.5 croreMargin dips 170 bps to 18.2  Vs 19.9 Company partners with Arm to drive innovation in software defined vehicles (SDV)Persistent Systems Q1 (Consolidated QoQ)Profit drops 2.8  to Rs 306.4 crore Vs Rs 315 croreRevenue rises 5.7  to Rs 2737.2 crore Vs Rs 2590.5 croreEBIT grows 2.6  to Rs 384 crore Vs Rs 374.4 croreEBIT margin dips 50 bps to 14  Vs 14.5 South Indian Bank Q1 (Standalone YoY)Profit surges 45.4  to Rs 294.1 crore Vs Rs 202.4 croreNet interest income increases 7.2  to Rs 865.8 crore Vs Rs 807.7 croreGross NPA flat QoQ at 4.50 Net NPA falls QoQ to 1.44  Vs 1.46 Tanla Platforms Q1 (Consolidated YoY)Profit increases 4.3  to Rs 141.2 crore Vs Rs 135.4 croreRevenue grows 10  to Rs 1002.2 crore Vs Rs 911.1 croreCIE Automotive India Q1 (Consolidated YoY)Profit increases 1.3  to Rs 216.4 crore Vs Rs 213.6 croreRevenue drops 1.2  to Rs 2292.7 crore Vs Rs 2320.3 croreCEAT Q1 (Consolidated YoY)Profit jumps 7  to Rs 154.2 crore Vs Rs 144 croreRevenue increases 8.8  to Rs 3192.8 crore Vs Rs 2935.2 croreDalmia Bharat Q1 (Consolidated YoY)Profit rises 0.7  to Rs 145 crore Vs Rs 144 croreRevenue drops 0.2  to Rs 3621 crore Vs Rs 3627 croreSagar Cements Q1 (Consolidated YoY)Net loss narrows to Rs 28.4 crore Vs loss at Rs 39.8 croreRevenue rises 3.9  to Rs 560.6 crore Vs Rs 539.7 croreShoppers Stop Q1 (Consolidated YoY)Net loss at Rs 22.7 crore Vs profit at Rs 14.5 croreRevenue increases 7.6  to Rs 1069.3 crore Vs Rs 993.6 croreRallis India Q1 (YoY)Profit declines 23.8  to Rs 48 crore Vs Rs 63 croreRevenue rises 0.1  to Rs 783 crore Vs Rs 782 croreJSW Infrastructure Q1 (Consolidated YoY)Profit slips 8.9  to Rs 292.4 crore Vs Rs 320.9 croreRevenue jumps 15  to Rs 1009.8 crore Vs Rs 878.1 croreStocks To WatchDr Reddy s LaboratoriesThe pharma company signed a nonexclusive patent licensing agreement with Takeda Pharmaceutical Company to commercialize Vonoprazan tablets in India. Vonoprazan is a novel orally active potassiumcompetitive acid blocker (PCAB) used to treat reflux esophagitis and other acid peptic disorders.Tech MahindraThe company has approved a plan to merge its stepdown subsidiary vCustomer Philippines (Cebu) Inc. with its parent company vCustomer Philippines Inc. vCustomer Philippines Inc. is a wholly owned subsidiary of Tech Mahindra. The merger is subject to regulatory approvals in the country of incorporation.Zydus LifesciencesThe United States Food and Drug Administration (USFDA) has conducted an inspection at the company s injectables manufacturing facility at Jarod Gujarat from April 15 to April 23 this year. The USFDA has determined that the inspection classification of this facility is Official Action Indicated (OAI).GPT InfraprojectsThe company has received an order worth Rs 103 crore from NHAI New Delhi and Eastern Railway Kolkata. The contract is an enhancement of the existing contract with NHAI and Eastern Railway Kolkata.Dixon TechnologiesThe Competition Commission of India (CCI) has approved the acquisition of up to 56  shareholding of Ismartu India by Dixon Technologies.JTL IndustriesThe company has opened its qualified institutions placement (QIP) issue on July 18. The floor price has been fixed at Rs 221.57 per share.Tata Consumer ProductsThe Capital Raising Committee of the board will meet on July 23 to consider the rights issue price and related payment mechanisms rights entitlement ratio the record date and the timing of the issue. The board had approved a rights issue worth Rs 3000 crore in January 2024.Vodafone IdeaThe Capital Raising Committee of the board has approved the second tranche of the allotment of 415202701 equity shares worth Rs 614.5 crore at an issue price of Rs 14.80 per share to Nokia Solutions and Networks India and Ericsson India vendors of the company on a preferential basis.Grindwell NortonAfter the retirement of Keki Elavia Independent Director the board has recommended the appointment of Subodh Nadkarni Independent Director as the Chairman of the board of directors of the company.Bulk DealsIndiabulls Housing FinancePlutus Wealth Management LLP has bought 6170064 partly paid up equity shares in the company at an average price of Rs 70.61 per share valuing the transaction at Rs 43.57 crore.India CementsSociete Generale sold a 0.56  stake in the cement company at an average price of Rs 342.66 per share.SME Listing on July 19Sahaj SolarStocks Turn ExDividendTata Consultancy Services Kotak Mahindra Bank Life Insurance Corporation of India Tech Mahindra Union Bank of India Abbott India Apcotex Industries Arvind Bajaj Electricals Blue Star Bosch Chennai Petroleum Corporation Cholamandalam Investment and Finance Company Cummins India Dabur India Delta Corp Dhanuka Agritech Graphite India Gujarat Containers Hitech Corporation ICRA Indian Hume Pipe JSW Infrastructure Lloyds Engineering Works Laxmi Organic Industries Mangalam Cement PDS Precision Camshafts RS Software India SaintGobain Sekurit India Shanthi Gears Shree Digvijay Cement Sumitomo Chemical India Transport Corporation of India Zensar Technologies Zydus WellnessStock Trades ExDate for SplitElecon Engineering CompanyStocks Trade ExDate for RightsJaykay Enterprises Shrydus IndustriesF O BanBandhan Bank Hindustan Aeronautics India Cements SAIL Balrampur Chini Mills GMR Airports Infrastructure GNFC Hindustan Copper Piramal Enterprises RBL Bank Vedanta",
    "Wipro is set to announce its Q1 FY25 earnings on July 19 with analysts divided between expecting a slight decline due to macroeconomic challenges and softness in certain verticals and anticipating modest growth driven by new deals and operational efficiencies.According to the average of nine estimates compiled by   Wipro s consolidated net profit for the quarter ended June is expected to rise over four percent QoQ to Rs 2953 crore while revenue from operations is likely to remain flat. Wipro Q1 FY25 Preview We expect flattish revenues for the quarter. Revenues will be above the midpoint of guidance of ()1.5  0.5 percent. We attribute relatively strong performance to strength in CAPCO and likely recovery in Americas market  said Kotak Institutional Equities.Wipro s EBIT margin for the June quarter is expected to decline by 20 basis points (bps) QoQ to 16.2 percent.  Recurring IT services EBIT margins are expected to remain largely flat despite seasonal softness in 1Q margins due to investment lead by ongoing cost optimisation  Equirus Capital said.What factors are driving the earnings 1. New Deal RampUps  Axis Securities expects a 0.9 percent QoQ revenue growth primarily fueled by the rampup of new deals. Wipro Q1 FY25 Brokerage Estimates2. Operational Efficiencies  InCred Equities notes that operational efficiencies could help offset increased SG A expenses (Selling General and Administrative) following significant reductions in the previous quarter. This efficiency drive is likely to stabilize margins despite the revenue pressures.3. Vertical Performance  The company is expected to see a continued softness in key verticals such as retail and communications led by cautious client spending behaviour according to Motilal Oswal.Also Read   TCS vs Wipro  Who ll win the AI platform war What to look out for in the quarterly show Analysts will be closely monitoring Wipro s commentary on several key aspects such as the new management s strategic initiatives in AI and consulting and signs of recovery in verticals like BFSI and healthcare. Investors will be keen on updates regarding deal TCV pipeline pricing scenarios and the rampup of new deals.Anand Rathi expects significant insights into BFSI growth and a potential revival in the HiTech sector. Axis Securities focuses on the outlook for key verticals like manufacturing and retail. BNP Paribas will look for updates on discretionary demand and macro headwinds while Emkay anticipates detailed discussions on IT budgets demand trends and consulting business outlook.",
    "Analysts continue to remain cautious about information technology stocks despite some seeing green shoots of recovery for the sector ahead of the Q1 earnings season. As a result three information technology majors Wipro Tech Mahindra and HCLTech continue to hold a place on the list of Nifty 50 stocks receiving maximum pessimism from analysts.According to   s Analyst Call Tracker Wipro tops the list of stocks with the highest  sell  calls or maximum pessimism. A total of 23 brokerages have a  sell  call on the stock while 13 gave it a  hold  rating and only nine rolled out a  buy  recommendation. This is despite CLSA s recent double upgrade on the stock to  outperform  an equivalent to a  buy  call.Tech Mahindra is another IT major that commands high pessimism with 24 out of the 46 brokerages covering the stock assigning it either a  sell  or a  hold  rating. The Street s stance on HCLTech is similar with the stock facing 22  sell  or  hold  calls compared to 21  buy  ratings.Recovery still some time awayIT companies have faced a challenging year as businesses in the US a key market tightened spending causing delays in deal conversions for domestic players. Even though a respite is likely to come for the sector towards the end of the current fiscal year it is still some time away. A weak exit to FY24 and a still inconducive demand environment could temper initial FY25 guidance for most players  JM Financial said in a recent note.While the street hopes for a pickup in discretionary spending through FY25 channel checks and recent peer commentaries suggest no immediate recovery Axis Securities said. This could potentially lead to some nearterm consensus cuts it added.Also Read   Analyst Call Tracker  Pain continues for IT stocksEven though analysts at Nomura believe Q1 FY25 will mark the bottom of sluggish revenue growth for the Indian IT services sector they still feel that a strong recovery in discretionary demand may take a few quarters. However a glimmer of hope arises from the fact that the brokerage does not see things worsening for the sector hereon.Regardless of the fact that Nomura has shifted from a  negative  to  neutral  stance on the sector it still remains cautious about turning bullish on Indian IT majors.Uncertainty over rate cutsWhile investors across the globe are hoping to see the Federal Reserve deliver the first rate cut in September underlying caution on the same still prevails. Analysts also believe that a tight macro environment in the US would delay a recovery for domestic IT players and hence the US central bank s rate action will remain crucial for the sector.Along with that analysts also remain watchful of management s commentaries after the Q1 results to gauge the course of recovery for the IT sector. Management commentaries for major IT companies were not so positive in the previous quarter further evoking caution among brokerages. Hence this time around brokerages would want to see some optimism from the management before shifting their stance on the sector.Also Read   Analyst Call Tracker April 2024  Optimism eludes IT stocks despite upgrades auto stocks see rating cuts",
    "A double upgrade by CLSA sent shares of Wipro higher by as much as 4 percent on July 1 making it the top Sensex gainer with the rating revised from  Underperform  to  Outperform  and the target price raised to Rs 607 from Rs 431 per share.The revised price target implies a potential upside of nearly 41 percent from the June 28 closing level.The brokerage firm anticipates no further adjustments to Wipro s FY25 guidance and said it has noted a stabilization in discretionary demand which is helping the outlook. CLSA expects Wipro to provide Q2 constant currency revenue growth guidance in the range of 02 percent.In an exchange filing last month Wipro had said that a leading US communication services provider has awarded a contract to the company for managed services for some products and industryspecific solutions. The  500 million deal is expected to be spread over a period of five years.Follow our market blog to catch all the live actionWipro s announcement of a  500 million deal this quarter has also been received positively by CLSA. Another brokerage Morgan Stanley had also said that the mega US deal can be a positive especially given the tight discretionary spending environment.Aside of Wipro other IT stocks like Tech Mahindra LTIMindtree and Tata Consultancy Services (TCS) too were trading higher by up to 2 percent helping the Nifty IT index.Experts point to renewed foreign inflows and optimism surrounding potential US Fed rate cuts as key drivers behind the current rally in IT shares.According to Kranthi Bathini director of equity strategy at WealthMills Securities  Valuations of IT stocks appear very attractive from a longterm perspective.  Given that Indian IT firms derive a substantial portion of their revenue from US clients they are particularly sensitive to changes to the US Fed Funds rates."
]