[
    "Shares of Tata Steel slipped over 3 percent to Rs 160 snapping its fourday gaining streak on the bourses after investors gave thumbs down to its firstquarter earnings.During the quarter it reported a 51 percent jump in consolidated net profit at Rs 960 crore missing analysts  expectations of Rs 1025 crore according to ten brokerage houses polled by  .Follow our LIVE blog for all the latest updatesThe firm s revenue from operations fell 8 percent to Rs 54771 crore in Q1FY25 down from Rs 59490 crore in Q1FY24 and also below the Rs 58687 crore reported in the JanuaryMarch quarter.Following the results international brokerage CLSA maintained its  underperform  call on the counter with a price target of Rs 135. It said that the recent Supreme Court ruling upholding the state government s power to levy cess on minerals will be an overhang on the stock.On the other hand Jefferies issued a  buy  call on Tata Steel with a target price of Rs 195 per share. In Europe the Netherlands operations achieved positive EBITDA after six quarters is a positive for the company.At about 2 pm shares of the company were trading at Rs 162 down 2 percent from the last close on the NSE. Tata Steel shares have slipped 7 percent in the past month. ",
    "Tata Steel Netherlands will become debtfree in next 1218 months focusing on decarbonization capex and avoiding significant spending on the legacy business managing director TV Narendran said in a call with analysts.Currently Tata Steel UK and Tata Steel Netherlands each hold about GBP 600800 million in debt primarily for securitization and working capital requirement Narendran said.Tata Steel Netherlands was debtfree until about 1215 months ago.Narendran said historically the Netherlands had no debt due to positive cash flows but recent challenges including the repair and modernisation of the blast furnace has led to the debt burden. However this is not expected to be a longterm concern he clarified. We have around  200300 million in old acquisition debt across the Netherlands UK and overseas acquisitions excluding other bonds. The Netherlands is expected to use its cash flows to eliminate this debt within 1218 months as they won t have significant capex on the legacy business with decarbonization spending being separate   TV Narendran said in the analyst concall.For the UK Narendran said Tata Steel aims for EBITDA profitability and debt reduction and prepare for decarbonization. It has received  500 million in grants from the UK government to modernize the Port Talbot site.On 31 July Tata Steel reported a 51 percent jump in consolidated net profit at Rs 960 crore for the quarter ended June. Revenue from operations declined 8 percent YoY to Rs 54771 crore in Q1FY25.Tata Steel s European operations showed signs of recovery in the latest quarter with the Netherlands  IJmuiden works benefiting from a new blast furnace. Despite overall weak demand in Europe Tata Steel Netherlands  EBITDA turned positive at Rs 453 crore in June quarter.The EBITDA rebound was due to improved liquid steel production and stabilized operations. After issues with blast furnace 6 EBITDA reached GBP 43 million in the first quarter reversing a GBP 27 million loss in the previous quarter. EBITDA per tonne improved by GBP 48 quarteronquarter driven by reduced material costs and lower conversion costs despite higher raw material expenses.However the UK operations continued to struggle posting a significant EBITDA loss of Rs 955 crore with a higher loss per tonne compared to both the previous quarter and the same period last year. Increased inventory for downstream operations also impacted working capital according to CFO Koushik Chatterjee.",
    "Net Sales at Rs 54771.39 crore in June 2024 down 7.93  from Rs. 59489.66 crore in June 2023.Quarterly Net Profit at Rs. 959.61 crore in June 2024 up 51.37  from Rs. 633.95 crore in June 2023.EBITDA stands at Rs. 6954.38 crore in June 2024 up 9.51  from Rs. 6350.70 crore in June 2023.Tata Steel EPS has increased to Rs. 0.77 in June 2024 from Rs. 0.52 in June 2023.Tata Steel shares closed at 165.33 on July 31 2024 (NSE) and has given 21.61  returns over the last 6 months and 34.25  over the last 12 months.",
    "Net Sales at Rs 32959.66 crore in June 2024 up 1.91  from Rs. 32341.62 crore in June 2023.Quarterly Net Profit at Rs. 3329.03 crore in June 2024 down 22.05  from Rs. 4270.70 crore in June 2023.EBITDA stands at Rs. 7145.72 crore in June 2024 down 11.79  from Rs. 8101.13 crore in June 2023.Tata Steel EPS has decreased to Rs. 2.67 in June 2024 from Rs. 3.49 in June 2023.Tata Steel shares closed at 165.35 on July 31 2024 (BSE) and has given 21.67  returns over the last 6 months and 34.27  over the last 12 months.",
    "Metals major Tata Steel Ltd reported a 51 percent jump in consolidated net profit at Rs 960 crore for the quarter ended June 30 2024 from Rs 634 crore in the yearago period.Here are the key highlights from the first quarter results of Tata Steel Q1 performance",
    "Tata Steel might need to pay more than Rs 17000 crore as minerals tax dues to the state of Odisha if the Supreme Court rules that states can retrospectively impose taxes on mineral extraction the company said in an exchange filing on July 31.The disclosure comes a  week after a ninejudge Constitution bench of the Supreme Court by a majority held that the royalty payable on minerals under the Mines and Minerals (Development and Regulation) Act 1957 is not a tax.The SC bench said states have the power to impose tax and levies such as cess on land in which the mineral is extracted from.However the company is awaiting further clarity on the period of the tax levy s applicability to fully determine its financial obligations . The SC on July 31 reserved its verdict on whether its judgment holding that states have the power to impose tax on mineral extraction will be applicable prospectively or retrospectively.The steelmaker s battle with Odisha regarding the tax dates back to 2005 when Odisha introduced  Orissa Rural Infrastructure and SocioEconomic Development Act 2004 (ORISED Act)  with effect from February 01 2005 levying tax on mineral bearing land.Tata Steel operates 10 mines in the eastern state which includes iron ore mines chromite mines and manganese mines. These mines play a crucial role in supplying raw materials for Tata Steel s operations in India.In December 2005 the High Court of Odisha ruled that the state lacked the authority to impose taxes on minerals based on a writ petition filed by Tata Steel. Later Odisha contested this decision and appealed to the Supreme Court.        ",
    "Metals major Tata Steel Ltd reported 51 percent jump in consolidated net profit at Rs 960 crore for the quarter ended June 30 2024. It reported consolidated net profit of Rs 634 crore in the yearago period. The steelmaker s net profit missed analysts  expectations of Rs 1025 crore according to a poll by   collated from estimates by ten brokerage houses. The net profit was also higher on a sequential basis with the bottomline coming in at Rs 611.48 crore in the quarter ending March 31.The firm s revenue from operations declined 8 percent to Rs 54771 crore in Q1FY25 as against Rs 59490 crore in Q1FY24 with the topline also being lower over the Rs 58687 crore reported in the JanMar quarter. The consolidated earnings before interest taxes depreciation and amortisation or EBITDA for the quarter was Rs 6822 crore higher by 11.4 percent on an annual basis and also higher than the Rs 6631 crore reported in Q4 FY24.The consolidated operating EBITDA margin for the quarter was around 12.5 percent higher than the 10.3 percent reported in the same quarter last year and the 11.3 percent reported in the JanMar quarter aided by a decline in the total expenses at Rs 52389 crore lower than the Rs 58553 crore for Q1 FY24 and Rs 56497 crore in the preceding quarter. Raw material prices including that of coking coal and iron ore remained rangebound during the quarter Tata Steel said in its investor presentation.Net debt at the end of the June quarter was Rs 82162 crore. with the company s liquidity at Rs 36460 crore.ELECTIONS HEAT MAR INDIA OPSIn its India business Tata Steel reported sluggish sales for the AprJun quarter which was marked by the General Elections causing a slowdown in construction activity as well as extreme heat in many parts of India resulting in unavailability of labour and restrictions on construction. The company reported deliveries in India of 4.94 MT during the quarter slightly higher over the same period last year but declined 8.6 percent sequentially.Price growth or the lack of it in the company s India operations remained a drag on Tata Steel s balance sheet as it has with other steelmakers too. Market sources indicate that prices of hot rolled coil steel have declined by around 56 percent on an annual basis and have been largely flat sequentially. This resulted in Tata Steel s India operations reporting an EBITDA per tonne of Rs 14227 lower than Rs 15884 reported in the same quarter last year and also representing a decline over JanMar when the same was Rs 15282.The company noted that while imports  witnessed moderation  on a sequential basis India remained a net importer of steel for the AprJun quarter. Steelmakers such as JSW Steel and others have expressed concerns about the elevated levels of Chinese steel exports to India which is also being routed through countries in the Association of South East Asian Nations or ASEAN trade bloc. India has a free trade agreement with ASEAN.NETHERLANDS RECOVERING CHURN IN UKFor Tata Steel s longstruggling European operations the reporting quarter was marked by a recovery in the company s mainland Europe business primarily in The Netherlands where a newlyrefurbished blast furnace at its IJmuiden works has been up and running.Despite subdued demand in Europe an improvement in cost metrics caused Tata Steel Netherlands to report a positive EBITDA of Rs 453 crore translating to an EBITDA per tonne of Rs 3075. In the quarter before and in the yearago period Tata Steel reported negative EBITDA from its Netherlands operations.For the company s UK operations EBITDA remained in the red at Rs 955 crore representing an EBITDA per tonne loss of Rs 14076 significantly higher YoY and sequentially. The company also built up inventory to service its downstream operations which impacted working capital according to Koushik Chatterjee Tata Steel executive director and chief financial officer.In Tata Steel UK the company started its restructuring process to close its blast furnaces at Port Talbot and replace them with electric arc furnaces even as parts of plan remain uncertain particularly the 500 million pound support package that was to be provided by the UK government to the total 1.25 billion pound restructuring.The new UK government led by the Labour Party prime minister Keir Starmer has been critical of the layoffs that are expected as a result of the restructuring and wants jobs to be protected before it starts disbursing the 500 million pounds. Around 2800 people are expected to be laid off as part of the restructuring with Tata Steel having commenced the process of closing its heavyend assets including one of the two blast furnaces. The other blast furnace is scheduled for closure in September.The company had previously indicated that the change in government would not get in the way of its restructuring plans in the UK. In the press release ED and CFO Chatterjee said that it is continuing to engage with employees  unions in the UK having opened the voluntary redundancy programme for employees on July 10 and it is also working with the UK government for the release of the 500 million pound grant.CAPEX AND EXPANSIONTata Steel spent Rs 3777 crore  by way of capital expenditure in Q1 with the 5 MTPA Kalinganagar expansion project being close to reallisation according to the company.The firm s 3 MTPA facility in Kalinganagar is currently being expanded in capacity to 8 MTPA with Tata Steel managing director and chief executive officer TV Narendran saying in a press release that the new blast facility there is expected to be commissioned by September 2024.The steelmaker announced that it is investing Rs 6000 crore into its subsidiary Neelachal Ispat Nigam which has a 1.1 MTPA integrated steel facility in Kalinganagar Odisha. Tata Steel had previously said that it wants to proceed with a capacity expansion at Neelachal Ispat Nigam.On July 31 Tata Steel s shares on NSE closed trading 0.8 percent higher at Rs 165.44 apiece.         ",
    "Tata Steel on Monday said it has acquired over 557 crore equity shares in its Singaporebased arm for USD 875 million.In May Tata Steel s board had approved infusion of funds into T Steel Holdings Pte Ltd (TSHP) by way of subscription to equity shares in one or more tranches the company said in an exchange filing.  Further to our disclosure dated May 29 2024  we wish to inform you that the company has today acquired 5573248408 equity shares of face value USD 0.157 each aggregating to USD 875 million (Rs 7324.41 crore) in TSHP  Tata Steel said. Post this acquisition TSHP will continue to be a whollyowned subsidiary of the company it said.        ",
    "The benchmark indices showed a smart recovery trading moderately lower after the Union Budget met street expectations on July 23. Experts advised focusing on the 2420024000 levels on the downside for the Nifty 50 and 2485025000 on the higher side while continuing with a buyondips strategy. Here are the top budgetsensitive stocks to bet on and their levels to watch Ashish Kyal CMT Author Founder and CEO of Waves Strategy AdvisorsREC   CMP  Rs 618.8REC shows a bullish trend with prices above the Ichimoku Cloud. The Relative Strength Index (RSI) indicates positive momentum as it is reversing back from near 50 levels. Long positions can be created with a stoploss at Rs 580 and target levels at Rs 660 which is near the upper end of the channel.Strategy  BuyTarget  Rs 660StopLoss  Rs 580Petronet LNG   CMP  Rs 341.35Petronet LNG a leading player in the LNG infrastructure sector has shown a bullish trend with a strong support level at Rs 330. The RSI indicates bullish momentum and the Moving Average Convergence Divergence (MACD) suggests a buy signal. The stock also bounced back from the 20day moving average support. A break above Rs 344 will indicate a buy for a move towards Rs 364 with a stoploss near Rs 330 levels.Strategy  BuyTarget  Rs 364StopLoss  Rs 330Bharat Dynamics   CMP  Rs 1493.75BDL is exhibiting a strong bullish trend with a recent bounce back above the 50day moving average (MA). BDL has completed wave 4 and can start wave 5 on the higher side which can take prices to the previous high near Rs 1720 levels. We recommend a buy position with a stoploss at Rs 1380 (recent swing low) and target levels at Rs 1720. The longterm trend is turning bullish with the 20day MA above the 50day MA providing additional upside momentum.Strategy  BuyTarget  Rs 1550 Rs 1720StopLoss  Rs 1380Anshul Jain Head of Research at Lakshmishree Investments   SecuritiesHindustan Unilever   CMP  Rs 2735.3Hindustan Unilever (HUL) is showcasing a robust 150week long Cup and Handle pattern on its weekly charts with a critical neckline at Rs 2680. During the base formation volumes remained subdued but the subsequent rally to the neckline has witnessed substantial volumes indicating broadbased participation by smart money. Given the positive budget outlook for FMCG companies HUL emerges as an attractive buy opportunity at Rs 2750 with a stoploss set below Rs 2650 and an ambitious target of Rs 3000 . The strong technical setup coupled with favorable macroeconomic factors positions HUL as a compelling choice for investors looking for growth in the FMCG sector. This setup highlights the stock s potential for significant upside in the coming months.Strategy  BuyTarget  Rs 3000StopLoss  Rs 2650Apex Frozen Foods   CMP  Rs 251.25The upcoming budget is anticipated to emphasize frozen food and logistics sectors positioning Apex Frozen Foods as a significant beneficiary. Technically Apex Frozen has formed a 68weeklong Double Bottom pattern with the right bottom emerging on extremely driedup volumes indicating strong accumulation. This pattern typically suggests a reversal and a potential uptrend. The stock presents an attractive buy opportunity at the current market price of Rs 251 with an immediate stoploss on a close below Rs 220. With the budget likely to focus on these sectors Apex Frozen Foods could see a substantial upside targeting Rs 345. Investors should keep an eye on this stock for a promising breakout in the near term.Strategy  BuyTarget  Rs 345StopLoss  Rs 220Snowman Logistics   CMP  Rs 74.37The upcoming budget is anticipated to heavily emphasize the logistics sector making Snowman Logistics a standout contender for potential gains. Snowman Logistics is displaying exceptional technical strength with a 19weeklong Cup and Handle pattern forming on the weekly charts. This classic bullish pattern is backed by volume dynamics volumes remained subdued during the Cup formation but surged significantly as the stock approached the Handle s neckline. This suggests strong buying interest and accumulation. Given the stock s current market price of Rs 74 investors can consider buying with a stoploss at Rs 65 and a target of Rs 90. With the expected budget boost to logistics Snowman Logistics is wellpositioned for substantial returns.Strategy  BuyTarget  Rs 90StopLoss  Rs 65Navkar Corporation   CMP  Rs 137.58The upcoming budget is expected to be highly favourable for Navkar Corporation and the stock s technicals are aligning perfectly with this outlook. Navkar Corp has broken out of a bullish 25weeklong Cup and Handle pattern on the weekly chart which is a classic indicator of a strong upward trend. The breakout has been accompanied by significant followthrough on substantial volumes reinforcing the bullish sentiment. This volume surge during the breakout phase signals robust buying interest and institutional accumulation. Currently trading at Rs 137.58 Navkar Corp presents a compelling buy opportunity with a stoploss below Rs 115. The immediate target for this trade setup is Rs 225 making it a potential highreward investment in light of the positive budget expectations.Strategy  BuyTarget  Rs 225StopLoss  Rs 115Jigar S Patel Senior Manager  Equity Research at Anand RathiTata Steel   CMP  Rs 160.32Recently Tata Steel experienced a significant decline dropping nearly 22 rupees after forming a Double Top at Rs 180 level. This decline equates to a 12 percent fall reflecting considerable selling pressure. However the stock found support around its 150day Exponential Moving Average (DEMA) indicating a potential stabilization point. On the indicator front the daily Relative Strength Index (RSI) has formed an impulsive structure near the 30 oversold zone which appears attractive at current levels. Therefore we advise buying Tata Steel in the Rs 158162 zone with a target of Rs 175 and a stoploss of Rs 153 on a daily close basis.Strategy  BuyTarget  Rs 175StopLoss  Rs 153Chemplast Sanmar   CMP  Rs 528.85Recently Chemplast Sanmar has been in a corrective phase. However in the previous trading session it found support at its previous breakout upper band accompanied by significant volume. Additionally the daily RSI has reversed from the 50 level on a daily scale further affirming our bullish stance on the stock. Therefore we recommend going long in the Rs 520530 zone with a target of Rs 600 and a stoploss placed near Rs 488 on a daily close basis.Strategy  BuyTarget  Rs 600StopLoss  Rs 488Hikal   CMP  Rs 342.55During the past few weeks Hikal has been in a corrective phase experiencing a downward adjustment in its price. However in the previous trading session the stock found support at the upper band of its previous breakout level a crucial technical indicator suggesting potential stabilization. This support was further validated by the formation of a Bullish Piercing candlestick pattern a reliable signal of a possible trend reversal. Additionally the daily RSI a momentum oscillator has reversed from the 50 level on a daily scale indicating renewed buying interest and further affirming our bullish outlook on the stock. Given these technical indicators we recommend initiating a long position in the Rs 335345 zone with an upside target of Rs 390 and a stoploss set at Rs 315 on a daily close basis to manage risk.Strategy  BuyTarget  Rs 390StopLoss  Rs 315",
    "Prabhudas Lilladher has come out with its first quarter (AprilJune  25) earnings estimates for the Metal   Mining sector. The brokerage house expects Tata Steel to report net profit at Rs. 870 crore up 37.7  yearonyear (up 10.3  quarteronquarter).Net Sales are expected to decrease by 5.8 percent YoY (down 4.5 percent QoQ) to Rs. 56020 crore according to Prabhudas Lilladher.Earnings before interest tax depreciation and amortisation (EBITDA) are likely to rise by 15.4 percent YoY (down 9.5 percent QoQ) to Rs. 5970 crore.",
    "Tata Steel s strategy for its UK plants remains unchanged even though a new government has come to power chairman N Chandrasekaran told shareholders on July 15 at the annual general meeting. His words indicated that the steelmaker will march ahead with its plans to close the second blast furnace plant which would result in the loss of 2800 jobs in Port Talbot Wales. I must say we have had very good discussions with both the previous government and the current government. We have been working very closely with the government the unions and the local government in Wales... everybody is working together to make sure the project is on track and we don t see any change in direction  Chandrasekaran said when some of the investors raised queries on the transition plans in UK postelections.The comments come amid reports that the change in government in the United Kingdom could hinder Tata Steel s plans to reduce jobs as part of its strategy to shut down the aging blast furnaces.Last week Fitch Ratings changed its outlook on Tata Steel to negative due to uncertainties surrounding the company s efforts to improve operations in the UK. We are constantly looking at how we can not only deliver to our downstream product commitments but also any other expansion opportunities with the right financial metrics... so that we are able to serve the market customers and also keep employment  Chandrasekaran added.According to a few UK media reports the UK government s new business secretary Jonathan Reynolds has said that  job guarantees  will form part of the negotiations with Tata Steel.Reynolds said there was  a better deal available  on the future of the plant but said newer technologies would employ fewer people according to a BBC report from last week.Tata Steel operates a 3 million tonne per annum (MTPA) plant at Port Talbot in South Wales employing approximately 8000 people across its operations in the country. As part of its decarbonization strategy the company is transitioning from the blast furnace (BF) method which is approaching the end of its life cycle to a lowemission electric arc furnace (EAF) process.In September 2023 Tata Steel and the UK government agreed on a joint investment of  1.25 billion to implement decarbonization initiatives at the Port Talbot steelmaking facility in Britain.        ",
    "Fitch Ratings on Friday revised its outlook on domestic steel major Tata Steel to negative on account of uncertainty surrounding the turnaround of the company s operations in the UK.However the expected robust growth in Tata Steel s India operations and likely earnings before interest taxes depreciation and amortization (EBITDA) profits at Dutch operations in FY25 may offset any losses at UK operations Fitch Ratings said in a report. Fitch Ratings has revised the Outlook on Indiabased Tata Steel Limited s (TSL) Issuer Default Rating (IDR) to Negative from Stable and affirmed the IDR at  BBB . We have also affirmed the rating on the USD 1 billion notes due July 2024 issued by TSL s subsidiary ABJA Investment Co. Pte. Ltd. and guaranteed by TSL at  BBB   the statement said adding that the negative outlook reflects uncertainty surrounding turnaround of the UK operations.The rating agency further said that the change in the UK government and labour union s actions to save job losses at TSL s UK operations may delay its plan to reduce losses through FY25.Tata Steel owns 3 million tonne per annum (MTPA) at Port Talbot plant in South Wales and employs around 8000 people across all its operations in that country.As part of its decarbonisation plan the company is shifting to a lowemission electric arc furnace (EAF) process from the blast furnace (BF) route which is nearing its end of life cycle.In September 2023 Tata Steel and the UK government agreed on a joint investment plan of 1.25 billion pounds to execute decarbonisation plans at Port Talbot steel making facility in Britain.Of the 1.25 billion pounds 500 million pounds was provided by the UK government.        ",
    "Amid concerns over global economic uncertainty operational aspects and rising steel imports from China analysts slashed their ratings and target prices for Tata Steel.The Tata groupled firm was one of the most downgraded stocks on the Street over the past year past quarter and past month.From 26  buy  calls last year only 14 brokerages have maintained their bullish rating on the player. Tata Steel went from four  hold  and three  sell  ratings to nine  hold  and eight  sell  calls in a year.According to experts the onset of monsoon across the country will limit and restrict constructionled activity impacting the demand for steel and prevent any major upward movement in prices during the nearterm. Additionally flat steel prices may face pressure as imports of flat steel are likely to increase. On the cost front rising coking coal prices are likely to drag margin of steel firms in the medium term  said Elara Securities.China imports riseOn the domestic front steel spreads are falling as Chinese steel production rises. The exports from China are depressing the global prices. Steel exports from China have fallen by  25 tonne over the past quarter. In the foreseeable future the steel market will likely experience sustained downward pressure resulting in no improvement in steel spreads  per InCred Equities. The brokerage has a  sell  rating on Tata Steel.On the other hand Jefferies upheld its  buy  ratings on Tata Steel and the target price has been increased to Rs 200. Jefferies was positive on the notable rise in manufacturing activities reported by China and the United States. With these two countries being major consumers of metal an increase in manufacturing activity would translate to a heightened demand for metal.Also Read   UK s Unite union suspends strike at Tata Steel plantUK plant closureTata Steel plans to invest  2.1 billion into its Singapore arm will help repay the existing debt of its offshore entities and support rejig costs in the UK.Morgan Stanley noted that Tata Steel s heavy assets in the UK are close to shutting down. This could mean a change in the company s strategy possibly leading to reallocating resources or new investments.The closures were announced in January as part of the Indian company s plan to turn around its lossmaking UK business by switching to lower carbon electric arc furnaces a proposal backed by 500 million pounds ( 632 million) of government money.The steelmaker has begun preparations to place equipment orders for the electric arc furnace by September 2024 begin enabling and preparatory works at the site by December 2024 and based on current permitting timelines begin construction on the project by August 2025.However the plant closure plans have been met with controversy as workers threatened to go on a strike due to the potential job losses.Profit fallsOn May 29 Tata Steel reported 64 percent fall in fourth quarter profit (attributable to owners) at Rs 611.48 crore amid lower steel realisations and poor performance in the steelmaker s international operations for the quarter ended March. The company had reported net profit of Rs 1704.86 crore in the same  quarter a year ago.The consolidated revenue from operations for the quarter fell 6.7 percent to Rs 58687.3 crore as compared to Rs 62961.5 crore recorded in the yearago period.The loss was significantly higher than anticipated leading to concerns among analysts about the company s operational challenges and prompting downward revisions.",
    "Here s a quick look at the stocks that will be in focus in trade on Thursday covering quarterly provisional numbers major order wins and large deals announced by companies after market hours on Wednesday Results TodayLe Travenues Technology (Ixigo) will announce its results for quarter ended March FY24 on July 4.Stocks To WatchTata SteelThe National Company Law Tribunal (NCLT) Mumbai Bench has approved the Scheme of Amalgamation among Tata Steel and Angul Energy and their respective shareholders.Bandhan BankThe bank recorded 21.8  yearonyear (YoY) and 0.7  quarteronquarter (QoQ) growth in loans and advances at Rs 125619 crore for Q1FY25. Total deposits fell 1.5  QoQ but grew 22.8  YoY to Rs 133203 crore in Q1. CASA deposits registered a 13.8  YoY growth and retail deposits (including CASA) rose 19.2  YoY while bulk deposits jumped 31.6  YoY for the quarter.Bajaj FinanceThe nonbanking finance company has recorded assets under management (AUM) at Rs 3.54 lakh crore for Q1FY25 growing 31  over the yearago period. The deposits book at Rs 62750 crore increased by 26  compared to Q1FY24. Net liquidity surplus was Rs 16200 crore as of June 2024. New loans booked during Q1FY25 grew by 10  YoY to 10.97 million.L T FinanceThe retailisation in Q1FY25 is estimated at 95  against 82  in Q1FY24. Retail disbursements for Q1FY25 are estimated at Rs 14830 crore growing 33  YoY and the retail loan book at the end of June FY25 quarter is estimated at Rs 84440 crore a growth of 31  YoY.VedantaThe cast metal aluminum production at the company s smelters stood at 5.96 lakh tonnes up 3  YoY due to better operational performance while the alumina production at Lanjigarh refinery was at 5.39 lakh tonnes growing 36  YoY driven by new capacity. Oil and gas production for the quarter was down 17  YoY.Suryoday Small Finance BankThe bank recorded gross advances at Rs 9037 crore in the June FY25 quarter growing 42  YoY while disbursement jumped 46  YoY to Rs 1740 crore. Total deposits grew by 42  YoY to Rs 8137 crore for Q1FY25. Gross NPA dropped to 2.67  in Q1FY25 against 2.80  in Q4FY24.Brigade EnterprisesThe Bengalurubased real estate developer has signed a Joint Development Agreement for a residential project spread across 8 acres with a total development potential of around 1.2 million square feet. The gross development value of the project is around Rs 1100 crore.GE T D IndiaThe company has received an order worth 64 million euros from Grid Solutions SAS France for the supply and supervision of high voltage products. It has also bagged an order worth 26 million euros from Grid Solutions Middle East FZE Dubai for the supply and supervision of high voltage products.MaricoThe FMCG company announced a collaboration with Kaya to scale up its play in advanced sciencebacked personal care aiming to build an omnichannel presence of Kaya s product range by leveraging Marico s sales and marketing capabilities.Shri Gang Industries and Allied ProductsSyed Azizur Rahman has resigned as Chairperson and NonExecutive NonIndependent Director of the company effective July 4.Koura Fine Diamond JewelryThe board has appointed Charmi Kamlesh Lodhiya as Chief Financial Officer (CFO) of the company effective July 3 following the resignation of Krunal Soni as CFO.Zee Media CorporationThe Ministry Of Corporate Affairs has given its approval to the company for the incorporation of the subsidiary Pinews Digital.Indiabulls Real EstateThe company s name has been changed from Indiabulls Real Estate to Equinox India Developments.Bulk DealsYatharth Hospital   Trauma Care ServicesICICI Prudential Mutual Fund has bought an additional 2.3  stake in Yatharth Hospital at an average price of Rs 405 per share. However Plutus Wealth Management LLP exited the company by selling its entire 2.91  stake at an average price of Rs 405.07 per share.Krishna VenturesGreen Portfolio via its Super 30 Dynamic Fund bought 0.65  shares in the company at an average price of Rs 92.47 per share.Dharmaj Crop GuardElara India Opportunities Fund sold a 0.6  shareholding in the company at an average price of Rs 305.24 per share.Ideaforge TechnologyThink India Opportunities Master Fund LP sold 0.52  shares in the company at an average price of Rs 796.6 per share.Stocks Turn ExDividendTata Power SKF India Solar Industries India Tide Water Oil Balaji AminesStock Trades Exdate For BuybackeClerx ServicesF O BanHindustan Copper India Cements        ",
    "Tata Steel aims at having a minimum of 25 per cent of its workforce made up of diverse groups including gender minorities marginalised communities persons with disabilities and LGBTQIA  individuals within the next few years a company official said.It is one of the first companies in the country to roll out a special recruitment drive for transgender talent having recruited over 100 members from the community for various roles across different locations the official claimed. Continuing this drive we aim to have 25 per cent of our workforce from diverse groups in the next couple of years  the official said.A total of 113 transgender individuals have been onboarded and posted at various locations including manufacturing operations and maintenance mining and services. These employees are stationed in Noamundi West Bokaro Kolkata Kharagpur Kalinganagar and Jamshedpur.Some of these employees work all three shifts and operate Heavy Earth Moving Machinery (HEMM) at the Noamundi iron ore mine in Jharkhand s West Singhbhum and West Bokaro coal mine in Ramgarh district. Tata Steel appreciates the potential of diversity equity and inclusion (DE I) and has a tremendous organisational focus on it  the official said. In line with this we renewed our commitment and refocused our approach to DE I in 2015 by setting up MOSAIC  a platform for pioneering initiatives diversity targets and employeefriendly policies conceptualised and executed from the apex level  he added.The official admitted that the initial planning stage was challenging due to inadequate knowledge about the transgender community. However we made a detailed plan and implemented it without any difficulty. To date we have not received any complaint from either side of the employees since the first batch of transgender individuals was inducted following proper training in 2019  the official said.On the productivity of these employees compared to the general workforce he said transgender individuals perform better in some areas.Jaya Singh Panda Chief Diversity Officer at Tata Steel said  We believe in nurturing a workplace where every person regardless of their sexual orientation or gender identity feels valued respected and empowered. Diversity is one of our greatest strengths and continuing this practice is key to longterm success and innovation. Speaking on condition of anonymity a transgender employee at the company s Jamshedpur plant said  We feel very safe inside the company as coworkers are friendly supportive and cooperative. The company has also developed infrastructure including separate toilets for us.  Another transfemale employee from Noamundi lamented that her parents never used to care about whether she ate or came home on time. When my father learned about my job at Tata Steel he did not believe me. He came and stayed with me until I joined. Since then he calls me every day to check on me  the worker said.A transmale employee in Jamshedpur said his job at the company enabled him to support his family and help with his sister s marriage something he never imagined possible.Another transfemale employee in Jamshedpur expressed gratitude for the accommodation provided by the company. I m happy that my society has accepted me as an individual  another member of the group added.        ",
    "Around 1500 Tata Steel workers in Britain will begin an indefinite strike from July 8 over the company s plans to close two blast furnaces and cut up to 2800 jobs the trade union Unite said on June 21.The strike action described by Unite as the first strikes by British steel workers in 40 years will take place at Tata s Port Talbot and Llanwern sites in Wales.The closures were announced in January as part of the Indian company s plan to turn around its lossmaking UK business by switching to lower carbon electric arc furnaces a proposal backed by 500 million pounds ( 632 million) of government money. Tata s workers are not just fighting for their jobs  they are fighting for the future of their communities and the future of steel in Wales  Unite General Secretary Sharon Graham said.Tata Steel employs more than 8000 people in the UK. The company said in January about about 2500 jobs of the total being cut were likely to go over the next 18 months.Reacting to the strike decision by the union a Tata Steel spokesperson said   We are extremely disappointed by Unite s unilateral decision to call strike action. Our existing steelmaking assets are near the end of their life are operationally unstable and causing unsustainable losses of  1 million a day. This is why preparations to close the blast furnaces and associated plants in Port Talbot are unchanged.  However if the safety and stability of our operations are put at risk by this action we will be forced to accelerate those closure plans. After extensive negotiations with our unions we substantially improved our support offering for affected employees   the most generous package in our history. Rather than taking strike action we would have expected Unite to put our improved offer to its members as previously accepted by all unions including Unite  the spokesperson added.(With Reuters inputs) ",
    "S P Global Ratings on June 14 placed its ratings on six Tata group entities including Tata Motors Tata Steel and Tata Power on CreditWatch with positive implications. The other companies in the Tata Group are Jaguar Land Rover Tata Power TML Holdings and ABJA Investment.The rating actions come ahead of S P s review of the relationship between the group s holding company Tata Sons and its subsidiaries. The review will assess whether the potential of extraordinary support for the group entities from Tata Sons is greater than what we previously factored S P said in a statement. This is due to increasing operational and management linkages within the group.S P noted that Tata Sons has a record of supporting group entities in events of stress. For example the group provided material extraordinary financial support to entities such as Tata Teleservices Ltd. and Coastal Gujarat Power Ltd. an erstwhile subsidiary of Tata Power which has now been merged with Tata Power. We are also undertaking the review because we believe operational integration between Tata Sons and group entities as well as between group entities will continue to increase. In addition we note the continued close involvement of Tata Sons in the strategies of group entities. For example the holding company led negotiations with the U.K. government for setting up the battery plant and securing government support for the restructuring of Tata Steel s U.K. facility.Tata Sons has a clear imprint on the group s financial strategy in line with a groupwide focus on managing leverage the ratings agency noted.        ",
    "Net Sales at Rs 58687.31 crore in March 2024 down 6.79  from Rs. 62961.54 crore in March 2023.Quarterly Net Profit at Rs. 611.48 crore in March 2024 down 64.13  from Rs. 1704.86 crore in March 2023.EBITDA stands at Rs. 6776.54 crore in March 2024 down 8.29  from Rs. 7388.74 crore in March 2023.Tata Steel EPS has decreased to Rs. 0.49 in March 2024 from Rs. 1.40 in March 2023.Tata Steel shares closed at 182.23 on June 12 2024 (NSE) and has given 40.07  returns over the last 6 months and 66.42  over the last 12 months.",
    "Tata Steel has expressed concerns over news reports in the UK media suggesting that the investment and restructuring programme at Port Talbot may be  put in peril  over differences between Conservative and Labour parties in the ongoing election period.In a statement to stock exchanges on June 11 Tata Steel clarified that it would continue with its announced closure of assets and restructuring program at the plant in the coming months.  We urge and request the current and the incoming government postelections to adhere to and safeguard the agreed terms of the  500 million package of support for the Electric Arc Furnace (EAF) project announced in September 2023  Tata Steel said in the statement.As of now one blast furnace at Port Talbot is scheduled to close by the end of June and another one by the end of September the company said. The plant plans to continue to service customers by utilising imported semifinished steel till the new furnace is built and commissioned.The Labour party has called for Tata Steel to make  no irreversible decisions  till the General Election next month said news reports. The First Minister of Wales and leader of Welsh Labour Vaughan Gething has met the management and trade unions at Port Talbot on June 10 and is making efforts to keep steelmaking going at the plant.Labour Party s shadow Business Secretary Jonathan Reynolds has urged Tata Steel to wait till the general election and hold new talks BBC reported on June 10. Reynolds has promised more government funds than the  500 million which were promised by the Conservatives.Tata Steel is one of UK s biggest private investors and its GBP 1.25 billion investment in Port Talbot is the largest in many decades in British steelmaking.In April this year Tata Steel had decided to shut its furnaces at Port Talbot turning down union s plea to reconsider the plans stating daily financial loss of GBP 1 million due to the operations. Construction work on a new furnace at Port Talbot is likely to begin next year one that would employ fewer workers and would adhere to greener production.        ",
    "The benchmark indices recouped almost all their losses and ended at fresh closing highs on June 7 with about 1915 equity shares advancing and 387 shares declining on the NSE. The market is expected to remain positive along with some volatility in the coming sessions. Here are some trading ideas for the near term Rajesh Palviya Senior Vice President Research (Head Technical Derivatives) at Axis SecuritiesTata Steel   CMP  Rs 179Tata Steel is in a strong uptrend across all time frames forming a series of higher tops and bottoms indicating positive bias. It has registered an alltime high at Rs 179.65 indicating bullish sentiments. The stock has been well placed above its 20 50 100 and 200day SMA and these averages are also inching up along with the price rise reaffirming the bullish trend. The daily weekly and monthly strength indicator Relative Strength Index (RSI) is in positive terrain which justifies rising strength across all time frames. The monthly  Bollinger band  buy signal shows increased momentum.Investors should buy hold and accumulate this stock with an expected upside of Rs 200221 with a downside support zone of Rs 170162 levels.Strategy  BuyTarget  Rs 200 221StopLoss  Rs 162Biocon   CMP  Rs 336Biocon continues to trend higher on the daily and weekly time frames forming a series of higher tops and bottoms. Recently the stock has recuperated its 100 and 200day SMA and rebounded sharply. This support zone also coincides with the 30week SMA (Simple Moving Average) support zone of Rs 274 which remains a crucial support zone. Rising volumes over the past 56 months signify increased participation in every rally. The daily and weekly  Bollinger band  buy signal shows increased momentum. The daily weekly and monthly strength indicator RSI is in positive terrain which justifies rising strength across all time frames.Investors should buy hold and accumulate this stock with an expected upside of Rs 365400 with a downside support zone of Rs 310290 levels.Strategy  BuyTarget  Rs 365 400StopLoss  Rs 290Pidilite Industries   CMP  Rs 3124Pidilite is in a strong uptrend across all time frames forming a series of higher tops and bottoms indicating positive bias. It has registered an alltime high at Rs 3231 indicating bullish sentiments. With last week s gains of 5 percent it has decisively broken out of the  multiple resistance  zone of Rs 3100 levels along with huge volumes indicating increased momentum. The stock has recaptured its 20 and 50day SMA and rebounded sharply which reconfirms the bullish trend. The daily weekly and monthly strength indicator RSI is in positive terrain which justifies rising strength across all time frames.Investors should buy hold and accumulate this stock with an expected upside of Rs 32803420 with a downside support zone of Rs 30803000 levels.Strategy  BuyTarget  Rs 3280 3420StopLoss  Rs 3000Osho Krishan Senior Analyst  Technical   Derivative Research at Angel OneApollo Tyres   CMP  Rs 485Apollo Tyres has seen a decent correction in the last couple of trading months plunging towards the 200 SMA on the daily chart. However in the last couple of sessions the counter has restored some strength from its historical support and the neckline of the previous breakout and seems to recoup from here on. Additionally the 14period RSI has witnessed a positive crossover as the counter surpassed all its major EMAs on the daily chart construing a positive development.Hence we recommend buying Apollo Tyres around Rs 480470 with a stoploss of Rs 445 and a target at Rs 520540.Strategy  BuyTarget  Rs 520 540StopLoss  Rs 445Prince Pipes   Fittings   CMP  Rs 650.40Prince Pipes witnessed a decisive spurt in price volume in the last trading session soaring nearly 6 percent. The counter has witnessed very strong traction from the cluster of its shortterm moving averages and is now on the verge of a  Cup   Handle  pattern breakout after which strong momentum is likely to be seen in the counter. On the oscillator front the 14period RSI signals a continuation move suggesting a potential upside journey in a comparable period.Hence we recommend buying Prince Pipes around Rs 640 with a stoploss of Rs 580 and a target at Rs 740750.Strategy  BuyTarget  Rs 740 750StopLoss  Rs 580Wipro   CMP  Rs 484.55Wipro has seen a strong resurgence after the substantial consolidation seen in the last couple of trading weeks near its key support of 200 SMA. Furthermore the market has experienced a notable increase in buying activity with trading volumes surpassing all major EMAs indicating a strong bullish sentiment. As a result it is now positioned for a gradual reversal in the near future. On the oscillator front the 14period RSI and MACD both signal a reversal from the oversold terrain suggesting a potential upside journey in a comparable period.Hence we recommend buying Wipro around Rs 480470 with a stoploss of Rs 440 and a target at Rs 540550.Strategy  BuyTarget  Rs 540550StopLoss  Rs 440Nandish Shah Senior Technical Derivative Analyst at HDFC SecuritiesDeepak Fertilisers And Petrochemicals Corporation   CMP  Rs 579The shortterm trend of Deepak Fertilisers turned positive as it has closed above its 5 11 and 20day EMA. Accumulation has been seen in the stock during the last few weeks where volumes were higher on up days compared to down days. Momentum indicators and oscillators like MFI (Money Flow Index) and RSI are sloping upwards and placed above 60 on the weekly chart suggesting strength in the current bullish trend. The stock price is likely to show momentum once it surpasses the 200day EMA placed at Rs 581.Strategy  BuyTarget  Rs 625 655StopLoss  Rs 540Nuvoco Vistas Corporation   CMP  Rs 335After forming multiple bottoms around 310 odd levels Nuvoco Vistas stock price reversed northwards to close at a onemonth high. Accumulation has been seen during the last four days where the price rise is accompanied by rising volumes. The shortterm trend of the stock turned positive as it has closed above its important moving averages. Cement stocks have regained momentum and that is expected to continue.Strategy  BuyTarget  Rs 355 370StopLoss  Rs 310Rallis India   CMP  Rs 282Rallis India stock price has broken out on the daily chart from the downward sloping trendline with higher volumes to close at the highest level since April 22 2024. The primary trend of the stock is positive as it is placed above its important longterm moving averages. Momentum Indicators and Oscillators like MFI and RSI are in rising mode and placed above 60 levels suggesting strength in the current up move.Strategy  BuyTarget  Rs 299 310StopLoss  Rs 267",
    "Tata Steel has said it is premature to draw final conclusions following reports that the Dutch parliament approved providing an unspecified amount of subsidies to the company for the green transformation of its plant in the Netherlands.The proposed terms would require approval from both the Netherlands parliament and the Tata Steel board the company said in an exchange filing on June 6.Given the ongoing nature of the discussions and negotiations it was not in a position to comment further on the news reports circulating in the mainstream media the company said.Bloomberg has reported that the Netherlands may pay up to  3 billion for the green transformation of Tata Steel s IJmuiden factory to address health and environmental concerns in the surrounding area.On June 5 the Dutch parliament formally mandated the government to negotiate terms of potential support for decarbonisation efforts in Tata Steel Nederland the report said.Tata Steel said discussions with the Dutch government on decarbonisation had been ongoing since March.As part of the negotiations the Dutch government has formulated a detailed framework involving diligence analysis discussions and negotiations with Tata Steel. This process is expected to take several months before potentially culminating in an agreed set of terms the reports said.Tata Steel reaffirmed its commitment to complying with disclosure obligations and making accurate and timely disclosures as required by regulations.At 10.22 am the Tata Steel stock was trading at Rs173.35 on the National Stock Exchange up 2.45 percent from the previous close.        ",
    "The Netherlands may pay up to  3.26 billion for the green transformation of Tata Steel Ltd. s IJmuiden factory which has caused serious health and environmental problems in the surrounding area reported Bloomberg on June 5.On Wednesday the steelmaker s shares were trading 6.6 percent higher at Rs 169.45 apiece.On June 4 the Dutch parliament approved providing an unspecified amount of subsidies to the company to accelerate the renovation. External consultants estimate subsidies could reach  3.26 billion according to a spokesperson for the Dutch Ministry of Economic Affairs and Climate reported Bloomberg.People living close to Tata Steel s Dutch steelworks have a life expectancy that is 2.5 months lower than the average for the Netherlands due to the plant s emissions the Dutch National Institute for Public Health and the Environment said last year reported Reuters.The Institute said its research showed that exposure to particulate matter and nitrogen dioxide increases the risk of lung cancer and that 4  of the new cases in the area could be attributed to the emissions from the plant.The research also showed that 3  of new cases of asthma in children were due to the emissions.Negotiations with Tata Steel to reach an agreement on the funding have started but the process is confidential and the ministry can t comment on the financial size of the subsidy yet the ministry spokesperson said reported Bloomberg on June 5.Tata is  pleased with the broad support  from the Dutch parliament to make the steelworks more sustainable according to Tata Steel spokesman Peter van Boesschoten. Apart from the money we will put in our Green Steel plan ourselves we will need government support just like our competitors in Germany Belgium and France to establish a European level playing field as much as possible  Van Boesschoten said.        "
]