[
    "Net Sales at Rs 46269.00 crore in March 2024 down 1.48  from Rs. 46962.00 crore in March 2023.Quarterly Net Profit at Rs. 1299.00 crore in March 2024 down 64.55  from Rs. 3664.00 crore in March 2023.EBITDA stands at Rs. 6366.00 crore in March 2024 down 24.25  from Rs. 8404.00 crore in March 2023.JSW Steel EPS has decreased to Rs. 5.33 in March 2024 from Rs. 15.24 in March 2023.JSW Steel shares closed at 907.45 on May 17 2024 (NSE) and has given 19.11  returns over the last 6 months and 31.12  over the last 12 months.",
    "JSW Steel gained nearly 0.8 percent during early morning trade on the NSE despite its weak performance in Q4FY24 as reported on May 17. Despite a decline in both net profit and revenue for the quarter the stock was trading at Rs 893 at 10 am marking an approximate 29.1 percent increase over the past year.Follow our market blog for live updatesIn a regulatory filing JSW Steel disclosed a significant 64.5 percent yearonyear decrease in net profit to Rs 1299 crore for the quarter ended March 31 2024. This decline was attributed to higher coking coal prices and reduced realizations amidst a challenging domestic steel market. Revenue for Q4FY24 also witnessed a slight dip of 1.5 percent totaling Rs 46269 crore compared to Rs 46962 crore in the previous fiscal period.During the quarter consolidated crude steel production stood at 6.79 million tonnes while the company invested Rs 3503 crore in consolidated capital expenditures.Also read  JSW Steel s board approves raising up to Rs 7000 cr via NCDs equity or convertible sharesFurthermore JSW Steel s board approved a plan to raise funds up to Rs 7000 crore through nonconvertible debentures (NCDs) with warrants equity or convertible shares. The company s regulatory filing specified that the board endorsed the issuance of NCDs with warrants convertible into or exchangeable with equity shares of the Company with a face value of Rs 1 each at a later date.",
    "The board of JSW Steel has approved raising funds upto Rs 7000 crore  through nonconvertible debentures (NCDs) with warrants equity or convertible shares  amid expansion plans of the steelmaker to capture the booming domestic demand.The company s joint managing director and chief executive officer Jayant Acharya specified that it s an enabling resolution.  An enabling resolution is an  authorization made by a governing body such as a board of directors  that grants the authority to take specific actions or implement certain policies.Board has approved raising cash through the issuance of NCDs with warrants which are convertible into or exchangeable with equity shares of the Company of face value of  1 each  at a later date the company said in a regulatory filing on May 17.Board has also approved raising funds through equity Shares and or convertible Securities. In both cases the amount will not exceed Rs 7000 crore.Last week the board of JSW Energy approved raising funds upto Rs 10000 crore in one or more tranches as the power producer looks to snap up clean energy companies put up on sale in the market amid targets to achieve 20 Gigawatt (GW) capacity by 2030.Also read  JSW Steel Q4 results  Here are the key highlightsMeanwhile the company reported over 60 per cent decline in fourth quarter profit owing to higher expenses. JSW Steel s net profit (attributable to owners) plunged 64.5 percent to Rs 1299 crore in the quarter ended March 31 2024 as expenses rose even as other income declined. The steelmaker had reported a profit of Rs 3664 crore in the same quarter last year.        ",
    "JSW Steel said that its board has approved acquisition of Mozambiquebased mining company  Minas de Revuboe (MDR) as the steelmaker looks to benefit from MDR s  highquality coking coal crucial for steel production.The company through its subsidiary JSW Natural ResourcesLimited  will acquire  92.19  equity stake and shareholders loans ofMDR for  73.75 million.  The steelmaker said that the deal enables access to more than 800 metric tonnes of premium hard coking coal reserves in Mozambique according to an investor presentation from May 17.MDR owns a high quality and large scale predevelopment stage premium hard coking coal mine project in the Moatize Basin of Tete Province Mozambique the company added.The deal is subject to approval from Ministry of Mineral Resourcesand Energy Mozambique  and other applicable customary approvals.Earlier in the year JSW Steel flagged that it is exploring various options including acquisitions and strategic alliances to enhance its coking coal supply amid goals to increase its production capacity to 37 million tonnes per annum by FY25 and to 50 MTPA by 2030.ALSO READ  JSW Steel Q4 net profit plunges 65  to Rs 1299 crore amid higher expenses low other incomeReportedly the company is also in talks to acquire a 20 percent stake in the Blackwater coal mine owned by Australia s Whitehaven Coal in a deal valued between  750 million and  1 billion. Its previous attempt to acquire up to a 75 percent stake in Canada s Teck Resources  metallurgical coal business did not materialize.Indian steelmills are dependent on imports for coking coal and procures majority of the key ingredient from  Australia Russia the United States and Canada with Australia being one of the biggest suppliers. However the recent spike in prices of the steelmaking ingredient has raised production costs for steelmakers.        ",
    "JSW Steel s net profit (attributable to owners) plunged 64.5 percent to Rs 1299 crore in the quarter ended March 31 2024 as expenses rose even as other income declined. The steelmaker had reported a profit of Rs 3664 crore in the same quarter last year.Here are the key highlights from the fourth quarter and full year results of JSW Steel Q4 performance ",
    "JSW Steel s net profit (attributable to owners) plunged 64.5 percent to Rs 1299 crore in the quarter ended March 31 2024 hit by higher coking coal prices and lower realizations amid bleak domestic steel prices.  The steelmaker had reported a profit of Rs 3664 crore in the same quarter last year.Revenues for the quarter stood at Rs 46269 crore almost flat from Rs 46962 crore reported in the fourth quarter of 2023. The company recorded expenses of Rs 44401 crore in the quarter  up from Rs 43170 crore reported an year earlier according to a regulatory filing from May 17.Other income in the quarter dipped 18 per cent to Rs 451 crore.The company said that its expenses related to changes in inventories of finished and semifinished goods work in progress and stock in trade rose to Rs 534 crore up more than 200 per cent from Rs 165 crore. Exports at 1.32 million tonnes increased significantly QoQ as export opportunity was used to liquidate inventories given restocking demand in global markets. Exports constituted 20  of sales from the Indian operations  the company said in a press statement.On a standalone basis net profit for the March quarter was Rs 1007 crore marking a 64 percent decline yearonyear (YoY). Total revenue from operations fell 4.9 percent YoY in the quarter to Rs 35341 crore.Consolidated crude steel production in the quarter stood at  6.79 million tonnes. The company spent consolidated capex of  Rs 3503 crore in Q4FY24 and  Rs 16752 crores in FY24.Standalone steel sales for the quarter was 5.69 million tonnes for the quarter higher by 9  QoQ and flat YoY. Domestic sales were at 5.16 million tonnes down by 2  QoQ and by 5  YoY on elevated imports.        ",
    "The market failed to hold on to its record high due to selling pressure at higher levels and declined sharply on May 3 as a result of which the Nifty 50 closed last week with just 0.25 percent gains. In fact the index failed multiple times to surpass 22800 since April indicating the strong hurdle going ahead as surpassing and sustaining above the same can only open doors for the upper band of rising channel placed at around 2295023000 levels experts said.On the lower side 2235022300 is the immediate key support. If the index breaks the same support then 22200 is the level to watch. Further the increasing volatility also pointed towards an uncomfortable scenario for bulls as India VIX the fear gauge jumped 43 percent in the last seven sessions to the 14.62 levels.For the week the Nifty 50 was up 56 points at 22476 and formed a Doji candlestick pattern on the weekly charts with continuation of higher highs higher lows for yet another week while on the daily charts there was Bearish Engulfing candlestick pattern formation the bearish reversal pattern. For now the immediate swing low of the 2235022300 subzone is likely to provide a firm cushion for any intraweek blip followed by the 50 DEMA (days exponential moving average) of 22230 and the bullish gap around the 22200 zone  Osho Krishan senior analyst  technical   derivative research at Angel One said.On the higher end the recordhigh zone of 2275022800 seems daunting for the bulls and until the market witnesses a decisive breakthrough the next leg of rally toward the 23000 mark seems demanding he feels.Ashish Kyal Founder and CEO of Waves Strategy Advisors also feels it is not going to be easy for bulls to take Nifty back above 22800 immediately.  On the downside 22350 is immediate support. Any breach below 22350 will be a bearish sign.   collated a list of top 10 stock ideas from experts with a 34 weeks perspective. The closing price of May 3 is considered for calculation of stock price return Expert  Amol Athawale VPTechnical Research at Kotak SecuritiesContainer Corporation of India  Buy   LTP  Rs 1059   StopLoss  Rs 1020   Target  Rs 1140   Return  8 percentOn the daily scale after the robust up move the stock is trading in a sideways movement forming a Flag chart pattern. The stock is representing a bullish continuation chart structure which indicates that a new leg of up move is likely to resume from the current levels on the coming horizon.Jubilant Foodworks  Buy   LTP  Rs 463   StopLoss  Rs 444   Target  Rs 490   Return  6 percentPost decline from the higher levels the counter rebounded from its demand zone and witnessed a steady recovery from the lower levels. Additionally on the weekly charts the counter has given a breakout from its sloping channel formation. The up moves in the counter suggest a new leg of bullish trend from the current levels.BHEL  Buy   LTP  Rs 305   StopLoss  Rs 292   Target  Rs 330   Return  8 percentOn the daily and weekly charts the counter is into a rising channel chart formation with higher high and higher low series pattern. Additionally the technical indicator ADX (average directional index) is also indicating further up trend from current levels which could boost the bullish momentum in the near future.As long as the stock is trading above Rs 292 the uptrend formation is likely to continue. Above which the counter could move up to Rs 330.Expert  Riyank Arora Technical Analyst at Mehta EquitiesJSW Steel  Buy   LTP  Rs 874   StopLoss Rs 860   Target  Rs 925 and Rs 950   Return  9 percentThe stock witnessed an ascending triangle breakout on April 25 2024 on its daily timeframe charts. With the price pulling back and undergoing a retest of its trendline support level the overall riskreward ratio looks favourable at current levels.With the RSI (relative strength index) around 53.35 and ADX near 21.25 it is expected that the stock should pick up momentum in the upcoming trading sessions. A strict stoploss can be kept near the Rs 860 mark for potential upside targets of Rs 925 and Rs 950.Tata Consumer Products  Buy   LTP  Rs 1094   StopLoss  Rs 1070   Target  Rs 1180   Return  8 percentThe stock is consolidating well between its anchor VWAP (volumeweighted average price) resistance mark of Rs 1120 and support mark of Rs 1075. With the RSI near 40.66 and ADX near 22.95 showing a minor increase from lower levels of 15 it is expected that momentum should pick up strength and the stock should witness a breakout above the Rs 1120 mark.We can expect targets of Rs 1180 and Rs 1200 with a strict stoploss set at Rs 1070 mark.GMR Airports Infrastructure  Buy   LTP  85.60   StopLoss  Rs 83   Target  Rs 95   Return  11 percentThe stock has successfully touched its anchor VWAP support mark of Rs 85 on its daily time frame charts. With the RSI near 53.51 and ADX at 20.20 the overall momentum looks strong and the stock might head towards a target of Rs 95 and above.The stoploss should be kept at Rs 83 for all long positions to manage risk well. A strong technical structure with tight volatility contraction between AVWAP (anchored volume weighted average price) makes it a good candidate.Expert  Om Mehra Technical Analyst at Samco SecuritiesTorrent Pharma  Buy   LTP  Rs 2735   StopLoss  Rs 2600   Target  Rs 2950   Return  8 percentTorrent Pharma has experienced a period of solid consolidation culminating in a significant breakout above the critical resistance level of Rs 2700. The stock holds above its shortterm (20day) and mediumterm (50day) moving averages.The sharp rise in volumes with price indicates that bullish momentum is likely to persist. Further validating this upward momentum the RSI is holding above the 60 level.Hence based on the above technical structure one can initiate a long position at CMP Rs 2735 for a target price of Rs 2950. The stoploss can be kept at Rs 2600.Thermax  Buy   LTP  Rs 4767     StopLoss  Rs 4590   Target  Rs 5100   Return  7 percentThermax is forming higher highs and higher lows indicating a sustained uptrend. It is trading comfortably above its shortterm (20day) and mediumterm (50day) moving averages. The RSI is comfortably holding at 66 and is steadily rising.The stock is holding the Rs 4700 levels which previously served as minor resistance indicating buying interest among shortterm traders.Hence based on the above technical structure one can initiate a long position at CMP Rs 4767 for a target price of Rs 5100. The stoploss can be kept at Rs 4590.Expert  Nagaraj Shetti Senior Technical Analyst at HDFC SecuritiesWelspun Corp  Buy   LTP  Rs 601   StopLoss  Rs 555   Target  Rs 660   Return  10 percentThe stock price has bounced back decently after the downward correction in the previous week. Currently the stock price is in an attempt to break above the larger range movement of around the Rs 590600 levels. Hence a sustainable move above the Rs 600610 levels is likely to bring sharp upside momentum for the stock price ahead.Volume has started to expand during upside breakout in the stock price and weekly 14 period RSI shows positive indication. Hence one may expect further strengthening of upside momentum in the stock price ahead.Buying can be initiated in Welspun Corp at CMP (Rs 601) add more on dips down to Rs 575 wait for the upside target of Rs 660 in the next 35 weeks. Place a stoploss of Rs 555.UPL  Sell   LTP  Rs 494   StopLoss  Rs 525   Target  Rs 455   Return  8 percentThe stock price has been in an intermediate downtrend over the last many months. We observe a negative chart pattern like lower tops and bottoms over the period of time as per the weekly timeframe chart.The recent upside bounce in the stock price seems to have completed and the stock price is now ready to decline from the lower highs around Rs 510 levels. The daily and weekly RSI are showing negative indication there by reiterating our negative view for the stock price for coming weeks.One may look to sell UPL at CMP (Rs 494) add more on rise up to Rs 510 and wait for the downside target of Rs 455 in the next 35 weeks. Place a stoploss of Rs 525.",
    "The market made a smooth rebound in the week ended April 26 following 1.65 percent decline in the previous week. The mood remained in favour of bulls despite investors booking some profits last Friday forming a dark cloud cover pattern which is a bearish reversal trend as experts feel the index has been in an upward sloping channel since the middle of January and hence as long as it holds 2230022200 levels on a closing basis a march towards 22800 can t be ruled out.The Nifty 50 during the week rallied 1.23 percent to 22420 and formed a bullish candlestick pattern with long upper shadow and a small lower shadow on the weekly charts while major action was reflected in the broader markets as the Nifty Midcap 100 and Smallcap 100 indices jumped around 4 percent each. Despite Friday s setback the market mostly adopted a  buy on dip  strategy maintaining a bullish undertone  Rajesh Bhosale technical analyst at Angel One said.Going ahead he feels the immediate support is seen around Thursday s low of 22300 which coincides with 20day EMA (exponential moving average) followed by the pivotal support of the bullish gap around 22200.According to Jigar S Patel senior manager  equity research at Anand Rathi the Nifty is currently trading within a rising channel pattern suggesting potential bullish momentum if it manages to maintain levels above 22300 in the current week with a likely target range of 2275022800.Additionally he feels the longshort ratio of foreign institutional investors (FIIs) stands at around 39 percent indicating limited downside potential.Hence immediate resistance levels for the Nifty are anticipated at 2270022800 and a decisive close above this range could trigger renewed buying interest in index futures.Overall experts advised traders to monitor these levels and focus on buying on dips while booking profits at higher levels.  collated a list of top 10 stock ideas from experts with 34 weeks perspective. The closing price of April 26 is considered for the stock price calculation.Expert  Nandish Shah senior technical derivative research analyst at HDFC SecuritiesPower Mech Projects  Buy   LTP  Rs 5279   StopLoss  Rs 4900   Targets  Rs 5695 5900   Return  12 percentPrimary trend of the stock has been bullish with higher tops and higher bottoms on the weekly chart. Short term trend of the stock remains strong as stock price is trading above its 11 and 20day EMA (exponential moving average).Momentum indicators and oscillators like RSI (relative strength index) and MFI (money flow index) are in rising mode and placed above 60 on the weekly and monthly chart indicating strength in the current uptrend of the stock. Stock price is on the verge of breaking out from the symmetrical triangle on the daily chart.Ircon International  Buy   LTP  Rs 251   StopLoss  Rs 230   Targets  Rs 273 285   Return  14 percentThe stock price has broken out on the daily chart with higher volumes to close at threemonth high. Moreover it has broken out from the downward sloping trendline.Primary trend of the stock has been bullish with higher tops and higher bottoms on the weekly chart. Momentum indicators and oscillators are showing strength in the current uptrend of the stock.NLC India  Buy   LTP  Rs 250.55   StopLoss  Rs 235   Targets  Rs 268 281   Return  12 percentThe stock price has broken out on the daily chart from the consolidation of last many weeks where it closed at highest level since February 3 2024. Moreover it has broken out from the downward sloping trendline adjoining highs of February 5 and April 10 2024.The stock price has been taking support at 20week EMA. Momentum indicators and oscillators like MFI and RSI are sloping upwards and placed above 60 on the daily chart suggesting strength in the current bullish trend.Expert  Shrikant Chouhan head equity research at Kotak SecuritiesAurobindo Pharma  Buy   LTP  Rs 1131   StopLoss  Rs 1090   Target  Rs 1210   Return  7 percentPost decline from the higher levels the counter rebounded from its demand zone and witnessed a steady recovery from the lower levels. Additionally on the daily charts the counter has given a breakout from its sloping channel formation.The up moves in the counter suggest a new leg of bullish trend from the current levels.Colgate Palmolive  Buy   LTP  Rs 2855   StopLoss  Rs 2760   Target  Rs 3070   Return  7.5 percentThe counter had been in a strong uptrend in the past many months. Post remarkable up move the counter witnessed consolidation on higher levels.Additionally there is a fresh breakout from the ascending triangle chart formation on the daily scale. As a result the comfortable close above its breakout zone suggest upward momentum to persist in the coming horizon.PVR INOX  Buy   LTP  Rs 1403   StopLoss  Rs 1350   Target  Rs 1500   Return  7 percentThe counter is in the accumulation zone where it is trading in a rangebound mode for the past few sessions. The texture of the chart formation and technical indicator RSI is indicating that the counter is in oversold territory.Therefore it is very likely to rebound from current levels for a new leg of the up move in the near term.Expert  Riyank Arora technical analyst at Mehta EquitiesContainer Corporation of India  Buy   LTP  Rs 1068   StopLoss  Rs 1000   Target  Rs 1200   Return  12 percentThe stock has given a strong breakout above its alltime high mark of Rs 1027.65 on its daily charts and has successfully managed to close above the same.With the RSI (14) near 74 the overall momentum looks strong and with volumes nearly three times its average (30) days volume there is another positive indicator for the stock. A strict stoploss should be kept at Rs 1000 mark for potential upside targets of Rs 1200 and above.JSW Steel  Buy   LTP  Rs 887   StopLoss  Rs 860   Target  Rs 1000   Return  13 percentThe stock has seen a good retest of its breakout mark of Rs 883895 on its technical charts after breaking out above its resistance mark of Rs 895 in a Cup   Handle formation on the daily charts.With the RSI (14) around 60 momentum appears to be on the positive side for the stock. At present levels the riskreward ratio looks favourable for buying. A strict stoploss should be placed at Rs 860 to manage risk well and potential targets of Rs 1000 and above can be expected for JSW Steel.Expert  Om Mehra technical analyst at Samco SecuritiesDr Lal PathLabs  Buy   LTP  Rs 2388   StopLoss  Rs 2310   Target  Rs 2520   Return  5.5 percentDr Lal PathLabs stock is forming higher highs and higher lows indicating a sustained uptrend. It is trading comfortably above its shortterm (20day) and mediumterm (50day) moving averages.The RSI is comfortably holding at 62 and is steadily rising. The stock continues to hold levels above Rs 2330 which previously served as resistance indicating buying interest among shortterm traders.Hence based on the above technical structure one can initiate a long position at CMP Rs 2388 for a target price of Rs 2520. The stoploss can be kept at Rs 2310.CESC  Buy   LTP  Rs 143.50   StopLoss  Rs 135   Target  Rs 158   Return  10 percentThe CESC stock has been consolidating near its strong support zone in recent trading sessions. The stock is currently trading above all of its shortterm moving averages. Meanwhile the RSI remains at 65. There is minor resistance near the Rs 147 level  once this is overcome the stock might inch higher to set a new high.Hence based on the above technical structure one can initiate a long position at CMP Rs 143.50 for a target price of Rs 158. The stoploss can be kept at Rs 135.",
    "Prabhudas Lilladher has come out with its fourth quarter (JanuaryMarch  24) earnings estimates for the Metal   Mining sector. The brokerage house expects JSW Steel to report net profit at Rs. 45630 crore down 56.4  yearonyear (down 33.9  quarteronquarter).Net Sales are expected to decrease by 2.8 percent YoY (up 8.8 percent QoQ) to Rs. 45630 crore according to Prabhudas Lilladher.Earnings before interest tax depreciation and amortisation (EBITDA) are likely to fall by 22 percent YoY (down 13.7 percent QoQ) to Rs. 620 crore.",
    "JSW Steel on Monday posted a record output of 26.43 million tonnes of crude steel during financial year 202324 registering an onyear growth of 9 per cent.It had produced 24.14 million tonnes (MnT) crude steel on a consolidated basis in preceding financial year JSW Steel said in a statement.In the JanuaryMarch period of 2024 the consolidated output was at 6.79 MnT higher by 3 per cent over 6.58 MnT in the yearago quarter. JSW Steel has achieved its highestever annual consolidated crude steel production of 26.43 MnT with a growth of 9 per cent YoY. The production for Q4 FY24 stood at 6.79 MnT higher by 3 per cent YoY  it said.The company produced 25.55 MnT steel from its India operations up 8 per cent over 23.62 MnT in the last fiscal.The output in India rose 3 per cent to 6.54 MnT from 6.37 MnT in the same quarter last fiscal.In the US JSW Steel USA Ohio posted a 63 per cent rise in output to 0.87 tonnes from 0.53 tonne in FY23. The production in the last quarter was at 0.25 tonnes over 0.21 tonnes a rise of 19 per cent.The capacity utilisation at Indian operations level stood at 93 per cent for Q4 FY 24.JSW Steel further said  the merger of the Joint Venture Creixent Special Steels Limited along with its subsidiary JSW Ispat Special Products Limited (JISPL) with the company has become effective on 31 July 2023.  During FY24 JISPL produced 0.26 tonnes of steel as against 0.42 tonnes in FY23.JSW Steel is the flagship business of the diversified USD 23billion JSW Group.        ",
    "JSW Steel on Saturday announced commissioning of a hot strip mill at its integrated steel plant in Vijayanagar Karnataka. The company has also made first dispatch of steel products from the mill having an annual capacity of 5 million tonnes (MT) JSW Steel said in an exchange filing. The company has also made first dispatch of steel products from the mill having an annual capacity of 5 million tonnes (MT) JSW Steel said in an exchange filing. JSW Vijayanagar Metallics Ltd (JVML) a whollyowned subsidiary of the company today successfully commissioned its hot strip mill (HSM) at Vijayanagar plant with a capacity of 5 MTPA and has made its first dispatch  the company said.The HSM facility has the capability of manufacturing plates and coils and is equipped with advanced features such as digital reheating furnaces evaporative cooling system and waste heat recovery system among others. The HSM facility has the capability of manufacturing plates and coils and is equipped with advanced features such as digital reheating furnaces evaporative cooling system and waste heat recovery system among others.The facility was litup on March 17 2024 and after successful completion of trial runs and quality   delivery testing the commercial manufacturing and sales have commenced JSW Steel said.        ",
    "When it comes to the leastloved sectors by investors two wheeler figures pretty much high up on that list. So it would come as a surprise to most people that the top two consistent performers in the Nifty over the last one year have been Bajaj Auto and Hero Motocorp.Similarly few would have been willing to bet their money on Adani Ports after the pounding it look in January and February last year over the Hindenburg report. Here too the street is in for a surprise  Adani Ports figures at number three for consistency.Follow our market blog for live updatesTo test the consistency of performance of Nifty 50 stocks in FY24 we observed the monthly returns of Nifty 50 constituents and compared it with Nifty 50 returns.Nifty 50 has delivered positive returns in 8 of the 12 months since April 2024 and only on 4 instances it has generated negative returns. However there are at least 16 Nifty stocks that gave positive returns on more occasions reflecting better consistency in performance in FY24. And Adani Ports Hero MotoCorp and Bajaj Auto have given the maximum positive returns among the 16 contesters. Better consistency also indicates momentum in the underlying security.Bajaj Auto gave positive returns in 11 months of the past 12 months and outperformed the index in 10 out of 12 months.The company s newly launched Triumph has presence in Bangalore and Kerala and its market share has reached 20 percent in the category. It plans to grow its footprint beyond 100 cities covering 50 percent of the market  We expect Bajaj Auto to benefit from market share gains over the long term driven by the premiumization trend an opportunity in exports and a sizeable position in the scooter EV market  said Amber Shukla and Ankit Desai of Motilal Oswal.As of March 20 Bajaj Auto has 21 buy calls 12 hold calls and 12 sell calls.The other consistent Nifty 50 outperformer has been Hero MotoCorp. The shares of company have outperformed Nifty 50 in 10 out of 12 months indicating consistency.On the back of the resilient Indian economy Hero MotoCorp s  management expects to grow in double digits with new premium product launches rampup of the EV product portfolio introducing new Premia stores Vida Hubs and upgrading existing stores to Hero 2.0 said Axis Securities in a report. The brokerage firm further said that reduced inventory levels and higher enquiries from rural geographies with higher demand for 125  cc vehicles gives management the confidence to beat average industry growth in FY25.As of March 20 Hero MotoCorp has 26 buy calls eight hold calls and 10 sell calls.Adani Ports has given positive returns in 8 of the 12 months and outperformed the Nifty 50 in 8 of the 12 months. Adani Ports has one buy call and zero hold and sell calls.The lagging onesHDFC Bank JSW Steel and United Phosphorous underperformed Nifty 50 in the past 12 months on regular basis. All these three stocks gave positive returns in only 5 out of 12 months while United Phosphorous managed to outperform Nifty 50 only in 2 months while delivering lesser returns than Nifty in 10 out of 12 months reflecting lack of momentum and buying.As of March 20 HDFC Bank had 45 buy calls five hold calls and zero sell calls. JSW Steel had 12 buy calls nine hold calls and eight sell calls. United Phosphorous had 17 buy calls eight hold calls and seven sell calls.",
    "Leading Indian steel producers including JSW Steel Ltd and Tata Steel Ltd are expected to invest billions in a record capacity increase to benefit from rising domestic demand in one of the world s fastest growing economies.A spurt in economic activity and a revamp of broader infrastructure have drawn steel makers from around the world to India where demand is rising. In Europe and the United States it is falling.Analysts and company data showed major mills were planning to increase capacity by at least 22 million metric tons in the fiscal year beginning April 2024.Jindal Steel and Power is expected to add 6 million metric tons to existing capacity of around 9.6 million metric tons and Tata Steel said it was adding 5 million tons to its capacity of 21 million tons.JSW Steel India s largest steel maker has said in results reports it aims to increase capacity to 38.5 million tons by 2024 25 up from 27.5 million tons domestic capacity now.None of the companies has said how much it will be spending on capacity although analysts who said the expansion was unprecedented predicted it would be billions. We expect JSW Steel will spend  2 2.2 billion a year towards brownfield expansions scaling up its iron mining capacities in Odisha raw material efficiency projects and downstream projects  Hui Ting Sim an assistant vice president Moody s Ratings in Singapore said referring to the eastern Indian state.    Together with Japan s JFE Steel JSW Steel said in February it would invest 55 billion rupees ( 662.85 million) in an Indian joint venture to produce grainoriented electrical steel used in manufacturing transformers.Tata Steel meanwhile is expected to spend between  1.21 1.51 billion in 2024 25 Lakshmanan R head of South   Southeast Asia corporates at CreditSights in Singapore said.Anshuman Bharati an analyst at S P Global Ratings in Singapore meanwhile expected India s steel consumption would grow between 8  to 10  in 2024 25.During AprilJanuary India s steel consumption rose by 14.5  to a sixyear high of 112.5 million metric tons.        ",
    "",
    "JSW Steel has appointed  Robert Simon as the chief executive officer of the steelmaker s US unit.Simon will lead the overall business comprising slab coil pipe and plate production and sales at Baytown and Mingo Junction the company said in a statement on March 6. He will report to the respective boards of both the subsidiary companies of JSW Steel the company said.In the US JSW Steel has a 1.5 MNTPA (million tonnes per annum) electric arc furnacebased steelmaking capacity in Ohio and downstream product facilities including a 3MNTPA hotrolling mill in Ohio a 1.2 MNTPA plate mill and a 0.55 MNTPA pipe mill capacity in Baytown Texas.In Q3 the mill in Texas produced 97829 net tonnes of plates and 7219 net tonnes of  pipes reporting a capacity utilization of 40 percent and 5 percent respectively. Sales volume for the quarter stood at 86985 net tonnes of plates and 5532 net tonnes of pipes. It reported earnings before interest taxes depreciation and amortization (EBITDA) of  18.67 million.In 2022 Mark Bush stepped down from his role as Chief Executive Officer of JSW Steel USA to pursue other opportunities and Chief Operating Office  Greg Manfredi took charge on an interim basis.Prior to joining JSW USA Simon consulted with several companies including OmniTrax in Denver Colorado and also served as the chiefexecutive officer for the newly formed Bayou Steel Group according to the statement.        ",
    "Sajjan Jindalled JSW Steel has entered an agreement with the Italian government to revive its Piombino steel hub project with an investment of 143 million euros (Rs 1281.9 crore) the company said on March 1.JSW Steel s Italian unit signed a memorandum of understanding (MOU) with the authorities to relaunch the steelworks site of Piombino which includes conditions for efficient and sustainable state support for the production of rails. The company did not disclose details of the state support it will receive for the project. The Italian steel industry is undergoing a transformative stage. JSW Steel Italy s investments to modernise the Piombino Steelworks site reiterates our commitment to partner with the Italian government s effort in the growth and economic development of the region  Sajjan Jindal Chairman of JSW Group said.The MoU is also aimed at safeguarding employment and reducing the import of steel products into Italy. The investment will be used to double the current railmaking capacity to 600000 tonnes per annum from 300000 tonnes. JSW Steel Piombino is an iron and steel company which manufactures specialty steel used in railway automobile and earthmoving vehicles among others. The investments of Euro 143 million in modernising the rail mill at Piombino will make the Piombino Rail mill most modern technologically advanced and best inclass rail mill in Europe  said Sajjan Jindal.The project includes setting up of tandem mill head hardening facility and increasing the length of rails from 108 to 120 meters. The company said that the broader part of the project is to kickstart economic development of the region which also includes the restarting of the production of Steel Products to safeguard employment and reduce the import of steel products into Italy.The Acquisition  In 2018 JSW Steel Italy acquired a 100 percent stake in Aferpi SpA Piombino Logistics SpA and a 69.27 percent of equity in GSI Lucchini SpA for a cash consideration of 55 million euro. The acquisition was aimed to give the Indian steelmaker a presence in Italy with access to the European speciality steel long products market.Soon after its acquisition in 201920 the Italybased longrolled products manufacturing facility reported an EBITDA loss of 31.91 million euro (Rs 236 crore) from 17.37 million euro (Rs 161 crore) a year ago. Loss after tax for the year amounted to 49.1 million euros (Rs 364 crore) from 15.3 million euro (Rs 139 crore) in FY 201819 according to data from JSW Steel s annual report.The Italian business continued to languish and in FY 202122 it generated an EBITDA loss of 6.42 million euro (Rs 69 crore) compared to EBITDA loss of 22.65 million euro (Rs 191 crore) a year ago. Media reports suggested in 2022 that JSW Steel was mulling disinvesting the Italian operations partly with plans to retain the rail mill while selling other assets in that country.Why the decisionIn January this year JSW Steel Joint Managing Director Jayant Acharya said in a postearnings analyst call  Our Italian operations also reported robust performance aided by improved realizations and rail orders from both the Italian government as well as exports. In the OctoberDecember quarter of 2023 the Italian unit s rolled long products manufacturing facility produced 97933 tonnes and sold 73833 tonnes of rolled products. It reported an EBITDA profit of 18.6 million euro for the quarter.JSW s revival plan comes after its peer Tata Steel entered an agreement with the UK government in September 2023 to invest 1.25 billion pound in electric arc furnace steelmaking at the Port Talbot site. Earlier this year Tata Steel said it would be shutting down the two blast furnaces in its Port Talbot Steelworks in Wales which would impact 2800 jobs.        ",
    "Steel tycoon Sajjan Jindal plans to borrow  750 million for capital expenditure purposes as India s largest mill targets a major capacity expansion according to people familiar with the matter.JSW Steel Ltd part of the  23 billion JSW Group is sounding out lenders and a mandate is likely in the coming days the people said asking not to be identified as the information is private. The loan s tenor and pricing will be finalized later as the deal proceeds the people said.The Mumbaibased firm s need for cash has been growing as it aims to almost double its steel output to 50 million tons by the end of the decade to meet rising demand from construction energy and autos. Last week it started work on a  7.8 billion complex in eastern India and the company is also said to be in the fray for a 20  stake in Whitehaven Coal Ltd. s Blackwater coal mine.JSW Steel didn t respond to a query by Bloomberg News seeking comment on the fundraising plan.In January JSW s board approved raising 20 billion rupees ( 241 million) in funds through bonds. While its Decemberquarter profit quintupled from a year earlier analysts have become wary of rising debt at the company. Net debt grew nearly 14  to 792.21 billion rupees at the end of December from a year earlier though net debt to EBITDA fell to 2.64 times from 3.51 according to a filing.JSW is part of the O.P. Jindal family whose matriarch Savitri Jindal is Asia s wealthiest woman. While her wealth of  28.9 billion derives from the businesses of her four sons bulk of her fortune comes from JSW Group companies.        ",
    "Tata Steel JSW Steel JK Cement and Rungta Sons were among the 27 companies that have submitted their bids in the recent rounds of commercial mines auction the Ministry of Coal said on February 20.The bids were placed on December 20 2023 when the ninth round and the second attempt of the seventh round of commercial coal mines  auction was held.The online bids were decrypted and opened electronically in the presence of the bidders on February 20 the ministry said. Subsequently sealed envelopes containing offline bid documents were also opened in the presence of bidders it added. Under the ninth round a total of 27 coal mines were put up for auction and 33 bids were received against 13 coal mines. Under the second attempt of the seventh round a total of 5 coal mines were put up for auction and 7 bids received against 3 coal mines  an official release said.The maximum number of bids six were placed for the noncoking mine based in Dumri during the second round as per the list shared by the government. This was followed by five bids for Lamatola mine which is categorised as coking.Among the companies the maximum bids were placed by Rungta Sons at five followed by four bids each by JSW Steel and JK Cement and two each by Tata Steel and Sunflag Iron   Steel.The bids will be evaluated by a multidisciplinary technical evaluation committee and the technically qualified bidders will be shortlisted for participation in the electronic auction to be conducted on MSTC portal.        ",
    "Companies are increasingly using liquified petroleum gas (LPG) as a cleaner alternative to carbonintensive fossil fuels a top executive of Confidence Petroleum said in an interview. We are being approached by industries to evaluate infusing LPG in a bid to increase cleaner fuel adoption in a costeffective way  Confidence Petroleum business head for LPG Rajashree Telharkar told   in an interview.Telharkar added that steelmakers such as JSW Group have also reached out to the company.  We are drawing plans for their Anjar plant in Gujarat. The LPG tankers will be brought to the plant and stored in bullets already there in the plant s existing infrastructure. We will construct the pipeline through which the LPG will reach the burner  she said.Asked about the development JSW Steel which has a plate   coil mill in Anjar said  We are not using LPG in our reheating furnaces. Meanwhile in 2023 Tata Steel said that the company is in talks with staterun GAIL Ltd for liquified natural gas (LNG) supplies to replace a significant portion of diesel used at its mines to cut carbon emissions. The steelmaker is looking to replace 2530 percent of diesel used by its Heavy Earth Moving Machinery at its mines.Role of LPG in steel makingSo far the gas has been used for melting and refining processes in the production of iron and steel as it facilitates precise temperature control and enables the efficient melting of raw materials.The industry is looking to use LPG for smelting purposes according to Confidence Petroleum. Smelting is the process of applying heat and a chemicalreducing agent to an ore to extract a desired base metal product.Currently the steel industry relies on coke derived from coal to smelt iron ore to produce steel.        ",
    "JSW Steel is in discussions to acquire a 20 percent stake in the Blackwater coal mine owned by Australia s Whitehaven Coal in a deal valued between  750 million and  1 billion said sources familiar with the matter.The mine situated in Queensland s Bowen Basin is one of the largest opencut metallurgical coal producers in the region expected to yield an average of 14.8 million tonnes of saleable metallurgical coal annually over the next five years.JSW Steel has not confirmed the development.Whitehaven Coal had previously announced its intention to sell a 20 percent stake in the mine to global steelmakers aiming to bring them in as strategic joint venture partners.The company has set a midMarch deadline for the first round of bids with the name of the successful bidder to be announced on or after April 2. Other interested parties include Australiabased Indian company AvidSys Group as well as Japanese trading houses Itotchu Marubeni and Sojitz.Also bread  JSW Group to invest Rs 65000 crore in steel cement plants in OdishaJSW Steel has been actively seeking to acquire mines both domestically and internationally to secure its coking coal supply. A previous attempt to acquire up to a 75 percent stake in Canada s Teck Resources  metallurgical coal business did not materialize. The company is now exploring various options including acquisitions and strategic alliances to enhance its coking coal supply.JSW Steel is aiming to increase its production capacity to 37 million tonnes per annum by FY25 and to 50 MTPA by 2030 necessitating additional raw materials such as coking coal. The company s expansion plans include adding a total of 8.5 MTPA this year taking its total capacity to 36.7 MTPA from the current 28.2 MTPA. It currently operates 13 mines and has secured another seven iron ore and two coking coal mines through government auctions in 2023.        ",
    "JSW Steel Limited has announced a 50 50 joint venture (JV) with JFE Steel Corporation Japan to establish JSW JFE Electrical Steel Private Limited a company focused on producing grainoriented electrical steel in India. The manufacturing base will be in Karnataka s Bellary with a planned investment of Rs 5500 crore.A groundbreaking ceremony took place on February 12 and the production is slated to begin in fiscal year 2027 with plans for further capacity expansion to meet the growing demand for this steel type in India the steelmaker said in an exchange filing on February 13.The JV aims to address the rising domestic demand for such steel JSW said highlighting that grainoriented electrical steel is crucial for energyefficient transformers. This collaboration is a milestone development as it would be the first company to have endtoend manufacturing of grain oriented electrical steel products in India. The JV aspires to cater to the surging domestic demand for grain oriented electrical steel and contribute significantly to the country s energy infrastructure  said JSW Steel in a statement.Grainoriented electrical steel plays a pivotal role in the production of energyefficient transformers. Whether in laminated wound or punched sheet form it serves as the essential core material for distribution transformers power transformers and small transformers.The global grainoriented electrical steel market size is projected to grow from  12.47 billion in 2023 to  18.81 billion by 2030 according to a research report from Fortune Business Insights. This is due to rising demand for electrical steel from the automotive industry for application in electric vehicles (EV).Recently the JSW Group has signed a memorandum of understanding (MoU) with the government of Odisha for electric vehicle  and its battery manufacturing project at Cuttack and Paradip. The company will invest Rs 40000 crore for the mega manufacturing plants.The group plans to invest Rs 25000 crore in Cuttack for the electric vehicle and its battery manufacturing complex while the rest Rs 15000 crore will be invested in the EV components manufacturing facility in Paradip.         ",
    "Sharekhan s research report on JSW SteelQ3 consolidated operating profit of Rs. 7180 crore (down 9  qoq) was above our estimate led by robust performance of overseas subsidiaries which offsets marginal miss in standalone EBITDA margin. Standalone EBITDA margin of Rs. 11113 tonne (down 13  qoq) was 2  below our estimate due to a rise in coking coal and iron ore costs. Overseas subsidiaries posted 42  qoq rise in EBITDA led by lower losses at US Ohio and sharp EBITDA jump of 89  qoq for Italy operations supported by higher realisations. High coking coal and iron ore price is a concern for steel margin.OutlookThe company maintained FY24 consolidated steel sales volume guidance of 25 mt and plans to expand steel production capacity to 37 mt 50 mt by FY25E FY31E. We maintain our Reduce rating on JSW Steel with a revised PT of Rs. 738 given rich valuation of 7.5x 7x FY25E FY26E EV EBITDA and elevated debt.For all recommendations report click here",
    "Motilal Oswal s research report on JSW SteelJSTL posted consolidated revenue of INR419b (up 7  YoY) which was in line with our estimate of INR411b. ASP for 3QFY24 stood at INR69900 t (up 2  YoY) INR236 t higher than our estimate of INR69664 t. EBITDA stood at INR72b (up 58  YoY) 9  above our estimate of INR66b. EBITDA t stood at INR11967 t INR807 t higher than our estimate of INR11159 t. Record dispatches to OEM auto RE and packaging sector along with better operating performance from overseas subsidiaries supported the performance which was partially offset by lower exports and lower offtake during festive holidays and higher input costs. APAT stood at INR23b (up 366  YoY) 9  above our estimates of INR21b. During 3QFY24 JSTL recognized an unrealized gain of INR1.35b resulting from the dilution of interest in the company s JV. This gain was accounted for as  other income . Combined crude steel production stood at 6.9mt (up 12  YoY) and sales volumes came in at 6mt (up 5  YoY). The volumes were driven by higher capacity utilization and better demand scenario in the USA. Net debt in 3QFY24 increased INR100b to INR792b with a net debttoEBITDA ratio of 2.64x (up from 2.52x in 2QFY24) and D E ratio of 1.02x (up from 0.92x in 2QFY24). Revenue for 9MFY24 was up 8  YoY to INR1287b  EBITDA was up 108  YoY to INR221b and APAT stood at INR77b.OutlookJSTL is trading at 5.9x FY26E EV EBITDA and 2x FY26E P B. We reiterate our Neutral rating on the stock with a TP of INR910 (6.5x FY26E EV EBITDA). While we remain positive on the company s growth prospects we believe the current valuations reflect the strong outlook.For all recommendations report click here",
    "JSW Steel Joint Managing Director and Chief Executive Officer Jayant Acharya shares his expectations from the upcoming interim budget as told to Rachita Prasad Editor Energy and Infrastructure   in an exclusive interview on January 30.This is an interim budget. So we expect that the government will continue their focus on infrastructure spend and public capex which has stood us in good stead over the last two or three years. Our focus on manufacturing to encourage selfreliance in India has been very good. We look forward to the government focusing on that as well.The transition to renewable energy has been a big focus and that is also going on quite well. I am quite confident that these spaces will continue to be a focus area for the government in the years to come as well. From a budget perspective the only area where we need to be cautious is that imports into the country are increasing. Since we are a growing country we need to be conscious of that and be cautious that we do not allow unfair trade into India. And if such things happen then we need to take appropriate steps to control that.The biggest opportunity for the steel industry remains the growth in India  economic growth is our primary driver because a lot of steel consumption comes from the economic movement in India. That s a big opportunity for us. Our capacity expansions are focused on meeting the domestic demand. As far as the challenges for the industry go we would need to be focused more in terms of looking at the imports and seeing that they do not become a drag concerning our business. Other than that I don t think there is any immediate challenge which we see.JSW Steel Q3FY24 net profit surged fivefold yearonyear to Rs 2450 crore driven by strong India demand. Talking exclusively to   Joint MD   CEO Jayant Acharya shares his outlook on demand and prices and explains why the company has trimmed its FY24 capex to Rs 18000 crore from Rs 20000 crore planned earlier.        "
]