[
    "The Nifty last week managed to surpass the crucial resistance of the previous swing high placed at 18458. This has resulted into symmetrical triangle pattern breakout on the daily chart which indicates the continuation of a primary uptrend.The only logical resistance which is expected in the Nifty from here on is the alltime high placed at 18887 which also happens to be the 50 percent Fibonacci extension level of the entire swing seen from June 2022 bottom to December 2022 top and from December 2022 top to March 2023 bottom.Above 18887 the next resistance comes in at 61.8 percent Fibonacci extension placed at 19372 in Nifty. Shortterm support for the Nifty has shifted up to 18450 which happens to be the previous swing high on the shortterm chart. Far support is placed in the range of 1820018250.Breadth of the market is going very strong as a percentage of stocks above their respective 200 DMA have reached at 62. Strong breadth added the strength in the current uptrend of the market.Technical setup of world market indices is also very strong as MSCI World and ACWI Indices are on the verge of breaking out from long term horizontal trend line resistance on the weekly charts.Considering the technical evidence discussed above we believe that Nifty could extend its rally towards alltime high 18887 followed by 19372. Short term traders are advised to hold longs with a stoploss of 18450. Positional traders should keep 18200 stoploss in Nifty. Bank Nifty is expected to extend current rally towards 45000 in the coming weeks.Here are three buy calls for next 23 weeks Equitas Small Finance Bank  Buy   LTP  Rs 85.40   StopLoss  Rs 80.55   Target  Rs 96   Return  12.4 percentThe stock price has registered new alltime high with rise in volumes. Primary trend of the stock is bullish as it has been forming higher tops and higher bottoms on the weekly charts.The stock is placed above all important moving average indicating bullish trend on all time frames. Indicators and oscillators like MACD (moving average convergence divergence) and RSI (relative strength index) have turned bullish on its weekly charts. NBFC and Banking sector have been outperforming for last two months.Marico  Buy   LTP  Rs 544.15   StopLoss  Rs 500   Target  Rs 590   Return  8.5 percentPrimary trend of the stock has been bullish as it has been forming higher tops and higher bottoms on weekly charts. Stock price has been finding support on its 50day EMA.The stock has broken out from symmetrical triangle on the daily chart and registered new alltime high. Price rise is accompanied by jump in volumes. Indicators and oscillators have turned bullish on daily and weekly charts.Apollo Hospitals Enterprises  Buy   LTP  Rs 4640.45   StopLoss  Rs 4370   Targets  Rs 49405150   Return  11 percentTriple Bottom Formation was seen at Rs 4150 odd levels on the weekly charts. Stock price has been rising with rising volumes. Stock price has broken out from downward sloping trend line on the weekly charts.It is placed above all important moving averages indicating bullish trend on all time frame. Indicators and oscillators like MACD and RSI have turned bullish on its weekly charts.",
    "The Nifty made a fresh fivemonth high but gave up part of the intraday gains towards the end of the session on May 15. Bank Nifty and Nifty Financial indices closed at alltime highs on a weekly closing basis last week.The Nifty is in continuation of an uptrend as it has not even breached its nearest moving average support of fiveday EMA (exponential moving average) placed at 18310. From last six out of seven weeks the Nifty closed in the green. From the low of 16828 made on March 20 2023 the Nifty has seen a rise of almost 10 percent towards 18458. The Nifty Smallcap index has been rising for the last seven consecutive weeks and has registered a rally of more than 14 percent in this period.From the derivatives perspective there has been a significant Call writing happening at 18500 strike price in the weekly expiry which could offer a resistance in the Nifty for the short term. Short term support has shifted up near 18200 which can be kept as a stoploss in trading long positions of Nifty.Close below 18200 would confirm the shortterm bearish trend reversal. India VIX continued to remain near the historically lower band which indicates lower volatility and stable prices for the Nifty50 stocks.Considering the evidences discussed above we believe that Nifty should be held long with trailing stoploss of 18200. On the upside 18500 is strong resistance for Nifty sustaining above which rally could extend towards all time high of 18887.Here are three buy calls for next 23 weeks Mastek  Buy   LTP  Rs 1751   StopLoss  Rs 1600   Targets  Rs 18902000   Return  14 percentOn the week ended April 21 2023 the stock price broke out from consolidation with significant jump in volumes. On May 2 2022 the stock resumed its uptrend after running correction from recent swing high.It is placed above its 20 50 and 100day EMA. Indicators and oscillators like MACD (moving average convergence divergence) and RSI (relative strength index) have turned bullish on its weekly charts. IT sector has started its outperformance after long time.CCL Products  Buy   LTP  Rs 606.50   StopLoss  Rs 548   Target  Rs 680   Return  12 percentPrimary trend of the stock has been bullish as it has been forming higher tops and higher bottoms on weekly charts. Stock price has been finding support on its 50day EMA.The stock has broken out from symmetrical triangle on the daily chart and registered new all time high. Price rise is accompanied by jump in volumes. Indicators and oscillators have turned bullish on daily and weekly charts.Apollo Hospitals Enterprises  Buy   LTP  Rs 4626   StopLoss  Rs 4370   Targets  Rs 49405150   Return  11 percentTriple Bottom Formation is expected at Rs 4150 odd levels on the weekly charts. Stock price has been rising for last three weeks with rising volumes. Stock price has broken out from downward sloping trend line on the weekly charts.Stock is placed above all important moving averages indicating bullish trend on all time frame. Indicators and oscillators like MACD and RSI have turned bullish on its weekly charts.",
    "The benchmark Nifty50 at last reclaimed its psychological 18000 mark for the first time since December 2022 and delivered 2.5 percent gains for the week ended April 28. The weekly gains were highest since July 2022 as the buying was seen across sectors with leaders being realty technology and infra.The consistent uptrend in all five days of last week after forming a bottom around 17550 in the previous week raised confidence among market participants with the Nifty50 forming a long bullish candlestick pattern on the weekly scale with a higherhigh formation. Even momentum indicators showed a bullish bias on daily as well as weekly scales.The Nifty is expected to move towards the next hurdles at 1820018500 in the coming sessions where we can see some possibility of profittaking whereas the immediate supports are placed at 1790017800 and the critical support may be 17500 experts said. Things seem to be improving on the global fronts as well which certainly bodes well for the bulls. As far as Nifty is concerned it has certainly cemented its position at  200SMA  placed around 17600  17550. Before this 17900  17700 should now be treated as immediate supports  Sameet Chavan Head Research  Technical and Derivatives at Angel One said.On the flipside Sameet expects the Nifty to continue this northward trajectory to enter the next important cluster of 18200   18500 very soon.Rohan Patil Technical Analyst at SAMCO Securities feels the major hurdle for bulls will be faced near 18200 levels. If the index breaks above the said levels then we will be witnessing a continuation of higher high formation.Hence Sameet Chavan advised traders to remain upbeat and should use declines (if any) to add bullish bets in the coming week.Sectorally banking and auto counters were the initial contributors  but now other heavyweight pockets like Capital Goods and IT (to some extent) have started participating in this journey. It s also important to highlight how the broader end of the spectrum (cash segment midcaps) has found its mojo back. It s advisable to keep focusing on such potential movers  Sameet said.Let s take a look at the top 10 trading ideas by experts for the next threefour weeks. Returns are based on the April 28 closing prices Expert  Shrikant Chouhan Head of Equity Research (Retail) at Kotak SecuritiesChennai Petroleum Corporation  Buy   LTP  Rs 303.75   StopLoss  Rs 275   Target  Rs 370   Return  22 percentThe stock is under the formation of a rounding bottom which is suggesting a bullish consolidation and may lift the stock towards Rs 370 or Rs 400 in the medium term.After the announcement of the quarterly numbers the stock suddenly jumped up to Rs 318 with an excellent volume which was registered in the month of June 2022 when the stock stood at Rs 418.Based on the overall formation traders should be buyers at current levels and more on declines near Rs 290 with a stoploss at Rs 275.Power Finance Corporation  Buy   LTP  Rs 170   StopLoss  Rs 155   Target  Rs 195   Return  15 percentOn a monthly basis the stock is on the verge of an upside breakout which is at Rs 175. On the break of the same the stock can quickly move to Rs 195. Before the breakout the stock consolidated between Rs 170 and Rs 155 levels.Technically such a formation leads to a breakout in price and volume. Positional traders should be buyers at current levels and more on dips near Rs 160 with a stoploss at Rs 155.India Cements  Buy   LTP  Rs 185.55   StopLoss  Rs 165   Target  Rs 230   Return  24 percentIn September 2022 the stock started correcting to a spectacular rally from a high of Rs 299 which started from a low of Rs 145. It was about to end at Rs 200 however it registered an extended correction which pulled the stock up to 1.618 percent of the previous move.After hitting the same we saw a bullish recovery up to the Rs 195 level. Currently it is at Rs 186 and once the stock break Rs 195 we can see a trending move for the stock. Above 195 it has the scope to move towards Rs 230 with minor resistance near Rs 210. One can buy at current levels and buy more on dips to Rs 170 with a stoploss at Rs 165.Expert  Nandish Shah Senior Derivative and Technical Analyst at HDFC SecuritiesLa Opala RG  Buy   LTP  Rs 384   StopLoss  Rs 358   Targets  Rs 412430   Return  12 percentThe stock price has broken out on the daily chart with higher volumes to close at highest level since January 18 2023. It has broken out from the downward sloping trendline adjoining the highs of December 9 2022 and April 11 2023.RSI (relative strength index) and MFI (money flow index) oscillator is placed above 60 and rising upwards on the daily chart indicating strength in the current uptrend.Plus DI (directional indicator) is trading above minus DI while ADX (average directional index) line is placed above 25 Indicating momentum in the current uptrend.MSTC  Buy   LTP  Rs 303   StopLoss  Rs 275   Target  Rs 336348   Return  15 percentthe stock price has broken out on the daily chart from the downward sloping trendline adjoining the highs of November 30 2022 and February 1 2023.Price up move is accompanied by the surge in volumes indicating strong uptrend. Primary and intermediate trend turned positive as stock price has closed above its 50 100 and 200day EMA.Momentum oscillators  RSI (11) and MFI (10) is sloping upwards and placed above 60 on the daily chart indicating strength in the stock.Vidhi Specialty Food Ingredients  Buy   LTP  Rs 381   StopLoss  Rs 350   Target  Rs 420440   Return  15 percentThe stock price has broken out on the monthly chart from the long consolidation which held for last twelve months with higher volumes. On the weekly chart it has broken out from the downward sloping trendline adjoining the highs of April 8 2022 and September 16 2022.Stock price has formed strong base around Rs 320 levels. Momentum Indicators and Oscillators are showing strength in the stock.Expert  Mitesh Karwa Research Analyst at Bonanza PortfolioPFC  Buy   LTP  Rs 170   StopLoss  Rs 163.7   Target  Rs 182   Return  7 percentThe Stock has given a breakout of a  Cup   Handle Pattern  on a fourhourly chart. Importantly the price movement is backed by good volumes. The super trend is also indicating a bullish move on the four hourly charts which can be used as a confluence toward the bullish view.The price is trading above conversion   baseline which is now acting as support for the stock. The momentum indicator RSI (14) has also sustained above 60 which adds more strength on the upside.So based on the abovementioned technical structure one can initiate a long position in PFC at CMP Rs 169.90 or a fall in the price till Rs 168 level can be used as a buying opportunity for the upside target of Rs 182. However the bullish view will be negated if PFC closes below the support level of Rs 163.70.Hindustan Petroleum Corporation  Buy   LTP  Rs 251   StopLoss  Rs 239   Target  Rs 274   Return  9 percentThe price has been consolidating just above the high volume zone and formed an Inverted Head   shoulder pattern indicating bullish strength. The price has formed Bullish Engulfing candlestick pattern on the weekly chart. Recently the price has reversed from the lower Bollinger Band and shifted just below the upper band of Bollinger which adds more strength to the price.In addition the price is trading above the cloud which indicates bullish trend. The indicator Stochastic RSI suggested also a positive crossover confirming a long position.Observation of the above factors indicates that a bullish move is possible in HPCL for targets up to Rs 274. One can initiate a long position near Rs 251 with a stoploss below Rs 239 on a daily closing basis.Dabur India  Buy   LTP  Rs 532.90   StopLoss  Rs 513.9   Target  Rs 568   Return  7 percentOn a weekly chart the price has been rising continuously with Higher Highs and Higher Lows formation. Prices have respected the Rising trend tine every time it has touched.Recently the counter has reversed from the lower Bollinger Band with Bullish Pin bar candlesticks indicating bullish strength. At the same time the accumulation distribution indicator is also supportive to the next bullish rally.Hence based on the above technical structure one can initiate a long position in Dabur at CMP Rs 532.90 or a fall in the price till Rs 527 levels can be used as buying opportunity for the upside target of Rs 568.However the bullish view will be negated if Dabur closes below the support level of Rs 513.90.Expert  Ruchit Jain Lead Research at 5paisa.comApollo Hospitals Enterprises  Buy   LTP  Rs 4514   StopLoss  Rs 4420   Target  Rs 4660   Return  3 percentThis stock went through a corrective phase from in last four months. Post some consolidation the prices have now given a breakout from a falling trendline resistance.On the daily chart the stock has started forming a  Higher Top Higher Bottom  structure and the RSI oscillator is indicating a positive momentum. Hence traders can buy this stock around current market price of Rs 4510 for potential targets of Rs 4600 and Rs 4660. The stoploss for long positions should be placed below Rs 4420.REC  Buy   LTP  Rs 132   StopLoss  Rs 125   Target  Rs 146   Return  11 percentThe stock has given a breakout from its previous swing high resistance and has resumed its uptrend. The volumes on breakout in Friday s session were high and the RSI oscillator is indicating a positive momentum.Short term traders can look to buy the stock at current price of Rs 132 and add on dips around Rs 129 for potential targets around Rs 140 and Rs 146. The stoploss for long positions should be placed below Rs 125.",
    "After a rout in the previous week the market rebounded with more than half a percent gains for week ended March 3 driven by Friday s smart rally of 1.5 percent. The Nifty50 has formed a decent bullish candlestick pattern with long lower shadow on the weekly scale indicating supportbased buying at lower levels. Formation of such pattern after the sharp weakness of previous week signal chances of upside bounce for the market ahead  Nagaraj Shetti Technical Research Analyst at HDFC Securities said.The index jumped 129 points to 17594 for the week tad above 200day EMA (exponential moving average  Rs 17582).In the coming sessions 1770017800 levels (5 and 21 EMA  exponential moving average on weekly scale) are expected to be next resistance area for the index and if the said levels get passed then psychological 18000 mark which coincides with 20day SMA (simple moving average) is likely to be crucial hurdle with the support at 1740017255 area experts said.The broader markets outperformed frontline indices on positive breadth as the Nifty Midcap 100 index jumped 2 percent and Smallcap 100 index climbed 1 percent during the week. 17500 is now likely to be seen as the immediate support zone while the sacrosanct support lies around the 1735017400 zone coinciding with the 200 SMA. On the flip side the bearish gap of 1777017800 is expected to act as the sturdy hurdle for Nifty in a comparable period  Sameet Chavan Chief AnalystTechnical and Derivatives at Angel One said.Going forward he advised the traders to utilize the dips to add long position in the index.Simultaneously one should also keep a close tab on the midcap space which is expected to provide immense trading opportunities in the near period he said.Let s take a look at the top 10 trading ideas by experts for the next threefour weeks. Returns are based on the January 13 closing prices Expert  Shrikant Chouhan Head of Equities Research (Retail) at Kotak SecuritiesApollo Hospitals  Buy   LTP  Rs 4408   StopLoss  Rs 4300   Target  Rs 4550   Return  3 percentThe stock is in the process of forming a higher bottom between Rs 43504375. The stock witnessed a strong surge after the announcement of the Q3 results. It was at Rs 4170 and it rallied to Rs 4670.Such type of formation offers an opportunity to buy with the stock with a short term view as reward to risk is favourable for bulls. Buy at current levels and keep a stoploss at Rs 4300. On the higher side the stock could bounce to Rs 4500 or Rs 4550 in the near term.Federal Bank  Buy   LTP  Rs 134   StopLoss  Rs 129   Target  Rs 150   Return  12 percentThe stock is relatively strong compared to other bank stocks. It is only seven percent below the immediate highs and alltime highs it made at Rs 143.On a daily chart basis it is making a higher bottom at Rs 124 as compared to Rs 120 which it made in the month of December 2022. A buy is recommended at current levels for a target of Rs 143 and Rs 150. For this keep a stoploss at Rs 129.Mukand  Buy   LTP  Rs 135.5   StopLoss  Rs 127   Target  Rs 165   Return  22 percentIt has been forming a Double Bottom for the past few days. However on last Friday it validated a formation by crossing Rs 136 level.Technically the stock should move towards Rs 150 level in the coming days. On the longterm chart also it has developed a rounding bottom formation which may lift the stock towards Rs 165 in the coming few weeks. Buy at current levels and place stoploss at Rs 127.Expert  Vinay Rajani Senior Technical   Derivative Analyst at HDFC SecuritiesUCO Bank  Buy   LTP  Rs 28.05   StopLoss  Rs 24.70   Target  Rs 32   Return  14 percentStock price has broken out from downward sloping trend line on the daily chart. Primary trend of the stock has been bullish as it has been holding above its 200 DMA (day moving average or simple moving average) since long.The stock price has reclaimed its level above 50day EMA (exponential moving average). PSU Bank index has started outperforming after healthy correction from recent peak. Indicators and oscillators have turned bullish on the daily charts.RITES  Buy   LTP  Rs 350.6   StopLoss  Rs 311   Target  Rs 400   Return  14 percentThe stock price has broken out from downward sloping trend line on the daily chart. Price Breakout is accompanied by jump in volumes. Higher tops and higher bottoms on the daily chart.Indicators and oscillators like MACD (moving average convergence divergence) and RSI (relative strength index) have turned bullish on the daily chart.Railway sector has resumed its outperformance. Stock price is places above important long term moving averages.Varun Beverages  Buy   LTP  Rs 1358   StopLoss  Rs 1280   Target  Rs 1428   Return  5 percentThe stock price has been forming higher tops and higher bottoms on the daily chart. Stock price has surpassed crucial resistance of Rs 1350 with rising volumes.The stock is trading above all important moving averages which indicates bullish trend on all time frames. Indicators and oscillators have been showing strength on the daily and weekly charts.Expert  Ruchit Jain Lead Research at 5paisa.comTrent  Buy   LTP  Rs 1305   StopLoss  Rs 1240   Target  Rs 1430   Return  10 percentPost a corrective phase the stock had recently seen an upmove from Rs 1155 to Rs 1378 which was a five wave impulsive move. Technically this indicates a short term uptrend and the prices have also retraced this recent upmove by 50 percent.The volumes during the upmove were high while those on correction were low. Looking at the correct chart structure we expect the stock to resume its upmove and hence we advise traders to look for buying opportunities for the near term.Hence traders can buy the stock in the range of Rs 13101300 for potential short term targets of Rs 1375 and Rs 1430. The stoploss on long positions should be placed below Rs 1240.L T Finance Holdings  Buy   LTP  Rs 91.35   StopLoss  Rs 86.5   Target  Rs 100   Return  9.5 percentThe stock has recently seen a consolidation phase which just seems to be a timewise correction within an uptrend. Prices have managed to form support around its  89 DEMA  and seem to be gearing up for the next leg of upmove.The RSI (relative strength index) oscillator has given a positive crossover and is in  buy mode . Hence we expect the stock to rally towards the higher end of the pattern first and if it gives a breakout above the same then it would witness a decent upmove.Traders are advised to buy the stock around current market price of Rs 91 for potential near term targets of Rs 95 and Rs 100. The stoploss for long positions should be placed below Rs 86.50.Expert  Jatin Gohil Technical and Derivative Research Analyst at Reliance SecuritiesCrompton Greaves Consumer Electricals  Buy   LTP  Rs 311   StopLoss  Rs 290   Target  Rs 370   Return  19 percentAfter a higher level of reversal (43 percent fall from its lifetimehigh of Rs 513) the stock formed a base around its prior point of polarity and poised for a rebound. This could lead the stock towards its highest level of December 2022.The key technical indicators are in favour of the bulls on shortterm timeframe chart. In case of any decline the stock will find support around its recent swing low.United Spirits  Buy   LTP  Rs 756   StopLoss  Rs 710   Target  Rs 870   Return  15 percentIn the last week the stock breached its prior falling trend and reported rise of 1.7 percent. The stock found multiple supports around Rs 730 where its prior point of polarity extended falling trend line and intermediate upper band of the channel are placed.Major technical indicators witnessed a bullish divergence on shortterm timeframe chart. The stock has potential to test its January 2023 breakdown line.On the lower side the stock may take support around the lowest level of June 2022.SRF  Buy   LTP  Rs 2272   StopLoss  Rs 2140   Target  Rs 2470   Return  9 percentThe stock retested its upper band of the falling channel after a breakout and resumed its upmove. This could take the stock towards Rs 2400 initially and Rs 2470 subsequently.The key technical indicators are in buy mode on mediumterm as well as shortterm timeframe charts. In case of any decline the stock may find support around its recent swing low.",
    "Net Sales at Rs 4263.58 crore in December 2022 up 17.17  from Rs. 3638.93 crore in December 2021.Quarterly Net Profit at Rs. 153.46 crore in December 2022 down 32.8  from Rs. 228.37 crore in December 2021.EBITDA stands at Rs. 540.71 crore in December 2022 down 10.5  from Rs. 604.17 crore in December 2021.Apollo Hospital EPS has decreased to Rs. 10.67 in December 2022 from Rs. 15.88 in December 2021.Apollo Hospital shares closed at 4643.15 on February 16 2023 (NSE) and has given 6.75  returns over the last 6 months and 1.27  over the last 12 months.",
    "",
    "Shares of Apollo Hospitals Enterprise went down in early trade on February 14 as investors exercised caution ahead of the company s Q3 earnings due later today.At 10.14am the stock was quoting at Rs 4306.65 apiece on the NSE down 1.19 percent.Revenue for the healthcare major is likely to grow in midteens on a yearonyear basis to Rs 4177.50 crore according to a poll of brokerages conducted by  . In the same period a year ago the company had posted a net profit of Rs 228.4 crore on a topline of Rs 3638.9 crore.Better revenue mix normalisation of medical tourism and rise in pharmacy sales are some factors aiding the topline for Apollo Hospitals.Meanwhile high operational expenditure and weak margins are expected to be a drag on the company s bottomline Kotak Institutional Equities wrote in a report. Likewise the poll of brokerages forecasts net profit for the quarter to witness subdued growth at Rs 229.7 crore up merely 1 percent on year. Despite a rise in revenue the company s EBIDTA margin is expected to decline onyear due to higher spend on Apollo 24x7  brokerage firm ICICI Securities wrote in a report.A poll of brokerages conducted by   pegged the company s EBIDTA margin for the quarter at 13.1 percent a contraction of 300 basis points on a yearonyear basis. EBIDTA margin was at 16.1 percent in the corresponding quarter last year.        ",
    "Kunal Shah Senior Technical   Derivative Analyst at LKP SecuritiesThe bears continued to hold their grip and the Nifty50 index saw selling pressure around the resistance zone of 1830018350.The options data indicates a hurdle at 18300 where the highest open interest was built up a day before the monthly expiry.The index lowerend support is visible at 1820018150 which will act as a cushion for the bulls. The bulls need to cross the level of 18350 decisively to continue the momentum on the upside towards the 18500 level.The Bank Nifty index continued its outperformance and the index managed to hold the critical support zone 4250042400. The index on the upside faces a hurdle at 43000 where the highest open interest was built up on the Call side.The banking index remains in a buyondip mode as long as the mentioned support levels are held. The momentum oscillators are in the buy zone which will confirm the strength of the index.Here are three buy calls for next 23 weeks Fertilisers and Chemicals Travancore  Buy   LTP  Rs 142   StopLoss  Rs 133   Target  Rs 148153   Return  8 percentThe stock on the daily chart has given a strong breakout from large consolidation range with volumes. Its momentum oscillators are in the strong buying zone which confirms the strength of the stock.The momentum is likely to continue post the breakout which will help the stock climb towards the levels of Rs 148153 on the upside. The lower end support zone of Rs 135133 will act as cushion for the bulls.Apollo Hospitals Enterprises  Buy   LTP  Rs 4605   StopLoss  Rs 4400   Target  Rs 48004900   Return  6 percentApollo Hospitals on the daily chart has given a strong breakout from a sideways trend with rising volumes. The F O data too suggested fresh long builtup positions with the rise in open interests and price.The momentum indicator RSI has also given a positive crossover on the daily chart confirming the buy signal. The lowerend support is at Rs 4400 levels which will act cushion for the bulls and the upside visible targets are Rs 48004900.Aditya Birla Capital  Buy   LTP  Rs 129   StopLoss  Rs 123   Target  Rs 135140   Return  8.5 percentThe stock after a recent breakout has retested the support zone and resumed the up move with increase in volumes. The momentum oscillator RSI has also given a positive crossover on the daily chart confirming the buy signal.The stock has witnessed short covering in the November series and fresh long have been added in the December series which indicates rollovers in the upcoming month.",
    "Net Sales at Rs 1715.58 crore in September 2022 down 39.23  from Rs. 2823.20 crore in September 2021.Quarterly Net Profit at Rs. 279.19 crore in September 2022 up 50.19  from Rs. 185.89 crore in September 2021.EBITDA stands at Rs. 495.98 crore in September 2022 up 10.92  from Rs. 447.15 crore in September 2021.Apollo Hospital EPS has increased to Rs. 19.42 in September 2022 from Rs. 12.93 in September 2021.Apollo Hospital shares closed at 4285.45 on November 10 2022 (NSE) and has given 16.23  returns over the last 6 months and 5.87  over the last 12 months.",
    "Net Sales at Rs 4251.07 crore in September 2022 up 14.37  from Rs. 3717.07 crore in September 2021.Quarterly Net Profit at Rs. 203.99 crore in September 2022 down 17.69  from Rs. 247.82 crore in September 2021.EBITDA stands at Rs. 587.94 crore in September 2022 down 5.27  from Rs. 620.62 crore in September 2021.Apollo Hospital EPS has decreased to Rs. 14.19 in September 2022 from Rs. 17.24 in September 2021.Apollo Hospital shares closed at 4285.45 on November 10 2022 (NSE) and has given 16.23  returns over the last 6 months and 5.87  over the last 12 months.",
    "Nifty opened gapdown and closed in the red amid volatility and sideways momentum in global markets on September 21. On the daily chart the Nifty has formed a Doji after taking resistance from the 17800 levels. On the hourly timeframe the Nifty was seen to be trading in a range of 17500 and 17800 and till it breaks the range on either side with confirmation it is expected to remain sideways and it would be interesting to see how it performs.The momentum oscillator RSI (relative strength index  14) on the daily chart is at around 53  whereas the MACD (moving average convergence and divergence) is moving towards the centre point from higher levels.India VIX has increased from 18.79 to 19.32 levels above its 200 EMA (exponential moving average). Maximum pain of Nifty is at 17750. Nifty PutCall ratio (PCR) is at 0.75 whereas Bank Nifty PCR is at 0.84.Important support levels for the Nifty are at 17500 17400 and 17350 whereas resistance levels are at 17650 17750 and 18000. As per the F O data the short buildup has substantially increased in ITM (inthemoney) calls whereas long unwinding is seen in OTM (outofthemoney) puts which indicates a negative market. 18100 and 18000 have high short builtup whereas 17700 and 17500 have high long builtup.Here is one sell call and one buy call for next 23 weeks Amara Raja Batteries  Sell October Future   LTP  Rs 512.45   StopLoss  Rs 527   Target  Rs 494   Return  3.6 percentOn a weekly chart the stock has witnessed sharp up move and price has made a high of Rs 1025.50 in mid of January 2021 and then stock traded in a lower highs and lower lows formation till date.The price of Amara Raja Batteries has been falling continuously in a well channelized manner from last couple of week. Every time it has touched the prices have respected the bearish channel s upper and lower band. In addition the price has also reversed from upper Bollinger Band with Bearish Engulfing candlesticks which indicates a bearish setup in the counter.Moreover a momentum indicator RSI (14) reading is below 50 levels   which suggest bearish move for the midterm.Hence based on above technical structure one can initiate a short position in Amara Raja October futures at Rs 512.45 or a rise in the price till Rs 519.50 levels can be used as selling opportunity for the downside target of Rs 494. However the bearish view will be negated if the price closes above the resistance level of Rs 527.Apollo Hospitals Enterprises  Buy   LTP  Rs 4604.8   StopLoss  Rs 4488   Target  Rs 4850   Return  5.3 percentOn a daily chart the stock is trading in bullish territory after the breakout of the Falling channel and again reclaim the upper band of the pattern which indicates upward direction in the stock for the short to medium term.On the weekly scale it has formed Bullish Engulfing candlestick which point out positive trend in midterm. In addition the price is trading above 100 days exponential moving average which indicates positive trend.Moreover the technical indicator Ichimoku Cloud suggests that the price is trading above the cloud which shows positive trend in the counter. A momentum indicator RSI (14) reading is above 60 levels which add more strength on the upside.Hence based on above technical structure one can initiate a long position in stock at Rs 4604.80 or a fall in the price till Rs 4590 levels can be used as buying opportunity for the upside target of Rs 4850.However the bullish view will be negated if the price closes below the support level of 4488.",
    "Net Sales at Rs 3795.60 crore in June 2022 up 0.94  from Rs. 3760.21 crore in June 2021.Quarterly Net Profit at Rs. 317.11 crore in June 2022 down 35.19  from Rs. 489.28 crore in June 2021.EBITDA stands at Rs. 506.80 crore in June 2022 down 6.93  from Rs. 544.51 crore in June 2021.Apollo Hospital EPS has decreased to Rs. 22.05 in June 2022 from Rs. 34.03 in June 2021.Apollo Hospital shares closed at 4429.65 on August 11 2022 (NSE) and has given 1.89  returns over the last 6 months and 10.02  over the last 12 months.",
    "Net Sales at Rs 1529.69 crore in June 2022 down 48.92  from Rs. 2994.71 crore in June 2021.Quarterly Net Profit at Rs. 333.14 crore in June 2022 up 122.03  from Rs. 150.04 crore in June 2021.EBITDA stands at Rs. 398.86 crore in June 2022 down 0.12  from Rs. 399.33 crore in June 2021.Apollo Hospital EPS has increased to Rs. 23.17 in June 2022 from Rs. 10.44 in June 2021.Apollo Hospital shares closed at 4429.65 on August 11 2022 (NSE) and has given 1.89  returns over the last 6 months and 10.02  over the last 12 months.",
    "The Indian equity market reversed all its previous week s gains and closed with more than 2 percent loss following nervousness in global peers. Inflation worries remained at the fore after the Reserve Bank of India raised its inflation forecast for FY23 by 100 bps to 6.7 percent and US inflation reading came in at 40year high of 8.6 percent in the week ended June 3.Consistent FII selling growth worries imposition of some more Covid restrictions by China and oil hovering above  120 a barrel also dented the market sentiment. The market has fallen for the first time on weekly basis in the last four weeks.The Nifty50 has broken not only the 16400 level but also 16250 levels during the last week hence holding of 16200 is expected to be crucial in the current week (which is important as FOMC meet and CPI inflation lined up this week) as breaking of which can take the index down to around 16000 mark experts said adding the volatility has not moved significantly on higher side despite sharp fall on last Friday so the possibility of holding 1620016000 levels is likely to be high. The market is unable to show any kind of strength at higher levels but we are still not getting convinced with the weakness. We would rather reassess the situation in the first half of the forthcoming week and all eyes on crucial levels like 16000 on the lower side and 16400 on the upside  Sameet Chavan Chief AnalystTechnical and Derivatives at Angel One said.The pragmatic strategy would be to stay light on positions the market expert advised suggesting to be stock specific as  we see a lot of whipsaws  on either side.  In fact it has become a nightmare in trading stocks in the last couple of weeks  said Chavan who still hopes to see some recovery in coming days.Here are the top 10 trading ideas by experts for the next threefour weeks. Returns are based on the May 13 closing prices Vaishali Parekh VP Technical Research at Prabhudas LilladherTVS Motor Company  Buy   LTP  Rs 763.65   StopLoss  Rs 730   Target  Rs 850   Return  11 percentThe stock has initially given an Inverted Head   Shoulder neckline breakout above Rs 690 zone and further indicated a breakout above the Rs 750 levels with the bias maintained strong and has further upside targets of Rs 820850 levels keeping the stoploss near Rs 730 levels.Apollo Hospitals Enterprises  Buy   LTP  Rs 3700.5   StopLoss  Rs 3500   Target  Rs 4100   Return  11 percentThe stock after the decent correction has stabilised currently and maintained the support zone near Rs 3530 levels and gradually picking up. A decisive move past Rs 3530 would improve the bias and can anticipate for further upward movement for higher targets.We suggest to buy and accumulate this stock for an upside target of Rs 40004100 levels keeping the stoploss near Rs 3500 levels.Torrent Power  Buy   LTP  Rs 466   StopLoss  Rs 450   Target  Rs 520   Return  12 percentThe stock has picked up well from the bottom made near Rs 418 levels near the trendline support indicated and after a short correction from Rs 485 levels again has taken support near Rs 450 levels to form a higher bottom formation pattern and regaining strength.We suggest to buy and accumulate for further upside targets of Rs 490520 in the coming days keeping the stoploss near Rs 450.Jatin Gohil Technical and Derivative Research Analyst at Reliance SecuritiesDeepak Nitrite  Buy   LTP  Rs 1853.4   StopLoss  Rs 1700   Target  Rs 2278   Return  23 percentOn June 9 2022 the stock reversed after testing its horizontal support line and extended gain subsequently. Its daily RSI (relative strength index) has given buy signal post a bullish divergence which signals the stock is on the verge of a turnaround.This could take the stock towards is shortterm supply zone (Rs 20352050) initially and its longterm moving average 200day SMA (Rs 2278) subsequently.In case of any decline the stock will continue to find support around its horizontal trendline which is placed at Rs 1700.Biocon  Buy   LTP  Rs 339   StopLoss Rs 312   Target  Rs 388   Return  14.5 percentOn week ended June 10 2022 the stock again tested its 61.8 percent Fibonacci Retracement level of prior upmove (Rs 211488) which was placed at Rs 317 and formed a bullish Engulfing pattern.In the past the stock witnessed a sharp upmove after testing that Fibonacci Retracement level of prior upmove.The key technical indicators are positively poised on the shortterm timeframe chart. The stock has potential to move towards Rs 370 initially and Rs 388 subsequently.On the lower side the stock will find support around its prior swing low which is placed at Rs 312.Apollo Tyres  Sell   LTP  Rs 200.4   StopLoss  Rs 226   Target  Rs 165   Return  18 percentIn the last week the stock breached its prior rising trend and formed a bearish pattern. On the higher side the stock faced hurdle around its upper band of the falling channel.The key technical indicators are in favour of the bears on the shortterm timeframe chart. This could drag the stock towards its lower band of the falling channel which is placed at Rs 165.In case of rebound the stock will continue to face hurdle around its upper band of the falling channel which is now placed at Rs 226.Sacchitanand Uttekar Deputy Vice President  Research Technicals (Equity) at Tradebulls SecuritiesAditya Birla Capital  Sell   LTP  Rs 100.65   StopLoss  Rs 106   Target  Rs 90   Return  11 percentIt witnessed fresh breakdown evident on its daily   weekly scale as the stock breaks below its 4 days prior swing support zone of Rs 101.50. A bearish Pennant formation on its weekly scale too indicates weakness to persist from here on until a firm reversal is not established on its weekly scale.Immediate pattern target coincides with its 52week low placed around Rs 90 which could be met in the next 23 weeks. Fresh shorts to be considered with a stoploss at Rs 106.Coal India  Buy   LTP  Rs 198.5   StopLoss  Rs 190   Target  Rs 220   11 percentIt was strong relative outperformer of the last week as it consistently maintained its shadows above its 5 DEMA (exponential moving average)   never closed below the same despite the persistent weakness across the market.The recent consolidation on its daily scale looks like a bullish flag in the making which suggests continuation of the ongoing bullish sequence. The pattern indicates a price target up to Rs 220 which could be participated with a stoploss below Rs 190.Adani Enterprises  Sell   LTP  Rs 2203.1   StopLoss  Rs 2260   Target  Rs 2020   Return  8.3 percentOccurrence of a Spinning Top formation on its weekly scale after a continued sequence of  Inside bar  formations is a sign of diminishing strength. The stock has been facing stiff resistance around Rs 2240 zone while its month RSI creeping lower below 80 in accordance with the ongoing negative divergence since last 2 months.We expect Adani Enterprises to retrace back below its 20 weeks EMA (exponential moving average) zone below Rs 2020 as most trend strength indicators exhibit signs of distribution since last few weeks.Shrikant Chouhan Head of Equity Research (Retail) at Kotak SecuritiesDr Reddy s Laboratories  Buy   LTP  Rs 4351.55   StopLoss  Rs 4200   Target  Rs 4640   Return  7 percentAfter a short term correction the stock has formed higher bottom reversal formation. The stock is consistently taking support near 50 and 20 day SMA (Rs 4192 Rs 4227).The short term texture of the stock is still in to the positive and strong possibility of fresh uptrend rally is likely if it succeeds to trade above Rs 4200 level.Looking at the overall pattern it offers buying opportunity for the positional traders with a decent riskreward ratio. The trend reversal move is likely to continue up to Rs 4640.Adani Ports  Sell   LTP  Rs 726.4   StopLoss  Rs 745   Target  Rs 675   Return  7 percentThe stock corrected sharply from its alltime high level of Rs 924.65. Post sharp decline it is consistently forming lower top formation which indicating further correction form the current levels.Currently the stock comfortably trading below 200 days SMA (Rs 748) which is broadly negative. We are of the view that the short term texture of the stock is bearish and as long as it is trading below the level of Rs 745 the correction wave is likely to continue. Below which it could slip up to Rs 680675.",
    "Net Sales at Rs 3546.43 crore in March 2022 up 23.66  from Rs. 2867.95 crore in March 2021.Quarterly Net Profit at Rs. 90.14 crore in March 2022 down 46.3  from Rs. 167.86 crore in March 2021.EBITDA stands at Rs. 493.96 crore in March 2022 up 14.27  from Rs. 432.28 crore in March 2021.Apollo Hospital EPS has decreased to Rs. 6.27 in March 2022 from Rs. 11.77 in March 2021.Apollo Hospital shares closed at 3524.30 on May 25 2022 (NSE) and has given 38.18  returns over the last 6 months and 10.15  over the last 12 months.",
    "Net Sales at Rs 1420.73 crore in March 2022 down 41.05  from Rs. 2410.07 crore in March 2021.Quarterly Net Profit at Rs. 153.67 crore in March 2022 up 33.02  from Rs. 115.52 crore in March 2021.EBITDA stands at Rs. 350.71 crore in March 2022 up 1.19  from Rs. 346.57 crore in March 2021.Apollo Hospital EPS has increased to Rs. 10.69 in March 2022 from Rs. 8.10 in March 2021.Apollo Hospital shares closed at 3524.30 on May 25 2022 (NSE) and has given 38.18  returns over the last 6 months and 10.15  over the last 12 months.",
    "The market was about to snap a fourday losing streak as it opened higher and traded strong but the correction in the last hour due to Ukraine war wiped out all gains and finally benchmark indices lost more than one percent continuing southward journey for the fifth straight session.Most sectoral indices were caught in a bear trap with IT and FMCG being prominent losers with around three percent loss. Bank auto financial services metal and pharma indices were down one to two percent.The BSE Sensex plunged more than 700 points to 56463 and the Nifty50 closed below the psychological 17000 mark falling more than 200 points to 16959. The broader markets were also under pressure with the Nifty Midcap 100 index losing 1.4 percent and Smallcap 100 index declining 1.66 percent.Stocks that were in action include Apollo Hospitals Enterprises which was the biggest gainer in the futures and options segment rising 5.75 percent to Rs 4816  MRPL which hit a fresh 52week high intraday and closed nine percent higher at Rs 57.65  and Minda Corporation which ended at record closing high of Rs 251 up 4.78 percent.Among others Genus Paper and Boards climbed 6.28 percent to Rs 22 and Vaishali Pharma surged 19 percent to Rs 111.80.Here s what Ruchit Jain of Angel Broking recommends investors should do with these stocks when the market resumes trading today Apollo Hospitals EnterprisesAfter a pricewise correction at the start of the calendar year the stock has been trading within a narrow range which seems to be a timewise correction. This entire consolidation has taken place above its 200 EMA (exponential moving average) which is now around Rs 4425 and is important support.On the flipside resistance is seen around Rs 5000. A breakout beyond these levels will lead to the next leg of directional move and hence traders should look to buy on a breakout above the mentioned resistance.However existing long positions can be held till the stock continues to hold above the moving average support.MRPLThe stock has given a breakout above the previous high resistance with very high volumes. This indicates buying interest in the counter and hence the stock could continue its upmove in the short term.However the RSI Smoothened (relative strength index) oscillator on the daily chart is around the level of 90 which is overbought. Hence one should wait for a corrective move within this uptrend and look for buying opportunities on declines.The support is placed around Rs 54 and any dip towards that can be used as a buying opportunity for a potential target of Rs 70. The stoploss for long positions can then be placed below Rs 48.Minda CorporationThe stock is trading in an uptrend and has recently shown decent outperformance. The previous resistance of Rs 230 is now expected to become a support and hence any declines towards this support could be used as a buying opportunity.Traders can look to buy the stock on dips around Rs 230 for a potential target of Rs 275 in the next couple of months. The stoploss for long positions can then be placed below Rs 218.Genus Paper and BoardsPaper stocks have been buzzing for the last few weeks and this stock has been forming a  Higher Top Higher Bottom  structure which is a sign of an uptrend. The volumes have also been good in the recent upmove and oscillators are indicating a positive momentum.Traders can look to trade with a positive bias and accumulate the stock in the range of Rs 2021 for a potential target around Rs 25. The stoploss on long positions can be placed below the support of Rs 19.Vaishali PharmaThis stock has given a breakout from a long consolidation phase in the month of February and since then prices have rallied from Rs 40 to over Rs 110 now. Although the trend continues to be positive the oscillators are deeply overbought and hence the risk reward ratio for fresh buying is not favourable.However traders with existing long positions can continue to ride the trend by keeping a trailing stoploss. The immediate support for the stock is now placed around Rs 95.",
    "Bears tightened their grip over Dalal Street with the benchmark indices falling sevententh of a percent as the rising UkraineRussia tensions and further spike in oil prices weighed on the market sentiment.The BSE Sensex fell 383 points to 57301 and the Nifty50 declined 115 points to 17092.All sectoral indices closed in the red with IT FMCG and Metal being the top losers falling 1 percent each. The broader markets too were under pressure with the Nifty Midcap 100 and Smallcap 100 indices declining 1 percent and 2 percent.Stocks that were in focus include NALCO Apollo Hospitals Enterprises and Metropolis Healthcare which were the second third and fourth biggest gainers respectively in the futures and options segment. NALCO gained 3.5 percent to close at Rs 115.50 after falling nearly 9 percent in previous four consecutive sessions.Apollo Hospitals Enterprises corrected 5 percent in previous four straight sessions before closing the session on Tuesday at Rs 4576 with 3.4 percent gains. Metropolis Healthcare was up 2.9 percent at Rs 2033 while Indiabulls Real Estate surged more than 10 percent to Rs 113.65 after falling 19 percent in previous four sessions in a row.Here s what Mazhar Mohammad of Chartviewindia.in recommends investors should do with these stocks when the market resumes trading today NALCOThis counter seems to have reversed its trend in favour of bulls as it smartly bounced back from intraday low of Rs 108 levels. Interestingly the said low not only coincides with the 62 percent retracement level of the last leg of rally from the lows of Rs 99 to Rs 128 levels but also interacts with the trend line support as shown on the chart.Therefore as long as it sustains above Rs 108 levels it should head higher to test recent peak of Rs 128 where it appears to have formed a double top. Stoploss suggested for this trade will be a close below Rs 108 levels.Apollo Hospitals EnterprisesThis counter seems to be in a base building process after the sharp cut from the highs of Rs 5935 to Rs 4150 levels as it is moving in a zone of Rs 4794 to Rs 4300 levels for last couple of weeks.Bullish Engulfing formation of last trading session from the intraday low of Rs 4300 on relatively higher volumes seems to have set the tone for a pullback rally.However initial target for this pullback attempt shall be Rs 4794 levels and a close above that shall confirm a sustainable upmove. Outlook shall remain positive as long as this counter trades above Rs 4300.Metropolis HealthcareThis counter appears to be making efforts to stabilise as hinted by the sideways move of last couple of trading sessions after retracing 62 percent of its entire upmove from the March 2020 lows of Rs 998 to a high of Rs 3571 levels.Hence sustaining above Rs 1933 levels it can make an attempt to pullback into the bearish gap zone of Rs 2298   Rs 2363 levels.In case as mediumterm trend is down if this counter registers a close below Rs 1870 levels then it can slide down all the way to Rs 1550. If someone is holding then they are advised to maintain a stoploss below Rs 1925 levels.Indiabulls Real EstateThis counter appears to have registered a Harami kind of candlestick formation on daily charts hinting that trend for near term might be shifting in favour of bulls. Moreover at recent low of Rs 99 this counter seems to have retraced 62 percent of the huge rally from the November 2020 low of Rs 46 to a high of Rs 196 levels.Hence sustaining above Rs 99 levels it can make a pullback attempt with initial targets of Rs 132 levels. In case if this counter registers a close below Rs 95 levels then it can slide down all the way into the zone of Rs 76 to Rs 72 levels.",
    "Santosh Meena Head of Research at Swastika InvestmartThe Nifty again respected its 200DMA (day moving average 16877) beautifully gave confidence to the bulls however the 20DMA is acting as a strong resistance for many days that is currently placed at 17325 level. Above this we can expect the positive momentum to pick up towards 1760017800 levels.If the Nifty surrenders its 200DMA then things may become ugly where 1640016000 are the next important support levels.FIIs are still selling in the cash market but the momentum has come down a little bit despite the RussiaUkraine s standoff and they are making bullish positions in the F O market for the last few days which is also a positive sign.As per the open interest data 17000 should act as strong support for the Nifty ahead of expiry while 3700036500 is a critical support zone for the BankNifty.Here are three buy calls for next 23 weeks Apollo Hospitals Enterprises  Buy   LTP  Rs 4576   StopLoss  Rs 4300   Target  Rs 5100   Return  11.5 percentThe counter is bottoming out at its 200DMA following a meaningful correction where it has formed a bullish Engulfing candlestick formation with a double bottom chart pattern. The counter is in a very narrow range for the last many days where Rs 4750 is acting as a strong hurdle. Above this we can expect a swift move towards the Rs 5100 level.Momentum indicator RSI (relative strength index) witnessed positive crossover with a positive divergence whereas MACD (moving average convergence divergence) also showed positive crossover however it is trading below the centerline.L T Infotech  Buy   LTP  Rs 5991   StopLoss  Rs 5600   Target  Rs 6600   Return  10 percentThe counter has created a strong base around Rs 5600 level that coincides with its 200DMA. It created a strong bullish candlestick formation near the major base with positive divergence in momentum indicators.On the upside 20DMA is acting as a strong hurdle that is currently placed at the Rs 6075 level. Above this we can expect a move towards a cluster of 100 and 50DMA which is currently placed around Rs 6600 level.Minda Corporation  Buy   LTP  Rs 195   StopLoss  Rs 180   Target  Rs 225   Return  15 percentMinda Corporation is outperforming the market and managed to hold important support of Rs 180 despite a selloff in the overall market. It formed a bullish opening Marubozu candlestick formation from the support of Rs 180 in Tuesday s trading session.The overall structure is bullish where it is consolidating in the range of Rs 180210 and a move above Rs 210 may lead to a fresh leg of the rally. Momentum indicator RSI is witnessing positive crossover from the support of 40 levels whereas other momentum indicators are also positively poised.",
    "Bears have returned to rule Dalal Street. The benchmark indices fell significantly dented by selling pressure across sectors barring private banks and weak global cues.The BSE Sensex fell more than 550 points to 60755 and the Nifty50 declined nearly 200 points to 18113 while the broader markets corrected more than 2 percent.Stocks that were in focus include Prestige Estates Projects which hit a fresh record high of Rs 554.90 before closing with 2.77 percent gains at Rs 526.65 and Gujarat Ambuja Exports which rallied 3.96 percent to Rs 190.15.Infibeam Avenues rallied 8.5 percent to Rs 44.30 whereas Apollo Hospitals was the fifth biggest loser in the futures and options segment falling 6 percent to Rs 4615.80.Here s what Mazhar Mohammad of Chartviewindia.in recommends investors should do with these stocks when the market resumes trading today Prestige Estates ProjectsDespite hitting lifetime highs the mediumterm trend of this counter seems to be sideways in a broader range of Rs 520 to Rs 400. In the last four months with its price behaviour it carved out a welldefined channel in which the upper bound acted as a supply point where as lower boundary witnessed buying interest.In the last session it gave up all the intraday gains to close around the lowest point of the session. Hence it may witness more selling pressure in the next session if it trades below Rs 522 levels. Therefore we don t advise fresh longs unless it closes above Rs 555 levels. On such a close initially Rs 590 can be expected.Positional traders who have own this counter shall either book profits and wait for a breakout above Rs 555 with a stoploss below Rs 522 or exit if it fails to close above Rs 555 in next two sessions.Apollo Hospitals EnterprisesThis counter seems to have witnessed some critical breakdowns on weekly charts as in the current week it erased a fourweekold pullback attempt from the lows of Rs 4643 to a high of Rs 5148 in the current week in which only two sessions passed.This faster retracement on the downside is hinting at more selling pressure with initial targets of Rs 4351 levels and breach of this can drag it down further towards Rs 3955 levels.For the time being fresh long side bets should be avoided whereas shortterm traders who already invested in this counter should exist either on pull back towards Rs 5000 levels or triggering a stoploss below Rs 4500 levels.Gujarat Ambuja ExportsLast two trading sessions of sharp upmove on the back of massive volumes may be hinting at a breakout above its 94dayold corrective and consolidation phase.Volumes with sharp price appreciation may be pointing at a trend reversal with a sustainable upmove. Moreover as this counter is trading close to its life highs of Rs 202 beyond that a higher target of Rs 219 can t be ruled out.Hence it remains a  buy on dip  opportunity but with a stoploss below Rs 180 on closing basis for a target of Rs 219.Infibeam AvenuesThis counter appears to be in a multiweek consolidation zone of Rs 58  37 for the last 10 months. However last four weeks of price structure is in extremely narrow ranges and seems have formed a decent base around Rs 39.This was followed by sharp price rise on the back of massive volumes. Hence positional traders are advised to adopt a two pronged strategy of buying now and add on dips in the zone of Rs 42   40 levels and look for an initial target of Rs 57. Stoploss suggested for the trade is a close below Rs 39.",
    "Dalal Street stayed upbeat for yet another week as the market entered the New Year on a bullish note driving the benchmark indices up over 2.5 percent by the end of the weekly session on January 7. the possibility of faster monetary policy tightening and rate hikes by the US Fed though capped the upside. Banking and financials were the key drivers for the rally.The Nifty50 climbed closer to the psychological 18000 mark during the day and settled above 17800 levels up 459 points or 2.64 percent on a weekonweek basis forming a bullish candle on the weekly charts. Experts largely feel 18000 will be crucial for a sharp uptrend in the coming days and as long as the index holds 20week simple moving average of 17553 then the positive momentum would continue however 17640 is going to be a crucial support. Looking at the price action the psychological level of 18000 will act as a key resistance level. If the prices manage to breach this level then we might see further up move towards 18210 (Swing High). The key support level is placed at 17640 (Multiple touch point level) we expect this to act as a key support level going forward  said Malay Thakkar Technical Research Associate at GEPL Capital.Looking at the options data 18000 CE and 17500 PE have the maximum open interest. The 17800 strike has identical Open Interest (30 lakh) on both Calls and Puts which indicates that straddles are being written at 17800 strike according to him. We expect the index to be in the range of 1750018000. Only a break above 18000 will increase momentum on the upside and trigger fresh buying  Thakkar said.Here are 10 trading ideas by experts for the next 34 weeks. Returns are based on January 7 closing prices Expert  Vinay Rajani Senior Technical   Derivative Analyst at HDFC SecuritiesChambal Fertilisers  Buy   LTP  Rs 423.15   StopLoss  Rs 384   Target  Rs 499   Return  18 percentThe stock has broken out from the symmetrical triangle pattern on the daily chart. Price breakout is accompanied with rising volumes. The stock has surpassed the previous swing high resistance of Rs 424.Primary trend of the stock has been bullish with higher tops and higher bottoms. The stock is trading above all important moving averages. Indicators and oscillators have turned bullish on the daily charts.Natco Pharma  Buy   LTP  Rs 915.50   StopLoss  Rs 824   Target  Rs 1065   Return  16.3 percentThe stock is on the verge of closing above the previous high resistance placed at Rs 901 on the daily chart. Recent Price rises have been with healthy volumes which indicates accumulation in the stock.The stock has surpassed the crucial resistance of its 50day EMA. The stock is on the verge of surpassing the long term resistance of 200day EMA placed at Rs 900.The stock has also broken out from last 10 weeks  price consolidation. Indicators and oscillators have turned bullish on the daily chart.Tata Coffee  Buy   LTP  Rs 213.20   StopLoss  Rs 195   Target  Rs 257   Return  20.5 percentDownward sloping trend line breakout was seen on the daily chart. The stock broke out from the resistance on December 27 which was followed by three days of running correction.On December 31 the stock resumed the uptrend by forming a Rising Three candlestick pattern on the daily chart.The price breakout is accompanied by a jump in volumes. Primary trend of the stock has been bullish with higher tops and higher bottoms. The stock is trading above all important moving averages. Indicators and oscillators have turned bullish on the daily charts.Expert  Vijay Dhanotiya Lead of Technical Research at CapitalVia Global ResearchVinati Organics  Buy   LTP  Rs 2103.90   StopLoss  Rs 1800   Target  Rs 2550   Return  21.2 percentThe stock has been following an uptrend and is in the uptrend channel. We can see a bullish sentiment in the stock.We have observed indicators like MACD (moving average convergence divergence) and RSI indicating the momentum in the stock is likely to continue.We recommend a buy in Vinati Organics above Rs 2110 with a target of Rs 2550. Investors are advised to maintain a stoploss at Rs 1800.Amber Enterprises  Buy   LTP  Rs 3428.50   StopLoss  Rs 3200   Target  Rs 3950   Return  15.2 percentThe stock has taken been trading in a positive manner and has reversed from the previous level of Rs 3250.It has also taken a support of 200 EMA and reversed from the same support level. We recommend a buy above Rs 3550 with a target of Rs 3950 with a stoploss of Rs 3200.Apollo Hospitals Enterprises  Buy   LTP  Rs 5021.85   StopLoss  Rs 4350   Target  Rs 6200   Return  23.5 percentThe stock has reversed from the support of lower band of an ascending channel. It has also taken the support of 100 EMA.We have observed indicators like MACD and RSI indicating the momentum in the stock is likely to continue. We recommend a buy above Rs 5150 with a target of Rs 6200 with a stoploss of Rs 4350.Expert  Ruchit Jain Lead Research at 5paisa.comTata Power  Buy   LTP  Rs 229.80   StopLoss  Rs 219   Target  Rs 243245   Return  8.4 percentSince the pandemic lows this stock has seen a huge buying interest among market participants and had risen sharply without any meaningful correction till October 2021. However in the later half of the month prices took a pause and retraced some of the gains along with the broader market. But rather than a price correction the stock went through a timewise correction as it has consolidated within a broad range in the last twoandahalf months.Now prices have hinted at initial signs of a resumption of the momentum as it has given a breakout from a falling trend line resistance. Looking at the price action and the RSI (relative strength index) readings we expect a positive momentum in the stock and hence it could resume its broader uptrend.Thus shortterm traders can look to trade with a positive bias and buy in the range of Rs 229226 for a potential target of Rs 243245. One can place a stoploss below Rs 219 on long positions.UPL  Buy   LTP  Rs 788.95   StopLoss  Rs 759   Target  Rs 820   Return  4 percentThe stock has been consolidating within a broad range since last seven months and has not seen any directional move. In this consolidation whenever the prices have traded below the Rs 700 mark the stock has witnessed good buying interest.After this long consolidation the stock finally witnessed a good momentum in last week in which it gave a breakout above its trend line resistance. Also the volumes were good since the opening ticks itself on Friday indicating buying interest in the counter. Thus we expect the stock to resume its broader uptrend and thus short term traders can look for buying opportunities.Hence traders can look to trade with a positive bias and buy in the range of Rs 784778 for a potential target of Rs 820. One can place a stoploss below Rs 759 on long positions.Indiabulls Real Estate  Buy   LTP  Rs 166.15   StopLoss  Rs 157   Target  Rs 183   Return  10 percentIn the last couple of months the stock has witnessed a corrective phase from the highs of Rs 195. However the stock seems to have completed its pricewise correction and entered into a timewise corrective phase in the later half of December. If we look at the historical data it is observed that the 89day EMA (exponential moving average) on the daily chart usually attracts a lot of buying interest in the stock and this time too this average has acted as a support in the stock.In Friday s session prices hinted at initial signs of buying interest as price up move during the day was seen with rise in volumes. Hence we expect the stock to resume its uptrend and rally towards the precious highs going ahead.Thus traders can look to trade with a positive bias and buy around the current price of Rs 166 for a potential target of Rs 183 in next 34 weeks. One can place a stoploss below Rs 157 on long positions.JSW Steel  Buy   LTP  Rs 672.85   StopLoss  Rs 655   Target  Rs 705   Return  5 percentAlthough the Metal index started correcting in the midOctober 2021 this stock has been correcting since August and has seen a pricewise as well as a timewise correction. On the longer term charts this correction just seems to be a corrective phase within an uptrend and prices have given a breakout from a falling trend line resistance during this week.With the Nifty Metal index chart also looking interesting this stock seems to be poised for a resumption of its uptrend after this corrective phase.Thus traders can look to trade with a positive bias and buy around the current price of Rs 673 for a potential target of Rs 700705 in the next 34 weeks. One can place a stoploss below Rs 655 on long positions.Expert  Chandan Taparia  Vice President  Equity Derivatives   Technical Broking   Distribution at Motilal Oswal Financial ServicesAarti Industries  Buy   LTP  Rs 1030.95   StopLoss  Rs 1005   Target  Rs 1080   Return  5 percentThe stock has given a consolidation breakout of last 52 trading sessions with decisive close above Rs 1030 zone. It has taken support at its 50day exponential moving average (EMA) and entire chemical sector is getting attraction. Mechanical indicator like RSI (relative strength index) is holding and giving a crossover signal.",
    "The market was caught in a bear trap on December 17 as well as for the entire last week amid relentless FII selling hawkish stance by the Federal Reserve and a surprise rate hike by the Bank of England.All sectors barring IT closed in the negative terrain with bank auto financial services FMCG and metal indices losing 22.5 percent. However Accenture s results and FY22 outlook lifted IT stocks.The BSE Sensex plunged nearly 900 points or 1.5 percent to 57012 while the Nifty50 closed below 17000 mark down a little more than 260 points on Friday. The broader markets  the Nifty Midcap 100 and Smallcap 100 indices  corrected more than 2.4 percent each.Stocks that were in focus include Wipro and Persistent Systems which were the biggest gainers in the futures and options segment rising 4.11 percent to Rs 670.80 and 3.03 percent to Rs 4640.15.Indiabulls Housing Finance Apollo Hospitals Enterprises and Zee Entertainment Enterprises were among the top five losers in the F O segment. Indiabulls Housing fell 8.21 percent to Rs 233.15 and Apollo Hospitals plunged 8.02 percent to Rs 4786.70 while Zee Entertainment declined 7.02 percent to Rs 342.35.Here s what Rajesh Palviya of Axis Securities recommends investors should do with these stocks when the market resumes trading today Persistent SystemsThe stock is in a strong uptrend across all the time frames forming a series of higher tops and higher bottoms indicating bullish sentiments. With the current close the stock has decisively broken out its threemonth resistance zone of Rs 4460 levels indicating strength ahead.This breakout is accompanied by huge volumes indicating increased participation. The stock is well placed above 20 50 and 100day SMA (simple moving averages) which reconfirms the bullish trend.The daily and weekly strength RSI (relative strength index) continues to remain bullish. On the daily chart the Band Bollinger signals increased momentum in the near term.The shortterm support zone is placed at Rs 44004200 levels with the expected upside of Rs 48004900 levels.WiproWith the current close the stock has surpassed its sixweek  multiple resistance zone  of Rs 666 levels on a closing basis. This breakout is accompanied by huge volumes indicating increased participation.This buying was observed from 20 50 and 100 day SMA which reconfirm upside momentum. The daily and weekly strength RSI continues to remain in the bullish terrain. On the daily chart the Band Bollinger signals increased momentum in the near term.The shortterm support zone is placed at Rs 650630 levels with the expected upside of Rs 694720 levels.Apollo Hospitals EnterprisesOn the shortterm chart the stock is in a downtrend forming a lower high low formation. Currently the stock is trending below 20day and 50day SMA which supports bearish sentiments ahead.The weekly RSI negative divergence signifies losing strength on mediumterm charts. The shortterm bias remains weak with an upside resistance zone of Rs 52005300 levels.On the downside any violation of the  bullish gap  area (Rs 48004688) on a closing basis may cause further weakness towards Rs 45504300 levels.Zee Entertainment EnterprisesOn the weekly chart the past couple of weeks  price action has formed an  engulfing bearish   a shortterm trend reversal pattern. However any followup down close below Rs 338 levels will confirm the abovementioned pattern.The stock is sustaining below its 20day SMA which signals weakness in the near term. The daily and weekly strength indicator RSI has turned bearish along with negative crossover which signals weakness on shortterm charts.On the upside the stock is facing a resistance zone towards Rs 366379 levels. On the downside the stock may revisit a lower support zone of Rs 320290 levels.Indiabulls Housing FinanceSince June 2021 the stock has been consolidating within a broad range of Rs 290200 levels representing a sideways trend. With recent week s high the stock has reacted strongly from its multiple supply zone of Rs 290 levels along with huge volumes indicating profit booking at major resistance zones.With the current close the stock has violated its 20 50 and 100day SMA on a closing basis indicating weakness. The overall bias remains neutral to negative with a downside support zone of Rs 200190 levels.",
    "The market extended losses amid volatility and fell half a percent due to correction in banking   financials pharma and select metals stocks on November 17.The Nifty50 closed a tad below 17900mark with a loss of 100 points and the BSE Sensex fell over 300 points to end moderately above 60000 levels. The broader market continued to show a mixed trend with the Nifty Midcap 100 index falling 0.67 percent and Smallcap 100 index rising 0.13 percent.Stocks that were in focus include Apollo Hospitals Enterprises which gained 12.5 percent to close at Rs 5733.95 L T Technology Services (closed at Rs 5675.50 with 5.75 percent gains) Tanla Platforms and Barbeque Nation Hospitality  both were locked in 5 percent upper circuit at Rs 1392.20 and Rs 1610.25 respectively.Here s what Gaurav Sharma of Globe Capital Markets recommends investors should do with these stocks when the market resumes trading today Apollo Hospitals EnterprisesIt is the biggest healthcare stock in terms of market capitalization and is betterplaced among the listed peers. It has posted good up move in past couple of sessions rallying from Rs 4600 to Rs 5800plus levels in just 4 days.On weekly charts breakout from Nformation is also witnessed which is backed by strong volume. Considering its overall chart pattern we see it heading towards Rs 6200 levels which is the first target of the above mentioned formation.L T Technology ServicesThis stock is in strong uptrend trading in higher highs higher lows formation from quite a long time. During the initial COVID impact that adversely impacted markets across the globe this stock too witnessed the heat corrected reasonably fell from levels close to Rs 2000 till Rs 1160.Post this slide steep rise have been witnessed and the stock price never looked back it has multifolded since then.Considering its past performance we advise medium to long term buyers to stay invested and those who missed out can utilize dips to take fresh entry.Tanla PlatformsIt has consolidated in range Rs 750 till Rs 1000 levels for almost eight months (February till October 2021) before steeply moving higher. In less than a month it has moved up from Rs 1000 to levels close to Rs 1400. It had traded at upper circuit during that rise on Wednesday i.e. November 17 it was at 5 percent upper circuit.It has surpassed upside target range of the rectangle formation it was trading in  hence chances of some profit taking cannot be ruled out but that should not be considered negative. It should be used as an opportunity to go long as the overall trend is still quite strong.Barbeque Nation HospitalityThe stock quadrupled from its initial listing levels i.e. Rs 490. It has retraced 61.8 percent of the rise Rs 11501945 as per the Fibonacci Retracement theory. This is a healthy correction and if we go by this theory chances of recovery are quite high.Hence this is a good buying opportunity as apart from technical reasons there are negligible chances that the third COVID wave will be hitting India and if that is so restaurants are likely to have quite an impressive quarter ahead.",
    "Last week Nifty50 had formed an indecisive candle pattern on the weekly charts and in the current week it is forming small bearish candle. Since last 3 weeks the Nifty has been forming Inside Week candle patterns indicating rangebound movement for the index for the short to medium term.On the daily charts the Nifty has been sustaining below its 20day SMA (18019) since last few days which shows resistance at higher levels.However the momentum indicator like RSI (relative strength index) is sustaining near 50 levels on the daily charts which indicates neutral sentiment for the index for the short to medium term.We believe Nifty could be rangebound between 18200 and  17600 levels. It has a resistance placed at 18200 followed by 18345 and 18604. On the flip side the support levels would be 17600 and 17450 levels.Here are three buy calls for next 23 weeks Birlasoft  Buy   LTP  Rs 475.05   Stop Loss  Rs 435   Target  Rs 543   Return  14.3 percentBirlasoft has given a strong consolidation breakout with a volume confirmation which has been forming since last 5 months and made a fresh life time high which shows strong bullish undertone of the stock for medium to long term. The stock has been taking strong support at 20week SMA (simple moving average) since June 2020 indicating the stock is in long term bullish phase.The momentum indicator RSI has sustained above 60 levels on all the time frames which confirms strong positive momentum of the stock for the medium to long term.Looking at the prices action and the momentum indicators and other technical parameters we believe this stock has a lot of upside potential left. Going ahead we expect the prices will move towards Rs 514 levels (50 percent extension level of Rs 215   Rs 457 projected from Rs 393) followed by Rs 543 mark (61.8 percent extension level of Rs 215   Rs 457 projected from Rs 393).The stop loss for this trade set up would be Rs 435 levels of closing basis.Apollo Hospitals Enterprises  Buy   LTP  Rs 5733.95   Stop Loss  Rs 5198   Target  Rs 6520   Return  14 percentApollo Hospitals has given a strong breakout after taking a strong support at 20week SMA and made a fresh life time high at Rs 5844 levels which shows strong positive undertone of the stock for the medium to long term. The breakout is backed by the strong volume confirmation indicating the strength of the upward move.The momentum indicators and the technical indicators all point towards the possibility of the prices moving higher towards the Rs 6520 mark immediately (61.8 percent extension level of Rs 1047   Rs 5198 projected from Rs 3955) if this level is breached we might see the prices move towards Rs 7217 (78.6 percent extension level of Rs 1047   Rs 5198 projected from Rs 3955).The stop loss for this trade set up would be Rs 5198 levels of closing basis.L T Technology Services  Buy   LTP  Rs 5675.50   Stop Loss  Rs 5350   Target  Rs 6233   Return  10 percentThe stock has been making fresh life time highs consistently since December 2020 which shows strong positive undertone of the stock. In the current week as well the stock has made fresh life time high at Rs 5744 mark. On the daily charts the stock has been consistently sustaining above its 20day SMA since May 2021 indicating positive strength of trend.The momentum indicator like RSI is sustaining above 60 mark indicating strong positive momentum of the stock. As per price pattern we feel that the stock prices gain momentum and move higher toward the Rs 6233 (61.8 percent extension level of Rs 2476   Rs 5548 projected from Rs 4335) levels and eventually towards Rs 6750 (78.6 percent extension level of Rs 2476   Rs 5548 projected from Rs 4335).Investors can accumulate LTTS at this point and hold for a target of Rs 6233 and Rs 6750 with a stop loss of Rs 5350 on closing basis.",
    "The market managed to add more gains in the morning on November 15 following a 1.3 percent rally in the previous trading session but profitbooking at higher levels erased those gains in the afternoon to finally settle the day on a flat note.The Nifty50 continued to respect the 20day SMA (whose value is placed at 18068) and settled above 18100 mark while the BSE Sensex closed the session above 60700 levels.FMCG IT and pharma stocks helped the benchmark indices close with a positive bias however the selling pressure in metals and select banking and financial stocks capped the gains.The trend in broader markets was mixed with the Nifty Midcap 100 rising 0.32 percent and Smallcap 100 falling 0.25 percent.Stocks that were in focus include Apollo Hospitals Enterprises which was the biggest gainer in the futures and options segment rising 8.81 percent to close at Rs 5080.95 and Syngene International which rallied 6.95 percent to Rs 593.20. Metropolis Healthcare was also in action hitting a fresh record high of Rs 3352.45 before closing with 7.87 percent gains at Rs 3337.95.Metropolis Healthcare and Syngene International were the third and fourth biggest gainers in the F O segment. The buying was also seen in IRCTC rising 4.46 percent to close at Rs 903.40.Here s what Mazhar Mohammad of chartviewindia.in recommends investors should do with these stocks when the market resumes trading today Apollo Hospitals EnterprisesAt a recent low of Rs 3955 on this counter appears to have taken support around its channel lines after retracing almost 62 percent of its last leg of rally from the lows of Rs 3141 to Rs 5122 before resuming its uptrend. Since then it seems to be in a steady uptrend which seems to have accelerated in the last session as it witnessed almost twodigit appreciation on the back of huge volumes.Hence initially it should head higher to test its life highs present around Rs 5198 and beyond that eventually a higher target of Rs 5700 can t be ruled out.In today s (Tuesday) session if it rallies without a correction then positional traders who already own this counter should book profits in the zone of Rs 5150   Rs 5200 levels.In case it witnesses profitbooking in the early hours of trading sessions without much price appreciation then a dip between Rs 5000 and Rs 4900 can be an opportunity to create fresh longs with a stop below Rs 4800 on a closing basis.Syngene InternationalLarger trend of this counter seems to be sideways in a broader range of Rs 700 to Rs 500. Moreover last 45week of price behaviour seems to have carved out a channelled move.Interestingly with two weeks of consolidation at lower end of the said channel this counter appears to have positioned itself for resumption of upswing as it staged a strong comeback in the last trading session on huge volumes. Hence sustaining above Rs 547 levels this counter shall make an attempt to head towards its recent top of Rs 686.As this counter appears to have just initiated a fresh leg of rally traders should adopt a twopronged strategy of buying now and adding further on dips preferably in the zone of Rs 580   Rs 560 levels by placing a stop below Rs 547 and look for a potential target of Rs 680.Metropolis HealthcareThis counter seems to have resumed its uptrend with new lifetime highs as it registered a consolidation breakout from the 23week trading range of Rs 3230 to Rs 2630 levels.Hence as long as it sustains above Rs 3085 levels a higher target based on the width of consolidation range of Rs 3830 can be projected.Therefore positional traders are advised to buy now and add on dips into the zone of Rs 3200   Rs 3100 levels by placing a stop below Rs 3085 levels.IRCTCThis counter seems to be in a consolidation mode after a cut of 50 percent from its lifetime highs of Rs 1279 to a low of Rs 639 levels. Interestingly the current consolidation zone of 14 days seems to be inside the large bearish candle range registered on October 25 present between Rs 937 and Rs 792.Hence initially it needs to register a close above Rs 937 levels to confirm some kind of strength. In case it closes above Rs 937 then the strength shall expand towards Rs 980.For the time being as the current up move is of pullback nature traders should consider booking profits on its inability to get past Rs 937 in the next couple of sessions."
]