[
    "Check out the latest brokerage calls and analyst comments on the stocks in action today. Our coverage includes Reliance Industries Apollo Hospitals Zydus Life Emcure Pharma and Bansal Wires along with views on sectors such as information technology and oil marketing companies.Reliance Industries Jefferies On Reliance IndustriesMaintain Add Target Cut To Rs 3200 From Rs 3300 Sh50  Decline In Retail Capex A Key Positive Of FY24 Annual ReportCons Capex Declines Only by 7  In FY24Telecom Capex Remaining High   Other Segments See 5x RiseOptimistic Of Further Decline In Capex   Net Debt As Telecom Capex ModeratesPace Of Invst In New Energy Remained Slow With FY24 Invst Of  11.2 BnHave Further Moderated Our Retail   O2C Earnings For FY25Kotak Instl Eq On Reliance IndustriesMaintain Add Target Cut To Rs 3200 From Rs 3300 Sh50  Decline In Retail Capex A Key Positive Of FY24 Annual ReportCons Capex Declines Only by 7  In FY24Telecom Capex Remaining High   Other Segments See 5x RiseOptimistic Of Further Decline In Capex   Net Debt As Telecom Capex ModeratesPace Of Invst In New Energy Remained Slow With FY24 Invst Of  11.2 BnHave Further Moderated Our Retail   O2C Earnings For FY25CLSA On Reliance IndustriesOutperform Call Target At Rs 3300 ShThird Year Of New Energy Brought Co s New Venture Closer To RealityCo Planning To Launch Its Solar PV Gigafactory By The End Of 2024FY24 Financials Reveal Capex Of  1 Bn For Solar Mfg BusinessUpcoming AGM Should Provide More GranularityCiti On Zydus LifeSell Call Target At Rs 890 ShAsacol HD Generic Finally Has A Generic CompetitionTeva Receives US FDA Nod For Asacol HD Gets 180day ExclusivityAsacol HD Likely To Have Contributed  140160 m Of Sales In FY24With Teva s Launch Sales Of The Product May Fall By 4050  From Current LevelImpact Of Competition In This Product Should Also Reflect In The ValuationsJefferies On ITNifty IT Has Outperformed Nifty In CY23 CY24 YTD By 4  2  Despite EPS CutsLarge Caps Have Outperformed CYTD Due To Smaller Cuts To EPS EstimatesRecent Upmove In IT May Be Led More By Technical FactorsLike TCS Infosys Given Lower Risks To EPS Cuts   Valuation ComfortNomura On Apollo HospitalsDowngrade To Neutral From Buy Target Raised To Rs 6856 From Rs 6724 ShRise In Hospital Profitability To Be Gradual HereonDigital Segment Growth UnderwhelmingValuations Are At A Premium To Most Industry PeersLimited Opportunities To Expand Capacity In Existing HospitalsExpect The Expansion To Be A Drag On EBITDA Margin In Near TermInvestec On Bansal wireInitiate With A Buy Call Target At Rs 440 ShCreated A Niche For Itself In Commoditised Steel Stainless Steel Wire MarketOffering The Widest Product Range And Reducing Customer Industry ConcentrationUndertaking Two Initiatives That Are Sharply More ProfitableForaying Into Steel Cords   Backward Integration In Stainless Steel RodsSee 40   EBITDA CAGR Over FY2427E With High Teens Posttax RoCEValuations At 24x FY26e PE  17x FY27e PE Look UndemandingHSBC On Oil Mktg CosMaintain Buy On HPCL BPCL   IOCTarget For IOC Raised To Rs 200 Sh From Rs 180 ShTarget For BPC Cut To Rs 460 From Rs 470 ShTarget For HPCL Raised To Rs 480 Sh From Rs 440 ShDownward Orientation Of Global Oil Prices Is PositiveExpect Low Government Interference In Pump PricesStrong Marketing Margin Offsets Weakness In GRMsJefferies On Emcure PharmaInitiate With A Buy Call Target At Rs 1600 ShHave Strong Chemistry Skills In Developing Complex MoleculesNo Exposure To Volatile US Market A Key DifferentiatorHigh Growth In India   Canada Op Leverage   Debt Reduction Should BenefitSee 11  Rev CAGR From Mkt Share Gains In India   New Launches In ExportsSee Profit CAGR Of 29  Over FY2427.        ",
    "International brokerages Bernstein and CLSA maintained their bullish stance on Mukesh Ambaniled Reliance Industries Ltd citing telecom unit Jio as the key driver of the conglomerate s growth.Bernstein retained its  outperform  call raising its target price on Reliance Industries stock to Rs 3440 indicating a potential upside of around 15 percent. The brokerage also raised its target price for the Jio business following the telecom operator s rollout of its cheapest prepaid yet.Reliance Jio continues to focus on monetisation recently raising tariffs and completing its 5G rollout. Over the next three years Jio is expected to report an average annual revenue growth of 16 percent and a 20 percent annual increase in earnings before interest taxes depreciation and amortisation (EBITDA) the brokerage estimated.As Jio continues to gain market share it is on track to surpass 500 million subscribers and capture nearly 47 percent of the revenue share by FY25 Bernstein wrote.CLSA also maintained its outperform call albeit with a target price of Rs 3300. The brokerage said Jio s 5G rollout has led to a 46 percent increase in capital expenditure for FY24 from a year earlier which has impacted its free cash flow despite a 15 percent increase in operating cash flow.The next phase of growth for Jio will come from 5G monetisation and the rampup of its broadband services the brokerage said.Follow our live blog to catch all the updatesAccording to data from TRAI Reliance Jio added about 19.1 lakh wireless subscribers in June increasing its mobile user base to about 47.6 crore. In the wireline segment Reliance Jio outperformed the competition by adding 4.34 lakh new subscribers.",
    "Here s a quick look at stocks likely to be in focus in Wednesday s trade covering monthly telecom subscribers update bulk deals and deal wins announced by companies after market hours on Tuesday Results on August 21Procter   Gamble Health and Toyam Sports will release quarterly earnings scorecard on August 21.Stocks To WatchCyient DLMPromoter Cyient is likely to sell a 14.5  stake or 1.15 crore equity shares in Cyient DLM via block deals on August 21. The deal size is expected to be Rs 860.9 crore with a floor price of Rs 748.65 per share. After the deal Cyient s shareholding in Cyient DLM will decline from 66.66  to 52.16 .PNB Housing FinanceGeneral Atlantic Singapore Fund FII Pte is likely to sell a 5.1  equity stake in the company through a block deal according to CNBCTV18 sources. The floor price for the deal may be Rs 775 per share with the offer size likely to be Rs 1032.7 crore.GE T D IndiaPromoters GE Grid Alliance BV and Grid Equipments are reviewing their shareholding structure in the company to simplify it. In this regard they will evaluate the possibility of a minority stake sale in the company.Genus Power InfrastructuresGenus Power Infrastructures  whollyowned subsidiary has received three Letters of Award (LOA) totaling Rs 3608.52 crore for the appointment of advanced metering infrastructure service providers (AMISPs). The orders involve designing an Advanced Metering Infrastructure (AMI) system including the supply installation and commissioning with FMS of about 4.26 million smart prepaid meters system meters including DT Meters with corresponding energy accounting on a DBFOOT basis.Tata ChemicalsSES ESG Research (SES) has assigned an Environmental Social and Governance (ESG) Score (Adjusted) of 69.4 (Grade B) to Tata Chemicals based on data pertaining to FY24. The company did not engage SES for this ESG rating. SES independently prepared the report based on FY24 data available in the public domain.Ola Electric MobilityOla s scooters S1 X 3 kWh and S1 X 4 kWh have received Certification for Compliance with the eligibility assessment requirements as per the Production Linked Incentive (PLI) scheme for the automobile and auto components industry. Both the S1 X 3 kWh and S1 X 4 kWh scooters have successfully met the stringent minimum localization criteria of 50  as mandated by the Ministry of Heavy Industries.Larsen   ToubroThe Bombay High Court has quashed and set aside the showcause notice issued by the GST authorities. The company had filed a Writ Petition in the Bombay High Court against the showcause notice issued by the Principal Commissioner of GST and Service Tax Mumbai regarding a service tax demand of Rs 2237 crore on an erstwhile subsidiary for tax already paid by the company with respect to certain transactions undertaken postdemerger.Exide IndustriesExide Industries has further invested Rs 75 crore in its subsidiary Exide Energy Solutions on a rights basis. With this investment the total investment made by the company in the subsidiary stands at Rs 2652.24 crore. There is no change in the shareholding percentage of the company in the subsidiary following this acquisition.BGR Energy SystemsThe company has received an intimation of termination of contract from Jharkhand Urja Sancharan Nigam (JUSNL project) concerning the supply installation testing and commissioning of 132 33 kV GIS at Sarath Sundernagar and Chattarpur. There is no material impact on the financials operations or other activities of the company.Petronet LNGThe company has entered into a Memorandum of Understanding (MoU) with LTL Holdings (LTL) of Sri Lanka for the supply of LNG to LTL s dualfuelled power plant(s) in Kerawalapitiya Colombo. The proposed supply of LNG from Petronet s Kochi LNG terminal would be through LNG ISO tank containers involving a multimodal transport system. The initial term of LNG supply would be five years extendable subject to mutual agreement.NHPCAn incident of a landslide occurred at NHPC s 510 MW TeestaV Power Station (Sikkim) affecting the TRT (tail race tunnel) gate hoist structure and part of the GIS building. The power station is currently not operational and is undergoing restoration works after the flash flood of October 2023.Reliance IndustriesSubsidiary Reliance Jio added 19.11 lakh subscribers in June compared to the addition of 21.95 lakh subscribers in May. Its market share was 40.71  in terms of wireless subscribers as of June 2024.Bharti AirtelThe telecom operator added 12.52 lakh subscribers in June compared to the addition of 12.50 lakh users in the previous month. Its market share was 33.23  in terms of wireless subscribers as of June 2024.Vodafone IdeaThe thirdlargest telecom operator lost 8.60 lakh subscribers in June 2024 compared to a loss of 9.24 lakh users in May. Its market share was 18.56  in terms of wireless subscribers as of June 2024.Bulk DealsZomatoAntfin Singapore Holding Pte a part of Alibaba sold a 1.05  stake each in the food delivery giant at an average price of Rs 257.46 per share and Rs 257.17 per share respectively.HG Infra EngineeringAditya Birla Sun Life Mutual Fund bought a 0.75  stake and TATA Mutual Fund picked up a 0.73  stake in the company at an average price of Rs 1566.50 per share. However promoters Girishpal Singh Family Trust Harendra Singh Family Trust and Vijendra Singh Family Trust sold a 2.76  stake in the company at the same price.Krishna Institute of Medical SciencesSBI Life Insurance Company bought a 0.97  stake in the company at an average price of Rs 2373.30 per share while India Advantage Fund S4I sold a 0.89  stake in the company at the same price.Sicagen IndiaPromoter AMI Holdings bought a 0.98  stake in the company at an average price of Rs 69.94 per share.Eraaya LifespacesBridge India Fund bought a 0.9  stake in the company at an average price of Rs 800 per share.SME Listing on August 21Solve Plastic ProductsBroach Lifecare HospitalStocks Turn ExDividendEngineers India Bharat Bijlee Emami Paper Mills Gateway Distriparks Hindustan Aeronautics India Glycols ISGEC Heavy Engineering ITD Cementation KPI Green Energy Linc Credo Brands Marketing Pfizer Rajapalayam Mills Satia Industries Snowman Logistics Sumedha Fiscal Services Symphony Uniparts India Vidhi Specialty Food IngredientsStock Turns ExBuybackSymphonyStock Trades ExDate for BonusSpraykingStock Trades ExDate for Spin OffRDB Realty   InfrastructureStocks Under F O BanNALCO Aarti Industries Aditya Birla Fashion and Retail Balrampur Chini Mills Bandhan Bank Birlasoft GNFC Granules India Hindustan Copper India Cements LIC Housing Finance Manappuram Finance Piramal Enterprises RBL Bank SAIL Sun TV Network",
    "Reliance Retail Ventures Limited (RRVL) is  well positioned  to serve the consumption needs of the fastgrowing economy according to the Chairman and Managing Director of Reliance Industries Mukesh Ambani. The world is now realising the enormous potential of India.  Invest in India  is being advocated globally. Reliance Retail s vision of inclusive development for millions of consumers and merchants coupled with the unprecedented growth of the Indian marketplace has resulted in marquee names investing in RRVL at a US  100 billion valuation milestone  Mukesh Ambani said in the annual report of Reliance Industries released on August 7.Reliance Retail undertook equity fund raise of Rs 17814 crore during FY24.ALSO READ  Reliance Retail clocks 28  jump in EBITDA in FY24 bets on partnerships acquisitions to fuel growthThe company s  New Commerce  initiative is also playing an important role in supporting small indigenous merchants and kirana shop owners. This year the company introduced a  Swadesh  store promoting traditional art forms as well as artisans according to the annual report. We have always believed that the demand for India s ageold crafts is at par with prominent global brands and our belief has been vindicated by the overwhelming response to our Swadesh stores  Ambani said.According to Ambani working population soaring to 450 million and household incomes on an upward trajectory are enabling the growth of the company.  With increase in disposable income the demand for goods and services is expanding rapidly. As India s largest retailer Reliance Retail is perfectly positioned to serve the consumption needs of our fastgrowing economy  he said.The annual report also stated RRVL s objective to strengthen the endtoend value chain to serve the fast fashion opportunity leveraging growing demand for premium and luxury products in India and scaling up their brands and formats. Reliance Retail s commitment to the Indian retail sector is evident through the substantial investments made across the retail value chain over the years. Reliance Retail remains steadfast to innovation across formats and products to improve customer experience and serve evolving consumer needs  the annual report added.The Indian retail market is one of the fastestgrowing markets in the world and is expected to cross  1.4 trillion by 2027. Rising demand for premium and luxury products further fuels this growth trajectory reflecting the evolving preferences with rising disposable incomes.        ",
    "Reliance Retail posted doubledigit earnings growth in the year ended March 31 despite sluggish domestic consumption.Gross revenue rose 18 percent to Rs 3.1 lakh crore from the previous year and EBITDA surged 28.4 percent to Rs 23082 crore as Reliance Retail continued its robust profit growth trajectory.The operator of Reliance Digital stores ended FY24 with 18836 retail stores spread over 79 million sq. ft. which caters to more than 300 million registered customers.Also Read   Reliance Industries  capital expenditure fell 7  in FY24 EBITDA rose by 16 During the year gone by Reliance Retail completed several strategic partnerships and acquisitions to strengthen its capabilities. It acquired the Sephora India franchise  the IP rights for Superdry for India Sri Lanka and Bangladesh  the India business of Kiko Milano  and a majority stake in EdaMama among the notable ones.In its annual report Reliance Industries noted that the Indian retail market is one of the fastest growing in the world and is expected to cross  1.4 trillion by 2027.Rising demand for premium and luxury products further fuels this growth trajectory reflecting the evolving preferences with rising disposable incomes.Therefore two key opportunities for Reliance Retail are both to focus on strengthening the endtoend value chain to serve the fast fashion opportunity while also catering to the growing demand for premium and luxury products in India.A key strength for the firm to achieve this is the wide portfolio of brands that make Reliance Retail a partner of choice as the firm is the largest omnichannel retailer with integrated stores digital and new commerce platforms.Reliance Retail India s largest retailer operates an integrated network of stores and digital commerce platforms catering to diverse consumer needs across electronics fashion grocery and connectivity consumption baskets.",
    "Mukesh Ambani the chairman of India s most valuable company Reliance Industries Ltd did not draw a salary from his oiltotelecomandretail conglomerate for the fourth straight year while his children earned sitting fees and a commission for being on the board.The 67yearold billionaire capped his annual remuneration at Rs 15 crore from FY09 to FY20 to set a personal example of salaries at higher managerial positions.In FY21 Ambani opted to forgo his salary after Covid19 pandemic hit the world. He decided against drawing any salary until the company and all its businesses were fully back to their earnings potential.In FY24 he received  nil  salary allowances and perquisites as well as retiral benefits according to the latest annual report of the company.Ambani who has been on the board of Reliance since 1977 and was elevated as chairman of the company after the death of his father and group patriarch Dhiburhai Ambani in July 2002 was just last year reappointed as the head of Reliance for another fiveyear term till April 2029. He shall however be entitled to reimbursement of expenses incurred for travelling boarding and lodging including for spouse and attendant(s) during business trips and provision of car(s) for use on company s business and communication expenses at residence shall be reimbursed at actuals and not considered as perquisites  the special resolution seeking shareholder nod for his reappointment said last year. The company shall arrange to provide security to Ambani and his family members and the expenses borne by the company for the same shall not be considered as perquisites.With a net worth of  109 billion Ambani is the 11th richest person in the world.Executive director PMS Prasad saw his remuneration rise to Rs 17.93 crore. He drew Rs 13.50 crore in 202223 including performancelinked incentives for 202122 which were paid in 202223. In 202122 he drew Rs 11.89 crore.Mukesh Ambani s three children Isha Akash and Anant were appointed to the board in October last year at nil salary. They received Rs 4 lakh each as sitting fee and Rs 97 lakh as commission.Other nonexecutive directors include Adil Zainulbhai Raminder Singh Gujral Shumeet Banerji former SBI chairperson Arundhati Bhattacharya former CVC K V Chowdary veteran banker K V Kamath and Saudi sovereign wealth fund nominee Yasir Othman H Al Rumayyan.All independent directors got Rs 2.25 crore commission (up from Rs 2 crore in 202223) and sitting fees.With PTI inputsDisclosure    is a part of the Network18 group. Network18 is controlled by Independent Media Trust of which Reliance Industries is the sole beneficiary. ",
    "Reliance Industries Ltd said it has strengthened its balance sheet by securing funds at competitive rates to finance capital expenditures facilitate business expansion and refinance existing debts despite challenging market conditions. RIL and its subsidiaries successfully raised financing across various markets currencies and financial products at competitive cost to finance capital expenditure support business expansion and refinance maturing debt  the company said in its annual report on August 7.RIL issued 10year nonconvertible debentures worth Rs 20000 crore in FY24 it said.  The NCDs were issued at rates which were RIL s lowest coupon ever and at the tightest spread over sovereign credit  the annual report said.Furthermore RIL secured loans worth  4.45 billion through two deals in FY24 including a  2 billion secured by Reliance Jio Infocom Ltd (RJIL) to finance capital expenditure and  2.45 billion to refinance maturing debt.RIL said its  2.35 billion syndicated term loan was wellsubscribed in the primary syndication market from global lenders across geographies.Mukesh Ambani chairman and managing director of RIL on August 7 also said that RIL now ready for the next level of growth after consolidating its balance sheets in FY24. Our constant endeavour to find solutions for India and Indians has helped us spot multiple growth opportunities that have expanded our business portfolio. This portfolio now enables us to touch the lives of millions of Indians through multiple products and offerings  Mukesh Ambani said.Reliance Industries reported a consolidated EBITDA of Rs 1.79 lakh crore for FY24 with net profit at Rs 79020 crore.The company also partnered with Export Credit Agencies (ECA) of Finland Canada and South Korea to raise funding for  2.83 billion equivalent during the year.Reliance Jio also secured  2.2 billion in funding from the Finnish Export Credit Agency (Finnvera) and Canadian Export Credit Agency to finance equipment and services for its panIndia 5G rollout.Similarly RIL tied up with the Korean Export Credit Agency for debt worth  625 million to finance the purchase of floating production storage and offloading vessels in its oil   gas business.",
    "Reliance Industries Ltd reported a 7 percent reduction in capital expenditure in FY24 with spending falling to Rs 1.32 lakh crore ( 15.8 billion) from Rs 1.42 lakh crore in the previous fiscal year according to the company s annual report released on August 7.The company spent on network expansion in the digital services segmentscaling up the retail business boosting oil and gas production capacities and oiltochemical projects. RIL said the capex spending was fully covered by internal cash generation. Reliance has consolidated its balance sheet after the previous round of capex and is ready for the next level of growth  Mukesh AmbaniChairman and Managing Director of RIL wrote in the annual report.Easing capital expenditure helped improve the operational performance of the Indian conglomerate with its consolidated EBITDA rising by 16.1 percent to Rs 1.79 lakh crore from Rs 1.54 lakh crore in FY23.Also Read   Reliance Industries Q1 earnings  Revenue climbs 11.5  boosted by telecom retail and oil   gas businessesThe growth was driven by a 28.4 percent EBITDA increase in the retail segment which benefited from improved operating leverage higher footfalls and growth in digital channels. The digital services segment also saw a 12.7 percent EBITDA increase due to higher revenue from an expanded subscriber base and increased customer engagement.Similarly EBITDA for the oiltochemical segment also grew albeit marginally from the previous year supported by stronger transportation fuel cracks though global downstream chemical margins were weak and a major planned turnaround at the Jamnagar complex impacted results. The oil and gas segment s EBITDA surged by 49 percent driven by a 57 percent rise in gas production from the KGD6 block.RIL said it remains committed to creating sustainable value for its stakeholders through disciplined capital allocation appropriate leverage and optimal resource utilisation.The company said it aims to enhance its resilience and agility in adapting to evolving market conditions.  RIL will actively monitor financial markets to seize capitalraising opportunities that support its growth plans while maintaining a strong focus on financial discipline and risk management  the annual report mentioned.Also Read   Reliance Industries now 86th on Fortune 500 list sets Aug 29 as date for 47th AGMDisclosure    is a part of the Network18 group. Network18 is controlled by Independent Media Trust of which Reliance Industries is the sole beneficiary.",
    "Reliance Industries Limited (RIL) which is the 86th company on the Fortune Global 500 list has scheduled its 47th Annual General Meeting (AGM) at 2pm on August 29. Chairman Mukesh Ambani will address shareholders at the event.The company announced that if a dividend is declared at the AGM it will be paid within a week. August 19 has been set as the record date for determining the dividend eligibility.The meeting will be broadcast live through videoconferencing and other audiovisual means complying with the guidelines from the Ministry of Corporate Affairs and the Securities and Exchange Board of India.The previous AGM was held on August 28 shortly after Jio Financial Services  listing on India s stock exchanges.RIL recently climbed to the 86th position on the Fortune Global 500 list for 2024 from 88th spot and making a significant jump of 69 places over the past three years. This year is the 21st consecutive year RIL has been part of the list the longest for any Indian private sector company. The Fortune Global 500 ranks companies by total revenues for fiscal years ending on or before March 31 2024.RIL concluded FY24 with recordhigh consolidated revenues of Rs 1000122 crore a 2.6 percent increase yearonyear and an EBITDA of Rs 178677 crore up 16.1 percent yearonyear with substantial growth across its various business segments.Disclosure    is a part of the Network18 group. Network18 is controlled by Independent Media Trust of which Reliance Industries is the sole beneficiary. ",
    "The benchmark indices closed flat after a smart recovery from the day s low and formed a bullish candlestick pattern on the daily charts signaling hope for a further bounce amid consolidation. About 1213 shares declined against 1138 advancing shares on the NSE. If the index continues to hold 24400 then 2450025600 can t be ruled out in the coming sessions but failure can drag it down towards 24200 the immediate support. Here are some trading ideas for the near term Amol Athawale VPTechnical Research at Kotak SecuritiesReliance Industries   CMP  Rs 2984.8After the remarkable up move in recent weeks Reliance Industries witnessed profit booking at higher levels. Post the recent selloff in the counter the downward momentum had stopped. On daily charts the counter has found support near its important retracement zone. The formation suggests a revival of the uptrend from the current levels in the coming horizon.Strategy  BuyTarget  Rs 3180StopLoss  Rs 2870Berger Paints   CMP  Rs 530.3On the weekly charts Berger Paints is in a rising channel chart formation with a higher low series pattern. Additionally the stock has formed an Inverse Head and Shoulders chart pattern on the daily scale and is trading near the neckline resistance zone. The texture of the stock indicates a likely breakout move and fresh leg of upward momentum from the current levels in the near term.Strategy  BuyTarget  Rs 570StopLoss  Rs 510FSN ECommerce Ventures (Nykaa)   CMP  Rs 181.88Nykaa is trading in a symmetrical triangle chart formation on the weekly scale which clearly suggests bullish momentum is likely to remain in the short term. In addition the stock has formed a higher bottom formation on the daily chart indicating good strength in the counter for a fresh breakout move in the coming horizon.Strategy  BuyTarget  Rs 195StopLoss  Rs 175Chandan Taparia Head  Equity Derivatives   Technicals Broking   Distribution at Motilal Oswal Financial ServicesSun Pharmaceutical Industries   CMP  Rs 1665.8Sun Pharma has retested a breakout on the daily chart and inched higher. The stock is holding gains at higher zones as every small decline is being bought into. Buying is visible across the pharma space which may support the ongoing up move.Strategy  BuyTarget  Rs 1770StopLoss  Rs 1620Tata Motors   CMP  Rs 1091Tata Motors has given a consolidation breakout of the past 20 weeks and a range breakout on the daily scale. The breakout is supported by a surge in delivery and trading volumes which may take prices higher.Strategy  BuyTarget  Rs 1170StopLoss  Rs 1050Petronet LNG   CMP  Rs 365.35Petronet has given a channel breakout on the daily scale with noticeable volumes. It is perfectly respecting the 20 DEMA (Days Exponential Moving Average) and momentum indicator RSI (Relative Strength Index) is positively placed which may take prices higher.Strategy  BuyTarget  Rs 385StopLoss  Rs 355Mandar Bhojane Equity Research Analyst at Choice BrokingQuess Corp   CMP  Rs 712.2Quess Corp is ready for a breakout of the Cup and Handle pattern on the daily chart with a significant increase in trading volume indicating a potential breakout. If the price manages to close above Rs 715 level it may have the potential to reach shortterm targets of Rs 990   Rs 1000. On the other hand immediate support levels are located at Rs 600. These levels can be considered opportunities to buy on dips. The RSI currently stands at 69.92 and is trending upward indicating increasing buying momentum.Strategy  buyTarget  Rs 990 Rs 1000StopLoss  Rs 560Multi Commodity Exchange of India   CMP  Rs 4183.8MCX has recently seen a breakout of range on the daily chart with a significant increase in trading volume indicating a potential breakout. If the price manages to close above the Rs 4190 level it may have the potential to reach shortterm targets of Rs 5000   Rs 5400. On the other hand the immediate support levels are located at Rs 3800. These levels can be considered opportunities to buy on dips. The RSI currently stands at 62 and is trending upward indicating increasing buying momentum.Strategy  BuyTarget  Rs 5000 Rs 5400StopLoss  Rs 3600Indian Oil Corporation   CMP  Rs 176.85IOC is ready for a breakout of the ascending triangle on the daily chart with a significant increase in trading volume indicating a potential breakout. If the price manages to close above the Rs 178 level it may have the potential to reach shortterm targets of Rs 195   Rs 200. On the other hand immediate support levels are located at Rs 164. These levels can be considered opportunities to buy on dips. The RSI currently stands at 61.35 and is trending upward indicating increasing buying momentum.Strategy  BuyTarget  Rs 195 Rs 200StopLoss  Rs 160Mitesh Karwa Research Analyst at Bonanza PortfolioSyngene International   CMP  Rs 786.8On the weekly time frame Syngene International has given a breakout of a bullish pattern and made a big body bullish candlestick indicating bullish strength. On the indicator front the stock is sustaining comfortably above all its important EMAs and Ichimoku cloud support indicates strength on the upside. The momentum indicator RSI is above 50 levels which is showing strong buying interest in the script.Strategy  BuyTarget  Rs 867StopLoss  Rs 763",
    "Net Sales at Rs 231784.00 crore in June 2024 up 11.67  from Rs. 207559.00 crore in June 2023.Quarterly Net Profit at Rs. 15138.00 crore in June 2024 down 5.45  from Rs. 16011.00 crore in June 2023.EBITDA stands at Rs. 42748.00 crore in June 2024 up 2.01  from Rs. 41906.00 crore in June 2023.Reliance EPS has decreased to Rs. 22.37 in June 2024 from Rs. 23.66 in June 2023.Reliance shares closed at 3110.30 on July 19 2024 (NSE) and has given 13.73  returns over the last 6 months and 9.45  over the last 12 months.",
    "Net Sales at Rs 129898.00 crore in June 2024 up 10.9  from Rs. 117136.00 crore in June 2023.Quarterly Net Profit at Rs. 7611.00 crore in June 2024 down 21.75  from Rs. 9726.00 crore in June 2023.EBITDA stands at Rs. 17817.00 crore in June 2024 down 7.47  from Rs. 19256.00 crore in June 2023.Reliance EPS has decreased to Rs. 11.25 in June 2024 from Rs. 14.38 in June 2023.Reliance shares closed at 3110.30 on July 19 2024 (NSE) and has given 13.73  returns over the last 6 months and 9.45  over the last 12 months.",
    "Here s a quick look at stocks likely to be in focus in Monday s trade covering quarterly earnings order wins and fundraising announced by companies after market hours on Friday and over the weekend Results TodayIDBI Bank Suzlon Energy Allied Blenders and Distillers Coforge Cyient DLM Dodla Dairy Fortis Malar Hospitals Indian Overseas Bank Jana Small Finance Bank Mahindra Logistics Mangalore Refinery   Petrochemicals Solara Active Pharma Sciences Spencers Retail Supreme Industries UCO Bank and Zensar Technologies will announce quarterly earnings on July 22.Quarterly EarningsReliance Industries Q1 (Consolidated YoY)Profit at Rs 17448 crore Vs Rs 18182 croreRevenue grows 11.5  to Rs 257823 crore Vs Rs 231132 croreEBITDA rises 2  to Rs 42748 crore Vs Rs 41906 croreEBITDA margin at 16.6  Vs 18.1 Jio Platforms profit jumps 11.7  to Rs 5698 crore Vs Rs 5101 croreJio Platforms revenue rises 12.8  to Rs 34548 crore Vs Rs 30640 croreReliance Retail Ventures profit increases 4.6  to Rs 2549 crore Vs Rs 2436 croreReliance Retail Ventures revenue climbs 8.1  to Rs 75615 crore Vs Rs 69948 croreOil to chemicals revenue spikes 18.1  to Rs 157133 crore Vs Rs 133031 croreOil   gas revenue surges 33.4  to Rs 6179 crore Vs Rs 4632 croreHDFC Bank Q1 (Standalone QoQ)Profit falls 2  to Rs 16174.8 crore Vs Rs 16511.85 croreRevenue rises 2.6  to Rs 29837.1 crore Vs Rs 29076.8 croreProvisions falls sharply to Rs 2602 crore Vs Rs 13511.6 croreGross NPA ratio increases to 1.33  Vs 1.24 Net NPA ratio rises to 0.39  Vs 0.33 Wipro Q1 (Consolidated QoQ)IT services revenue declines 0.8  to Rs 21896.3 crore Vs Rs 22079.6 croreIT services EBIT falls 0.4  to Rs 3605.7 crore Vs Rs 3619.5 croreMargin rises 10 bps to 16.5  Vs 16.4 Dollar revenue down 1.2  to USD 2625.9 million Vs USD 2657.4 millionCompany expects revenue from IT services business to be in range of  26002652 million in Q2 Vs Q1Kotak Mahindra Bank Q1 (Standalone YoY)Profit surges 81  to Rs 6249.8 crore Vs Rs 3452.3 croreRevenue rises 9.8  to Rs 6842.4 crore Vs Rs 6233.7 croreProvisions jump to Rs 578.5 crore Vs Rs 364.3 croreGross NPA ratio flat at 1.39  Vs 1.39  (QoQ)Net NPA ratio rises to 0.35  Vs 0.34  (QoQ)Union Bank of India Q1 (Standalone YoY)Profit increases 13.7  to Rs 3679 crore Vs Rs 3236 croreNet interest income grows 6.5  to Rs 9412 crore Vs Rs 8840 croreGross NPA ratio falls to 4.54  Vs 4.76  (QoQ)Net NPA ratio declines to 0.90  Vs 1.03  (QoQ)Yes Bank Q1 (Standalone YoY)Profit grows 46.7  to Rs 502 crore Vs Rs 343 croreNet interest income increases 12.2  to Rs 2244 crore Vs Rs 2000 croreGross NPA ratio flat at 1.7  Vs 1.7  (QoQ)Net NPA ratio drops to 0.5  Vs 0.6  (QoQ)JSW Steel Q1 (Consolidated YoY)Profit plunges 64.3  to Rs 867 crore Vs Rs 2428 croreRevenue rises 1.7  to Rs 42943 crore Vs Rs 42213 croreEBITDA declines 21.8  to Rs 5510 crore Vs Rs 7046 croreMargin dips 390 bps to 12.8  Vs 16.7 RBL Bank Q1 (Standalone YoY)Profit jumps 29  to Rs 372 crore Vs Rs 288 croreNet interest income increases 20  to Rs 1700 crore Vs Rs 1422 croreNet interest margin improves to 5.67  Vs 5.53 Gross NPA ratio rises to 2.69  Vs 2.65  (QoQ)Net NPA ratio flat at 0.74  Vs 0.74  (QoQ)JK Cement Q1 (Consolidated YoY)Profit jumps 66.9  to Rs 184.8 crore Vs Rs 110.7 croreRevenue rises 1.6  to Rs 2807.6 crore Vs Rs 2762.6 croreJSW Energy Q1 (Consolidated YoY)Profit surges 84  to Rs 534.2 crore Vs Rs 290.4 croreRevenue declines 1.7  to Rs 2879.5 crore Vs Rs 2927.9 crorePatanjali Foods Q1 (Standalone YoY)Profit zooms 199.6  to Rs 262.9 crore Vs Rs 87.8 croreRevenue falls 7.6  to Rs 7173 crore Vs Rs 7767.1 croreCreditAccess Grameen Q1 (Standalone YoY)Profit increases 14.8  to Rs 397.7 crore Vs Rs 346.3 croreRevenue rises 28.7  to Rs 926.8 crore Vs Rs 720.3 croreRoute Mobile Q1 (Consolidated YoY)Profit declines 11.5  to Rs 81.2 crore Vs Rs 91.7 croreRevenue rises 14  to Rs 1103.4 crore Vs Rs 967.3 croreICICI Lombard General Insurance Company Q1 (YoY)Profit spikes 48.7  to Rs 580.4 crore Vs Rs 390.4 croreGross premium written grows 19.8  to Rs 7931 crore Vs Rs 6622.1 croreCombined ratio at 102.3  Vs 103.8 Oberoi Realty Q1 (Consolidated YoY)Profit surges 81.7  to Rs 584.5 crore Vs Rs 321.6 croreRevenue jumps 54.4  to Rs 1405.2 crore Vs Rs 910 croreNippon Life AMC Q1 (Consolidated YoY)Profit zooms 41  to Rs 332.3 crore Vs Rs 235.7 croreRevenue increases 42.6  to Rs 505 crore Vs Rs 354.2 croreIndian Hotels Q1 (Consolidated YoY)Profit rises 10.2  to Rs 260.2 crore Vs Rs 236 croreRevenue increases 5.7  to Rs 1550.2 crore Vs Rs 1466.4 croreRPG Life Sciences Q1 (YoY)Profit grows 21.1  to Rs 26.8 crore Vs Rs 22.1 croreRevenue increases 11.9  to Rs 165.4 crore Vs Rs 147.8 croreSupreme Petrochem Q1 (YoY)Profit zooms 76.1  to Rs 121.9 crore Vs Rs 69.3 croreRevenue jumps 28.4  to Rs 1573.5 crore Vs Rs 1225.1 croreTejas Networks Q1 (Consolidated QoQ)Profit sinks 47.2  to Rs 77.5 crore Vs Rs 146.8 croreRevenue grows 17.8  to Rs 1562.8 crore Vs Rs 1326.9 croreStocks To WatchIndian Railway Catering and Tourism CorporationThe Government of India announced the upgradation of IRCTC from  Schedule B  to  Schedule A  category Central Public Sector Enterprises (CPSE).EMSThe company has received a Letter of Acceptance from the Uttarakhand Urban Sector Development Agency for the Development of Water Supply and Sewerage System in Vikas Nagar Dehradun. The order value is Rs 535.19 crore with EMS holding a 95  share along with another joint venture partner for an 18year operation and maintenance (O M) period.VedantaThe company closed its Qualified Institutions Placement (QIP) issue raising Rs 8500 crore by selling 19.31 crore equity shares at Rs 440 per share. Institutional investors including Morgan Stanley Societe Generale SBI MF Nippon MF ICICI Mutual Funds and Copthall Mauritius Investment participated.JSW InfrastructureIndia s secondlargest private commercial port operator acquired the Under Development Slurry Pipeline Project from JSW Utkal Steel a whollyowned subsidiary of JSW Steel for Rs 1700 crore. They will enter a 20year longterm takeorpay agreement to transport iron ore through the pipeline.Allcargo GatiTotal volume including surface and air express stood at 100000 tonnes in June 2024 marking a marginal MoM decline of 3  and a YoY decline of 2 . The company reported a 1  improvement in yield compared to the previous month driven by a better product mix.Oil and Natural Gas CorporationONGC Videsh signed a definitive Sale Purchase Agreement (SPA) to acquire 0.615  participating interest in the offshore Azeri Chirag Gunashli (ACG) oil field in Azerbaijan from Equinor. Additionally it will acquire 0.737  shares of the Baku Tbilisi Ceyhan (BTC) pipeline company through its subsidiary ONGC BTC. The acquisitions totaling up to USD 60 million are expected to complete in the coming months.Anant RajSubsidiary Anant Raj Cloud entered into a Memorandum of Understanding with Google LLC to collaborate on providing data center infrastructure managed services and cloud platforms to public and private enterprises. They also plan to develop innovative technological solutions for potential customers.HDFC Life Insurance CompanyThe Assistant Commissioner of Income Tax Mumbai issued an income tax rectification order reducing tax and interest demand for Assessment Year 202021 to Rs 1868.12 crore down from the previous demand of Rs 4178.8 crore.Jubilant PharmovaFollowing an audit in April 2024 the US Food and Drug Administration (US FDA) classified Jubilant Draximage Inc s radiopharmaceutical manufacturing facility in Montreal Canada as Voluntary Action Indicated.Indian BankThe Central Government has extended the term of office for Shanti Lal Jain as MD   CEO of Indian Bank from September 1 2024 to December 31 2024.Power Finance Corporation (PFC)The board appointed Sandeep Kumar as Director (Finance) effective July 11.SME Listing on July 22Three M Paper Boards Prizor Viztech Sati Poly Plast Aelea CommoditiesBulk DealsIndiabulls Housing FinancePlutus Wealth Management LLP purchased 13.5 lakh partly paidup equity shares of the housing finance company at an average price of Rs 67.9 per share.Navkar CorporationStallion Asset purchased a 1.14  stake in the company at an average price of Rs 125.37 per share.Stocks Turn ExDividendExide Industries Carborundum Universal Bemco Hydraulics Chembond Chemicals DHP India Divgi Torqtransfer Systems Happy Forgings Indian Metals   Ferro Alloys Swelect Energy Systems Swelect Energy Systems Taparia Tools Voltamp Transformers Xpro IndiaStock Trades ExDate for SplitNHC FoodsF O BanBalrampur Chini Mills Bandhan Bank GMR Airports Infrastructure Hindustan Aeronautics Hindustan Copper India Cements Piramal Enterprises SAIL Vedanta",
    "HighlightsReliance Industries  (RIL) the Nifty 50 heavyweight demonstrated robust profitability and solid execution in the quarter ended June 2024. While gross revenues grew 11 percent yearonyear (YoY) consolidated operating profits came in nearly flat due to a dip in                                     ",
    "Reliance Industries which runs businesses spanning oil telecom and retail reported a resilient financial performance in the fiscal first quarter ended June 30 underscoring the strength of its diverse businesses. Consolidated EBITDA for the quarter improved from a year ago with strong contribution from consumer and upstream businesses offsetting weak O2C (oiltochemical) operating environment  Mukesh Dhirubhai Ambani Chairman and Managing Director said.Reliance stock gained more than 20 percent year to date to close Friday s session at Rs 3110.3 on the NSE.Here are top 10 key highlights 1) Bottom LineThe consolidated profit for the quarter came in at Rs 17448 crore declining 4 percent from Rs 18182 crore net recorded in the corresponding period of previous fiscal.Finance cost increased by 1.4 percent yearonyear to Rs 5918 crore primarily due to higher interest rates while depreciation rose by 15.5 percent to Rs 13596 crore during the same period on expanded asset base across all the businesses higher network utilisation in digital services business higher retail store count and rampup in upstream production Reliance said in the filing to exchanges.Tax expenses for the June quarter at Rs 5786 crore fell by 5.3 percent from Rs 6112 crore in the year earlier.2) Top LineThe Mukesh Ambaniowned company registered an 11.5 percent onyear growth in gross revenue at Rs 257823 crore for the quarter on higher oil   product prices and strong growth in oil   gas segment volumes. Steady growth in consumer businesses also contributed to increase in revenue it said.3) Operating PerformanceConsolidated EBITDA (earnings before interest tax depreciation and amortisation) for the first quarter of current fiscal year 2025 stood at Rs 42748 crore growing 2 percent over the yearago period as strong contribution from oil   gas and consumer business offset weak O2C.It reported EBITDA margin for the quarter at 16.6 percent declining from 18.1 percent in same period previous fiscal.4) Jio PlatformsJio Platforms which contributed 13.4 percent to its gross revenue has started the fiscal year 2025 with profit after tax at Rs 5698 crore in the June quarter growing 11.7 percent over a yearago period with Jio becoming the largest operator globally in terms of data traffic.Further the telecom operator continued to build on its market leadership with 33 percent YoY increase in data traffic while the 5G business accounted for over 31 percent of Jio s wireless data traffic. The digital services business registered an impressive financial performance yearonyear continuing its positive growth momentum  Mukesh Ambani said.Consolidated revenue increased by 12.8 percent to Rs 34548 crore during the quarter with the total subscriber base reaching 48.97 crore (up from 44.85 crore) including 13 crore 5G users. Now Jio is the largest 5G operator outside China.On the operating front EBITDA jumped 11.6 percent yearonyear to Rs 14638 crore primarily due to healthy revenue growth and operating leverage. The margin stood at 49.7 percent for the quarter against 50.2 percent in the same period previous fiscal.Average revenue per user (ARPU) at Rs 181.7 in Q1FY25 increased from Rs 180.5 in Q1FY24 with better subscriber mix partially offset by increasing mix of promotional 5G traffic being offered on an unlimited basis to subscribers and not charged separately.5) Reliance RetailMukesh Ambani said the retail business delivered robust financial results as compared to last year supported by all consumption baskets.Reliance Retail Ventures has registered revenue at Rs 75615 crore during the first quarter of FY25 increasing by 8.1 percent onyear and profit at Rs 2549 crore a 4.6 percent growth.The segment s EBITDA at Rs 5664 crore for the quarter grew by 10.5  yearonyear driven by an increase in footfalls and expansion of store footprint streamlining of operations driving margin improvement. The margin improved by 30 bps to 8.5 percent during the same period.Reliance said the retail business expanded its store network with 331 new store openings taking the total store count to 18918 with footfalls growing 18.9 percent YoY to over 29.6 crore.6) OiltoChemicalThe O2C segment which contributed nearly 61 percent to top line recorded a 18.1 percent yearonyear growth in revenue at Rs 1.57 lakh crore for the quarter ended June 30 primarily due to higher product prices tracking 9 percent increase in Brent crude oil prices and higher volumes supported by strong domestic demand.However its EBITDA was lower by 14.3 percent YoY to Rs 13093 crore on account of lower gasoline cracks and lower downstream chemical deltas. The margin was at 8.3 percent during the quarter against 11.5 percent in yearago period. The total throughput for the June FY25 quarter increased by half a percent to 19.8 MMT and the production meant for sale grew by 2.9 percent to 17.7 MMT compared to same period previous fiscal.7) Oil   GasThe oil and gas segment continued its growth trajectory with higher production offsetting lower yearonyear gas price realisations Ambani said.The segment recorded revenue for the quarter at Rs 6179 crore a 33.4 percent growth over the corresponding period of last fiscal led by higher volumes partly offset by lower price realisation from KG D6 and CBM field.Reliance said the average price realised for KG D6 gas was  9.27 per MMBTU (metric million British thermal unit) in Q1FY25 against  10.81 per MMBTU in Q1FY24. The average price realised for CBM gas was  11.59 per MMBTU against  14.15 per MMBTU during the same period.The segment s EBITDA increased by 29.8 percent to Rs 5210 crore on higher volumes from KG D6. However margin came in at 84.3 percent against 86.7 percent during the same period.8) Media BusinessReliance said two of the biggest viewerinterest events IPL and General Elections helped the media business record one of the strongest quarters for the Network18 Group in terms of consumer reach and engagement. However revenue from operations was down by 3 percent YoY to Rs 3141 crore due to IPL revenue being distributed across two quarters this year.The media segment posted loss at Rs 221 crore for the quarter against profit of Rs 1 crore in yearago period while the EBITDA stood at Rs 3 crore against Rs 108 crore during the same period.The IPL 2024 on JioCinema set new viewership benchmarks reaching 620 million viewers and News18 was the most tunedin news network during general elections and on the counting day.9) Green EnergyReliance has made significant progress on the implementation of New Energy Gigafactories. On completion these projects will provide India a worldclass integrated green energy ecosystem which can propel the next leg of sustainable growth Ambani said.10) Capital Expenditure and DebtCapital expenditure for the quarter ended June FY25 was Rs 28785 crore against Rs 39645 crore in the corresponding period of previous fiscal.The cash and cash equivalents increased to Rs 1.93 lakh crore for June FY25 quarter from Rs 1.92 lakh crore in June FY24 quarter while the net debt during the same period dropped to Rs 1.12 lakh crore from Rs 1.26 lakh crore.",
    "Here s a quick look at stocks likely to be in focus in Friday s trade covering quarterly earnings order wins and acquisitions announced by companies after market hours on Thursday Results TodayReliance Industries Wipro UltraTech Cement Bharat Petroleum Corporation JSW Steel Union Bank of India ICICI Lombard General Insurance Company One 97 Communications (Paytm) Patanjali Foods Aether Industries Atul BEML Land Assets Blue Dart Express CreditAccess Grameen Fedbank Financial Services Indian Hotels JSW Energy Jubilant Pharmova Mahindra EPC Irrigation Nippon Life India Asset Management Oberoi Realty Orissa Minerals Development Company PVR Inox Route Mobile RPG Life Sciences Supreme Petrochem Stanley Lifestyles Tejas Networks Transformers and Rectifiers (India) and Vipul Organics will release their quarterly earnings on July 19.Results on SaturdayHDFC Bank Kotak Mahindra Bank RBL Bank Yes Bank Poonawalla Fincorp Aarti Surfactants Arihant Capital Markets Can Fin Homes Gravita India JK Cement Kirloskar Pneumatic Motisons Jewellers Netweb Technologies India Rossari Biotech Seshasayee Paper   Boards Shakti Pumps Sportking India and Zenith Health Care will announce their quarterly results on July 20.Quarterly EarningsInfosys Q1 (Consolidated QoQ)Profit down 20.1  at Rs 6368 crore Vs Rs 7969 croreOther income drops 72  to Rs 733 crore Vs Rs 2619 croreRevenue grows 3.7  to Rs 39315 crore Vs Rs 37923 croreEBIT increases 8.8  to Rs 8288 crore Vs Rs 7621 croreMargin expands to 21.1  Vs 20.1 Revenue in dollar terms grows 3.3  to USD 4714 million Vs USD 4564 millionRevenue growth in constant currency terms at 3.6 Raises revenue growth forecast for FY25 to 34  from 13 Retains operating margin forecast for FY25 at 2022 L T Technology Services Q1 (Consolidated QoQ)Profit declines 8  to Rs 313.6 crore Vs Rs 340.9 croreRevenue slips 3  to Rs 2461.9 crore Vs Rs 2537.5 croreEBIT dips 10.4  to Rs 383.6 crore Vs Rs 428.2 croreMargin drops to 15.6  Vs 16.9 Revenue in dollar terms down 3.3  at  295.2 million Vs  305.1 millionRevenue in constant currency down 3.1 Tata Technologies Q1 (Consolidated YoY)Profit declines 15.4  to Rs 162 crore Vs Rs 191.5 croreRevenue rises 0.9  to Rs 1269 crore Vs Rs 1257.5 croreEBITDA down 7.7  at Rs 231.1 crore Vs Rs 250.5 croreMargin dips 170 bps to 18.2  Vs 19.9 Company partners with Arm to drive innovation in software defined vehicles (SDV)Persistent Systems Q1 (Consolidated QoQ)Profit drops 2.8  to Rs 306.4 crore Vs Rs 315 croreRevenue rises 5.7  to Rs 2737.2 crore Vs Rs 2590.5 croreEBIT grows 2.6  to Rs 384 crore Vs Rs 374.4 croreEBIT margin dips 50 bps to 14  Vs 14.5 South Indian Bank Q1 (Standalone YoY)Profit surges 45.4  to Rs 294.1 crore Vs Rs 202.4 croreNet interest income increases 7.2  to Rs 865.8 crore Vs Rs 807.7 croreGross NPA flat QoQ at 4.50 Net NPA falls QoQ to 1.44  Vs 1.46 Tanla Platforms Q1 (Consolidated YoY)Profit increases 4.3  to Rs 141.2 crore Vs Rs 135.4 croreRevenue grows 10  to Rs 1002.2 crore Vs Rs 911.1 croreCIE Automotive India Q1 (Consolidated YoY)Profit increases 1.3  to Rs 216.4 crore Vs Rs 213.6 croreRevenue drops 1.2  to Rs 2292.7 crore Vs Rs 2320.3 croreCEAT Q1 (Consolidated YoY)Profit jumps 7  to Rs 154.2 crore Vs Rs 144 croreRevenue increases 8.8  to Rs 3192.8 crore Vs Rs 2935.2 croreDalmia Bharat Q1 (Consolidated YoY)Profit rises 0.7  to Rs 145 crore Vs Rs 144 croreRevenue drops 0.2  to Rs 3621 crore Vs Rs 3627 croreSagar Cements Q1 (Consolidated YoY)Net loss narrows to Rs 28.4 crore Vs loss at Rs 39.8 croreRevenue rises 3.9  to Rs 560.6 crore Vs Rs 539.7 croreShoppers Stop Q1 (Consolidated YoY)Net loss at Rs 22.7 crore Vs profit at Rs 14.5 croreRevenue increases 7.6  to Rs 1069.3 crore Vs Rs 993.6 croreRallis India Q1 (YoY)Profit declines 23.8  to Rs 48 crore Vs Rs 63 croreRevenue rises 0.1  to Rs 783 crore Vs Rs 782 croreJSW Infrastructure Q1 (Consolidated YoY)Profit slips 8.9  to Rs 292.4 crore Vs Rs 320.9 croreRevenue jumps 15  to Rs 1009.8 crore Vs Rs 878.1 croreStocks To WatchDr Reddy s LaboratoriesThe pharma company signed a nonexclusive patent licensing agreement with Takeda Pharmaceutical Company to commercialize Vonoprazan tablets in India. Vonoprazan is a novel orally active potassiumcompetitive acid blocker (PCAB) used to treat reflux esophagitis and other acid peptic disorders.Tech MahindraThe company has approved a plan to merge its stepdown subsidiary vCustomer Philippines (Cebu) Inc. with its parent company vCustomer Philippines Inc. vCustomer Philippines Inc. is a wholly owned subsidiary of Tech Mahindra. The merger is subject to regulatory approvals in the country of incorporation.Zydus LifesciencesThe United States Food and Drug Administration (USFDA) has conducted an inspection at the company s injectables manufacturing facility at Jarod Gujarat from April 15 to April 23 this year. The USFDA has determined that the inspection classification of this facility is Official Action Indicated (OAI).GPT InfraprojectsThe company has received an order worth Rs 103 crore from NHAI New Delhi and Eastern Railway Kolkata. The contract is an enhancement of the existing contract with NHAI and Eastern Railway Kolkata.Dixon TechnologiesThe Competition Commission of India (CCI) has approved the acquisition of up to 56  shareholding of Ismartu India by Dixon Technologies.JTL IndustriesThe company has opened its qualified institutions placement (QIP) issue on July 18. The floor price has been fixed at Rs 221.57 per share.Tata Consumer ProductsThe Capital Raising Committee of the board will meet on July 23 to consider the rights issue price and related payment mechanisms rights entitlement ratio the record date and the timing of the issue. The board had approved a rights issue worth Rs 3000 crore in January 2024.Vodafone IdeaThe Capital Raising Committee of the board has approved the second tranche of the allotment of 415202701 equity shares worth Rs 614.5 crore at an issue price of Rs 14.80 per share to Nokia Solutions and Networks India and Ericsson India vendors of the company on a preferential basis.Grindwell NortonAfter the retirement of Keki Elavia Independent Director the board has recommended the appointment of Subodh Nadkarni Independent Director as the Chairman of the board of directors of the company.Bulk DealsIndiabulls Housing FinancePlutus Wealth Management LLP has bought 6170064 partly paid up equity shares in the company at an average price of Rs 70.61 per share valuing the transaction at Rs 43.57 crore.India CementsSociete Generale sold a 0.56  stake in the cement company at an average price of Rs 342.66 per share.SME Listing on July 19Sahaj SolarStocks Turn ExDividendTata Consultancy Services Kotak Mahindra Bank Life Insurance Corporation of India Tech Mahindra Union Bank of India Abbott India Apcotex Industries Arvind Bajaj Electricals Blue Star Bosch Chennai Petroleum Corporation Cholamandalam Investment and Finance Company Cummins India Dabur India Delta Corp Dhanuka Agritech Graphite India Gujarat Containers Hitech Corporation ICRA Indian Hume Pipe JSW Infrastructure Lloyds Engineering Works Laxmi Organic Industries Mangalam Cement PDS Precision Camshafts RS Software India SaintGobain Sekurit India Shanthi Gears Shree Digvijay Cement Sumitomo Chemical India Transport Corporation of India Zensar Technologies Zydus WellnessStock Trades ExDate for SplitElecon Engineering CompanyStocks Trade ExDate for RightsJaykay Enterprises Shrydus IndustriesF O BanBandhan Bank Hindustan Aeronautics India Cements SAIL Balrampur Chini Mills GMR Airports Infrastructure GNFC Hindustan Copper Piramal Enterprises RBL Bank Vedanta",
    "HighlightsAvenue Supermarts (DMart  CMP  Rs 4950  Market cap  Rs 322113 crore  Rating  Equalweight) has posted a lowerthanexpected margin performance in Q1FY25. While gross margins improved owing to a pickup in the general merchandise and apparel category higher operating costs led to flat EBIDTA margins year on year (YoY).Going forward robust network expansion and a pickup in the performance of mature stores                                     ",
    "Jio Financial Services has secured Reserve Bank of India s approval to convert into a core investment company (CIC) from a nonbank financial company it said in a stock exchange filing.In November Jio Financial the financial services arm of Reliance Industries Ltd (RIL) applied to become a CIC after the banking regulator directed the conversion following its demerger from RIL and a change in its shareholding pattern.A CIC acts as a holding entity primarily managing the shares and securities of its group companies. With the transition Jio Financial Services could streamline its diverse business verticals spanning lending asset management insurance and more into distinct entities under the CIC umbrella.Also Read  Reliance Jio IPO may get over Rs 9 lakh crore valuation says JefferiesUnlike traditional NBFCs which engage in various financial activities Jio Financial Services  subsidiaries perform various functions from payroll and insurance to asset management and lending. This diversity does not align with the categories defined for pureplay NBFCs.A CIC by regulatory definition must have an asset size greater than Rs 100 crore and must hold at least 90 percent of its net assets in investments such as equity shares preference shares bonds debentures or loans in group companies. This structure allows for efficient capital deployment across subsidiaries ensuring each vertical receives the necessary resources for growth.The transformation to a CIC structure would enable Jio Financial Services to delineate the financials and operations of each subsidiary enabling better value discovery for investors. Moreover the CIC model aligns better with regulatory frameworks providing a more compliant and streamlined operational structure. As a CIC Jio Financial Services can focus on efficiently allocating capital to its subsidiaries.Jio Financial Services was listed on stock exchanges in August 2023 under the price discovery method after RIL spun off its financial services business arm.Disclosure    is a part of the Network18 group. Network18 is controlled by Independent Media Trust of which Reliance Industries is the sole beneficiary.",
    "Brokerage Morgan Stanley said Reliance Industries Ltd could boost its market capitalisation by as much as  100 billion in its fourth monetisation cycle driven by new cash flow streams and improved valuation multiples.Over the past three decades RIL has delivered 23x returns for shareholders with each decade adding over  60 billion in market value.Based on these projections Morgan Stanley which has an  overweight  rating on RIL has raised its target price for the stock by over 16 percent to Rs 3540 indicating a potential upside of around 13.5 percent from the previous closing price.Morgan Stanley believes RIL s fourth monetisation cycle will be driven by telecom tariff hikes revenue from its new energy business an upcycle in chemicals and the backend integration of its retail business.This marks a significant shift from previous cycles which heavily relied on oil and petrochemicals indicating a move towards consumer and technology sectors. RIL has been a  show me  story for the past decade and has seen significant market cap inflection once new revenue streams such as new energy higher telecom tariffs and chemical margins have been delivered  Morgan Stanley stated.Follow our live blog for all the market actionAccordingly the brokerage forecasted a 12 percent compounded annual growth in RIL s earnings per share between FY24 and FY27 driven by the company s investments in new energy and retail expansion which will help capture market share from the unorganised sector.Further Morgan Stanley has marginally raised its FY25 earningsperstock (EPS) estimates for RIL by 7 percent for FY26 and by 8 percent for FY27 factoring in recent telecom tariff hikes higher oil prices and improved refining margins.Morgan Stanley also noted that RIL s valuation multiples have varied across past investment cycles with the company s return on equity (RoE) expected to surpass the cost of capital as it transitions to a more profitable sustainable and less cyclical growth model due to changes in both business and capital structure.At 12.37 pm shares of RIL were trading marginally higher at Rs 3135.55 on the NSE.Also Read   RIL becomes first Indian company to cross Rs 21 lakh crore mcapDisclosure    is a part of the Network18 group. Network18 is controlled by Independent Media Trust of which Reliance Industries is the sole beneficiary.",
    "Telecom stocks are in focus on June 27 a day after an auction of radiowaves that carry voice and data signals for mobile phones ended garnering less than 12 percent of the Rs 96238 crore minimum value that the government had estimated for the spectrum on offer. The auction concluded with the majority bids for renewals and some for capacity expansions.The participation in this spectrum auction was largely driven by the renewals of the expiring spectrum in the 900 MHz and 1800 MHz bands  coupled with some purchases in the 2100 MHz and 2500 MHz bands to strengthen the network.  Apart from these there was no activity in other bands  said Ankit Jain Vice President and Sector Head  Corporate Ratings ICRA.Bharti Airtel emerged as the top bidder in the recent spectrum auction securing around 60 percent of the Rs 11341 crore worth of radio waves sold. Airtel acquired airwaves worth Rs 6856.76 crore.At 9 21 am Bharti Airtel shares were trading half a percent down at Rs 1452.85 apiece on the National Stock Exchange (NSE).Follow our market blog to catch all the live actionBharti Airtel and Vodafone Idea successfully renewed their expired spectrum in the 900 MHz and 1800 MHz bands. Additionally telcos acquired an extra 87.2 MHz worth Rs 6164.88 crore to enhance their services.The unsold spectrum will be put up for auction again next time. Available spectrum in various bands including 800 MHz 900 MHz and others were offered in this auction.Reliance Jio obtained spectrum valued at Rs 973.62 crore. Shares of Jio parent Reliance Industries (RIL) were also down nearly half a percent at Rs 3014.55 apiece on NSE. JPMorgan reiterated an overweight (OW) rating on RIL stock and raised the target price to Rs 3320.Also Read   Bharti Airtel acquires 97 MHz spectrum through auction for Rs 6857 croreThe brokerage highlighted that expectations of a tariff increase are bolstering the telecom sector which should now be factored into future forecasts.Analysts at JPMorgan anticipate that any upside following the upgrade in telecom expectations will necessitate a higher valuation for Reliance Retail. Additionally it emphasised that a significant improvement in topline growth in the first quarter will be pivotal.Vodafone Idea secured spectrum worth Rs 3510.4 crore. According to Motilal Oswal Vodafone Idea can opt for either 20 equal installments (of Rs 350 crore each) or upfront payment of minimum of two years and then installments for the remaining 18 years.This can increase Vodafone Idea s debt by 1.4 percent to Rs 2.3 lakh crore. The annual installment (of Rs 350 crore) will be 2.7 percent of its Ebitda. The stock was trading 0.8 percent higher at Rs 18.17 on NSE.Also Read   Jio invests Rs 973.63 crore for spectrum expansion in Bihar West BengalBharti Hexacom made an unexpected acquisition of spectrum valued at Rs 1000 crore in ongoing auctions a move expected to enhance its data services. Shares of the recently listed firm fell over 3 percent to Rs 1216.50 on NSE. Jefferies has downgraded the stock to a hold rating with a target price of Rs 1290.Analysts project a maintained revenue and EBITDA compound annual growth rate (CAGR) of 17 percent and 23 percent respectively for FY2427. However earnings estimates have been reduced by 4 percent to account for the spectrum acquisition costs. Despite doubling since its April IPO the stock is currently trading at a multiple of 16x EV EBITDA.",
    "The market maintained its recordhigh spree on June 26 despite mixed trends in global peers and weak breadth. About 1269 shares declined and 1032 shares advanced on the NSE. The bullish momentum is likely to continue with the Nifty climbing to 2400024200 levels in the immediate term with immediate support at 23700. Here are some trading ideas for the near term Jatin Gedia Technical Research Analyst Capital Market Strategy at Sharekhan by BNP ParibasDabur India   CMP  Rs 601.8Dabur India has been consolidating for the last three weeks and has now reached the support zone of Rs 600590 where the 20day moving average is placed. The daily momentum indicator has reached the equilibrium line suggesting that the correction phase is complete and a new cycle on the upside can start. We expect the stock to target levels of Rs 620629 from a shortterm perspective.Strategy  BuyTarget  Rs 620 Rs 629StopLoss  Rs 600 Rs 590Mahanagar Gas   CMP  Rs 1499.85Mahanagar Gas has formed a Triangle pattern on the hourly charts and we expect it to break out on the upside. The daily and hourly momentum indicators show a positive crossover which is a buy signal. We expect a target of Rs 1529   Rs 1565 from a shortterm perspective. A stoploss of Rs 1460 should be maintained for long positions.Strategy  BuyTarget  Rs 1529 Rs 1565StopLoss  Rs 1460Vidnyan S Sawant Head of Research at GEPL CapitalLIC Housing Finance   CMP  Rs 778.8LIC Housing Finance has been in an upward trend since March 2023 consistently forming higher tops and higher bottoms. Recently it broke out above its prior swing high from 2017 indicating robust price structure development. On the weekly scale it has formed a rallybaserally bullish price action pattern and is sustaining above key 12week and 23week EMAs suggesting a continuation of its upward trajectory. Additionally the ratio chart of LIC Housing Finance against the Nifty shows a rising trend indicating strengthening and readiness to outperform. Looking ahead there is a potential upside for the stock with a target of Rs 930. It s advisable to set a stoploss at Rs 714 on a closing basis to manage risks effectively.Strategy  BuyTarget  Rs 930StopLoss  Rs 714Escorts Kubota   CMP  Rs 4250.95On a monthly scale Escorts Kubota has consistently formed higher tops and higher bottoms since 2019 indicating a bullish trend. On the weekly scale after breaking out of the downward channel in April 2024 the stock has been moving consistently higher. Despite high market volatility from April to June 2024 the stock has demonstrated strong relative strength compared to the broader market. Trading above key averages like the 12week and 26week EMAs denotes a positive trend for the stock. Furthermore the ratio chart of Escorts Kubota against the Nifty has been sustaining above multiyear highs indicating sustained outperformance. Looking ahead there is potential upside for the stock with a target of Rs 5100. To manage risks effectively it s advisable to set a stoploss at Rs 3900 on a closing basisStrategy  BuyTarget  Rs 5100StopLoss  Rs 3900Ashok Leyland   CMP  Rs 240.19The price structure Ashok Leyland appears robust currently trading near its alltime high showcasing bullish price stability. On the monthly scale it has formed a LongLegged Doji candlestick indicating significant buying interest. On the weekly scale the stock has shown an interesting price development. Since March 2024 Ashok Leyland has been rising steadily after reversing from the polarity level of a multiyear swing high connected from 2018 signaling a regime shift to bullish territory.Additionally after encountering this polarity the stock broke out of the rising channel reinforcing the continuation of its upward trajectory. The stock is wellsustained above the key 12week and 26week EMAs with the MACD indicator trending higher in positive territory denoting a bullish trend backed by strong momentum. The ratio chart of Ashok Leyland against Nifty denotes a breakout of the multiyear swing high qualifying the stock as an outperformer. Looking ahead there is a potential upside for the stock with a target of Rs 280. It s advisable to set a stoploss at Rs 220 on a closing basis to manage risks effectively.Strategy  BuyTarget  Rs 280StopLoss  Rs 220Titagarh Rail Systems   CMP  Rs 1764Titagarh Rail has demonstrated robust momentum since January 2020 showcasing a clear uptrend and trading at its alltime high levels. Currently it is trading above key moving averages such as the 12week EMA and 26week EMA indicating a positive trend. Furthermore the ratio chart of Titagarh Rail against the Nifty has been waving higher indicating sustained outperformance. Looking ahead there is a potential upside for the stock with a target of Rs 2247. It s advisable to set a stoploss at Rs 1650 on a closing basis to manage risks effectively.Strategy  BuyTarget  Rs 2247StopLoss  Rs 1650Kunal Shah Senior Technical   Derivative Analyst at LKP SecuritiesReliance Industries   CMP  Rs 3028Reliance Industries has given a breakout on the daily chart from a consolidation range with a rise in volumes. It has surpassed its 20DMA indicating a bullish undertone along with the MACD indicator showing signs of a crossover. The momentum indicator RSI is showing signs of reversal from the oversold territory further validating the bullish stance. Buy Reliance in the range of Rs 30303010.Strategy  BuyTarget  Rs 3100 Rs 3160StopLoss  Rs 2970Senco Gold   CMP  Rs 1113.65Senco Gold has given a previous swing high breakout on the daily chart with a sharp surge in volumes. The momentum indicator RSI is trading above the level of 60 and has surpassed the immediate hurdle of 76. Buy the stock in the range of Rs 11101100. The lowerend support is placed at the Rs 10701060 zone which will act as a cushion for the bulls with upside potential targets at Rs 1190 and Rs 1240.Strategy  BuyTarget  Rs 1190 Rs 1240StopLoss  Rs 1060Deepak Nitrite   CMP  Rs 2505.25After a recent volumebased breakout Deepak Nitrite witnessed a retracement and experienced renewed volumebased buying. The momentum indicator RSI has reversed from the level of 58 and is entering above 60 which will resume the upward momentum. The stock is trading in a strong uptrend on the lower time frame with higher high and higher low formations intact on the charts.Strategy  BuyTarget  Rs 2620 Rs 2700StopLoss  Rs 2400Shitij Gandhi Senior technical Research Analyst at SMC Global SecuritiesJK Lakshmi Cement   CMP  Rs 866.95JK Lakshmi Cement has been consolidating in a broader range of Rs 750900 for the last three months and has been hovering around its 200day exponential moving average on the daily time frame. This week a sharp runup has been witnessed in the prices as the stock has managed to give fresh bullish momentum along with a sudden spike in volume activity which points towards long buildup in the prices. Therefore one can buy hold accumulate the stock for the expected upside of Rs 970975 levels with a downside support zone of Rs 850845 levels.Strategy  BuyTarget  Rs 970 Rs 975StopLoss  Rs 800Orient Cement   CMP  Rs 252.8Orient Cement hit its 52week high of Rs 293.75 in February 2024 but subsequently experienced a pullback due to profittaking. Nevertheless it found support at its 200day exponential moving average on the daily chart and bounced sharply indicating potential signs of reversal from lower levels. The bullish momentum has been confirmed technically as the stock recently gained fresh momentum by breaking above the key resistance level of a prolonged consolidation phase. Therefore one can buy hold accumulate the stock for the expected upside of Rs 300305 levels with a downside support zone of Rs 250245 levels.Strategy  BuyTarget  Rs 300 305StopLoss  Rs 220AU Small Finance Bank   CMP  Rs 692.45After marking its 52week low of Rs 553.70 in March 2024 AU Small Finance Bank has gradually recovered following an upward trend. Recently it managed to surpass its 200day exponential moving average on the daily charts once again. This week the stock experienced renewed momentum with a fresh breakout observed above the key resistance level of Rs 690. Therefore one can buy hold accumulate the stock for the expected upside of Rs 770775 levels with a downside support zone of Rs 685680 levels.Strategy  BuyTarget  Rs 770 Rs 775StopLoss  Rs 640",
    "",
    "Foreign brokerage Morgan Stanley has reiterated its  Overweight  call on Reliance Industries as it sees the monetisation cycle pick up.The brokerage also retained its target price of Rs 3046 per share on Reliance Industries indicating a minor upside from the current levels.According to the brokerage the rerating potential takes centerstage as the monetization cycle accelerates and the earnings catchup will be a key event in FY26 as multiple catalysts improve.Follow our market blog to catch all the live updatesThe earnings from the energy arm and the retail segment are primary reasons for Morgan Stanley s overweight rating it said. Additionally impending mobile tariff hikes promise to significantly boost Reliance Jio s revenue and profit and the new energy vertical too is poised to generate additional revenue.In the brokerage s regional order Reliance Industries continues to hold the top five spot.On March 27 Goldman Sachs had reiterated a  Buy  rating on Reliance Industries with as much as a 54 percent upside by FY26 in its bull case. It cited favourable riskreward dynamics value unlocking from its Disney joint venture and enhanced return on capital investments.With the capex cycle in two capitalintensive businesses  Reliance Retail and Jio Telecom  reaching its peak RIL will now start seeing improvements in its overall performance Goldman Sachs analysts had said."
]