[
    "Shares of Tata Motors could be in top gear on August 8 riding on the launch of the muchawaited Tata Curvv starting at Rs 17.5 lakh. The Curvv EV is Tata s fifth electric car and ICE version of Tata Curvv is expected to debut soon.Brokerages took note of the EV launch and have reiterated positive outlook on Tata Motors expecting Curvv to boost its market share.Nomura and Jefferies shared  Buy  rating on Tata Motors and assigned targets of Rs 1303 and Rs 1330 per share respectively. Nomura believes Tata Curvv will overcome major barriers to EV adoption by achieving price parity with ICE vehicles. Jefferies anticipates that Curvv will further enhance Tata Motors  market share building on progress of past four years in the passenger vehicle segment.ALSO READ  Moody s upgrades Tata Motors  ratings to Ba1 outlook remains positiveHowever Morgan Stanley analysts have expressed some caution citing recent slowdown in EV sales and plan to monitor the success of Curvv for a wider understanding of India s EV demand picture. This will help determine whether EV growth in fiscal year 2026 will follow a Vshaped or Ushaped pattern the brokerage note said. Morgan Stanley has given Tata Motors an  Equalweight  rating with a target price of Rs 1178 per share.The Tata Curvv EV 45 is priced between Rs 17.4919.29 lakh while the Curvv EV 55 is priced between Rs 19.2521.99 lakh.Tata Motors Curvv EV sports a 1.2C charging rate and promises a range of 150 km with just 15 minutes of charging. It offers two battery pack options  a 45 kWh pack with a claimed range of 502 km and a 55 kWh pack with a claimed range of 585 km. Safety features include six airbags electronic stability program (ESP) allwheel disc brakes and acoustic alerts for pedestrian safety.The Curvv EV will compete against the likes of MG ZS EV Mahindra XUV400 and BYD Atto 3.Meanwhile the Tata Curvv ICE will feature three engine choices  two petrol and one diesel. The petrol variants include the new Hyperion GDi engine delivering 125 hp and 225 Nm of torque. The diesel engine will introduce a dualclutch transmission for the first time in Tata s lineup. The prices of ICE version are still under wraps and will be revealed on September 2.So far this year shares of Tata Motors rallied over 31 percent outpacing 12 percent rise in the benchmark Nifty 50 index.",
    "Ratings agency Moody s on August 7 said it has upgraded Tata Motors Limited s (TML) corporate family rating (CFR) by two notches to Ba1 from Ba3 with the outlook remaining positive due to the automaker s revenue growth improving profitability and debt reduction.The agency also upgraded Tata Motors  senior unsecured instruments  ratings to Ba1 from Ba3. TML s twonotch rating upgrade with a positive outlook follows the company s sustained track record in achieving revenue growth improving profitability and reducing debt using its large free cash flow despite its elevated capital expenditure to refresh its products  Kaustubh Chaubal a Moody s Ratings Senior Vice President said in a press release.The rating action considers the impact of TML s  sound governance practices  mainly in its creditorfriendly financial policies track record and management prudence  on its credit profile which Moody s said it viewed as credit positive. Strong underlying demand in key geographies and business segments and a refreshed product slate that caters across different price points have paved the way for the continued improvement in TML s operating profile. These factors alongside its cost rationalization efforts have assisted in its margin recovery. TML s adjusted consolidated EBITA margin will improve to a solid 8 8.5  over the next two years from 7  in the fiscal year ended 31 March 2024 (FY24) and 2 4  over FY21 and FY23  Moody s said. We believe TML will sustain the improvement in all three of its automotive operations  commercial vehicle (CV) and passenger vehicle (PV) business in India collectively referred to as TML India  and its global premium passenger car business through wholly owned subsidiary Jaguar Land Rover Automotive Plc (JLR Ba2 positive)  it further added.Jaguar Land Rover (JLR) which Moody s recently upgraded to Ba2 from Ba3 is expected to see slower revenue growth to around 3 percent in FY25 and FY26. Still profitability will improve because of higher average sales prices and higher contribution margins from new products. Moreover even after sizeable investments towards product development as well as new product platforms JLR will generate at least  1 billion of free cash flow annually  Moody s added.        ",
    "Prabhudas Lilladher s research report on Tata MotorsTTMT s consolidated revenue for Q1FY25 increased by 5.7  YoY in line with PLe BBGe led by robust performance in its JLR   CV business units while PV business reported a degrowth owing to decline in volumes. EBITDA margin expanded by 110bps YoY to 14.4  against PLe BBGe of 15  13.9 . JLR EBIT margin grew by 30bps YoY to 8.9  with company retaining its guidance of delivering  8.5  EBIT margin and improving its net debt in FY25. TTMT noted that the demand slowdown in EV business was due to decline in buying from fleet operators. However its top 2 models continue to perform well and the new launch (Curvv) should aid in volume expansion. Additionally it remains optimistic on growth prospects of CV business owing to infrastructure improvement and industrial capex. We maintain our positive view on TTMT as 1) JLR business is likely to deliver sustainable growth 2) CV business is likely to report healthy performance due to replacement and demand in higher tonnage vehicles 3) cost reduction and mix improvement are expected to expand profitability and 4) demerger and listing could lead to sustained growth for respective businesses and benefit shareholders.OutlookFactoring this we estimate its revenue EBITDA to grow at a CAGR of 11.6 20  over FY2426E. We retain  Accumulate  with SoTPbased target price of Rs1254 (previous Rs1089).For all recommendations report click here",
    "Motilal Oswal s research report on TATA MotorsTata Motors (TTMT) reported a strong consolidated performance in 1QFY25 with margins expanding  110bp YoY to 14.4  (est. 13.3 ) driven by JLR and strong India CV business margins even as India PV margin missed estimates. Margins were also supported by higher capitalization rate (1Q at 6.2  of revenues v s 4.6  YoY). However apart from the risks from subdued global demand and margin headwinds at JLR recent supplier based constraint may pose as an incremental headwind in the nearterm. This coupled with demand moderation in its India CV and PV businesses raises concerns about TTMT s ability to sustain the currentlevel of profitability going forward. We raise our EPS estimates by 3  4  for FY25 FY26. The stock trades at 19.1x 16.4x FY25E FY26E consol. EPS and 7x 5.7x EV EBITDA. Reiterate Neutral with Jun 26E SOTPbased TP of INR1025.OutlookWe raise our EPS estimates by 3  4  for FY25 FY26. The stock trades at 19.1x 16.4x FY25E FY26E consol EPS and 7.0x 5.7x EV EBITDA. Reiterate Neutral with Jun 26E SOTPbased TP of INR1025.For all recommendations report click here",
    "After witnessing a sustained jump in volumes over the last two and a half years Passenger Vehicle (PV) sales witnessed a fall in July this year due to sluggish demand highbase effect of last year and high dealer inventory. Total car dispatches by carmakers went down by 2.5 percent at 344076 units last month vis vis 352941 units in July 2023.Industry observers reckon that last year s base was very high as July 2023 was the first month of normal supply after semiconductor shortages. Furthermore there were no pending bookings unlike last year where limited chip availability ensured a lot of bookings.Also during last year a lot of wholesales happened to fill the  inventory pipeline vacuum  and the stocks this year started with upwards of 405000 units in the industry as per industry insiders.During the first four months of this financial year PV sales stood at 13.75 lakh just a shade higher from 13.5 lakh units during the corresponding period a year ago.Domestic passenger vehicle (PV) wholesales of top three carmakers such as Maruti Suzuki India (MSIL) Tata Motors Hyundai Motor India (HMIL) went down as carmakers had to rationalise dispatches amid high dealer inventories.Maruti Suzuki India saw a 9.64 percent dip in its total domestic PV sales at 137463 units as against 152126 units in the yearago month. The country s largest carmaker s total domestic sales (PV LCV OEM) declined by 5.25 percent YoY to 151056 units in July 2024 as compared to 159431 units recorded in July 2023.Hyundai Motor India Limited (HMIL) revealed that the domestic dispatch of vehicles to dealers saw a dip of 3.3 percent to 49013 units last month from 50701 units in the yearago period. SUVs continue to demonstrate a robust contribution accounting for 66.6 percent of total HMIL domestic sales  noted Tarun Garg Wholetime Director and Chief Operating Officer HMIL.Tata Motors stated that its domestic PV sales including electric vehicles were down 6 percent at 44954 units as compared to 47689 units in the yearago period it added.Mahindra   Mahindra (M M) which bucked the trend achieved a 15 percent growth in sales in the domestic market by selling 41623 units versus 36205 units yearonyear. We are gearing up for the muchawaited arrival of  Thar ROXX   THE SUV  this Independence Day  said Veejay Nakra President Automotive Division M M Ltd.Toyota Kirloskar Motor (TKM) which too saw a sales upswing reported a 44 percent growth yearonyear in total wholesales at 31656 units in July. Demand for all our models remains at an alltime high especially in the SUV and MPV segments  Toyota Kirloskar Motor Vice President SalesServiceUsed Car Business Sabari Manohar said. He added that the company s operational enhancement strategy including the addition of a third shift is supporting strong demand.Kia India has posted a 2.5 percent YoY growth with a domestic dispatch of 20507 units in July this year.         ",
    "Net Sales at Rs 108048.00 crore in June 2024 up 5.68  from Rs. 102236.08 crore in June 2023.Quarterly Net Profit at Rs. 5566.00 crore in June 2024 up 73.79  from Rs. 3202.80 crore in June 2023.EBITDA stands at Rs. 17360.00 crore in June 2024 up 19.08  from Rs. 14578.26 crore in June 2023.Tata Motors EPS has increased to Rs. 14.61 in June 2024 from Rs. 8.35 in June 2023.Tata Motors shares closed at 1144.40 on August 01 2024 (NSE) and has given 30.27  returns over the last 6 months and 77.80  over the last 12 months.",
    "Net Sales at Rs 16862.00 crore in June 2024 up 6.5  from Rs. 15832.57 crore in June 2023.Quarterly Net Profit at Rs. 2190.00 crore in June 2024 up 3519.74  from Rs. 64.04 crore in June 2023.EBITDA stands at Rs. 3894.00 crore in June 2024 up 146.86  from Rs. 1577.41 crore in June 2023.Tata Motors EPS has increased to Rs. 5.80 in June 2024 from Rs. 0.17 in June 2023.Tata Motors shares closed at 1144.40 on August 01 2024 (NSE) and has given 30.27  returns over the last 6 months and 77.80  over the last 12 months.",
    "Shares of Tata Motors fell over 4 percent to Rs 1095 per share on August 2 despite reporting betterthanexpected results for the June quarter. The decline followed management s commentary indicating subdued global demand for the remainder of the fiscal year. Nonetheless brokerages were largely optimistic about the automaker with the CV segment and Jaguar Land Rover (JLR) surpassing market expectations.Jefferies issued a  buy  recommendation for Tata Motors raising the target price to Rs 1330 per share citing strongerthananticipated EBITDA in the India CV segment. Nomura also maintained a bullish stance setting a target price of Rs 1303 per share due to JLR s impressive performance in challenging market conditions.In the domestic market Tata Motors  CV revenues grew by 5.1 percent yearonyear to Rs 17800 crore while EBIT margins improved by 240 basis points to 8.9 percent benefiting from better realizations and material cost savings.ALSO READ  Tata Motors expects muted global demand positive on domestic sales during festive seasonJLR s revenue grew by 5.4 percent during AprilJune to GBP 7.3 billion with EBIT margins of 8.9 percent up 30 basis points driven by favorable volume mix and material cost improvements.However UBS analysts maintained a  sell  rating for Tata Motors and increased the target price to Rs 825 from Rs 800 due to pressure in the passenger vehicle (PV) segment. PV revenues fell by 7.7 percent reflecting challenging market conditions but EBITDA at 5.8 percent expanded by 50 basis points driven by material cost reductions.Looking ahead the India PV segment needs to perform better in the second half of the fiscal year highlighted JPMorgan analysts as they maintained an  overweight  rating and raised the target price to Rs 1250 per share from Rs 1115.Overall Tata Motors reported a 74 percent YoY jump in its Q1FY25 consolidated net profit to Rs 5566 crore from Rs 3203 crore while revenue from operations rose by 5.7 percent YoY to Rs 107316 crore.The Indian automaker s consolidated EBITDA increased by 19 percent YoY to Rs 15785 crore and the operating margin expanded to 14.6 percent from 12.9 percent in the same period last year.",
    "A senior Tata Motors official stated that its British arm Jaguar Land Rover (JLR) has no plans to leverage on India s new electric vehicle (EV) policy that offers import duty concessions to firms setting up manufacturing units in the country as it is not suitable for the company.The Indian government had come out with the EV Policy earlier this year to incentivise global giants such as Tesla to set up manufacturing units in the country. While announcing the policy the government had stated that the new EV policy sought to promote India as a manufacturing destination for EVs and attract investment from reputed global manufacturers. If we are able to leverage upon the policy environment we will definitely consider it. At this point in time that specific policy is not something that is suitable for us. So we don t intend to leverage that at this point in time  Tata Motors  Group Chief Financial Officer P.B. Balaji told reporters in a postearnings conference call.Balaji said that currently JLR s business in India is on a very  good wicket  and is growing very strongly. We have just localised the manufacturing of Range Rover and Range Rover Sport. We re seeing huge pickup in orders on that front. As volumes pick up  we will want to keep localising to the extent possible  added Balaji.As per the EV policy announced in March global carmakers can import completely builtin units (electric) at a concessional rate of duty for five years if they invest at least  500 million (Rs 4150 crore) to manufacture in India within three years and also provide a bank guarantee.For manufacturers setting up facilities in India within a threeyear period customs duty of 15 percent will be levied on electric vehicles of minimum CIF (cost insurance and freight) value of  35000 (around Rs 30 lakh) for a period of five years.Balaji however hinted that the company will continue to look at opportunities of CKD (completely knocked down) operations to ensure that it will take the same benefits of 15 percent customs duty without taking on  additional obligations  in terms of both localisation as well as bank guarantees. We continue to evaluate CKD operations as more attractive to us given our size and scale in India at this point in time  Balaji further added.Meanwhile JLR is gearing up the Range Rover Electric which is current undergoing test runs and is slated for a global rollout next year. Balaji revealed that the electric car has already received 41000 signups on the waiting list. It is as much a brand launch as it is a powertrain launch. From that perspective it s Range Rover first then an electric next  said Balaji  We are excited with the next phase of JLR as it increasingly becomes an electric vehicle company. Going allelectric in Jaguar remaining flexible in platformsBalaji also reiterated that it will go allelectric in its Jaguar portfolio by 2025 with the first model currently undergoing prototype road testing. He revealed that most of the products will eventually be based on Jaguar Electrified Architecture (JEA) platform. We are consciously moving the Jaguar business to an allelectric portfolio and that is a business strategy call. We believe we can redefine and rediscover Jaguar in an electric avatar. And the products are on the road testing. As I said earlier excellent performance coming through and the consumer clinics have also been outstanding  asserted Balaji.Tata Motors said that its British subsidiary will retain the flexible modular longitudinal architecture (MLA) on which Range Rover and Range Rover Sport are built offering internal combustion engine (ICE) Hybrid (overseas markets) and battery electric vehicle (BEV) options. The bulk of our performance today comes out of the flexible MLA architecture. So we are absolutely neutral to what happens to the EV penetration as far as that part of the portfolio is concerned  noted Balaji.JLR will also be banking on its next generation medium size SUV architecture electrified modular architecture (EMA).  As far as the EMA portfolio is concerned that s an area where we will we will look at how the EV penetration is exploring and we will flex those portfolios to see how long we can continue ICE on this and when we move parts of it to BEV. Meanwhile Tata Motors stated that is likely to witness  constrained production  in the second and third quarter of the current fiscal reflecting the annual summer plant shutdown and floods at a key aluminium supplier.The wholesale volumes for JLR during the quarter were up 5 percent yearonyear at 98000 thousand units while the retail sales in the AprilJune period grew 9 percent yearonyear to 1.11 lakh units according to the company.        ",
    "Despite witnessing a drop in batterydriven cars for four months in a row Tata Motors affirmed that it is doubling down on increasing electric vehicles  penetration in the medium term. A senior official of the company said that the recent lacklustre volumes is a temporary aberration and the company is doubling down on its EV business by launching new models such as Curvv EV and building charging infrastructure. Going forward I think the excitement begins now with the launch of Curvv and therefore with the pricing corrections thanks to the battery price reductions also in place we do expect the momentum to build back in the EV business  said P.B. Balaji chief financial officer Tata Motors in a postearnings conference.He went on to add  Our focus remains on building the markets focusing on improving the EV infrastructure access to charging combining with the solar (chargers). So there s a host of activities that have been lined up and therefore our task remains driving up penetration of EVs in the overall portfolio. Tata Motors stated that it sold 5027 EVs in July 2024 which is a reduction of 21 percent compared to its sales figures for July 2023 (6329 units). This follows Tata witnessing its lowest EV sales in an 18month period in June when it declined by a whopping 34 per cent yearonyear 4657 units. Its July figures are only a 7.9 per cent increase over last month s EV sales.Balaji had attributed the decline in sales to a notable drop in demand after the FAMEII subsidy scheme concluded in March. As he puts it  Since FAMEII incentives are not there in the first quarter (of FY25) and till Julyend impacted (EV) sales. And that forms a sizable portion of our portfolio and therefore it is logical that there s been an impact on that. While exuding confidence that the BEV market will bounce back he maintained  This is a temporary aberration and once FAMEIII comes in we will be back into the growth path on EVs. So nothing changes as far as our plans are concerned. We are just doubling up EV penetration. At present Tata Motors offers five EV models   the Tiago EV Tigor EV Punch EV Nexon EV XpresT EV (for fleet sales). The XpresT previously qualified for a subsidy of up to Rs 2.15 lakh under the FAMEII scheme but was eventually ineligible for any incentives with the phase out of the policy.In Balaji s view some degree of the market slowdown is evident in the month of July across the board not just in EVs but in ICEV as well. We do expect this to recover from here on and particularly the festive demand coming up we should expect to see that build back. And there s enough launch activities also planned so enough and more noise there to get the buzz back in the market. Balaji is anticipating that the FAMEIII policy will also be extended to the private fleet buying segment.In his view  If it is going into the fleet segment and therefore it is public transport that is getting electrified (and) these are not personal buyers. Therefore there is a logical case for this. It has been made out and we do believe the authorities are sympathetic to the logic. But let s wait and see how the fine print finally evolves. While sharpening its focus on BEVs Tata Motors said that it expects momentum to build back after the Curvv EV launch. The company aims to anticipate better EV sales in the second half of the year.On Thursday Tata Motors reported a 74 percent yearonyear jump in consolidated net profit at Rs 5566 crore in Q1 FY25. Its revenue increased by nearly 6 percent yearonyear to Rs 1.08 lakh crore.        ",
    "Tata Motors reported its quarterly results on Thursday noting that global demand is expected to stay subdued with a gradual recovery in domestic demand anticipated for the remainder of the year. Anticipate gradual improvement in domestic demand during the rest of the year on account of continued investments in infrastructure healthy monsoons favourable macros and festive demand. Global demand is likely to remain muted  the company stated in an exchange filing.  We are confident of sustaining the performance in the coming quarters and delivering a strong year  India s largest electric vehicle player added.Read  Yes Bank stake sale hinges on bidders agreeing to local banking normsLooking ahead Tata Motors expressed optimism for increased sales during the festive season. New product launches are expected to benefit the business.  Our strategy includes expanding our market share by introducing new models enhancing our multi powertrain offerings to align with industry shifts and proactively growing the EV market in India while maintaining market leadership  the company added.Read  Tata Steel boss Narendran flags concerns on Chinese imports warns of impact on the industry s capexApart from this the SUV maker reported an 11 percent yearonyear decline in total sales recording 71996 units in July compared to 80633 units in the same month last year. Meanwhile the sales of passenger vehicles including electric vehicles in the domestic market decreased by 6 percent totalling 44954 units compared to 47848 units in the previous year.Tata Motors shares closed one percent lower at Rs 1144. The shares have been on a robust run rallying over 14 percent in the past month.",
    "The board of Tata Motors has approved the demerger of commercial vehicle business into TML Commercial Vehicles Limited and announced that the passenger vehicles businesses including PV EV JLR and related investments in another entity the company informed stock exchanges in a filing on August 1.The demerger would result in creation of two listed companies with mirror shareholding one housing the CV business and the other amalgamated company housing the PC business the company said.The demerger will be implemented through an NCLT scheme of arrangement and all shareholders of Tata Motors shall continue to have identical shareholding in both the listed entities the carmaker had said in March when the scheme was first announced.The scheme will enable respective businesses to pursue differentiated strategies with agility and enhance value for the shareholders Tata Motors has said.The scheme is subject to approval of shareholders creditors National Company Law Tribunal and other authorities.This demerger is also aimed to enhance synergies across PV and EV business along with JLR particularly in the areas of EV autonomous vehicles and vehicle software. The proposed demerger will help us improve focus and make us moreagile to capitalise on opportunities in the CV market globally. Our focus willbe to create a worldclass Company operating in the CV space  Girish Wagh ED Tata Motors had said in the 2024 annual report of the company.        ",
    "Tata Motors Ltd on August 1 reported a 74 percent yearonyear jump in its Q1 FY25 consolidated net profit to Rs 5566 crore from Rs 3203 crore surpassing Street expectations.The Mumbaibased automaker stated that its AprilJune revenue from operations rose 5.7 percent to Rs 107316 crore from Rs 101528 crore a year ago.A   poll of six brokerage estimates pegged Tata Motors  fiscal first quarter net profit at Rs 5149 crore and revenue at Rs 1.09 lakh crore.While Tata Motors  shares have risen substantially in the past one week gaining over 11 percent to Rs 1144.6 apiece on the BSE its shares on NSE declined 1.21 percent ahead of the results.The Indian automaker s consolidated earnings before interest tax depreciation and amortization (EBITDA) increased 19 percent yearonyear to Rs 15785 crore while operating margin expanded to 14.6 percent from 12.9 percent in the yearago period.Its luxury arm Jaguar Land Rover (JLR) revenue grew by 5.4 percent during AprilJune to GBP 7.3 billion with EBIT margins of 8.9 percent up 30 basis points driven by favourable volume mix and material cost improvements it said in a statement.In domestic market Commercial Vehicle (CV) revenues grew 5.1 percent onyear to Rs 17800 crore while EBIT margins improved 240 basis points to 8.9 percent. The margin benefitted from better realisations and material cost savings the company said.Its passenger vehicle revenues fell 7.7 percent reflecting  challenging market conditions  but EBITDA at 5.8 percent expanded 50 basis points driven by material cost reductions it added.Tata Motors said that the proposed demerger of the company into two separate listed entities is expected to conclude in 12 to 15 months.Further the merger of Tata Motors Finance with Tata Capital is also underway and expected to conclude over the course of next 9 to 12 months it said.While the company s shares have risen substantially in the past one week gaining over 11 percent to Rs 1144.6 apiece on the BSE. its shares on NSE declined 1.21 percent ahead of the results.Meanwhile Tata Motors foresees global demand to remain muted and hopes to see a gradual improvement in domestic demand during the rest of the year on account of continued investments in infrastructure healthy monsoons favourable macros and festive demand. It also expects the commodities to remain range bound.        ",
    "Tata Motors on Thursday reported an 11 per cent yearonyear dip in total sales at 71996 units in July.The company had sold 80633 units in July 2023.The total domestic sales dipped 11 per cent and stood at 70161 units last month as against 78844 units in the yearago period Tata Motors said in a statement.Sales of passenger vehicles including electric vehicles in the domestic market were down 6 per cent at 44954 units as compared to 47689 units in the yearago period it added.Commercial vehicle sales declined 18 per cent to 27042 units in July as against 32944 units in the yearago period.        ",
    "India s largest electric vehicle manufacturer Tata Motors Limited is set to release its earnings report for the first fiscal quarter of FY25 on August 1. An increase in JLR volumes is expected to push the company s sales growth to doubledigits.According to a   poll the Nexon maker is anticipated to record a 6.3 percent yearonyear increase in revenue reaching Rs 108767 crore. Net profit is projected to surge 32 percent to Rs 5149 crore from Rs 3878 crore in the same quarter of the previous fiscal year.What factors are driving Tata Motors  earnings Robust JLR Performance  JLR s volumes (excluding the China JV) are expected to grow 9 percent yearoveryear driven by strong demand for the Range Rover Range Rover Sport and Defender models.  Furthermore a 23 percent onyear increase in average selling price (ASPs) due to price hikes taken over the last year will likely bode well for the company.Recovery in India CV  The CV business is expected to increase 2 percent. Furthermore the EBITDA margin to expand on better pricing and cost reduction efforts. The demand for CVs is expected to pick up in 2HFY25 with the festive season and higher government spending expected post the general election.What to look out for in the quarterly show The key things to watch out for is JLR and India s CV demand outlook. Not just that the company s SUV segment trails Maruti and M M and guidance on the growth will also be essential for the company in the coming quarters.Tata Motors has entered the top ten most valued global automotive firms the first Indian company to do so thanks to a continued stock surge.The Tata Motors stock has risen over 50 percent this year and over 101 percent in 2023 with a market cap of  51 billion the highest among Indian auto companies.",
    "Tata Motors Ltd has entered the top ten most valued global automotive firms the first Indian company to do so thanks to a continued stock surge.The stock has risen over 50 percent this year and over 101 percent in 2023 with a market cap of  51 billion the highest among Indian auto companies.Globally Tesla Inc leads with a market cap of  711.19 billion followed by Toyota Motors with  307.50 billion and BYD Company with  92.65 billion. Ferrari NV ranks fourth at  74.02 billion market cap followed by MercedesBenz Group ( 71.26 billion) Porsche ( 68.29 billion) BMW AG ( 59.54 billion) Volkswagen AG ( 58.18 billion) and Honda Motor Co ( 56.12 billion).Tata Motors  market cap surpasses that of Stellantis NV ( 50.64 billion) General Motors ( 49.74 billion) Maruti Suzuki India ( 48.36 billion) Mahindra   Mahindra ( 43.41 billion) Ford Motor Co ( 43.1 billion) Hyundai Motor ( 37.88 billion) and KIA Corp ( 32.29 billion).Tata Motors  stock has tripled in three years driven by high expectations for its passenger vehicles. The company has turned around remarkably with Jaguar Land Rover (JLR) on a profitable growth path. In India Tata Motors leads in electric cars and has shifted its portfolio towards utility vehicles. However its EV business has yet to break even at the EBITDA level and continued investment in EVs requires strong sales.Analysts note that Tata plans to launch new EV models and aims for 50 percent of volumes from EVs by 2030 which could create significant value. Despite complexities in the passenger vehicle business JLR will continue to generate a large portion of revenues and earnings facing competition amid its EV transition.Analysts further said as semiconductor chip challenges for JLR ease supply has improved reducing the order backlog and allowing the company to serve more customers. Demand remains strong and an expanding order book with new models set to boost volumes further.In its recent note Nomura said it maintains a 5 percent volume CAGR for FY2527F and expects EBITDA margins to hold at around 11.5 percent due to strong demand. A guidance upgrade from flat to negative growth for FY25F is possible with ebuses potentially driving more upside.On India PVs it said despite signs of weakness in industry PV and EV demand the upcoming launches of Curvv (on August 7) and Harrier EV in FY25F should support volumes. Market share is projected to remain stable at 14  with a target of 1820  by FY30F.Recently Tata Motors said that its plan to demerge into two entities is welcomed by analysts. Postdemerger Tata s PV business will include the domestic EV segment and Jaguar Land Rover (JLR) offering investment opportunities in both domestic and global premium markets. Sharekhan believes this move allows investors to tap into massmarket PV growth potentially challenging Maruti Suzuki s dominance.All eyes are on Tata Motors  earnings release on August 1. A poll of 16 Bloomberg analysts forecasts revenue of Rs 1.09 trillion while 11 analysts predict a net profit of Rs 5310 crore. Currently the stock has 24 buy ratings 6 hold ratings and 5 sell ratings according to Bloomberg.",
    "The benchmark indices closed flat after a smart recovery from the day s low and formed a bullish candlestick pattern on the daily charts signaling hope for a further bounce amid consolidation. About 1213 shares declined against 1138 advancing shares on the NSE. If the index continues to hold 24400 then 2450025600 can t be ruled out in the coming sessions but failure can drag it down towards 24200 the immediate support. Here are some trading ideas for the near term Amol Athawale VPTechnical Research at Kotak SecuritiesReliance Industries   CMP  Rs 2984.8After the remarkable up move in recent weeks Reliance Industries witnessed profit booking at higher levels. Post the recent selloff in the counter the downward momentum had stopped. On daily charts the counter has found support near its important retracement zone. The formation suggests a revival of the uptrend from the current levels in the coming horizon.Strategy  BuyTarget  Rs 3180StopLoss  Rs 2870Berger Paints   CMP  Rs 530.3On the weekly charts Berger Paints is in a rising channel chart formation with a higher low series pattern. Additionally the stock has formed an Inverse Head and Shoulders chart pattern on the daily scale and is trading near the neckline resistance zone. The texture of the stock indicates a likely breakout move and fresh leg of upward momentum from the current levels in the near term.Strategy  BuyTarget  Rs 570StopLoss  Rs 510FSN ECommerce Ventures (Nykaa)   CMP  Rs 181.88Nykaa is trading in a symmetrical triangle chart formation on the weekly scale which clearly suggests bullish momentum is likely to remain in the short term. In addition the stock has formed a higher bottom formation on the daily chart indicating good strength in the counter for a fresh breakout move in the coming horizon.Strategy  BuyTarget  Rs 195StopLoss  Rs 175Chandan Taparia Head  Equity Derivatives   Technicals Broking   Distribution at Motilal Oswal Financial ServicesSun Pharmaceutical Industries   CMP  Rs 1665.8Sun Pharma has retested a breakout on the daily chart and inched higher. The stock is holding gains at higher zones as every small decline is being bought into. Buying is visible across the pharma space which may support the ongoing up move.Strategy  BuyTarget  Rs 1770StopLoss  Rs 1620Tata Motors   CMP  Rs 1091Tata Motors has given a consolidation breakout of the past 20 weeks and a range breakout on the daily scale. The breakout is supported by a surge in delivery and trading volumes which may take prices higher.Strategy  BuyTarget  Rs 1170StopLoss  Rs 1050Petronet LNG   CMP  Rs 365.35Petronet has given a channel breakout on the daily scale with noticeable volumes. It is perfectly respecting the 20 DEMA (Days Exponential Moving Average) and momentum indicator RSI (Relative Strength Index) is positively placed which may take prices higher.Strategy  BuyTarget  Rs 385StopLoss  Rs 355Mandar Bhojane Equity Research Analyst at Choice BrokingQuess Corp   CMP  Rs 712.2Quess Corp is ready for a breakout of the Cup and Handle pattern on the daily chart with a significant increase in trading volume indicating a potential breakout. If the price manages to close above Rs 715 level it may have the potential to reach shortterm targets of Rs 990   Rs 1000. On the other hand immediate support levels are located at Rs 600. These levels can be considered opportunities to buy on dips. The RSI currently stands at 69.92 and is trending upward indicating increasing buying momentum.Strategy  buyTarget  Rs 990 Rs 1000StopLoss  Rs 560Multi Commodity Exchange of India   CMP  Rs 4183.8MCX has recently seen a breakout of range on the daily chart with a significant increase in trading volume indicating a potential breakout. If the price manages to close above the Rs 4190 level it may have the potential to reach shortterm targets of Rs 5000   Rs 5400. On the other hand the immediate support levels are located at Rs 3800. These levels can be considered opportunities to buy on dips. The RSI currently stands at 62 and is trending upward indicating increasing buying momentum.Strategy  BuyTarget  Rs 5000 Rs 5400StopLoss  Rs 3600Indian Oil Corporation   CMP  Rs 176.85IOC is ready for a breakout of the ascending triangle on the daily chart with a significant increase in trading volume indicating a potential breakout. If the price manages to close above the Rs 178 level it may have the potential to reach shortterm targets of Rs 195   Rs 200. On the other hand immediate support levels are located at Rs 164. These levels can be considered opportunities to buy on dips. The RSI currently stands at 61.35 and is trending upward indicating increasing buying momentum.Strategy  BuyTarget  Rs 195 Rs 200StopLoss  Rs 160Mitesh Karwa Research Analyst at Bonanza PortfolioSyngene International   CMP  Rs 786.8On the weekly time frame Syngene International has given a breakout of a bullish pattern and made a big body bullish candlestick indicating bullish strength. On the indicator front the stock is sustaining comfortably above all its important EMAs and Ichimoku cloud support indicates strength on the upside. The momentum indicator RSI is above 50 levels which is showing strong buying interest in the script.Strategy  BuyTarget  Rs 867StopLoss  Rs 763",
    " In a choppy trading session Nifty and Sensex recovered sharply after a poor start driven by a gains in auto and pharma stocks. At the close the Sensex fell 109.08 points down 0.14 percent to 80039.80 and the Nifty declined 7.40 points largely flat at 24406.10. Around 1780 stocks rose while 1646 declined and 77 remained unchanged. The mid and smallcap indices dropped 0.7 percent and 0.2 percent  respectively. Despite this many experts see valuation comfort in large caps.  while the volatility index (VIX) surged over 8 percent to nearly 13. Suzlon Energy   CMP  Rs 62.01   The stock gained over 2 percent extending gains for a fourth straight session to hit multiyear high on July 25. The counter has been seeing a sharp rally since it reported stellar earnings earlier this week for the quarter ended June 2024. KPIT Technologies   CMP  Rs 1789.90    The stock fell 3.5 percent as brokerages remained divided after its quarterly earnings. Some analysts are positive on the stock and suggest the stock may reach Rs 2100 level on the back of a healthy order book while others suggest that the counter may fall up to 40 percent on the back of rich valuations. RBL Bank   CMP  Rs 230.65   Shares fell 3 percent after a 7.95 percent stake was sold through a block deal. The transaction worth Rs 1100 crore likely saw private equity firm EQT (formerly Baring PE Asia) exit the lender.Around 4.8 crore shares of RBL Bank changed hands at an average price of Rs 229.50 implying an 3.5 percent discount to the previous closing price of the stock. Axis Bank   CMP  Rs 1176.25   Shares took a 5 percent dive after the lender reported its AprilJune earnings which highlighted its worsening asset quality. The lender reported a sharp spike in its net profit which came at Rs 6035 crore for Q1 FY25 up from Rs 3452 crore in the year ago period. Even though this net profit came in well above the Street s estimate of Rs 5797 crore it was the rise in nonperforming assets that worried investors. Sequentially the lender s gross nonperforming assets rose 11 basis points to 1.54 percent in Q1 while net nonperforming assets were up 3 basis points to 0.34 percent. RVNL   CMP  Rs 576.40   Shares fell 3 percent amid profit booking despite the company receiving a Letter of Acceptance (LoA) for a project worth Rs 191.53 crore from South Eastern Railway. It is worth noting that RVNL was among the multibagger railway stocks that experienced a sharp decline following Union Budget 2024 as there was limited focus on the sector. Larsen   Toubro   CMP  Rs 3622   Shares rose 3 percent after brokerages either retained bullish calls on Larsen   Toubro (L T) or raised target prices on the stock after the company s fiscal first quarter earnings (Q1FY25) beat Street estimates albeit marginally. According to analysts L T has a dominant position and market share in most operating verticals which imparts flexibility to cherrypick projects which helps optimise overall business profitability. Larsen and Toubro s consolidated net profit for the quarter ended June 2024 jumped 12 percent onyear to Rs 2786 crore and its revenue from operations rose 15 percent YoY to Rs 55120 crore. Tata Motors   CMP  Rs 1089   Shares surged 6 percent after international brokerage Nomura upgraded the stock with a  buy  recommendation as it sees multiple levers of growth. The analysts have assigned a target price of Rs 1294. This implies an upside potential of 26 percent from the current market levels. In the past month the shares of the company have rallied 13 percent. It said that potential significant upsides from Jaguar Land Rover s (JLR) execution and the demerger of commercial vehicles (CVs) from the passenger vehicle (PV) are valueunlocking catalysts. IDBI Bank   CMP  Rs 101.70   Shares soared over 4 percent extending gains for the second day after DIPAM secretary stated that the Reserve Bank of India s (RBI s) vetting process to ascertain potential bidders for IDBI Bank is at an advanced stage. Nestle India   CMP  Rs 2478   Shares slipped 2.5 percent after the company announced its Q1FY25 results. The FMCG major s profit rose 6.92 percent onyear to Rs 746.6 crorein Q1 as compared to Rs 698.3 crore in the same quarter a year ago. Its revenue grew 3.3 percent to Rs 4813.9 crore in the June quarter of FY25. PG Electroplast   CMP  Rs 451.80   Shares soared 13 percent after the company reported a 151.2 percent jump in its net profit to Rs 84.93 crore in the June quarter on the back of strong operational performance. Its net profit was at Rs 33.81 crore in the year ago period. Revenue for the quarter rose 94.9 percent on year at Rs 1320.68 crore.         ",
    "Shares of Tata Motors Limited surged over 5 percent to scale a fresh record high of Rs 1084 after international brokerage Nomura upgraded the stock with a  buy  recommendation as it sees multiple levers of growth.The analysts have assigned a target price of Rs 1294. This implies an upside potential of 26 percent from the current market levels. In the past month the shares of the company have rallied 13 percent.Follow our LIVE blog for all the market updatesIt said that potential significant upsides from Jaguar Land Rover s (JLR) execution and the demerger of commercial vehicles (CVs) from the passenger vehicle (PV) are valueunlocking catalysts.Nomura estimates that the margin of India s largest EV player is projected to rise from 7.8 percent in FY25 to 8.5 percent and further to 10.1 percent by FY27 with the potential to reach 1112 percent by FY30 led by the phaseout of Jaguar s internal combustion engines (ICE) and the success of new EVs. Furthermore net debt of Rs 1600 crore (Rs 44 per share) in FY24 is expected to turn into net cash of Rs 57 and Rs 140 per share by FY26 and 27. Industry PV and EV demand has shown signs of weakness. But launches of Curvv (scheduled on August 8) and Harrier EV in FY25 should support volumes  the brokerage said in a recent note on the company.At about 11 am shares of the company were trading at Rs 1082 up 5.2 percent from the last close on the NSE.",
    "With the pentup demand for Passenger Vehicles (PVs) on the downswing carmakers are increasingly going for discounts exchange offers and hefty price cuts to entice buyers.According to industry observers the slowdown in car sales and a massive stockpile of unsold cars are the key reasons behind such schemes.PV retail sales in June fell 6.77 percent year on year and 7.18 percent month on month to 281566 units while inventory levels reached an alltime high ranging from 62 to 67 days.According to the Federation of Automobile Dealers Associations (FADA) the premonsoon period of May June and July traditionally witnesses a dip in automobile sales. In response to this seasonal trend OEMs and dealers introduce various promotional programmes including discounts offers exchange offers moneyback schemes and vouchers. These initiatives play a crucial role in stimulating market demand during these months. The collective efforts of OEMs and dealers in rolling out these promotions are greatly appreciated as they contribute significantly to sustaining sales momentum during an otherwise low period  Manish Raj Singhania President FADA said.To be sure discounts and other benefits were already being offered on compact cars and sedans and they have recently been extended to hotselling Sports Utility Vehicles (SUVs). For the last few months car dealers have been offering cash discounts ranging from as low as Rs 10000 and going up to Rs 3.3 lakh depending on the price points of the models. This is in addition to the affordable variants that carmakers are introducing to lure buyers.Maruti Suzuki IndiaMaruti Suzuki India Ltd which slashed the prices of the automatic transmission variants of its compact cars is offering discounts across its lineup. Across its Arena showrooms the company is offering a cash discount of Rs 10000 on Brezza Automatic Rs 3000040000 on Alto K10  Rs 3500040000 on SPresso Rs 1500035000 on WagonR  Rs 3500040000 on Celerio (depending on the variants) Rs 10000 on Eeco and Rs 1000015000 on Dzire as per dealer sources.This is in addition to a Rs 1000020000 exchange bonus and Rs 20003500 corporate discounts (depending on the model).Maruti Suzuki is also offering a cash discount of Rs 3500040000 on Ignis and Baleno Rs 2250035000 on Fronx Rs 20000 on Ciaz Rs 20000 on XL6 Rs 3000050000 on Grand Vitara (both mid and strong hybrid) and Rs 3.3 lakh on its only lifestyle offroader SUV Jimny across its Nexa chain of outlets. This is in addition to an exchange bonus of Rs 1000015000 and Rs 2100 rural and Rs 3100 corporate discounts (depending on the model). Some dealers are also providing an additional scrappage bonus of Rs 5000.Hyundai Motor IndiaHyundai Motor India Ltd (HMIL) is offering a discount of Rs 1000030000 on the Aura (both petrol and CNG) Rs 1500035000 on Grand i10 Nios (depending on the variant) Rs 2000035000 on i20 (as per the variant) Rs 15000 on Verna Rs 55000 on Alcazar Rs 50000200000 on Tucson and Rs 200000 on Kona (discontinued). Of late its bestselling SUVs such as Exter and Venue are also seeing a cash benefit of Rs 10000 and Rs 3500045000 (depending on the variant) respectively as per dealer sources.This is in addition to the Rs 1000030000 (depending on the model) offered on exchange customers and Rs 3000 as corporate discounts revealed dealer sources. It was also clarified that no discount offer was applicable on the premium SUV Creta which commands a huge waiting period.Tata Motors is offering a cash discount of Rs 2500035000 on Tiago 2500030000 on Tigor Rs 15000250000 on Altroz Rs 20000 on Nexon etc as per dealer sources. Customers can also avail a cash benefit of 7500085000 on the electric variants of Tiago and Tigor and up to Rs 1.1 lakh on Nexon EV. The discounts are in addition to the Rs 1000030000 exchange benefits and Rs 30008000 corporate discount (depending on the model).Mahindra   MahindraMahindra which recently slashed XUV7OO s prices by up to Rs 2.2 lakh is offering a cash discount of Rs 90000 (including an exchange bonus) on Bolero Neo and Rs 1.5 lakh on the XUV 4OO.  Dealer sources revealed that there are some limited offers on select variants of Thar and ScorpioN in select cities subject to availability. However there are no offers on the newly available XUV 3XO. Elevated stock levels indicate a pressing need for dealers to liquidate existing inventory. Concurrently consumer urgency to purchase remains low as they anticipate better deals and upcoming models. This scenario is poised to trigger even fiercer pricing strategies and aggressive sales tactics in the near term  said Puneet Gupta Director S P Mobility.Meanwhile the automobile industry is hoping for the revival of monsoon and for sales to rebound strongly marking a significant contribution to sustained sales momentum. The last two years have witnessed a good sales momentum in the automobile industry and on a high base we expect the growth to be in a single digit  said Singhania from FADA.         ",
    "The benchmark indices recorded a notable recovery from the day s low for another session closing flat with a negative bias on July 11 while the breadth was positive. About 1403 shares advanced while 924 shares declined on the NSE. The Nifty 50 continued to defend 24300 and if it breaks this level then 2420024100 is the next likely support area while the resistance is placed at the 2440024500 zone. Here are some trading ideas for the near term Amol Athawale VPTechnical Research at Kotak SecuritiesVoltas   CMP  Rs 1512.8Voltas has shown a robust rally from the lower levels in recent sessions. Additionally it is continuously trading in an ascending triangle chart formation along with decent volume activity. Therefore the overall formation indicates a likely breakout for a new leg of an up move from the current levels.Strategy  BuyTarget  Rs 1620StopLoss  Rs 1460LIC Housing Finance   CMP  Rs 790.75After a sharp uptrend rally LIC Housing Finance witnessed a bit of selling pressure but eventually moved to a higher side after taking support. On daily charts the stock has given a fresh breakout from the sloping trendline indicating further bullish momentum in the coming horizon.Strategy  BuyTarget  Rs 850StopLoss  Rs 760Bharat Petroleum Corporation   CMP  Rs 306.6After the downward trend from the levels of around Rs 340 the bearish trend took a pause. Bharat Petroleum Corporation (BPCL) was in a rangebound formation for quite some time which had emerged as a strong base for reversal in the counter. Recently the breakout from the symmetrical triangle chart formation on the daily scale hints at strong upside movement in the coming trading sessions.Strategy  BuyTarget  Rs 330StopLoss  Rs 295Chandan Taparia Head  Equity Derivatives   Technicals Broking   Distribution at Motilal Oswal Financial ServicesBHEL   CMP  Rs 332.7Bharat Heavy Electricals (BHEL) has given a range breakout on the daily chart and is holding gains at higher zones. Buying is visible across the CPSE Index which may support the ongoing up move.Strategy  BuyTarget  Rs 350StopLoss  Rs 320Tata Motors   CMP  Rs 1020.8Tata Motors is in an overall uptrend and gave a trendline breakout on the daily scale. It is trading above all crucial moving averages and supports are gradually shifting higher.Strategy  BuyTarget  Rs 1080StopLoss  Rs 990Mandar Bhojane Equity Research Analyst at Choice BrokingEngineers India   CMP  Rs 290.25Engineers India has recently seen a breakout of an ascending triangle on the daily chart with a significant increase in trading volume indicating a potential breakout. If the price manages to close above the Rs 295 level it may have the potential to reach shortterm targets of Rs 370 and Rs 400. On the other hand immediate support levels are located at Rs 265. These levels can be considered as opportunities to buy on dips. The Relative Strength Index (RSI) currently stands at 66.83 and is trending upward indicating increasing buying momentum.Strategy  BuyTarget  Rs 370 Rs 400StopLoss  Rs 250Gujarat Pipapav Port   CMP  Rs 236.63Gujarat Pipavav Port has recently seen a breakout of rounding breakout on the daily chart with a significant increase in trading volume indicating a potential breakout. If the price manages to close above the Rs 240 level it may have the potential to reach shortterm targets of Rs 280 and Rs 300. On the other hand immediate support levels are located at Rs 220. These levels can be considered as opportunities to buy on dips. The RSI currently stands at 67.5 and is trending upward indicating increasing buying momentum.Strategy  BuyTarget  Rs 280 Rs 300StopLoss  Rs 210DCX Systems   CMP  Rs 434.25DCX Systems has recently seen a breakaway gap up and is trading in range on the daily chart with a significant increase in trading volume indicating a potential breakout. If the price manages to close above the Rs 444 level it may have the potential to reach shortterm targets of Rs 530 and Rs 560. On the other hand immediate support levels are located at Rs 390. These levels can be considered as opportunities to buy on dips. The RSI currently stands at 70 and is trending upward indicating increasing buying momentum.Strategy  BuyTarget  Rs 530 Rs 560StopLoss  Rs 350Kunal Kamble Senior Technical Research Analyst at Bonanza PortfolioHindustan Petrolum Corporation   CMP  Rs 350During June 18 to July 2 Hindustan Petroleum Corporation experienced selling pressure. A struggle between the bear and bull occurred within the Rs 326336 levels. The stock opened with a gap up at Rs 339 and closed at Rs 349.50 suggesting a breakaway gap. The increase in volume indicates growing interest from buyers in the security. The price trading above the 50 (DEMA) signals an upward trend in the security. The RSI s upward movement is endorsing the price action. Based on the technical setup above an upward movement towards Rs 378 is anticipated as long as it maintains levels above Rs 338.Strategy  BuyTarget  Rs 370 Rs 390StopLoss  Rs 338ITC   CMP  Rs 458.65A breakout of the Cup and Handle pattern has occurred in ITC suggesting growing interest from buyers due to a consistent increase in volume. The price is currently trading above the 50 DEMA signalling an upward trend in the security. Following a period of cooling off the RSI has begun moving in a positive direction further supporting the trend. The fact that DI  (directional indicator) is trading above DI reflects favourable strength and the strength of the move is indicated by ADX (average directional index) trading above DI.Strategy  BuyTarget  Rs 480 Rs 500StopLoss  Rs 434Piramal Enterprises   CMP  Rs 934.4On July 3 Piramal Enterprises broke out of a falling trendline and subsequently retraced towards the 50 (DEMA). Near the DEMA the security found support and closed above the falling trendline signalling a continuation of the uptrend. The increase in trading volume suggests growing interest from buyers in Piramal Enterprises. The RSI trading at higher levels indicates an ongoing uptrend in the security. Based on the technical analysis provided it is expected that the stock will move upward towards Rs 976 as long as Piramal Enterprises maintains levels above Rs 904.Strategy  BuyTarget  Rs 970 Rs 1015StopLoss  Rs 860",
    "Tata Motors and Mahindra   Mahindra have cut the prices of their SUV models to boost demand.Tata Motors has revised the starting prices of its flagship SUVs the Harrier (Rs 14.99 lakh) and the Safari (Rs 15.49 lakh) and extended benefits of up to Rs 1.4 lakh on other popular SUV variants. With regards to electric vehicles never before seen benefits on the Nexon.ev (up to Rs 1.3 lakh) have made it the most accessible it has ever been  Tata Passenger Electric Mobility Chief Commercial Officer Vivek Srivatsa said in a statement.Complementing the same the Punch.ev too is being offered with a benefit of up to Rs 30000 he added.Mahindra   Mahindra said its XUV700 s fullyloaded AX7 range now starts at Rs 19.49 lakh a price cut of over Rs 2 lakh.The price cut will enable more people to experience the range it added.        "
]