[
    "By Jigar S Patel Senior Manager  Equity Research at Anand RathiThe Nifty 50 started the week on a positive note reaching a high of around 24270 on Monday. However sentiment was dampened by the release of the Hindenburg report targeting SEBI and escalating geopolitical tensions between Israel and Iran which caused the index to drop to approximately 24100. Despite this setback the bulls staged a strong recovery on Friday propelling the Nifty 50 up by around 400 points and allowing it to close comfortably above the 24500 mark for the week ended August 16.The Nifty 50 s ability to close above 24500 confirms a solid support zone between 24100 and 23900. From a technical perspective the index now appears poised to test the 24700 and 25000 levels in the coming week as these are key resistance zones that need to be breached. Conversely a close below 24100 could signal a bearish Flag breakdown potentially leading to further declines. Traders may want to adopt a  buy on dips  strategy as long as the 24100 level holds.Similarly the Nifty Bank index also rebounded during the last trading session of the week reclaiming the 50500 mark. Looking ahead a close above 50600 would confirm a breakout from a falling wedge pattern with an upside target of around 52000. On the downside a doublebottom formation near 49600 serves as crucial support. A breach of this level could negate the bullish outlook and potentially lead to increased market volatility.Here are three buy calls for the short term Nestle India   CMP  Rs 2525.5Nestle India recently reached a high of Rs 2645 on July 19 2024 but since then it has undergone a correction shedding about 7  gains. Currently the stock is beginning to show signs of stabilizing as it approaches a critical support level near its previous breakout range. This level is significant because such breakout ranges often serve as strong support zones acting as a price floor where buyers might step in. This support area is further reinforced by two key technical indicators  the 200day Exponential Moving Average (DEMA) and the 50 percent Fibonacci retracement level from the stock s prior uptrend which began at Rs 2317 and peaked at Rs 2645.The convergence of these indicators at the current price level highlights the importance of this support zone and suggests it may hold. Moreover technical indicators are starting to turn favourable. Specifically the Relative Strength Index (RSI) on the hourly chart has formed a bullish divergence a pattern that often signals a potential reversal or upward momentum in price. Considering these technical factors it is advisable to initiate a long position in Nestle India within the price range of Rs 25002530.Strategy  BuyTarget  Rs 2760StopLoss at Rs 2395Macrotech Developers   CMP  Rs 1296After reaching a high near Rs 1595 Lodha has undergone a substantial decline shedding 28 percent gains. This significant correction has brought the stock down to a critical technical level where it has found support at the 200day DEMA. The 200 DEMA is a widely recognized indicator used by traders to identify longterm support levels and in this case it appears to be playing a crucial role in stabilizing the stock. Adding to the significance of this support level a bullish BAT pattern has emerged right at the 200 DEMA further strengthening the case for a potential reversal in the stock s downtrend.The bullish BAT pattern a harmonic trading pattern known for its reliability in signaling potential price reversals suggests that the stock may be poised for a recovery. Given these technical signals it is recommended to consider taking a long position in Lodha within the price range of Rs 12751300. The potential upside target is set at Rs 1400 providing a favourable riskreward ratio. To manage risk a stoploss should be placed at Rs 1232 on a daily closing basis ensuring that any further downside movement is contained.Strategy  BuyTarget  Rs 1400StopLoss  Rs 1232Bajaj Finance   CMP  Rs 6590.9Bajaj Finance reached a peak of Rs 7429 on June 18 2024 but since then it has undergone a notable decline losing about 11 percent of its value. This drop has brought the stock down to a critical support level around Rs 6500 a historically significant zone where the stock has previously found stability. At this juncture the RSI on the hourly chart is showing a bullish divergence near this support level a technical signal that often indicates a potential reversal in price trends. This suggests that the current price levels might offer a favorable buying opportunity.Adding further weight to this view a bullish BAT pattern has emerged right at Rs 65006600 support zone. The bullish BAT pattern a harmonic trading pattern known for predicting price reversals reinforces the likelihood of a turnaround in the stock s recent downtrend. Given these technical indicators we recommend taking a long position in Bajaj Finance within the price range of Rs 65756600. The potential upside target is set at Rs 7000 with a stoploss at Rs 6385 on a daily closing basis to effectively manage risk and protect against further downside.Strategy  BuyTarget  Rs 7000StopLoss  Rs 6385",
    "Bajaj Finance arm Bajaj Housing Finance is targeting a valuation of between Rs 56000 crore and Rs 59000 crore for its initial public offering multiple industry executives familiar with the development said.The IPO will mark the return of the Bajaj Group to the public markets after several years.   was the first to report the firm s listing plans on March 27. The firm is looking at a postmoney valuation range between Rs 56000 crore to Rs 59000 crore and plans to launch the IPO in the first half of September though timelines haven t been frozen yet  one of the people cited above said requesting anonymity.In June Bajaj Housing Finance filed draft papers with SEBI for a Rs 7000 crore IPO including new shares worth Rs 4000 crore and a Rs 3000 crore offer for sale by its parent. The market regulator gave its nod to the IPO earlier this month.A second person told   that the size of the issue is likely to be trimmed to between Rs 6300 crore and Rs 6600 crore. A third person confirmed the same.An email query to parent Bajaj Finance remained unanswered at the time of publishing this article.At the end of day s trade on August 14 the market cap of Bajaj Finance and Bajaj Finserv was around Rs 4 lakh crore and Rs 2.46 lakh crore respectively.Kotak Mahindra Capital BofA Securities Axis Capital JM Financial Ltd IIFL Securities Goldman Sachs and SBI Capital Markets are the bookrunning lead managers. Cyril Amarchand Mangaldas is the legal advisor to the housing financier.The upper layer clauseThe move by Bajaj Housing Finance is in line with RBI s mandatory requirement for  upper layer  NBFCs to list within three years of being notified i.e September 2025.On September 30 2022 the RBI announced the list of 16 NBFCs in the Upper Layer under Scale Based Regulation for NBFCs. The framework categorised NBFCs in Base Layer (NBFCBL) Middle Layer (NBFCML) Upper Layer (NBFCUL) and Top Layer (NBFCTL). It specified that Upper Layer shall comprise of those NBFCs which are specifically identified by the Reserve Bank based on a set of parameters and scoring methodology.Apart from Bajaj Housing Finance the Upper Layer list also included Tata Sons HDB Financial Services Tata Capital Financial Services Aditya Birla Finance and Shanghvi Finance.A closer look at Bajaj Housing Finance and NBFC IPOsBajaj Housing Finance is a diversified NBFC catering to more than 76.5 million customers across the country according to its website. Based in Pune it offers finance to individuals as well as corporate entities for the purchase and renovation of homes or commercial spaces.For the year ended March 31 2024 Bajaj Housing Finance had assets under management of Rs 91370 crore which grew by 32 percent. It will utilise the net proceeds from the fresh issue to augment its capital base to meet future business requirements. A portion of the proceeds from the fresh issue will be used towards meeting offer expenses.Listing of the shares on the stock exchanges will also enhance the company s brand name and help create a public market for its equity shares in India the firm said in its draft red herring prospectus.In May PhillipCapital anticipated that Bajaj Housing Finance will debut on the exchanges in September 2025 with an expected listing price of Rs 550570 per share.The brokerage is positive on the firm due to its emphasis on salaried home loans stable expense ratio and minimal credit costs resulting in robust return ratios.Blackstonebacked Aadhar Housing Finance and Westbridgebacked India Shelter Finance are two market debuts from 2024 in the NBFC segment.In June Mumbaibased Avanse Financial Services which is promoted by Warburg Pincus and also backed by Kedaara Capital and IFC filed draft papers with Sebi to raise Rs 3500 crore via an IPO.If the plans of Avanse fructify it would arguably be the firstever listing by an educationfocused NBFC in India.        ",
    "The RBI s Monetary Policy Committee as expectedly maintained the repo rate unchanged at 6.5 percent and remained focused on withdrawal of accommodation to ensure that inflation progressively aligns to the target while supporting growth.The Reserve Bank of India held the full fiscal year growth forecast and inflation estimates at 7.2 percent and 4.5 percent respectively however it revised GDP growth estimates for Q1FY25 downwards to 7.1 percent from 7.3 percent earlier and CPI inflation forecast upwards to 4.4 percent from 3.8 percent earlier for the June FY25 quarter. The central bank still sees higher risks from volatile and elevated food prices which may adversely impact inflation expectations and result in spillovers to core inflation although there are also indications of core inflation bottoming out.In the last reading i.e. for June CPI inflation jumped to fourmonth high of 5.08 percent against 4.75 percent in the previous month on higher food inflation. In fact the food inflation stayed above 8 percent mark for the eighth consecutive month. This clearly indicates that the rates are likely to remain higher for longer at least till the inflation consistently aligns to the 4 percent target on a durable basis.Hence the MPC reiterates the need to continue with the disinflationary stance until a durable alignment of the headline CPI inflation with the target is achieved. This is in continuity with the stance of the governor and our expectations. This is what the markets have been expecting so I don t see the interest rate decision moving markets  Divam Sharma Founder and Fund Manager at Green Portfolio said.By maintaining the status quo RBI is keeping up with its stance of balancing inflation and growth. It s a positive thing that India as an economy is able to stay relatively less affected by global cues he believes.According to Puneet Sharma CEO and Fund Manager at Whitespace Alpha the Governor s hawkish tone suggests that a rate cut in the near future is less certain reflecting a cautious stance in the face of inflationary risks. This decision reinforces the RBI s strategy of cautious optimism aiming for a stable and sustainable economic environment he said.The benchmark indices remained lacklustre after the RBI policy while among rate sensitive sectors Nifty Bank and Nifty Auto traded half a percent higher but Nifty Realty index was marginally down at the time of writing this article.The Nifty 50 was up 5 points at 24303 and the BSE Sensex gained 16 points at 79484 while the Nifty Midcap 100 and Smallcap 100 indices rose half a percent each.  collated a list of top 9 rate sensitive stocks from experts with a 34week perspective. The stock price of August 7 is considered for the calculation of returns Ashish Kyal CMT Founder and CEO of Waves Strategy AdvisorsBajaj Finance   CMP  Rs 6637Bajaj Finance is forming classical triangle pattern since many years. The stock has been moving in a broad range and is on verge of completing the downtrend. As per Elliott wave triangle pattern consist of 5 waves Bajaj Finance is in wave (E). Break above Rs 6740 will indicate a possible reversal for a move to Rs 7300 or higher. On downside Rs 6200 is important support which should remain intact. In a nutshell long positions can be created above Rs 6740 with Rs 6200 as stoploss for a target of Rs 7300 followed by Rs 7600 levels.Strategy  BuyTarget  Rs 7300 Rs 7600StopLoss  Rs 6200Axis Bank   CMP  Rs 1136.80Axis Bank is at important juncture. We can see the stock has shown impulsive down move consisting of 5 waves as per Elliott wave. Post its completion we can expect upside reversal or short term retracement. As shown on hourly chart break above Rs 1160 will indicate that wave v is complete and move towards Rs 1210 can be expected which is near 38.2 percent retracement level. On downside important price action support is at Rs 1110 levels.In short long positions can be created on hourly close above Rs 1160 with Rs 1110 as stoploss for a target of Rs 1210 followed by Rs 1255 levels.Strategy  BuyTarget  Rs 1210 Rs 1255StopLoss  Rs 1110Federal Bank   CMP  Rs 192.70Federal Bank shows strong impulsive rise with short term retracement in form of wave iv ongoing. Post completion of this we can expect up move to resume in form of wave v. Break above Gap area of Rs 197 will confirm this scenario for a move to Rs 208 levels as per Elliott wave. In short Federal Bank has important support near Rs 187 levels. As long as same is intact one can expect a move towards Rs 208 and maintain stoploss of Rs 187 on downside.Strategy  BuyTarget  Rs 208StopLoss  Rs 187Jigar S Patel Senior Manager  Equity Research at Anand RathiMacrotech Developers   CMP  Rs 1215.5After reaching a peak near Rs 1595 Lodha has experienced a significant decline dropping nearly 450 rupees which translates to a 28 percent decrease in its price. Currently the stock has found support at its 200day Exponential Moving Average (DEMA). Interestingly a Bullish BAT pattern has emerged precisely at this 200 DEMA support level of Rs 1218. Given these technical indicators we recommend taking a long position in the stock within the price range of Rs 12001220. The potential upside target is set at Rs 1350 while a stoploss should be placed at Rs 1140 on a daily closing basis to mitigate risk.Strategy  BuyTarget  Rs 1350StopLoss  Rs 1140ICICI Bank   CMP  Rs 1172.5At the current juncture ICICI Bank has found support within its previous breakout range and has maintained this level for the past three sessions. Additionally an Alternate Bullish BAT pattern has formed on the daily chart precisely within this support zone of Rs 11651175 making the stock an attractive buy at these levels. This technical setup suggests a strong potential for upward movement. Therefore we recommend buying ICICI Bank in the price range of Rs 11651175. The potential upside target is set at Rs 1220 while a stoploss should be placed near Rs 1145 on a daily closing basis to manage risk effectively.Strategy  BuyTarget  Rs 1220StopLoss  Rs 1145Riyank Arora Technical Analyst at Mehta EquitiesDLF   CMP  Rs 845.65DLF with support at Rs 800 and resistance at Rs 900 shows ongoing momentum with an RSI (Relative Strength Index 14) at 51. Wednesday s trading volumes were nearly equal to its 30day average indicating the stock s strength. The stock is trading well above important moving averages. A buy at the current market price (CMP) is recommended with a stoploss at Rs 800 and a target of Rs 900.Strategy  BuyTarget  Rs 900StopLoss  Rs 800Maruti Suzuki India   CMP  Rs 12371.50Maruti has support at Rs 12000 and resistance at Rs 13000 with an RSI (14) at 45 suggesting potential momentum pickup. Wednesday s session volumes were nearly the same as the 30day average showing robust trading activity. The stock is trading well above significant moving averages. Buying at the current market price is advised.Strategy  BuyTarget  Rs 13000StopLoss  Rs 12000Pravesh Gour Senior Technical Analyst at Swastika InvestmartMahindra and Mahindra   CMP  Rs 2680.85M M had given a breakout to a Flag formation and surged to an alltime high level of Rs 3000. However it has witnessed some profit booking from higher levels and has now retested its breakout level. Levelwise the first support will be at Rs 2615 a slip below this could lead to weakness towards the important support of the Rs 2500. On the upside the first hurdle is placed around Rs 2800 level with the 20   50 DMA placed above this. A rally could be witnessed towards Rs 3000 mark.Strategy  BuyTarget  Rs 3000StopLoss  Rs 2500HDFC Bank   CMP  Rs 1623.5HDFC Bank has created a bottom at its 50 and 20 DMA forming a lucrative chart structure that could lead the sector from current levels. Technically Rs 1570 will be the major support while on the upside the first hurdle will be at Rs 1700 level. Above this a rally could continue towards its higher zone of Rs 1800.Strategy  BuyTarget  Rs 1800StopLoss  Rs 1570",
    "Daimler India a subsidiary of German truck manufacturer Daimler Truck AG has partnered with Bajaj Finance part of the Bajaj Finserv Group to offer comprehensive financing solutions to customers.The collaboration between the two entities aims to enhance the accessibility and convenience of financing options across Daimler India Commercial Vehicles  entire portfolio according to a company release here said on Tuesday. We are delighted to partner with Bajaj Finance as this enables us to offer enhanced and accessible financing solutions to our customers. This collaboration strengthens DICV s ability to provide superior  Total Cost of Ownership  representing a significant advancement in our commitment to deliver exceptional value and support  Daimler India Commercial Vehicles President and Chief Business Officer Sreeram Venkateswaran said. This partnership helps our customers grow their business with confidence and capitalise on new market opportunities  he said in the release.As per the agreement tailored financial products would be designed to meet the needs of Daimler India Commercial Vehicles enhancing flexibility for businesses looking to acquire commercial vehicles from DICV. We are rolling out bespoke solutions for various customers from single truck owners to fleet operators providing them flexible financing options designed to optimise their cash flows and fuel their business growth. The commercial vehicle industry is showing immense promise. Daimler s stateoftheart products and the techled financing experience of Bajaj Finance will empower small and large fleet owners alike.  Bajaj Finance Deputy Managing Director Anup Saha said.The partnership would offer customerfocused finance solutions with faster turnaround time for loan approvals streamlined credit appraisal processes and customised financing options to suit customer needs the release added.         ",
    "KR Choksey s research report on Bajaj FinanceNet Interest Income (NII) for Q1FY25 increased by 24.5  YoY ( 4.4  QoQ) to INR 83653 Mn primarily led by the robust growth in AUM. The NII miss compared to our estimate was 1.5 . PreProvision Operating Profit (PPOP) stood at INR 69475 Mn a growth of 25.3  YoY ( 8.4  QoQ) in Q1FY25. PPOP was 1.0  below our estimates. Profit after tax for Q1FY25 grew by 13.8  YoY ( 2.3  QoQ) to INR 38245 Mn. Higher provisions of INR 16847 Mn have offset the healthy operating performance. Net profit miss against our estimates was 2.3 .OutlookWe have lowered our PAT estimates for FY25E  FY26E by 2.9   2.7  given the expected increase in cost of borrowings and credit costs. We assign a P ABV multiple of 4.5x on FY26E adj. book value of INR 1765.5 to arrive at a target price of INR 7945 per share (earlier INR 8000). We maintain our  BUY  rating on BAF.For all recommendations report click here",
    "ICICI Securitie s research report on Bajaj FinanceGNPA ratio was stable at 0.86  vs 0.85  QoQ and 0.87  YoY while NNPA ratio inched up to 0.38  vs 0.37  QoQ and 0.31  YoY. Gross loan loss for the company stood at INR 17.9bn or 2.12 . However during the quarter Bajaj utilised management overlay to the extent of INR 1.05bn and hence loan loss (net) after adjusting for management overlay stood at 1.99 . Even after utilisation loan loss was elevated vs 1.66  QoQ and 1.57  YoY. Muted collection efficiencies was the primary reason for inch up in credit cost as per the management.OutlookBajaj Finance s (Bajaj) Q1FY25 result has been largely in line except credit cost which was higherthanguided range. Credit cost increased to 2.12  (adjusted for management overlay utilisation stood at 1.99 ) vs guidance of 1.751.85 . While management highlighted that incremental delinquency and collection trend in Jul 24 is better than AprJun 24 and credit cost in H2FY25 should be materially lower than H1 meeting FY25 credit cost guidance will be the key thing to watch out. Strong core operating performance as reflected in consolidated AUM growth of 7  QoQ and PPoP growth of 8  QoQ was largely driven by strong 8  QoQ revenue growth. This resulted in Bajaj sustaining industryleading profitability with RoA at 4.6  and RoE at 20  in Q1. Its resilient business model built on strong customer acquisition engines and crosssell augurs well for maintaining leadership in the NBFC space. We retain BUY  TP unchanged at INR 8500 valuing the standalone business at 5x FY26E BVPS and INR 830 towards housing subs.For all recommendations report click here",
    "Sharekhan s research report on Bajaj FinanceBAF reported a mixed performance in Q1FY2025. Higherthanexpected NIM compression (down 25bps qoq) and elevated credit cost (1.9  up 32bps qoq) led to lower earnings growth partially offset by strong AUM growth and contained opex growth. Credit cost has been higher primarily due to muted collection efficiencies and it may remain at current levels in Q2 also but should start to normalise from Q3.NIM is likely to bottom out in H1FY2025. Growth guidance remains intact which is a key positive.OutlookWe retain our BUY rating with a reduced PT of Rs. 8300 with reducing P B multiple. At the CMP the stock trades at 4.9x 4.1x its FY2025E FY2026E BV estimates.For all recommendations report click here",
    "Net Sales at Rs 16098.67 crore in June 2024 up 28.81  from Rs. 12497.81 crore in June 2023.Quarterly Net Profit at Rs. 3911.98 crore in June 2024 up 13.82  from Rs. 3436.89 crore in June 2023.EBITDA stands at Rs. 11146.50 crore in June 2024 up 26.56  from Rs. 8806.99 crore in June 2023.Bajaj Finance EPS has increased to Rs. 63.28 in June 2024 from Rs. 56.83 in June 2023.Bajaj Finance shares closed at 6607.15 on July 24 2024 (NSE) and has given 6.35  returns over the last 6 months and 12.85  over the last 12 months.",
    "Net Sales at Rs 13723.11 crore in June 2024 up 28.69  from Rs. 10664.10 crore in June 2023.Quarterly Net Profit at Rs. 3401.54 crore in June 2024 up 14.95  from Rs. 2959.06 crore in June 2023.EBITDA stands at Rs. 8989.80 crore in June 2024 up 25.54  from Rs. 7160.89 crore in June 2023.Bajaj Finance EPS has increased to Rs. 55.03 in June 2024 from Rs. 48.93 in June 2023.Bajaj Finance shares closed at 6607.15 on July 24 2024 (NSE) and has given 6.35  returns over the last 6 months and 12.85  over the last 12 months.",
    "Motilal Oswal s research report on Bajaj FinanceBAF s 1QFY25 reported PAT grew 14  YoY to  INR39.1b (in line). NII grew 25  YOY to  INR83.6b (in line). Noninterest income stood at  INR20.5b ( 21  QoQ and  22  YoY) due to the resumption of EMI card sourcing and oneoff recovery from writtenoff pool of loans of INR450m. BAF s 1QFY25 NIM contracted  23bp QoQ to  9.8 . Out of this  13bp was on account of rise in CoF and  10bp due to change in AUM composition. AUM growth in 1Q was supported by mortgages commercial (ex LAS) SME and new product segments such as cars and LAP. Higher growth in the secured product segments will likely keep yields under pressure in the near term. The management guided that the change in the AUM mix is expected to stabilize by Oct 24 which will result in stable NIMs. We estimate NIM of 9.9  10  in FY25 FY26.OutlookDespite a healthy PAT CAGR of  24  over FY24FY26E and RoA RoE of 4.2  22  in FY26E we see limited upside catalysts. Consequently we maintain our Neutral rating on the stock with a TP of INR7500 (premised on 4.2x FY26E BVPS).For all recommendations report click here",
    "Emkay Global Financial s research report on Bajaj FinanceBajaj Finance (BAF) reported satisfactory results in Q1FY25 wherein AUM and PPoP were largely in line with consensus our estimates  but the prolonged electoral activityled disruptions in collections caused an increase in credit cost ( 2.12  of Assets Under Finance) that drove a  4  miss on our PAT estimate. The management maintained guidance of  2628  AUM growth and  1.75 1.85  credit cost for FY25 with an upward bias in credit cost. To reflect the Q1 developments and management commentary we have adjusted our FY2527 estimates leading to a  2  cut in earnings owing to  12bps increase in credit cost to  1.9 . BAF shares have underperformed the NIFTY by  15  in the last 3 months and the current blip in credit cost seems to be already pricedin.OutlookGiven  4  RoA and  20  RoE with the over 20  earnings growth intact we reiterate our BUY rating on the stock with revised down Jun25E TP to Rs9000 sh (vs Rs9300 earlier) implying FY26E P BV of 5.1x.For all recommendations report click here",
    "Here s a quick look at stocks likely to be in focus in Wednesday s trade covering quarterly earnings order wins and fundraising announced by companies after market hours on Tuesday Results TodayLarsen   Toubro Axis Bank SBI Life Insurance Company Bajaj Finserv Federal Bank Petronet LNG Jindal Steel   Power Aditya Birla Sun Life AMC Aurionpro Solutions Bikaji Foods International CG Power and Industrial Solutions CMS Info Systems DCB Bank HFCL Indian Energy Exchange Indraprastha Gas JK Paper KPIT Technologies Karnataka Bank Oracle Financial Services Software Hitachi Energy India Ramkrishna Forgings SIS Sona BLW Precision Forgings Syngene International Trident Tata Teleservices VGuard Industries and Welspun Living will release quarterly earnings on July 24.Quarterly EarningsHindustan Unilever Q1 (Standalone YoY)Profit grows 2.7  to Rs 2538 crore Vs Rs 2472 croreRevenue increases 1.3  to Rs 15339 crore Vs Rs 15148 croreEBITDA rises 2.4  to Rs 3606 crore Vs Rs 3521 croreMargin expands to 23.5  Vs 23.2 Underlying volume growth at 4 Bajaj Finance Q1 (Consolidated YoY)Profit rises 14  to Rs 3912 crore Vs Rs 3437 croreNet interest income jumps 25  to Rs 8365 crore Vs Rs 6717 croreGross NPA increases to 0.86  Vs 0.85  (QoQ)Net NPA ratio climbs to 0.38  Vs 0.37  (QoQ)United Spirits Q1 (Consolidated YoY)Profit grows 1.7  to Rs 485 crore Vs Rs 477 croreRevenue soars 3.5  to Rs 2761 crore Vs Rs 2667 croreEBITDA remains flat at Rs 713 croreMargin drops 90 bps to 25.8  Vs 26.7 Torrent Pharmaceuticals Q1 (Consolidated YoY)Profit grows 21  to Rs 457 crore Vs Rs 378 croreRevenue increases 10.3  to Rs 2859 crore Vs Rs 2591 croreEBITDA rises 14.3  to Rs 904 crore Vs Rs 791 croreMargin expands 110 bps to 31.6  Vs 30.5 ICICI Prudential Life Insurance Q1 (YoY)Value of new business (VNB) grows 7.8  to Rs 472 crore Vs Rs 438 croreVNB margin drops to 24  Vs 30 Premium growth (APE) increases 34.4  to Rs 1963 crore Vs Rs 1461 croreProfit climbs 8.7  to Rs 225 crore Vs Rs 207 croreParag Milk Foods Q1 (Consolidated YoY)Profit jumps 27.5  to Rs 27.3 crore Vs Rs 21.4 croreRevenue grows 1.1  to Rs 757.9 crore Vs Rs 749.6 croreDCM Shriram Q1 (Consolidated YoY)Profit surges 77.3  to Rs 100.3 crore Vs Rs 56.6 croreRevenue grows 4.6  to Rs 3073 crore Vs Rs 2937.2 croreSchaeffler India Q1 (Consolidated YoY)Profit rises 3.4  to Rs 245.5 crore Vs Rs 237.3 croreRevenue jumps 15.2  to Rs 2106.8 crore Vs Rs 1829.1 croreThyrocare Technologies Q1 (Consolidated YoY)Profit spikes 38.8  to Rs 23.9 crore Vs Rs 17.3 croreRevenue grows 16.3  to Rs 156.9 crore Vs Rs 134.9 croreStocks To WatchDr Reddy s LaboratoriesThe Board of Directors of the pharma company will meet on July 27 to consider the subdivision of existing equity shares including the American Depository Shares.VedantaThe company at its board meeting on July 26 will consider the second interim dividend on equity shares if any for FY25.Tata Consumer ProductsThe FMCG company has fixed July 27 as a record date for its Rs 3000 crore rights issue. The rights issue price has been fixed at Rs 818 per share. The rights issue will open on August 5 and close on August 19.Bajel ProjectsThe company has received contracts for the supply of goods and services for a transmission line package from PowerGrid Corporation of India amounting to Rs 586.28 crore.South Indian BankThe bank said the board members will meet on July 30 to consider raising funds via the issuance of equity shares through preferential issue and or Qualified Institutions Placement (QIP) or any other methods on a private placement basis or FPO.Titagarh Rail SystemsThe company has commenced the export of traction converters. The first batch of 8 converters was shipped to Titagarh Firema SpA (Titagarh Firema) Italy on July 19. This export is part of a 7.18 million euros (Rs 65 crore) order received by Titagarh Rail from Titagarh Firema.SME Listing on July 24Macobs Technologies Kataria IndustriesStocks Turn ExDividendAvadh Sugar   Energy Dynamic Cables Elgi Equipments Fiem Industries Fortis Healthcare Fortis Malar Hospitals Hatsun Agro Product Honeywell Automation Indo Count Industries IFGL Refractories Lakshmi Machine Works Pidilite Industries Privi Speciality Chemicals Vinyl ChemicalsF O BanGNFC India Cements SAIL        ",
    "India s largest nonbank lender Bajaj Finance anticipates net interest margins (NIMs) to stabilise from September onwards following a contraction of approximately 23 basis points (bps) yearonyear in the AprilJune quarter (Q1FY25). We expect NIMs to resume its sideways movement after one more quarter. Margin contraction seen in the Juneended quarter was attributed primarily to higher funding costs as well as AUM composition  the management said in their postearnings conference call.In Q1FY25 the cost of funds increased by 8 basis points on a sequential basis to 7.94 percent. Looking ahead the management indicated that funding costs are expected to decrease and the RBI s interest rate easing would further moderate margin compression.ALSO READ  Bajaj Finance Q1 results  Net profit grows 14  onyear to Rs 3912 crore misses estimatesBajaj Finance s consolidated net profit rose 14 percent YoY to Rs 3912 crore in Q1FY25 while net interest income advanced by 25 percent YoY to Rs 6717 crore. The lender s new loans booked also rose 10 percent YoY to 1.1 crore in the quarter ended June.Meanwhile loan losses and provisions in Q1 were elevated primarily on account of muted collection efficiencies while Stage 2 assets in Q1 went up by Rs 865 crore over Q4.  Given elevated stage 2 assets loan losses may remain at current levels in Q2 and should start to normalise by Q3 the management added.The lender s gross nonperforming assets (GNPA) and NNPA stood at 0.86 percent and 0.38 percent Q1FY25 as against 0.87 percent and 0.31 percent in the yearago period seen as lowest amongst the industry. ",
    "Bajaj Finance reported on Tuesday 23 July that its Q1 FY25 net profit rose 14 percent onyear to Rs 3912 crore missing street expectations. India s largest nonbanking finance company s AprilJune net interest income (NII) grew 25 percent onyear to Rs 8365 crore.A   poll of 7 brokerage estimates had pegged Bajaj Finance s fiscal first quarter net profit at Rs 4020 crore and NII at Rs 9042 crore.The company has resumed sanction and disbursal of loans under  eCOM  and  lnsta EMI Card  and issuance of EMI cards after the RBI removed the restrictions on these businesses on 2 May 2024 it said.Earlier in its Q1 business update Bajaj Finance had said that its new loans grew by 10 percent during the quarter to 1.1 crore bookings. Assets under management expanded 31 percent onyear to Rs 3.5 lakh crore at the end of the quarter. The deposit book also saw a rise of 26 percent YoY to Rs 62750 crore in the quarter ended June.Gross NPA and net NPA as of nonbank lender as of 30 June 2024 stood at 1.06 percent and 0.47 percent respectively compared to 1.09 percent and0.39 percent as of 30 June 2023.The company s two and three wheeler finance portfolio grew 34 percent and stood at Rs 19689 crore. It reported a jumbo 157 percent jump in its car loan portfolio to Rs 8710 crore. Urban B2C portfolio of the company stood at 69988 crore growing by31 percent on a YoY basis.Shares of the company closed for trading at Rs 6740 2.07 percent down on BSE.        ",
    "India s largest nonbank lender Bajaj Finance slated to release AprilJune quarter results on July 23 2024 is expected to clock healthy net interest income (NII) and profit growth supported by robust credit offtake said analysts.According to an average estimate of 7 brokerages Bajaj Finance is pegged to register 34 percent yearonyear (YoY) rise in NII to Rs 9042 crore in Q1FY25 from Rs 6719 crore in the yearago period. Profit too is estimated to increase by 17 percent YoY to Rs 4020 crore in Q1FY25 from Rs 3437 crore a year back.What factors are driving the earnings Strong loan deposits growth  In its Q1 business update Bajaj Finance saw 10 percent onyear growth in new loans booked at 1.1 crore resulting in 31 percent YoY increase in assets under management to Rs 3.5 lakh crore. The deposit book also saw a rise of 26 percent YoY to Rs 62750 crore in the quarter ended June.ALSO READ  IRDAI imposes Rs 2 crore penalty on Bajaj Finance for violating regulationsStable margin  Analysts at Kotak Institutional Equities estimate Bajaj Finance s margin to show mild expansion at 10.4 percent in Q1FY25 as seasonal inchup in yields would offset rise in cost of funds. Net interest margin of the nonbank lender stood at 10 percent in the yearago period.Healthy assetquality  Emkay Global analysts predicted Bajaj Finance s grossstage 3 and netstage 3 assets to remain below 1 percent level at 0.9 percent and 0.3 percent respectively in the quarter ended June.What to look out for in the quarterly show Analysts will track the management s commentary on sustenance of growth momentum progress on liberalised remittance scheme that allows Indian residents to remit funds abroad for certain purposes margin trends and loan growth outlook.So far this year the stock of this nonbank lender declined over 5 percent underperforming benchmark Nifty 50 s 12 percent rise during the same period.",
    "Here s a quick look at stocks likely to be in focus in Thursday s trade covering quarterly earnings order wins and fund raising announced by companies after market hours on Tuesday as well as Wednesday Results TodayInfosys L T Technology Services Tata Technologies Persistent Systems Dalmia Bharat Ceat Havells India Central Bank of India Andhra Cements Ashapuri Gold Ornament Bharat Bijlee Choice International CIE Automotive India Gopal Snacks Grindwell Norton JSW Infrastructure Mastek Newgen Software Technologies Polycab India Premier Explosives Rallis India Reliance Industrial Infrastructure Sagar Cements Shoppers Stop South Indian Bank Swaraj Engines Sterling and Wilson Renewable Energy Tanla Platforms Tata Communications Trident Texofab and Vraj Iron and Steel will announce quarterly earnings on July 18.Quarterly EarningsAsian Paints Q1 (Consolidated YoY)Net profit falls 24.6  to Rs 1186.8 crore Vs Rs 1574.8 croreRevenue declines 2.3  to Rs 8969.7 crore Vs Rs 9182.3 croreEBITDA drops 20.2  to Rs 1693.8 crore Vs Rs 2121.3 croreMargin sinks 420 bps to 18.9  Vs 23.1 LTI Mindtree Q1 (Consolidated QoQ)Net profit grows 3.1  to Rs 1135.1 crore Vs Rs 1100.7 croreRevenue rises 2.8  to Rs 9142.6 crore Vs Rs 8892.9 croreEBIT increases 4.8  to Rs 1370.9 crore Vs Rs 1308.7 croreEBIT margin expands to 15  Vs 14.7 Revenue in dollar terms up 2.5  at USD 1096.2 million Vs USD 1069.4 millionL T Finance Q1 (Consolidated YoY)Net profit jumps 29.1  to Rs 685.5 crore Vs Rs 531 croreRevenue rises 17.4  to Rs 3784.4 crore Vs Rs 3223.3 croreNet interest income grows 23  to Rs 2020 crore Vs Rs 1644 croreConsolidated book size increases 13  to Rs 88717 crore Vs Rs 78566 croreNetwork18 Media and Investments Q1 (Consolidated YoY)Revenue falls 3  to Rs 3141 crore Vs Rs 3239 croreOperating EBITDA loss at Rs 148 crore Vs Rs 84 croreTV18 Broadcast Q1 (Consolidated YoY)Revenue drops 3  to Rs 3069 crore Vs Rs 3176 croreOperating EBITDA loss at Rs 109 crore Vs EBITDA loss at Rs 54 croreTV News EBITDA at Rs 40 crore Vs EBITDA loss at Rs 6 croreEntertainment business EBITDA loss at Rs 149 crore Vs EBITDA loss at Rs 49 croreAditya Birla Money Q1 (YoY)Net profit jumps 73.4  to Rs 16.4 crore Vs Rs 9.4 croreNet interest income increases 47.8  to Rs 88.5 crore Vs Rs 59.9 croreCompany appoints Ashok Suvarna as Chief Executive Officer effective September 1 2024Just Dial Q1 (YoY)Net profit spikes 69.3  to Rs 141.2 crore Vs Rs 83.4 croreRevenue grows 13.6  to Rs 280.5 crore Vs Rs 247 croreEBITDA surges 119.8  to Rs 80.6 crore Vs Rs 36.7 croreMargin expands to 28.7  Vs 14.9 Alok Industries Q1 (Consolidated YoY)Net loss narrows to Rs 206.9 crore Vs loss at Rs 226.1 croreRevenue drops 28.9  to Rs 1006.3 crore Vs Rs 1414.9 croreEBITDA spikes 68.6  to Rs 20.75 crore Vs Rs 12.3 croreMargin jumps to 2.06  Vs 0.87 Elecon Engineering Company Q1 (Consolidated YoY)Net profit increases 0.5  to Rs 73.4 crore Vs Rs 72.96 croreRevenue falls 5.3  to Rs 392.4 crore Vs Rs 414.3 croreHathway Cable   Datacom Q1 (Consolidated YoY)Net profit declines 18  to Rs 18.32 crore Vs Rs 22.4 croreRevenue rises 0.7  to Rs 502.6 crore Vs Rs 499.2 croreStocks To WatchAdani Green Energy Q1 Provisional Operational Update (YoY)Operational capacity increased by 31  to 10934 MW with greenfield addition of 2418 MW solar and 200 MW wind power plantsSale of energy increased by 22  at 7356 million units backed by robust capacity additionSolar portfolio CUF (capacity utilisation factor) at 25.4  backed by 99.4  plant availabilityWind portfolio CUF at 36.2  backed by 96.8  plant availabilityConsistent high Hybrid portfolio CUF at 46.0  backed by 99.7  plant availabilityKoltePatil Developers Q1 Operational Update (YoY)Collections grow 19  to Rs 612 crore Vs Rs 513 croreSales value rises 1  to Rs 711 crore Vs Rs 701 croreSales volume increases 3  to 0.96 million square feet Vs 0.93 million square feetOne 97 CommunicationsFlixBus announced a strategic partnership with Paytm to significantly enhance its distribution capabilities. This partnership will enable FlixBus to tap into Paytm s vast customer base and technological expertise.KEC InternationalThe RPG Group company has secured new orders worth Rs 1100 crore for transmission   distribution (T D) projects in India the Middle East Australia and the Americas. These orders include 765 kV transmission line and 765 kV GIS substation orders in India from the Power Grid Corporation of India and a 132 kV transmission line in the United Arab Emirates (UAE).Bharti AirtelThe telecom operator has added 12.50 lakh subscribers in May 2024 up 66.2  from the addition of 7.52 lakh users in the previous month. The company held a 33.17  market share of wireless subscribers as of May 2024.Reliance IndustriesSubsidiary Reliance Jio added 21.95 lakh users in May compared to 26.87 lakh users added in the previous month. It had a 40.6  market share of wireless subscribers as of May 2024.Vodafone IdeaThe telecom operator lost 9.24 lakh subscribers in May this year compared to a loss of 7.35 lakh users in the previous month. It had an 18.66  market share of wireless subscribers as of May 2024.Adani EnterprisesSirius Digitech a joint venture between the Adani Group and Sirius International Holding (a subsidiary of International Holding Company (IHC)) signed binding agreements for the acquisition of Coredge.io a sovereign AI and cloud platform company.Sarda Energy   MineralsThe board of directors will meet on August 3 to consider unaudited results for the first quarter of FY25 and seek shareholder consent for fundraising.ESAF Small Finance BankThe Reserve Bank of India has approved the reappointment of Kadambelil Paul Thomas as Managing Director   CEO of the bank for three years effective October 1 2024.Glenmark PharmaceuticalsThe pharma company has received final approval from the United States Food   Drug Administration (US FDA) for Topiramate capsules USP 15 mg and 25 mg. Topiramate is used in the treatment of epilepsy.TVS Motor CompanyThe company will invest 200 million pounds in its subsidiary Norton Motorcycles for international expansion with an initial focus on the USA Germany France Italy and India.SpiceJetAshish Kumar has resigned as Head of Finance and Chief Financial Officer of the company to pursue other opportunities. The company has appointed Joyakesh Podder as the Head of Finance and designated him as the Deputy Chief Financial Officer effective July 15.Bajaj FinanceThe Insurance Regulatory and Development Authority of India (IRDAI) has levied a penalty of Rs 2 crore on the company for violating provisions of IRDAI Regulations. IRDAI conducted an onsite inspection of Bajaj Finance during March 3 and March 5 2021 for the period FY18 to FY20. IRDAI has also advised the company to comply with those directions in a timebound manner.Oil and Natural Gas CorporationONGC has commenced production from its coal bed methane (CBM) block in Bokaro Jharkhand. The initial production stands at 170000 SCMD and is expected to ramp up to 300000 SCMD by the end of the current financial year.Techno Electric   Engineering CompanyThe firm launched its Qualified Institutions Placement (QIP) issue on July 16 and fixed the floor price for QIP at Rs 1506.58 per share.GMR Airports InfrastructurePassenger traffic in June this year grew by 8  YoY with domestic traffic up 6.4  and international traffic up 12.8 . Aircraft movements increased by 6  YoY in June.Bajaj ElectricalsAnuj Poddar has resigned as Managing Director   CEO of the company effective September 30 2024 to explore an external opportunity.Zee Entertainment EnterprisesThe board has approved raising funds by issuing 5  foreign currency convertible bonds (FCCBs) up to USD 239 million (Rs 1997.22 crore) maturing in 10 years on a private placement basis to proposed investors  Resonance Opportunities Fund St. John s Wood Fund and Ebisu Global Opportunities Fund. The FCCB issue opened on July 16.Bulk DealsVijaya Diagnostic CentreForeign portfolio investor AL Mehwar Commercial Investments LLC sold a 0.58  stake in the diagnostic chain at an average price of Rs 775.03 per share.Indiabulls Housing FinancePlutus Wealth Management LLP bought 6579936 partly paid up shares in the housing finance company at an average price of Rs 68.16 per share valuing at Rs 44.8 crore. Aalidhra Textool Engineers purchased 25 lakh shares in Indiabulls Housing at an average price of Rs 67.15 per share. However Santosh Kumar Garg sold 2342587 shares at an average price of Rs 66.61 per share and Vibgyor Investors Developers offloaded 2541557 shares at an average price of Rs 66.64 per share.Stocks Turn ExDividendAdvanced Enzyme Technologies Amara Raja Energy   Mobility Arvind SmartSpaces ASM Technologies Bliss GVS Pharma Can Fin Homes Golkunda Diamonds   Jewellery GPT Healthcare Kanoria Energy   Infrastructure Nelcast Newgen Software Technologies Panasonic Energy India Company Praj Industries Tanla Platforms Thangamayil Jewellery Ultramarine   Pigments UTI Asset Management CompanyStock Trades ExDate for SplitKPI Green EnergyF O BanBalrampur Chini Mills Piramal Enterprises Vedanta Chambal Fertilisers and Chemicals GMR Airports Infrastructure GNFC Hindustan Copper RBL BankStocks Removed From F O BanAditya Birla Fashion   Retail India Cements Indus Towers",
    "Insurance Regulatory and Development Authority of India (IRDAI) has levied a penalty of Rs 2 crore on Bajaj Finance for the violation of regulatory norms the Punebased NBFC said in an exchange filing on July 16.The nonbanking financial company said the insurance regulator had conducted an onsite inspection of Bajaj Finance Limited between March 3 2021 and March 5 2021 for the period FY18 to FY20 the firm said in the filing.On March 14 2024 the NBFC received a showcause notice from the regulator. Following the response from the NBFC the insurance regulator issued an order dated July 15 2024 levying a penalty in aggregate of Rs 2 crore for violation of provisions of IRDAI regulations according to the company statement.The NBFC reiterated its commitment to compliance and stated no material impact on its operations.On July 16 the shares of the company declined marginally by 0.27 percent to Rs 7045 on NSE.The regulator levied a penalty of Rs 1 crore for  reconciliation of commission and professional fees received and that reported to the authority in violations of norms  and another Rs 1 crore  with respect to maintenance of records of customer documentation in violations of various rules of IRDAI (Registration of Corporate Agents) Regulations 2015.In April the country s largest nonbanking lender reported a 21 percent growth in its consolidated profit after tax at Rs 3825 crore in the fourth quarter of the financial year 202324 from Rs 3158 crore in the yearago period.In the reporting quarter company s assets under management (AUM) jumped 34 percent to Rs 3.31 lakh crore from Rs 2.47 lakh crore in the same period of previous year. AUM grew by Rs 19647 crore in Q4FY24.        ",
    "Sharekhan s research report on Bajaj FinanceBajaj Finance Ltd (BAF) reported strong business momentum in Q1FY25 and continued to beat its guidance (of 2628 ) for AUM growth. AUM grew by 31  yoy  7  qoq to Rs. 354100 crore. New loans booked grew by 10  yoy  39  qoq to 10.97 million. BAF has resumed sanction and disbursal of loans under  eCOM  and  Insta EMI Card  after the RBI lifted restrictions in the beginning of May.OutlookWe reiterate a Buy on the stock with an unchanged PT of Rs. 9300 driven by sector leading growth and profitability. At CMP the stock trades at 5.3x 4.4x FY2025E FY2026E BV estimates.For all recommendations report click here",
    "Shares of Bajaj Finance surged over a percent to Rs 7325 per share on July 4 after it reported 31 percent yearonyear (YoY) increase in assets under management (AUM) in the Juneended quarter (Q1FY25).In the past month the stock of this NBFC giant surged over 16 percent beating 11 percent rise in benchmark Nifty 50 index. Earlier Bajaj Finance had hit fresh 52week high of Rs 8190 apiece on October 6 2023.Catch all the market action on our LIVE blogBajaj Finance s AUM rose to Rs 3.5 lakh crore in Q1FY25 up from Rs 2.7 lakh crore in the yearago period. New loans booked during the quarter also improved by 10 percent YoY to 10.9 million as compared to 9.9 million in the corresponding quarter of FY24.That apart the deposit book also climbed by 26 percent YoY to Rs 62750 crore in Q1FY25. The management said that the nonbank lender s consolidated net liquidity surplus was nearly Rs 16200 crore.Additionally customer franchise f the company rose to 88.11 million from 72.98 million as of June 30 2023. It had increased by 4.47 million in Q4 FY24.Bajaj Finance resumed sanction and disbursal of loans under  eCOM  and  Insta EMI Card  and issuance of EMI cards after the RBI removed the restrictions on these businesses on May 2 2024. The company also had raised around Rs 10000 crore via qualified institutional placement (QIP) and preferential allotment which is expected to support growth till FY26F said analysts at InCred Equities. The aggressive customer acquisition and flawless diversity into new business segments are the unique features of the company. The reshuffle in managerial roles provides comfort over management stability and ability of the company to maintain diversified growth momentum  they added retaining an  add  rating on Bajaj Finance with Rs 9000 target price.",
    "Here s a quick look at the stocks that will be in focus in trade on Thursday covering quarterly provisional numbers major order wins and large deals announced by companies after market hours on Wednesday Results TodayLe Travenues Technology (Ixigo) will announce its results for quarter ended March FY24 on July 4.Stocks To WatchTata SteelThe National Company Law Tribunal (NCLT) Mumbai Bench has approved the Scheme of Amalgamation among Tata Steel and Angul Energy and their respective shareholders.Bandhan BankThe bank recorded 21.8  yearonyear (YoY) and 0.7  quarteronquarter (QoQ) growth in loans and advances at Rs 125619 crore for Q1FY25. Total deposits fell 1.5  QoQ but grew 22.8  YoY to Rs 133203 crore in Q1. CASA deposits registered a 13.8  YoY growth and retail deposits (including CASA) rose 19.2  YoY while bulk deposits jumped 31.6  YoY for the quarter.Bajaj FinanceThe nonbanking finance company has recorded assets under management (AUM) at Rs 3.54 lakh crore for Q1FY25 growing 31  over the yearago period. The deposits book at Rs 62750 crore increased by 26  compared to Q1FY24. Net liquidity surplus was Rs 16200 crore as of June 2024. New loans booked during Q1FY25 grew by 10  YoY to 10.97 million.L T FinanceThe retailisation in Q1FY25 is estimated at 95  against 82  in Q1FY24. Retail disbursements for Q1FY25 are estimated at Rs 14830 crore growing 33  YoY and the retail loan book at the end of June FY25 quarter is estimated at Rs 84440 crore a growth of 31  YoY.VedantaThe cast metal aluminum production at the company s smelters stood at 5.96 lakh tonnes up 3  YoY due to better operational performance while the alumina production at Lanjigarh refinery was at 5.39 lakh tonnes growing 36  YoY driven by new capacity. Oil and gas production for the quarter was down 17  YoY.Suryoday Small Finance BankThe bank recorded gross advances at Rs 9037 crore in the June FY25 quarter growing 42  YoY while disbursement jumped 46  YoY to Rs 1740 crore. Total deposits grew by 42  YoY to Rs 8137 crore for Q1FY25. Gross NPA dropped to 2.67  in Q1FY25 against 2.80  in Q4FY24.Brigade EnterprisesThe Bengalurubased real estate developer has signed a Joint Development Agreement for a residential project spread across 8 acres with a total development potential of around 1.2 million square feet. The gross development value of the project is around Rs 1100 crore.GE T D IndiaThe company has received an order worth 64 million euros from Grid Solutions SAS France for the supply and supervision of high voltage products. It has also bagged an order worth 26 million euros from Grid Solutions Middle East FZE Dubai for the supply and supervision of high voltage products.MaricoThe FMCG company announced a collaboration with Kaya to scale up its play in advanced sciencebacked personal care aiming to build an omnichannel presence of Kaya s product range by leveraging Marico s sales and marketing capabilities.Shri Gang Industries and Allied ProductsSyed Azizur Rahman has resigned as Chairperson and NonExecutive NonIndependent Director of the company effective July 4.Koura Fine Diamond JewelryThe board has appointed Charmi Kamlesh Lodhiya as Chief Financial Officer (CFO) of the company effective July 3 following the resignation of Krunal Soni as CFO.Zee Media CorporationThe Ministry Of Corporate Affairs has given its approval to the company for the incorporation of the subsidiary Pinews Digital.Indiabulls Real EstateThe company s name has been changed from Indiabulls Real Estate to Equinox India Developments.Bulk DealsYatharth Hospital   Trauma Care ServicesICICI Prudential Mutual Fund has bought an additional 2.3  stake in Yatharth Hospital at an average price of Rs 405 per share. However Plutus Wealth Management LLP exited the company by selling its entire 2.91  stake at an average price of Rs 405.07 per share.Krishna VenturesGreen Portfolio via its Super 30 Dynamic Fund bought 0.65  shares in the company at an average price of Rs 92.47 per share.Dharmaj Crop GuardElara India Opportunities Fund sold a 0.6  shareholding in the company at an average price of Rs 305.24 per share.Ideaforge TechnologyThink India Opportunities Master Fund LP sold 0.52  shares in the company at an average price of Rs 796.6 per share.Stocks Turn ExDividendTata Power SKF India Solar Industries India Tide Water Oil Balaji AminesStock Trades Exdate For BuybackeClerx ServicesF O BanHindustan Copper India Cements        ",
    "Commercial vehicle maker Ashok Leyland Ltd on Friday said it has partnered with Bajaj Finance for financial of vehicles across India.The company has signed a Memorandum of Understanding (MoU) with Bajaj Finance a part of Bajaj Finserv for the purpose Ashok Leyland said in a statement.The partnership will enable both Ashok Leyland and Bajaj Finance to offer customised and seamless financial solutions to their customers it added. This strategic partnership will strengthen Ashok Leyland s market position  Ashok Leyland CFO KM Balaji said.Bajaj Finance Deputy Managing Director Anup Saha said  We are confident that with Bajaj Finance s bestinclass India stack processes more vehicle owners will gain from this partnership and scale their operations. The sales and marketing teams of the two companies will work together to develop joint marketing and financing programs mutually enhancing business volumes under the partnership the statement said.        ",
    "Tata Motors on Tuesday said it has partnered with Bajaj Finance Ltd for offering financing solutions across its entire commercial vehicle portfolio.The company has signed a memorandum of understanding (MoU) with Bajaj Finance Ltd part of Bajaj Finserv Ltd for the same and customers will benefit from the latter s wide reach competitive interest rates flexi loan and digitallyenabled loan processing Tata Motors said in a statement. We are confident that their (Bajaj Finance) inaugural venture into commercial vehicle financing will allow them to tap the immense potential that the transportation sector brings in and this partnership will benefit entrepreneurs across the country  Tata Motors Commercial Vehicles Vice President   Business Head  Trucks Rajesh Kaul said.With Bajaj Finance s wide network in rural and urban areas customers will have easy access to financing solutions as per their requirements he added.Bajaj Finance Deputy Managing Director Anup Saha said  ... We aim to make the process of purchasing a commercial vehicle accessible and hasslefree. We are confident that the partnership will empower more commercial vehicle owners with financing solutions. Tata Motors offers a range of sub 1tonne to 55tonne cargo vehicles and 10seater to 51seater mass mobility solutions ranging in small commercial vehicles and pickups trucks and buses segments.On the other hand Bajaj Finance is a diversified NonBanking Financial Company (NBFC) in India with presence across lending deposits and payments serving over 8.36 crore customers. As of March 31 2024 its assets under management stood at Rs 330615 crore the statement said.        ",
    "Global brokerage firm Bernstein has initiated coverage ratings on three banking and financial firms  Bajaj Finance IndusInd Bank and Muthoot Finance. Analysts are optimistic about the Indian banking sector citing robust credit growth and favorable asset quality and believe it has a promising future as a great compounding story. While the large private sector banks remain clean compounding stories with their continuous deposit market share gains and emerging scale benefits the niche lenders (typically operating as Nonbank Financial Companies (NBFCs) and Housing Finance Companies (HFCs) offer equally compelling compounding stories  analysts at Bernstein said in a recent note.The brokerage firm gave Bajaj Finance a  marketperform  rating with a target price of Rs 6800 per share. They believe that the company is a true superstar in the Indian lending landscape with flawless execution but much of that is already priced into its valuations. Though its stellar execution has been its biggest differentiator versus peers there are other factors that helped the company over the last decade including a relatively benign competitive environment and a sharp surge in consumption credit as investment cycle slowed and consumption cycle picked up during the last decade  analysts said.Over the past decade Bajaj Finance managed to maintain a stable spread and operating leverage that pushed up its RoA to 4.8 percent compared to an average of 4 percent during the prior decade.Analysts noted that while the NBFC major has healthy growth prospects there is potential for consensus earnings cuts due to headwinds.  Challenges include a sectorwide trend of slowing consumption credit increased competitive intensity and the already high scale of Bajaj Finance which limits outperformance against the overall sector  they stated in a recent note.ALSO READ  PSU banks outsmart private foreign lenders in technical efficiency shows SBI reportDespite these challenges Bernstein expects Bajaj Finance to achieve a compounded annual growth rate (CAGR) of 21 percent in earnings over FY2426 and values the company at a PE of 24x FY25E EPS.On the other hand Bernstein has initiated an  outperform  rating on IndusInd Bank with a target price of Rs 1800 per share citing the bank s strong positioning for a potential rate easing cycle and high exposure to attractive segments like commercial vehicles and microfinance.Compared to its banking peers IndusInd Bank stands to benefit the most from an eventual rate cut given its higher share of fixed rate loans on the assets side as well as higher share of borrowings or wholesale deposits on its liability side. We view IndusInd Bank as a quasiNBFC due to its NBFClike loan book composition and weak deposit franchise. We expect the company s return on equity (RoE) to be 1516 percent and loan growth of 18 percent between FY2426. We value IndusInd Bank on 1.9x FY25E BVPS  the brokerage firm added.ALSO READ  Jonathan Garner of Morgan Stanley  India to emerge as FII s darling  bullish on ICICI Bank Maruti and moreSimilarly Bernstein started an  outperform  rating on Muthoot Finance with a target price of Rs 2000 per share. The brokerage firm sees a promising future for gold loans  amid India s insatiable love for gold and its use as collateral for borrowing. Considering this analysts said that Muthoot Finance the best play in this segment and anticipated 19 percent earnings CAGR from the gold financier valuing it at a PE of 15x FY25 EPS. Muthoot is a pureplay gold loan lender with gold loans forming more than 80 percent of its loan book and has the best operating metrics versus peers in the segment. It has delivered very healthy returns ( more than 20 percent TSR) over the last decade as it maintains its focus on one product that has very attractive returns and a healthy (even if cyclical) growth trajectory  the brokerage firm highlighted.So far this year shares of Bajaj Finance and Muthoot Finance surged up to 20 percent while IndusInd Bank declined by 5 percent. In comparison benchmark Nifty 50 index has increased by 8 percent during the same period.Overall analysts believe that since the regulatory arbitrage between NBFCs and banks are declining NBFCs that focus on catering to niche segments especially the mass market segments still have a long growth runway thanks to the still low debt penetration in India.",
    "Bajaj Housing Finance has filed the DRHP (Draft Red Herring Prospectus) with capital markets regulator SEBI for its proposed IPO to raise as much as Rs 7000 crore. The public issue includes a fresh issue of shares worth Rs 4000 crore. Parent Bajaj Finance Ltd will sell shares worth another Rs 3000 crore via an offer for sale according to the prospectus.  was the first to report the firm s listing plans on March 27. Shares of Bajaj Housing will be listed on the BSE and NSE.Also Read   Bajaj Finance arm Bajaj Housing Finance files draft papers for upto Rs 7000 crore IPOKotak Mahindra Capital Company Ltd BofA Securities India Ltd Axis Capital Ltd Goldman Sachs (India) Securities Pvt Ltd SBI Capital Markets Ltd JM Financial Ltd and IIFL Securities Ltd are the bookrunning lead managers. KFin Technologies Ltd was the registrar to the issue.Bajaj Housing will utilise the net proceeds from the fresh issue to augment its capital base to meet future business requirements.  A portion of the proceeds from the fresh issue will be used towards meeting offer expenses.Listing of the shares on the stock exchanges will also enhance the company s brand name and help create a public market for its equity shares in India Bajaj Housing said in its DRHP.Bajaj Housing has not yet disclosed the price band and the dates of listing."
]