[
    "Net Sales at Rs 179245.67 crore in September 2023 down 14.14  from Rs. 208753.93 crore in September 2022.Quarterly Net Profit at Rs. 13114.30 crore in September 2023 up 1422.61  from Rs. 991.55 crore in September 2022.EBITDA stands at Rs. 23834.87 crore in September 2023 up 486.44  from Rs. 4064.31 crore in September 2022.IOC EPS has increased to Rs. 9.53 in September 2023 from Rs. 0.72 in September 2022.IOC shares closed at 92.45 on November 01 2023 (NSE) and has given 12.54  returns over the last 6 months and 35.46  over the last 12 months.",
    "By Kunal Shah senior technical   derivative analyst at LKP SecuritiesPrior to the FOMC meeting the Nifty50 faced selling pressure from higher levels but successfully held the 18940 support levels. The immediate resistance on the upside is identified at 19100 and a breakout above this level may trigger shortcovering moves toward the 1925019300 range.Conversely if the lowerend support at 18940 is breached on a closing basis it could intensify selling pressure potentially pushing the index to new lows.The Bank Nifty index formed a Doji candlestick pattern suggesting a state of indecision at the current levels with a battle between bulls and bears. Immediate resistance is observed at 43000 where significant open interest is concentrated on the Call side. A breach above this level could trigger shortcovering moves towards 43500.Conversely the lowerend support is positioned at 42400 and if it is breached on a closing basis it may escalate the selling pressure.Here are three buy calls for short term Karur Vysya Bank  Buy   LTP  Rs 148   StopLoss  Rs 142   Target  Rs 154158   Return  7 percentKarur Vysya Bank is currently displaying some promising signals as the stock appears to be on the verge of a breakout. It recently rebounded from a robust support level with substantial trading volume hinting at strong buying interest.Furthermore the stock is trading above its crucial moving averages reinforcing a positive trend. The relative strength index (RSI) at 65 suggests good momentum.For shortterm traders it may be an opportune time to consider a long position at the current market price with a prudent stoploss at Rs 142 and aiming for shortterm targets of Rs 154158 on the upside.Birlasoft  Buy   LTP  Rs 574   StopLoss  Rs 550   Target  Rs 600615   Return  7 percentBirlasoft recently displayed some promising signals on its daily chart. Firstly it broke out of a consolidation phase suggesting potential upward momentum. Secondly it closed above its crucial moving average signifying a positive trend.Additionally the relative strength index (RSI) for the stock currently stands at 71 indicating strong momentum. These indicators suggest a favourable outlook.One can go long on the stock on a pull back in the price range of Rs 568575 with a stoploss of Rs 550 for the short term targets of Rs 600615.Indian Oil Corporation  Buy   LTP  Rs 92   StopLoss  Rs 86   Target  Rs 99103   Return  11 percentIOC (Indian Oil Corporation) stock has demonstrated a sharp recovery supported by volumebased buying at lower levels. The stock has given a breakout from a falling trendline which could significantly boost its momentum.The RSI momentum indicator has also provided a positive crossover confirming a buy signal. In terms of levels there is visible support at Rs 86 which serves as a safety net for the bulls. Additionally the stock presents potential upside targets at Rs 99 and 103 indicating a positive outlook for IOC.",
    "Net Sales at Rs 179739.82 crore in September 2023 down 13.37  from Rs. 207485.30 crore in September 2022.Quarterly Net Profit at Rs. 12967.32 crore in September 2023 up 4861.27  from Rs. 272.35 crore in September 2022.EBITDA stands at Rs. 22295.50 crore in September 2023 up 436.15  from Rs. 4158.45 crore in September 2022.IOC EPS has increased to Rs. 9.42 in September 2023 from Rs. 0.19 in September 2022.IOC shares closed at 88.25 on October 30 2023 (NSE) and has given 7.43  returns over the last 6 months and 29.30  over the last 12 months.",
    "1. Second quarter GDP growth likely to surprise on upside says RBI governorEconomic growth in the fiscal second quarter is likely to surprise on the upside Reserve Bank of India governor Shaktikanta Das has said. The central bank has projected a GDP growth rate of 6.5 percent for the three months to September while growth for 202324 is seen at 6.5 percent. Evolving geopolitics pose a challenge globally affecting financial markets and global growth Das said.Why it s important  The upside could be due to robust early indicators and the sustained momentum in economic activities. India seems to be well placed to mitigate geopolitical risks to a large extent.2. Core infrastructure sectors grow at 8.1 percent fiscal deficit at 39 percent of targetOutput of eight core infra sectors which accounts for twofifths of the country s industrial output grew at a healthy 8.1 percent in September official data showed. At the same time the central government s fiscal deficit during the AprilSeptember period stood at Rs 7.02 lakh crore or 39  of the fullyear estimate of Rs 17.87 lakh crore data from the Controller General of Accounts showed.Why it s important  Despite the healthy number core sector output expanded at its slowest pace in four months. The fiscal deficit has been contained by doubledigit growth in tax and nontax revenue receipts.3. Government orders investigation after Apple sounds hacking alarm in iPhonesMultiple messages from Apple to iPhones of several opposition leaders and journalists warning them that they could be potential targets of an unspecified statesponsored privacy attack has raised a furor prompting the central government to order a probe of the reported bids to hack into cellphones. Users facing such attacks are  individually targeted because of who they are or what they do  Apple s alert said.Why it s important  Although the government has questioned the nonspecific nature of the alarm the timing of the alleged privacy attack ahead of a crucial election season is bound to raise hackles. There was an earlier uproar over Pegasus spyware as well.4. Government to plug holes in legal framework to deter financial offendersThe central government is reviewing India s legal framework to identify gaps that financial offenders could exploit to launder money with possible changes in rules and regulations expected over the next few weeks. The development comes when the country is undergoing a peer review by the Financial Action Task Force a United Nations body.Why it s important  India would like to ensure that its legal system withstands the scrutiny of the task force and complies with global standards to stop money laundering and terror financing.5. Imported electric vehicles worth up to  35000 may see significantly slashed leviesIndia is considering lower import duties for electric vehicles up to a certain price level. All completely builtup vehicles priced below  40000 now face an import duty of 70 percent and a new national policy may slash it to 1530 percent for electric vehicles priced up to  2500035000.Why it s important  The development would provide an opportunity for foreign electric vehicle makers such as Tesla to gain a foothold in the rapidly expanding Indian market where appetite for premium personal vehicles have been on a high for quite some time.6. Larsen   Toubro reports 45 percent growth in net profit on better order executionLarsen   Toubro reported 45 percent growth in consolidated net profit to Rs 3223 crore in the September quarter. The construction and engineering giant reported an operating revenue of Rs 51024 crore in three months up 19 percent from a year ago. The company received orders worth Rs 89153 crore in the quarter registering a robust growth of 72 percent compared with a year ago.Why it s important  The expansion in L T s order book indicates strong momentum in the infrastructure sector despite five assembly polls and parliamentary elections next year.7. License fee ruling erodes Bharti Airtel s second quarter profit by 38 percentBharti Airtel posted a 38 percent fall in net profit from over a year ago to Rs 1341 crore in the fiscal second quarter because of a onetime tax and interest provisioning of Rs 1619 crore that followed a ruling by the Supreme Court that telecom companies could not treat license fee as an expense. The telco posted revenue of Rs 37044 crore up 7.3 percent from a year earlier.Why it s important  Despite the onetime provisioning the numbers at airtel are quite healthy as it showed consistent performance in its India operations. It added a record 1 million postpaid customers in the quarter.8. Indian Oil swings back to profit in September quarter beating analysts  expectationsStaterun Indian Oil Corporation saw a remarkable turnaround as consolidated net profit soared to Rs 13713 crore bouncing back from a loss of Rs 910 crore in yearago three months. However on a sequential basis net profit showed a 7 percent decrease from Rs 14735 crore recorded in the March quarter.Why it s important  The stateowned oil marketer saw a significant rise in consolidated annual net profit despite marketing margins for auto fuels crashing amid rising costs of crude oil.9. Central ministerial group likely to oversee online gaming regulationThe Union government is likely to set up a group of ministers to look into the regulatory framework for the gaming industry and consider other issues impacting the sector. The panel will likely include home minister Amit Shah finance minister Nirmala Sitharaman IT minister Ashwini Vaishnaw and information and broadcasting minister Anurag Thakur as members.Why it s important  India has been cracking down hard on online gaming. The industry is scrambling to set up a selfregulating body but that would not deter the authorities to tighten rules further.10. Number of eateries to see spurt in metros as well as smaller cities on higher demandA record number of new restaurants pubs bars and cloud kitchens will be opening their doors in the December quarter across metropolises as well as smaller cities and towns for the New Year. Food delivery platforms are also seeing a surge in new restaurant partners.Why it s important  Restaurateurs are looking to capitalize on the higher demand they have been seeing since the pandemic. An increasing number of Indians are eating out or ordering takeaways.         ",
    "Indian Oil Corporation on October 31 reported its fiscal second quarter net profit at Rs 12967 crore swinging into green from a net loss of Rs 272 crore a year ago.India s largest PSU oil refining and marketing company s Q2 FY24 net profit was driven by lower crude oil input costs and inventory gains the results showed. The company s net profit beat analysts  estimate of Rs 9640 crore.Indian Oil s revenue from operations for the JulySeptember quarter fell 11 percent to Rs 2.o3 lakh crore from Rs 2.31 lakh crore in the same quarter previous year according to an exchange filing. The staterun company was expected to report revenue of Rs 234780 crore up 13 percent from a year earlier according to a   poll of five brokerages.The company s average gross refining margin (GRM) for the fiscal first half AprilSeptember 2023 was  13.12 per barrel. This compared with  25.49 per barrel in the yearago period.IOCL shares gained o.4 percent to Rs 88.20 during the afternoon trade after the results were announced.Discounted Russian crude aid marginsIndian Oil s refining companies benefited from discounted Russian crude and significant inventory gains offsetting the impact of unchanged retail prices of petrol and diesel. In April 2022 companies including Indian Oil Bharat Petroleum and Hindustan Petroleum paused increasing prices of diesel and petrol after crude skyrocketed in the aftermath of the RussiaUkraine war. Later oil prices stabilised boosting refining margins.Revenue from petroleum products for the quarter fell 12 percent YOY while profit before tax was at Rs 17169.9 crore against a loss of Rs244.23 crore a year earlier.However concerns of higher crude costs are looming once again. Earlier this month analysts said oil refining companies are expected to report a decline in marketing margins in the second quarter of FY24 due to high crude oil prices. Additionally dwindling Russian crude discounts also pose a risk.Future imports from Venezuela India may resume purchases of crude oil from Venezuela. In October the US eased oil trade and financial sanctions on Venezuela. India was a regular buyer of Venezuelan crude oil grades prior to the imposition of US sanctions according to an S P Global report from October 24. One of the driving factors that led Indian refiners to opt for these longdistance Venezuelan crude grades during those years was the discounted pricing offered by the Venezuelan producers  said Sumit Ritolia refinery economics analyst at S P Global.  Indian refiners are likely to consider the Venezuelan market to import discounted barrels.         ",
    "Indian Oil Corporation the nation s biggest oil firm will invest Rs 1660.15 crore as equity in a newly set up joint venture with energy major NTPC Ltd for setting up renewable power plants.In June IOC and NTPC had formed a 50 50 joint venture company IndianOil NTPC Green Energy Pvt Ltd to set up renewable energy projects to meet roundtheclock power requirements of refineries of the oil company. In a stock exchanging filing IOC said its Board in a meeting on October 13  has accorded approval to the investment plan of the joint venture company for setting up of renewable energy power plants and approved the equity contribution of up to Rs 1660.15 crore towards Indian Oil s share of 50 per cent in the equity share capital of the JVC. On June 2 IOC incorporated the joint venture company (JVC) with NTPC Green Energy Limited (a whollyowned subsidiary of NTPC Limited).  IndianQil NTPC Green Energy Private Limited will develop renewable energybased power projects (viz. solar PV wind any other renewable energy energy storage or any combination of the same) to meet the roundtheclock (RTC) power requirements of new projects of IndianQOil Refineries  the firm had said at that time. The aim is to generate a minimum capacity of 650 MW of roundtheclock renewable power to fulfill the energy requirements of IOC refineries.NTPC through its whollyowned subsidiary NGEL has set an ambitious target of building a renewable generation portfolio of 60 GW over the next decade to aggressively pursue its green energy business. In March IOC had announced a consolidation of its green assets under one umbrella for better synergy. It is aiming to build a portfolio of 3 GW of renewable energy and 0.6 million tonnes of biofuels by 2025. The renewable energy portfolio is to be expanded to 35 GW by 2030 and 200 GW by 2050.Alongside it plans to raise the capacity to produce biofuels from agri and municipal waste to 7 million tonnes and biogas to 9 million tonnes by 2050. Its renewable energy portfolio currently stands at 239 MW which is being expanded through new wind solar hydel and pumped hydro projects. It is collaborating with NTPC to augment its renewable energy capacity by around 2.8 GW. IOC is also solarising 20705 petrol pumps with an installed capacity of 121 MW.Initiatives in EVs are being intensified by setting up 4700 charging stations and 66 battery swapping stations. It has collaborated with Israeli startup Phinergy for a battery joint venture. IOC has also firmly etched its presence in the nascent green hydrogen ecosystem of the country. The company has a firmedup collaboration with ReNew Power Private Limited (ReNew) and Larsen   Toubro Limited (L T) for green hydrogen business. A 7 kilotonnes per annum green hydrogen capacity is under development at the Panipat refinery.        ",
    "India s top fuel retailer Indian Oil Corporation will invest over Rs 4 lakh crore in this decade to expand oil refining and petrochemical business as well as in energy transition projects as part of a plan to become a  360degree energy company  its chairman Shrikant Madhav Vaidya said on Friday.IndianOil will invest Rs 1 lakh crore in expanding capacity to refine and turn crude oil into fuel and a staggering Rs 2.4 lakh crore in projects that will help it achieve netzero carbon emissions from its operations. Another Rs 60000 crore is planned to be invested in setting up a giant petrochemical complex at Paradip in Odisha.These investments will help the company continue to meet the rising energy needs of a fastexpanding economy while also treading on the path of the energy transition he told company shareholders at the annual general meeting.Vaidya said the past year witnessed waves of volatility that rocked the global energy dynamics but IOC kept its promise of fuelling the nation with unwavering commitment. As India s energy custodians your company has crafted a clear roadmap to drive India s energy destiny  he told shareholders. To fuel the rising energy demand of an ascendant India we are committed to increasing our share in India s energy pie from the current 9 per cent to around 1 8th or 12.5 per cent by 2050. For this IOC is leveraging varied energy pathways that will establish it  as a 360degree energy company  he said.  We are wellaligned with the need to ensure equitable energy access and sustainable transition.  The firm which controls over 40 per cent of India s fuel market and is the largest oil refiner has set 2046 as the target date for netzero carbon emissions. Our wellcrafted blueprint with a staggered investment plan of about Rs 2.4 lakh crore or USD 30 billion will take us towards the netzero destination  he said.These investments will be in producing green hydrogen to replace one currently used in refineries that come from fossil fuels renewable energy capacity addition biofuels and carbon offsetting.Its energy transition plans also include an EV charging network and infrastructure to enable electric vehicles to swap chargeable batteries.While it navigates through the energy transition path it is imperative that India strengthens its focus on the traditional fuel business he said. The Indian economy is surging ahead aiming for the USD 5 trillionmark by 2025. Reflecting India s robust economic growth the latest outlook from the International Energy Agency has pegged India s energy demand to go up from the current 5 million barrels per day (mbpd) to 7 mbpd by 2030 and about 9 mbpd by 2040  he said.Meeting this demand would require more investment in pumping crude oil from below ground or importing it from abroad turning it into fuels like petrol and diesel at refineries and taking them to nookandcorner of the country through a welloiled distribution network.And the tumultuous geopolitical events that unfolded last year led to the rearrangement of the energy baskets of the developed economies leaning towards conventional fuels.  Let me assure you that to ensure India s energy security we are strengthening the traditional energy avenues as we shape the green energy vision  he said. We are investing over Rs 1 lakh crore for expanding your company s refining capacity by about 33 per cent to reach almost 107 million tonnes per annum soon  he said.The expansion includes a new 9million tonnesperannum oil refinery at Nagapattinam in Tamil Nadu.Alongside it is pursuing petrochemical integration which will help convert crude into chemicals that are building blocks for a variety of products ranging from plastics to paints and cosmetics. It can potentially offset business uncertainties and amplify the value of every hydrocarbon molecule  he said.IOC Board he said has accorded Stage1 approval for the settingup of Paradip petrochemical complex in Odisha at an estimated cost of over Rs 61000 crore. This will be IOC s single largest investment at a location.The company is collaborating with Italy s Snam to explore the possibility of converting the existing natural gas pipelines for hydrogen transportation.Vaidya said the company continues to expand its retail network and has acquired sites to develop wayside amenities (WSA) on the DelhiMumbai expressway.Also the firm is expanding its offering of branded fuels.  Our 100 Octane petrol XP100 is now being offered at over 200 retail outlets 95 Octane petrol XP95 is available at over 10300 outlets and the green diesel XtraGreen is being retailed at more than 5600 outlets  he said.In LPG it has launched a unique QR codebased  Track N Trace  pilot initiative.IndianOil is developing a 10 kilo tonnes per annum green hydrogen plant at Panipat Refinery he said adding the company is also setting up a Sustainable Aviation Fuel (or SAF) plant of 86.8 thousand tonnes per annum capacity at Panipat.To support sustainable growth the firm also plans to convert over 100 million PET bottles annually into uniforms for its onground teams noncombat uniforms for the armed forces and other stakeholders.        ",
    "ICICI Securities research report on Indian Oil CorporationIndian Oil Corporation s (IOCL) Q1FY24 EBITDA and PAT of INR 221.6bn and INR 137.5bn beat our estimates of INR 175bn and INR 103bn respectively. The numbers were also well ahead of Q1FY23 EBITDA of INR 13.6bn and net loss of INR 19.9bn. Reported GRM of USD 8.3 bbl in Q1FY24 was down by USD 6.9 bbl QoQ and USD 23.5 bbl YoY (inline) while refining throughput was at 18.8mt (down 1  YoY inline). Marketing strength drove the outperformance with sharply higher retail margins (blended margins at INR 8.8 ltr for Q1FY24) the key driver even as marketing volumes of 24.4mt were down 1  YoY. We increase FY24E   FY25E EPS by 4.4    7.0  to factorin the stronger margins. Our EV EBITDA based target price thus stands increased to INR 120 sh. Maintain BUY.OutlookValuations at 5.0x FY25E P E 5.0x EV EBITDA and 0.8x P BV remain attractive. We believe dividend yield of  78  (average estimated for FY24E FY25E) is an added value driver for the stock. Our revised FY25E EV EBITDAbased valuation of INR 120 sh implies 26  upside. Maintain BUY.For all recommendations report click here",
    "Net Sales at Rs 198550.77 crore in June 2023 down 11.13  from Rs. 223414.39 crore in June 2022.Quarterly Net Profit at Rs. 14436.96 crore in June 2023 up 5267.5  from Rs. 279.38 crore in June 2022.EBITDA stands at Rs. 24330.95 crore in June 2023 up 302.73  from Rs. 6041.48 crore in June 2022.IOC EPS has increased to Rs. 10.48 in June 2023 from Rs. 0.20 in June 2022.IOC shares closed at 98.60 on July 27 2023 (NSE) and has given 20.61  returns over the last 6 months and 36.85  over the last 12 months.",
    "Net Sales at Rs 197526.57 crore in June 2023 down 11.92  from Rs. 224252.63 crore in June 2022.Quarterly Net Profit at Rs. 13750.44 crore in June 2023 up 790.1  from Rs. 1992.53 crore in June 2022.EBITDA stands at Rs. 22852.37 crore in June 2023 up 1018.8  from Rs. 2042.58 crore in June 2022.IOC EPS has increased to Rs. 9.98 in June 2023 from Rs. 1.45 in June 2022.IOC shares closed at 98.60 on July 27 2023 (NSE) and has given 20.61  returns over the last 6 months and 36.85  over the last 12 months.",
    "Thyssenkrupp Industrial Solution India a unit of the German engineering major on Wednesday said it bagged a  100million order from Indian Oil Corporation to build a polybutadiene rubber plant at Panipat refinery complex in Haryana.Polybutadiene rubber is manufactured from the polymerization of butadiene and has applications in manufacturing tyres and additives.Thyssenkrupp Industrial Solutions will execute this project with 60 kilo tonne per annum capacity based on technology from a reputed licensor the company said.The lumpsum EPC (engineering procurement and construction) scope includes residual process engineering detail engineering project management procurement construction   commissioning of the plant Rajesh Kamath chief executive of Thyssenkrupp Industrial Solutions  chemical plant business said.Thyssenkrupp Industrial Solutions is into petrochemical and refinery fertilizers chloralkali green chemicals cryogenic storages etc. and has executed multiple refineries and petrochemical projects for IOC across its refineries.At present apart from other contracts being executed on EPCM and PMC models it is also implementing the nbutanol project and catalytic dewaxing project on EPC basis for IOC s Gujarat refinery.The company has executed over 850 projects in the past four decades on various modalities.        ",
    "Shares of Praj Industries rose more than 4 percent on July 7 as the company has signed an agreement with Indian Oil Corporation Limited (IOCL) to strengthen biofuels production capacities in India.Various biofuels covered under this agreement include Sustainable Aviation Fuel (SAF) Ethanol Compressed BioGas (CBG) Biodiesel and Biobitumen among others the company said in a regulatory filing.At 9 23 am shares of the company were trading 4 percent higher at Rs 385.75 on the BSE. Meanwhile IOCL shares were also up 2.1 percent at Rs 100.7.Earlier in October 2021 both the companies had entered into an agreement to form a 50 50 Joint Venture to this end.The nation s firstofitskind advanced biofuels refinery at Indian Oil s Panipat complex is based on Praj s proprietary 2G technology the company added in the filing.Catch up on all LIVE stock market updates here This year in May Indian Oil and Praj partnered with AirAsia India and flew India s firstever commercial passenger flight powered by a blend of  indigenous  Sustainable Aviation Fuel   said Pramod Chaudhari Founder Chairman Praj Industries.The Pune based company is a supplier or constructor of ethanol plants and a global company that provides various engineering solutions with a focus on the environment energy and agriprocess industry. Praj Industries is the Indian market leader in the Ethanol Plant market and among the top Zero Liquid Discharge players in the country.Praj Industries is a key beneficiary of multiple tailwinds provided by the bioeconomic revolution giving strong growth and revenue visibility for the next 35 years said Axis Securities while adding that the company is a pure equity play on global decarbonisation theme.",
    "India managed to reduce its overall expenditure on crude oil imports by taking advantage of discounted Russian oil. However Indian Oil Marketing Companies (OMCs) failed to maximise the benefits from this favorable situation. Kotak Institutional Equities in a report said that  We also note that while India s overall crude imports costs have benefitted from Russian imports OMCs  reported raw material costs do not show any increased advantage versus Dubai crude. Kotak Institutional Equities say that the benefit of Russian crude will be higher for companies like Nayara Energy which is owned by Rosneft a Russian OMC. Indian oil companies have to spend more on transportation and insurance costs as compared to Nayara Energy which saves cost and benefits from the discounted Russian crude oil.Indian Oil Corporation s (IOC) raw material costs in Q2FY23 was around  115 per barrel while Dubai crude oil was around  105 per barrel. This means IOC was not able to monetise the benefits of Russian imports.Similarly Bharat Petroleum Corporation s (BPCL) raw material costs in Q2FY23 was around  115 per barrel compared to Dubai crude oil which was around  105 per barrel.Dubai crude is used as a benchmark. Thus if Indian refiners  crude costs decline (versus Dubai crude) it not only boosts their refining GRMs but also offers improved advantage over Singapore GRM.Also Read  Oil India ONGC gain as crude prices rally on Saudi plan to cut productionBetter Gross Refining Margins (GRM)Indian OMCs have reported strong GRMs as compared to the Singapore GRM complex margin. For FY23 IOC reported GRM of  19.5 per barrel which was nearly two times of Singapore GRM complex margin of  10.8 per barrel. BPCL s GRM was  20.2 billion per barrel.IOC and BPCL have reported a strong GRM compared to large independent refiners like Reliance Industries Limited Chennai Petroleum Corporation and Mangalore Refineries and Petrochemical Limited. The report said  In recent quarters the gap with other refiners has increased as OMCs (surprisingly in our view) have not reported the GRM after the impact of windfall export taxes on retail fuels (diesel petrol ATF) that was implemented from July 1 2022. After the ongoing RussiaUkraine conflict and sanctions on Russian crudes by several countries India has emerged as a key buyer of Russian crude. From barely 12 percent of crude imports share of Russian imports gradually increased in FY2023 to 21.5 percent. Russia is followed by Iraq (21.4 percent) and Saudi Arabia (16.7 percent) said the report.Analysts s viewsKotak Institutional Equities has put a sell rating on HPCL at a target price of Rs 257 and reduce the rating on IOCL and BPCL at Rs 89 and Rs 357 respectively. The institutional research firm will rerate the Indian OMCs only if they continue their strong refining performance post the 2024 general elections when OMCs will have greater control on the pump prices.",
    "Prabhudas Lilladher s research report on Indian Oil CorporationWe change our FY24 25E earnings by 20 26  to factor in actual FY23 numbers. IOCL reported better than expected Q4 results with standalone EBITDA of Rs153.4bn ( 327 QoQ  PLe Rs 92.5bn) and PAT of Rs100.6bn (PLe Rs41.8bn) due to higher than expected GRMs at USD15.2 bbl (Q3  USD12.9  PLe USD9.6). Earnings surprise came despite Q4 refining inventory loss of Rs43.8bn.OutlookWe believe OMCs are well placed to benefit from improving marketing margins and healthy refining profitability. We maintain   BUY  with a PT of Rs125 based on EV EBITDA of 5.5x FY24E (7x earlier) as earnings environment stabilizes. Retain Buy .For all recommendations report click here",
    "Sharekhan s research report on Indian Oil CorporationQ4FY23 PAT of Rs. 10059 crore (versus just Rs. 448 crore in Q3FY23) was significantly above our estimate due to a sharp beat in GRMs. Turnaround in the petchem segment a forex gain of Rs. 989 crore and positive auto fuel marketing margin also contributed to strong earnings. GRM at  15.3 bbl was better than that of HPCL at  14 bbl and above our estimate of  11.5 bbl. Refining throughput pipeline throughput petchem sales volume at 19 mmt 25mmt 0.7mmt was up by 5  6  81  qoq. . We expect earnings to normalise over FY2425 led by normalisation of crude oil prices. However a spike in crude oil prices (from  7475 bbl currently) is a key risk to earnings recovery especially given OMCs inability to hike petrol diesel price given general election expected to be scheduled in May 2024.OutlookWe maintain a Buy on IOCL with a revised PT of Rs. 100 on inexpensive valuation of 4.8x 0.8x FY25E EPS BV and FY24E dividend yield of  10 .For all recommendations report click here",
    "Net Sales at Rs 202994.07 crore in March 2023 up 14.5  from Rs. 177287.31 crore in March 2022.Quarterly Net Profit at Rs. 10058.69 crore in March 2023 up 67.04  from Rs. 6021.88 crore in March 2022.EBITDA stands at Rs. 16978.38 crore in March 2023 up 34.97  from Rs. 12579.22 crore in March 2022.IOC EPS has increased to Rs. 7.30 in March 2023 from Rs. 6.56 in March 2022.IOC shares closed at 84.20 on May 15 2023 (NSE) and has given 20.98  returns over the last 6 months and 3.44  over the last 12 months.",
    "Net Sales at Rs 203872.27 crore in March 2023 up 16.3  from Rs. 175292.02 crore in March 2022.Quarterly Net Profit at Rs. 10289.82 crore in March 2023 up 54.83  from Rs. 6645.72 crore in March 2022.EBITDA stands at Rs. 18914.61 crore in March 2023 up 27.34  from Rs. 14853.33 crore in March 2022.IOC EPS has increased to Rs. 7.47 in March 2023 from Rs. 7.24 in March 2022.IOC shares closed at 84.20 on May 15 2023 (NSE) and has given 20.98  returns over the last 6 months and 3.44  over the last 12 months.",
    "Indian Oil Corp Ltd on May 16 reported 67 percent yearonyear jump in standalone net profit to Rs 10059 crore for the quarter ended March 2023. Net profit stood at Rs 6021 crore in the yearago period.The stateowned oil marketing company s revenue from operations jumped almost 10 percent YoY to Rs 2.26 lakh crore. The numbers have managed to beat CNBCTV18 estimates of bottom line at Rs 6393 crore and top line at Rs 1.88 lakh crore.Average gross refining margin (GRM) for April March 2023 was  19.52 per barrel compared to  11.25 per barrel in April March 2022 said the company. However the suppressed marketing margins of certain petroleum products offset the benefit of increase in GRM.Indian Oil has been suffering under recoveries from sale of domestic LPG since FY22. To compensate for this the Union government approved a onetime grant of Rs 10801 crore and Indian Oil has recorded this under revenue from operations in FY23.The company s board of directors have recommended a final dividend of  Rs 3 per equity share for FY23 subject to approval by the members of the company.At 2 30 pm Indian Oil shares were quoting at Rs 87 on the NSE higher by 3.7 percent from previous close.        ",
    "The Nifty snapped a twoday rise and closed in the negative after witnessing a sharp rebound from the afternoon lows on March 20. Broader market indices fell more than the benchmark reflecting higher panic among noninstitutional players. The Nifty has formed a bullish hammer on daily charts after forming two Dojis hinting at possibility of an upward reversal.As any bear market could have a pullback rally the same can be expected from Indian indices too. The Nifty has witnessed a fall of almost 11 percent from the alltime high of 18887 of December 2022.The indices have been making lower top and lower bottom formation on the charts which indicates bearish trend for a longer time frame. However the possibility of a pullback in the short term cannot be ruled out. For the last few trading sessions a tugofwar is on between the bulls and the bears.FIIs have been heavily short in last couple of months and their longtoshort ratio in index future has reached as low as 0.12 which is extremely oversold. A band of 1680016850 has been a good demand zone and the same can act as a shortterm support for the Nifty.We believe that the Nifty could show a move towards the 1750017600 band in the short term and the same should be utilised to lighten long positions. A level below 16800 would negate the chances of a pullback in the Nifty.Here are three buy calls for next 23 weeks Manappuram Finance  Buy   LTP  Rs 113   StopLoss  Rs 107   Targets  Rs 123135   Return  19 percentThe stock price is in formation of bullish Inverted Head and Shoulder pattern on the daily charts. The stock is trading above its 50 100 and 200DMA (days moving average) indicating bullish trend on all time frame.Indicators like RSI (relative strength index) and DMI (directional movement index) have turned bullish on short to medium term charts.Indian Oil Corporation  Buy   LTP  80.60   StopLoss  Rs 77   Targets  Rs 8589   Return  10 percentThe stock price has confirmed higher top and higher bottom formation on the daily chart. In the recent downtrend of the market oil marketing companies have shown resilient performance.The stock is trading above its 50 100 and 200DMA indicating bullish trend on all time frame. Volumes have gone up along with the price rise recently. Indicators and oscillators have turned bullish daily time frame.Zensar Technologies  Buy   LTP  Rs 270   StopLoss  Rs 255   Target  Rs 302   Return  12 percentFlag Pattern Breakout is expected on the daily chart. The stock price has witnessed healthy correction after sharp upswing. IT Sector has also reached oversold zone on short term charts.DMI indicator has turned bullish on the short term charts. RSI (relative strength index) has given positive crossover on the daily chart. The stock is placed above its 50 100 and 200 DMA which indicates bullish trend positionally.",
    "Indian Oil Corporation on Friday said it will pump in Rs 250 crore in the West Bengal region in the current fiscal to ramp up infrastructure to push green auto fuels.The stateowned refiner and oil retailer said it has currently achieved ethanol blending of 7.5 per cent in the state against the national average of 10 per cent with Bengal lagging behind in ethanol supply. However supply chain issues will be sorted in due course and we will be able to augment blending and attain 20 per cent by 2025  IOC ED and State Head (West Bengal) LKS Chauhan said.The company aims at net zero operational emission by 2046.IOC is in dialogue with institutional and bulk customers like state transport agencies for more adoption of green fuels he said. At present green auto fuels are available at 275 pumps but by 2024 we will increase it to 1000 pumps out of 1482 retail outlets in the state  Chauhan said.        ",
    "Sharekhan s research report on Indian Oil CorporationQ3FY23 PAT of Rs. 448 crore was significantly below our estimate due to continues high loss (posted Rs. 616 crore EBIT loss) in the petchem segment a forex loss of Rs. 1700 crore and probably inventory loss (IOCL did not provide details) as crude oil prices declined sharply qoq. Refining performance remains strong with reported GRM of  12.9 bbl (inline) and a 13  qoq rise in refining throughput to 18.2 mmt. Marketing sales volume also rose by 8  qoq 24.3 mmt  however petchem sales volume declined sharply by 48  30  yoy qoq to 0.37 mmt in Q3FY23. We believe that earnings downgrade cycle is largely over for OMCs and expect earnings to normalize over FY2425 led by strength in GRM with likely normalised auto fuel marketing margins. Any spike in crude oil prices is a key risk to earnings recovery especially given OMCs inability to hike petrol diesel price in inflationary environment.OutlookWe maintain a Buy on IOCL with a revised PT of Rs. 92 on inexpensive valuation of 4.6x 0.8x FY24E EPS BV and FY24E dividend yield of 11 .For all recommendations report click here",
    "Prabhudas Lilladher s research report on Indian Oil CorporationWe lower our FY23 24 25E earnings estimate by 82.5   2.7   3.1  to factor in weak petchem performance (9MFY23 EBIT loss Rs4.7bn) lower Chennai petro results and higher cost. Indian Oil Corporation (IOCL) reported better than expected Q3 results with standalone EBITDA of Rs35.9bn ( 83 QoQ  PLe Rs27.5bn) and PAT of Rs4.5bn (PLe  Rs7.5bn) due to lower marketing losses. Sharp correction in international diesel prices   115 from recent peak of USD170 bbl improved marketing segment s profitability. Also ban on import of Russian oil product from Feb23 will support refining product spreads. Further global recessionary pressure along with high interest rates will keep oil prices range bound despite increased demand from China.OutlookWe believe OMCs are well placed to benefit from improving marketing and healthy refining profitability. Maintain  BUY  at PT of Rs125 (Rs130) based on 7x EV E FY24E.For all recommendations report click here",
    "ICICI Direct s research report on Indian Oil CorporationIndian Oil Corporation (IOC) is India s largest refining   marketing company with an installed refining capacity of  70 MMT. IOC operates 34559 retail outlets as of end of FY22   Petrol and diesel together historically constitute  52  of marketing sales.OutlookWe maintain our HOLD rating on the stock. We value IOC at Rs 90 i.e. average of P E multiple  Rs 85 share and P BV multiple  Rs 95 share.For all recommendations report click here",
    "Net Sales at Rs 232303.20 crore in December 2022 up 40.5  from Rs. 165339.04 crore in December 2021.Quarterly Net Profit at Rs. 773.23 crore in December 2022 down 87.41  from Rs. 6143.08 crore in December 2021.EBITDA stands at Rs. 5877.51 crore in December 2022 down 50.68  from Rs. 11916.81 crore in December 2021.IOC EPS has decreased to Rs. 0.56 in December 2022 from Rs. 6.69 in December 2021.IOC shares closed at 81.75 on January 31 2023 (NSE) and has given 14.98  returns over the last 6 months and 2.06  over the last 12 months."
]