[
    "ICICI Securities s research report on HCL TechnologiesHCLT reported revenue growth and EBIT margin in line with our estimates. IT and business services grew 4  QoQ CC and Engineering R D was down 1.6 . Software business was down 18.5  QoQ CC on seasonal weakness. Geographywise growth was led by North America at 4.2 . TCV was robust at USD 2.29bn with 13 out of 21 large deal wins originating from services. However FY25 growth guidance of 3 5  was lower than our  Street s estimate of 47 . This guidance includes a soft Q1FY25 impacted by offshore transition in large contact and a soft Q2FY25 impacted by State Street JV divesture. This implies a weak CQGR of 0.2  to  0.6  QoQ through FY25. Factoring this in we reduce FY25E 26E EPS by 3 7 .OutlookWe value HCLT on an SoTPbasis   Services (IT and ER D) at 20x and Products at 16x on FY26E EPS to arrive at a TP of INR 1330. Retain REDUCE on soft H1FY25 and unexciting EBIT margin guidance of 1819 .For all recommendations report click here",
    "Prabhudas Lilladher s research report on HCL TechnologiesHCLT reported revenue of USD3.43b up 0.3  QoQ in CC and 0.4  in reported terms tad above consensus of flat CC that translates to FY24 revenue growth of 5.0  YoY CC (lower end of the guidance). The growth was partly aided by further progress in mega deal within Telecom otherwise the growth was boardbased (exRetail). The margin impact was meaningful down 210bps QoQ (vs consensus of 130bps decline). The decline was led by normalizing highmargin P P business coupled with compensation revision that was long due for the mid and seniorlevel leadership team. The deal TCV wins were healthy at USD2.3b ( 10.4  YoY) which takes FY24 TCV to USD9.75b (BTB 1.0x). Despite this strong wins the full year revenue guidance (3.05.0 ) was a little disappointing which bakes in early volatility as it enters into FY25.OutlookThe stock is currently trading at 21x FY26e we are assigning PE of 22x to FY26e with a target price of INR 1550. With that we assume coverage on HCL Tech with an  ACCUMULATE  rating.For all recommendations report click here",
    "Motilal Oswal s research report on HCL TechnologiesHCL Technologies (HCLT) reported weak 4QFY24 performance with 0.3  QoQ CC consolidated revenue growth below our estimate of 0.9  QoQ CC.The weak performance was due to the seasonality in HCL Software (18.5  QoQ CC) coupled with weakness in ERS (1.6  QoQ CC) while ITBS posted an impressive 4  QoQ growth in CC. Services grew 3.0  QoQ in CC above our estimate of  2.7  QoQ. The new deal TCV was healthy at USD2.3b ( 18.8  QoQ 10.4  YoY) in 4QFY23. HCLT announced disappointing revenue growth guidance of 35  CC for FY25 amid weak 1QFY25 expectations (2  QoQ). The weak expectations are led by the offshoring of a large deal and the transfer of productivity benefits to clients. EBIT margin came in lower than expected at 17.6  (220bp QoQ  missing our estimate of 18.5 ) due to the HCL Software seasonality. Services margin contracted 70bp QoQ. Management retained its EBIT margin guidance band of 1819  for FY25.Outlookwe expect HCLT to emerge stronger on the back of healthy demand for these services in the medium term. The stock is trading at  20x FY26E EPS which offers a margin of safety. Our TP of INR1700 is based on 23x FY26E EPS. We reiterate our BUY rating on the stock.For all recommendations report click here",
    "Religare Retail Research report on HCL TechnologiesHCL Tech Q4FY24 revenue in constant currency (CC) grew by 0.3  QoQ and 6  YoY while its dollar revenue grew by 0.4  QoQ and 6  YoY to USD 3430mn. Its revenue in rupee was at Rs 28499cr up by 0.2  QoQ and 7.1  YoY. The growth was largely led by the service segment (contributes 90.5  of revenue) as it grew by 2.9    7.9  YoY to Rs 25792cr while in CC terms it was up by 3  QoQ and 6.7  YoY. Amongst segments in CC terms telecommunication   Media led the growth with 39  YoY   21.6  QoQ followed by manufacturing retail   Financial services with 14.3  YoY 9.4  YoY and 8.6  YoY. Amongst geographies both America and Europe performed well with America gaining 9.2  YoY   4.2  in CC while Europe gained 5.7  YoY   2.3  QoQ in CC. For FY24 CC revenue was up by 5  YoY revenue in dollar grew by 5.4  YoY to USD 13270mn and rupee revenue up by 8.3  YoY to Rs 109913cr. The growth was driven by both America   Europe regions while amongst verticals growth except for technology all the verticals specially financials services witnessed decent growth.OutlookAdditionally their capabilities expertise and increasing client base would bode well for the growth ahead. On the financial front we estimate its revenue EBIT to grow by CAGR of 7.6  10.7  over FY24 26E and continue to maintain our Buy rating with the target price of Rs 1777.For all recommendations report click here",
    "Net Sales at Rs 12077.00 crore in March 2024 up 3.78  from Rs. 11637.00 crore in March 2023.Quarterly Net Profit at Rs. 2763.00 crore in March 2024 down 2.85  from Rs. 2844.00 crore in March 2023.EBITDA stands at Rs. 4344.00 crore in March 2024 up 3.63  from Rs. 4192.00 crore in March 2023.HCL Tech EPS has decreased to Rs. 10.20 in March 2024 from Rs. 10.50 in March 2023.HCL Tech shares closed at 1473.85 on April 26 2024 (NSE) and has given 19.65  returns over the last 6 months and 38.32  over the last 12 months.",
    "Net Sales at Rs 28499.00 crore in March 2024 up 7.11  from Rs. 26606.00 crore in March 2023.Quarterly Net Profit at Rs. 3986.00 crore in March 2024 up 0.08  from Rs. 3983.00 crore in March 2023.EBITDA stands at Rs. 6533.00 crore in March 2024 up 3.44  from Rs. 6316.00 crore in March 2023.HCL Tech EPS has increased to Rs. 14.72 in March 2024 from Rs. 14.71 in March 2023.HCL Tech shares closed at 1473.85 on April 26 2024 (NSE) and has given 19.65  returns over the last 6 months and 38.32  over the last 12 months.",
    "Information technology (IT) major HCL Technologies is expected to report a tepid Q4 with flattish revenues quarteronquarter (QoQ). Its products and platforms (P P) business is expected to drag down its earnings even as the services business is expected to provide some succour. The fall in the highmargin P P business would also hit HCLTech s fourth quarter net profit. The company is scheduled to announce its JanuaryMarch financial results on April 26.HCL Technologies is expected to report a net profit of Rs 4054.71 crore  in Q4 FY24 down 6.78 percent QoQ according to the average estimate of seven brokerages. The company is expected to clock revenues of Rs 28552.64 crore up only 0.37 percent QoQ. Its EBIT margin may fall  152 basis points (bps) QoQ to 18.18 percent. HCLTech Q4 Results PreviewRevenue growth will be driven by the services business which was boosted by the Verizon deal. In August 2023 HCLTech signed a  2.1 billion deal with Verizon to provide managed network solutions to its global enterprise customers. HCLTech s revenue shall grow 0.3 percent QoQ in CC (constant currency) and 0.7 percent QoQ in USD due to Services ( 2.4 percent QoQ) and P P  (15 percent QoQ seasonality impact). Services growth shall be driven by the Verizon deal and reversal of furloughs  said Nuvama Wealth. Motilal Oswal expects its Services revenue to grow 2.7 percent QoQ in CC terms.The P P business is expected to decline due to seasonality. According to Motilal Oswal  The decline in the highmargin P P business should result in a 120bps QoQ decrease in profitability during Q4.  ICICI Securities predicts a 12 percent contraction in the P P business due to a  lack of positive seasonality from Q3FY24. Philip Capital noted that margins will be affected by  P P seasonality partial wage hikes and the Verizon deal  impact. Nuvama expects the company to give a guidance of 46 percent YoY growth in CC terms in the Services segment in FY25  and a margin guidance of 1819 percent. Motilal Oswal expects a revenue guidance of around 10 percent for FY25.",
    "The market on April 5 ended the first week of the new fiscal year 202425 in the green marking yet another week of rise surpassing the previous record high to trade beyond 22600 during the week.The benchmark Nifty index managed to settle the last two sessions above 22500 amid consolidation and saw higher highs higher lows formation for the second consecutive week making experts hopeful of further uptrend towards 2270022800 in the coming sessions with support at 2230022200 levels and the volatility index diving to November 2023 lows.The Nifty 50 gained 0.84 percent to settle at a record closing high of 22513.70 for the week and formed a small bullish candlestick pattern with long upper and lower shadows which resemble High Wave kind of candlestick pattern on the daily charts indicating indecisiveness among bulls and bears about future market trend.From a technical standpoint as the Nifty index heads into an uncharted territory it becomes difficult to surface the intermediate resistance but looking at the recent developments another leg of 200300 point (2270022800) rally could be seen on the cards under favourable scenarios Osho Krishan senior analyst for technical and derivative research at Angel One said.On the lower end he feels strong support is expected around 2235022300 which certainly has proved its mettle in the previous week followed by the sacrosanct support at 22200.Jigar S Patel senior manager of equity research at Anand Rathi also sees support at similar levels with hurdle on the higher side at 2260022800.Osho advised traders to refrain from complacency and maintain a pragmatic approach with a stockcentric view for an outperformance.  collated a list of top 10 stock ideas from experts with 34 weeks perspective. The closing price of April 5 is considered for calculation of stock price return Expert  Vinay Rajani CMT senior technical   derivative analyst at HDFC SecuritiesRedington  Buy   LTP  Rs 222.80   StopLoss  Rs 208   Target  Rs 244   Return  9.5 percentThe stock price has broken out from the consolidation which held for last 6 weeks. Price rise is accompanied by rise in volumes. Primary trend of the stock has been bullish with higher tops and higher bottoms on the weekly chart.The stock is placed above all important moving averages indicating bullish trend on all time frames. Indicators and oscillators have been showing strength in the current uptrend.Finolex Industries  Buy   LTP  Rs 255   StopLoss  Rs 240   Target  Rs 278   Return  9 percentThe stock has broken out from the symmetrical triangle on the weekly chart. Price breakout is accompanied by jump in volumes.Primary trend of the stock has been bullish with higher tops and higher bottoms on the weekly chart. Stock is placed above all important moving averages indicating bullish trend on all time frames.Graphite India  Buy   LTP  Rs 659   StopLoss  Rs 628   Target  Rs 710   Return  8 percentThe stock price has broken out from the narrow consolidation which held in last 5 weeks. Breakout is accompanied by jump in volumes.The stock price has also broken out from downward sloping trend line on the monthly chart. Stock is placed above all important moving averages indicating bullish trend on all time frames.Expert  Shrikant Chouhan head equity research at Kotak SecuritiesUltraTech Cement  Buy   LTP  Rs 9824   StopLoss  Rs 9490   Target  Rs 10500   Return  7 percentAfter the remarkable up move of the last few weeks the counter witnessed shortterm correction from the higher levels. However closing above the important retracement levels suggest bullish continuation chart formation.Therefore the counter is likely to resume its uptrend from the current levels in the near term.HCL Technologies  Buy   LTP  Rs 1545   StopLoss  Rs 1490   Target  Rs 1650   Return  7 percentThe counter is in the accumulation zone where it is trading in a rangebound mode for the past few sessions. The texture of the chart formation and technical indicator RSI (relative strength index) is indicating that the counter is very likely to breakout from rectangle formation for a new leg of the up move in the coming horizon.GAIL India  Buy   LTP  Rs 190.75   StopLoss  Rs 183   Target  Rs 205   Return  7.5 percentOn the weekly charts the counter is into a rising channel chart formation with higher high and higher low series pattern. Additionally the technical indicators like ADX (average directional index) and RSI are also indicating further up trend from current levels which could boost the bullish momentum in the near future.Expert  Riyank Arora technical analyst at Mehta EquitiesVarroc Engineering  Buy   LTP  Rs 537.85   StopLoss  Rs 512   Target  Rs 610   Return  13 percentThe stock has given a good breakout above its anchor VWAP (volumeweighted average price) resistance mark of Rs 530 and managed to close above the same. With the price retesting its support zone and offering a good risktoreward opportunity at current levels along with the RSI on daily charts being around 58 the momentum still appears strong.The stock seems like a good buy with a strict stoploss of 512 for potential upside targets of Rs 610 and above.Bajel Projects  Buy   LTP  Rs 226.50   StopLoss  Rs 209   Target  Rs 250   Return  10 percentThe stock has given a good breakout above its recent 6day consolidation phase which formed after the trendline breakout on its daily charts. With the major trend being positive and the anchor VWAP showing good demand in the stock along with major support at Rs 175 levels the stock looks like a good buy with a small stoploss at Rs 209 for potential upside target of Rs 250 and above.The RSI (14) on daily charts at 62.20 and in a rising trend show strong momentum in the stock.Chambal Fertilisers and Chemicals  Buy   LTP  Rs 380.75   StopLoss  Rs 372   Target  Rs 402.50   Return  6 percentThe stock has given a good breakout above its recent swing high mark of rs 378.40 and successfully managed to close above the same. With the RSI (14) on daily charts near 65.04 the momentum looks strong for potential upside target of Rs 402.50 and above with a strict stoploss at Rs 372 mark.Overall a strong technical structure for most of the fertilizer stocks and an interesting riskreward ratio on Chambal makes the stock an intriguing candidate.Expert  Om Mehra technical analyst at Samco SecuritiesSyngene International  Buy   LTP  Rs 729.5   StopLoss  Rs 708   Target  Rs 775   Return  6 percentThe stock has bounced back after forming a double bottom pattern in a daily time frame with significant volumes. The stock appears to be strongly placed above the middle Bollinger band and RSI holds above 60 levels.If the stock manages to close above Rs 736 level it could move higher further. Hence based on the above technical structure one can initiate a long position at CMP Rs 729.5 for a target price of Rs 775. The stoploss can be kept at Rs 708.Raymond  Buy   LTP  Rs 1913.6   StopLoss  Rs 1850   Target  Rs 2090   Return  9 percentThe stock is forming higher highs and higher lows indicating a sustained uptrend. A Bullish momentum is evident as the 9day simple moving average (SMA) has crossed above the 20 SMA signifying a strengthening trend. The stock is on the verge of a potential breakout.Hence based on the above technical structure one can initiate a long position at CMP Rs 1913.6 for a target price of Rs 2090. The stoploss can be kept at Rs 1850.",
    "Technically the Nifty 50 is almost on the verge of an upward sloping long support trendline. Hence the index may try to defend the trendline. In case the index breaks the same then 21500 is expected to be an immediate support but on the higher side if the index holds above the trendline then 2170021800 can be a resistance zone experts said.On February 12 the Nifty 50 plummeted 167 points to 21616 and formed long bearish candlestick pattern on the daily charts while the BSE Sensex was down more than 500 points to 71072. The broader markets hit hard as the Nifty Midcap 100 index tanked 2.5 percent and Smallcap 100 index plunged 4 percent.Stocks that bucked the trend included Zydus Lifesciences HCL Technologies and Apollo Hospitals Enterprises. Zydus Lifesciences rallied 6.4 percent to end at record closing high of Rs 857 and formed strong bullish candlestick pattern on the daily charts with robust volumes while on the monthly basis it has continued run up for fourth consecutive month.HCL Technologies too ended at new closing high of Rs 1667 up 2.2 percent and formed bullish candlestick pattern on the daily timeframe with above average volumes. On the monthly charts the stock maintained upward journey for seventh consecutive month.Apollo Hospitals Enterprises also saw record closing high of Rs 6614.5 rising 2.75 percent and formed long bullish candlestick pattern on the daily charts. The stock maintained upward bias for third days in a row with strong volumes.Here s what Ashish Kyal of Waves Strategy Advisors recommends investors should do with these stocks when the market resumes trading today Zydus LifesciencesPharma sector continued to shine. Amongst the pharma companies Zydus Life is outperforming. Currently the stock is trading at the life time high.On the daily chart prices which were moving in an upward sloping channel has given a breakout of it which is a positive sign. Also base line (red) of the Ichimoku cloud has acted as a brilliant support which is near Rs 775 levels. So as long as price holds above mentioned level mediumterm trend is likely to remain positive.In short trend for Zydus Life remains positive. Since RSI (relative strength index) is in overbought territory so buy on dips looks prudent strategy with the targets of Rs 875 as long as Rs 820 holds on the downside.Apollo Hospitals EnterprisesApollo Hospitals Enterprises has shown strong upside momentum since past few months. We have used Supertrend indicator on the daily chart. The Supertrend is acting as a reliable support.In addition it has consistently offered support which can be seen in the below chart. This indicates that as long as this line is protected one should follow the current trend. Along with this ADX (average directional index) is also suggesting that good momentum is likely to continue as it is showing reading of 48 which is above 25.In short trend for Apollo Hospitals is bullish. Use dips as a buying opportunity for a move towards Rs 6700 as long as Rs 6160 holds on the downside.HCL TechnologiesHCL Technologies is currently trading at the record high. Middle Bollinger bands is acting as a strong support which is near Rs 1585 levels. Adding to the positive outlook the MACD (moving average convergence divergence) indicator recently showed a bullish crossover signaling that bullish momentum can continue in the next few trading sessions.In short outlook for HCL Tech is bullish. Dips can be used as buying opportunity for a move to Rs 1750 levels as long as Rs 1585 holds on the downside.Follow Ashish Kyal on Twitter   kyalashish",
    "After a firm opening the Nifty gave up the early morning gains and remained under pressure throughout the session on February 12. The Nifty 50 lost 166 points to close at 21616. Declining shares outnumbered the advancing shares as the advancedecline ratio stood at 0.33 on the BSE lowest since January 23.The Nifty closed on a weak note below its 11 and 20 DMA (day moving average). In the derivatives we have seen aggressive Call writing at 2180022000 strikes. Moreover we have seen the index forming multiple tops around 22000 mark during the last few days suggesting that on the upside the 2180022000 levels would act as a strong resistance. Therefore traders are advised to remain cautious till the benchmark closes above 22000.Immediate support for the Nifty is seen at 21448 and 21137 derived from the previous swing lows.The broader market indices like Midcap and Smallcap have started underperforming compared to the Nifty having lost 4.2 percent and 6.5 percent from their recent tops as against a 2.3 percent fall in the Nifty.Shortterm trend of the Midcap Smallcap Indices turned bearish after many weeks as they closed below its important moving averages. Our advice for the traders is to remain cautious for the Midcap Small cap space for the near term.Here are two buy calls and one sell call for the next 34 weeks KEC International  Buy   LTP  Rs 655   StopLoss  Rs 603   Target  Rs 714740   Return  13 percentAfter breaking out on the weekly chart from the downward sloping trendline the stock price is consolidating in a narrow range which we believe is a buying opportunity.Primary trend of the stock is positive as it is trading above its important moving averages.HCL Technologies  Buy   LTP  Rs 1667   StopLoss  Rs 1575   Target  Rs 17701850   Return  11 percentThe stock price has been forming bullish higher top higher bottom formation on the weekly chart. Momentum Indicators and Oscillators like RSI and MFI are in rising mode and placed above 60 on the daily chart indicating strength in the stock.IT stocks are expected to continue their outperformance in the coming weeks.",
    "The market is expected to lack a direction in trading this week as well unless the Nifty 50 gives a strong closing above 22000 or sinks below 21500 where the sacrosanct support is seen. This is likely to be a range for the index experts said.The Nifty 50 shed a third of a percent amid volatility and closed at 21783. The index has formed a bearish candlestick pattern with higher and lower shadows on the weekly scale. The timewise correction phase continued with intermediate support at 21680 (20 DEMA  day exponential moving average) followed by the sacrosanct support of 21500 for the current week. On the flip side the 2190022000 zone remains a daunting task for the bulls followed by the sturdy hurdle of 22100  Sameet Chavan research head for technical and derivatives at Angel One said.A decisive breakthrough beyond the mentioned support or resistance zone could only trigger the next leg of the rally in the market he feels. Chavan advises to have a pragmatic approach while keeping the zone in mind.Looking ahead to the next week Jigar S Patel senior manager of equity research at Anand Rathi also feels that it s crucial for traders to closely monitor the 21500 level which is identified as a significant support level. A breach of this level could potentially trigger panic in the market he said.Traders should keep a close eye on key support and resistance levels (22000 22100) and remain flexible in their trading strategies he advised.It appears that the past week was indeed characterised by significant volatility with the India VIX surpassing 15 level again and closing at 15.45 level on a weekly scale. This suggests that market participants should brace themselves for potentially heightened volatility in the coming week Jigar said.  collated a list of top 10 stock ideas from experts with 34 weeks perspective. The closing price of February 9 is considered for stock price return calculation.Expert  Vinay Rajani senior technical derivative research analyst at HDFC SecuritiesCastrol India  Buy   LTP  Rs 201.6   StopLoss  Rs 182   Target  Rs 235   Return  17 percentThe stock price has shown resilient move against the recent correction of the benchmark indices. Stock has been consolidating in the narrow range for last 5 trading sessions.Primary trend of the stock has been bullish with higher tops and higher bottoms on the weekly chart. Stock price is placed above all important moving averages indicating bullish trend on all time frames.UTI AMC  Buy   LTP  Rs 918.5   StopLoss  Rs 850   Target  Rs 1025   Return  12 percentThe stock has been in to consolidation phase for last 8 trading sessions. Primary trend of the stock is bullish as it is placed above all important moving averages.The stock recently surpassed the crucial swing high resistance of Rs 894 and has been sustaining above it. Indicators and oscillators like DMI (directional movement index) and RSI (relative strength index) have turned bullish on the daily charts.Bank of Maharashtra  Buy   LTP  Rs 61.56   StopLoss  Rs 56   Target  Rs 70   Return  14 percentAfter registering stellar rally the stock witnessed some profit booking from higher levels. It has come down to Rs 61 odd levels from recent swing high of Rs 69.Considering the primary uptrend the recent correction should be utilized as a buying opportunity. PSU Bank sector has started outperforming and the same is expected to continue.Expert  Shrikant Chouhan head   equity research at Kotak SecuritiesBharat Forge  Buy   LTP  Rs 1314   StopLoss  Rs 1270   Target  Rs 1410   Return  7 percentThe counter has shown a robust rally from the lower levels in the recent sessions. Moreover there is a fresh breakout along with incremental volume from the ascending triangle chart formation on the daily scale. As a result the comfortable close above its breakout zone suggest upward momentum to persist in the coming horizon.Punjab National Bank  Buy   LTP  Rs 123.9   StopLoss  Rs 119   Target  Rs 133   Return  7 percentAfter the remarkable up move the stock is having a breather from last few sessions. The consolidation in the rangebound structure suggests bullish continuation chart formation.Moreover the stock comfortably closed above its short term moving average. Therefore the stock is likely to resume its uptrend from the current levels.HCL Technologies  Buy   LTP  Rs 1630.6   StopLoss  Rs 1570   Target  Rs 1740   Return  7 percentOn the weekly charts the counter is into a rising channel chart formation with higher high and higher low series pattern. Additionally the technical indicator RSI is also indicating further up trend from current levels which could boost the bullish momentum in the near future.Expert  Apurva Sheth head of market perspectives   research at SAMCO SecuritiesDLF  Buy   LTP  Rs 834.4   StopLoss  Rs 795   Target  Rs 885   Return  6 percentOn the daily chart the stock is moving in a higher high and higher low formation. It is trading above 20 and 50 DMA (day moving average) indicating strength in price action. The stock surged significantly in volume when it broke through its previous resistance of Rs 815 and is currently trading above this level.The stock has strong support at Rs 800 level which corresponds to middle line of Bollinger band. Also the positive crossover is indicated in the MACD (moving average convergence divergence) indicator while the RSI stands at 59 level.Hence based on the above technical structure one can initiate a long position at CMP Rs 834.4 for a target price of Rs 885. The stoploss can be kept at Rs 795.Ambuja Cements  Buy   LTP  Rs 576.2   StopLoss  Rs 552   Target  Rs 615   Return  7 percentAmbuja Cements maintained a robust upward trend within a positive rising channel. The shortterm moving averages of 20 and 50 affirm this bullish momentum indicating favourable momentum.Despite a significant 40 percent surge in the past month it might continue its primary trend. Volume participation has remained strong aligns with the rising price indicates strength. Additionally VWAP is rising upwards confirm the bullish trend.Hence based on the above technical structure one can initiate a long position at CMP of Rs 576.20 for a target price of Rs 615. The stoploss can be kept at Rs 552.Expert  Avdhut Bagkar derivatives   technical analyst at StoxBoxACC  Buy   LTP  Rs 2628   StopLoss  Rs 2450   Target  Rs 2900   Return  10 percentThe  higher high higher low  formation is witnessing bullish momentum as it approaches its alltime high placed at Rs 2740. The price action is resilient implying that a strong trend in play. The support of Rs 2450 acts as a stoploss for any long trade.The negative divergence prevents selling pressure from dominate the fragile bias.We advocate buying ACC shares in the range of Rs 2620 2580 range holding Rs 2450 as stoploss. The target for the optimistic trade appears at Rs 2900.Vaibhav Global  Buy   LTP  Rs 458.8   StopLoss  Rs 420   Target  Rs 550   Return  20 percentThe monthly chart denotes a breakout of  Inverse Head and Shoulder  post surpassing the key hurdle of Rs 460 on a decisive note. The trend is optimistic and heading in the direction of Rs 550.The relative strength Index (RSI) is still far from reaching the overbought region signaling enough for an up move. The volumes on the breakout suggest bullish participation which could assist price to aim for higher levels.We recommend to buy around Rs 460450 levels holding Rs 420 as a support levels and aiming to reach Rs 510  550 levels.",
    "Market experts expect Finance Minister Nirmala Sitharaman to focus on continuity in capital expenditure towards infrastructure new tax regime fiscal consolidation path and GDP growth numbers in the Budget 2024 especially ahead of general elections.The market clocked nearly one percent gains on January 31 and broader markets rallied more than 1.5 percent ahead of the budget day thanks to banking stocks. Nifty 50 recouped almost all its previous day s gains in the rebound.On January 31 the BSE Sensex climbed over 600 points to 71752 and the Nifty 50 jumped over 200 points to 21726 while the Nifty Midcap 100 and Smallcap 100 indices gained 1.6 percent and 2.25 percent respectively.  collated a list of Budget stocks picks from experts with 34 weeks perspective. The closing price of January 31 is considered for stock return calculation.Expert  Jigar S Patel Senior Manager  Equity Research at Anand RathiPetronet LNG  Buy   LTP  Rs 269   StopLoss  Rs 235   Target  Rs 320   Return  19 percentSince 2019 until 2023 Rs 240 levels have proved to be massive resistance. Fortunately in January 2024 the said counter managed to clear its Rs 240 resistance very comfortably and is currently placed near Rs 270 zone.The breakout on the monthly chart looks genuine since it is accompanied by huge volume with respective stochastics reversing from the 40 zone which is looking lucrative at current levels.Thus investors and traders can enter longs in the zone of Rs 255 270 with an upside target of Rs 320 and a stoploss of Rs 235 on a daily closing basis.KPR Mill  Buy   LTP  Rs 790   StopLoss  Rs 749   Target  Rs 860   Return  9 percentAfter making the top near Rs 928 on November 22 2023 the said counter gave a decent correction until Rs 732. In the previous trading session it bounced back from the support zone of Rs 730 coincidentally which is between 100 and 200 DEMA (day exponential moving average) and in the process it also took out its bearish trendline (refer to the chart) thus making it attractive at current levels.On the indicator front daily stochastics has given a bull divergence (refer to the chart) which further confirms our bullish stance on the counter. Thus one can buy in the zone of Rs 780 795 with an upside target of Rs 860 and stoploss orders would be placed on a daily closing basis around Rs 749.Maruti Suzuki India  Buy   LTP  Rs 10187   StopLoss  Rs 9650   Target  Rs 11000   Return  8 percentAfter breaking down the psychological level of Rs 10000 in the month of August 2023 the counter has retested Rs 10000 again and reversed from that level which confirms that the August 2023 breakout above Rs 10000 was genuine. Also volume was huge at the time of the reversal which further confirms our bullish stance on the counter.Coincidentally 200 DEMA which comes around Rs 9850 has been successfully tested (refer to the chart). On the indicator front daily stochastics has shown a bull divergence (refer to the chart). Thus one can buy in the zone of Rs 9900 10200 with an upside target of Rs 11000 and stoploss orders would be placed on a daily closing basis around Rs 9650.Expert  Omkar Patil technical   derivatives analyst  institutional equity at Ashika GroupTata Power  Buy   LTP  Rs 390   StopLoss  Rs 370   Target  Rs 435   Return  11 percentThe stock is presently trading at an alltime high reflecting its strong momentum. The consistent up move from the lower levels of Rs 230 has found support on each dip at the 12day EMA. Additionally the MACD (moving average convergence divergence) on the daily timeframe has shown a positive crossover above the zero line indicating the likelihood of the prices continuing to trend higher.Going ahead we expect the prices to move higher till Rs 435 where the stoploss on the downside must be kept at Rs 370 on closing basis.Bank of Baroda  Buy   LTP  Rs Rs 247.6   StopLoss  Rs 235   Target  Rs 275   Return  11 percentThe stock is in a robust uptrend marked by higher highs and higher lows. The recent up move is accompanied by a surge in volumes indicating a strong buildup in the trend.Additionally the MACD on the daily timeframe has shown a positive crossover confirming the presence of positive momentum in the stock.Going ahead we expect the prices to move higher till Rs 275 where the stoploss on the downside must be kept at Rs 235 on closing basis.National Aluminium Company  Buy   LTP  Rs 149   StopLoss  Rs 144   Target  Rs 165   Return  11 percentThe stock has recently surpassed its multiyear high around Rs 142 the highest since April 2008. The stock has broken out of the consolidation zone range of 122140 indicating the continuation of the prior uptrend. The recent rise in volumes also reflects the enthusiasm in the trend.Going ahead we expect the prices to move higher till Rs 165 where the stoploss on the downside must be kept at Rs 144 on closing basis.Expert  Ruchit Jain lead research at 5paisa.comColgate Palmolive  Buy   LTP  Rs 2569   StopLoss  Rs 2480   Target  Rs 2730   Return  6 percentThe stock has seen an uptrend in last few months and has shown an outperformance to other stocks from the FMCG sector. In last few weeks the stock consolidated in a range which just seemed to be a timewise correction within an uptrend.The prices have now given breakout from this consolidation and the RSI (relative strength index) oscillator too has given a positive crossover which indicates a resumption of the uptrend.Traders can look to buy the stock around current market price of Rs 2570 for potential target of Rs 2730. The stoploss on long positions should be placed below Rs 2480.Dr Reddy s Laboratories  Buy   LTP  Rs 6121   StopLoss  Rs 5920   Target  Rs 6470   Return  6 percentThe stock gave a breakout from its previous swing high resistance post the announcement of its quarterly results. The volumes on breakout were high which indicates a fresh buying interest in the stock and the RSI readings too are hinting at positive momentum.We advise traders to look for buying opportunities in the stock around current market price of Rs 6120 and add on any dips towards the breakout zone of Rs 6000. The potential targets for the stock are seen around Rs 6320 and Rs 6470 while stoploss on long positions should be placed below Rs 5920.HCL Technologies  Buy   LTP  Rs 1576   StopLoss  Rs 1500   Target  Rs 1720   Return  9 percentThe stock has been forming a  higher top higher bottom  structure since last few months and is thus in an uptrend. The 20 DEMA has been acting as a support on declines and it has formed a  Bullish Flag  pattern on the daily charts.The price volumes structure is also bullish as the price up moves have been supported by good volumes but the corrections have not seen any high volume selloff.Hence we advise short term traders to buy the stock in the range of Rs 15801570 for potential targets of Rs 1660 and Rs 1720. The stoploss on long positions should be placed below Rs 1500.Expert  Jatin Gedia technical research analyst at Sharekhan by BNP ParibasGrasim Industries  Buy   LTP  Rs 2175   StopLoss  Rs 2050   Target  Rs 23002411   Return  11 percentGrasim was consolidating in a range and in process has retraced 38.2 percent of the rise from Rs 1820   Rs 2166. In terms of price pattern it has formed and broken out a Bullish Flag pattern on the upside indicating resumption of the next leg of upmove.Daily momentum indicator has completed its pullback to the equilibrium line and triggered a positive crossover which indicates start of a new cycle.Prices are trading along the expanding upper Bollinger band indicating that the positive momentum is likely to continue. On the upside the move can extend towards Rs 2300 and above that it can extend towards Rs 2411. Structure becomes weak below Rs 2050.PFC  Buy   LTP  Rs 443   StopLoss  Rs 410   Target  Rs 479495   Return  12 percentPower Finance Corporation (PFC) has been in a medium term uptrend. In the last two months the stock has undergone a time wise correction where it has been trading within the broad range of Rs 380   430. The range has been broken out on the upside and suggests that the stock has resumed its next leg of upmove.Daily momentum indicator has a positive crossover which is a buy signal. Thus both price and momentum indicator suggest that the stock has resumed its upmove after a two months consolidation.Targets on the upside are placed at Rs 479 which is the weekly upper Bollinger band and Rs 495 which is the range breakout target. The structure becomes weak below Rs 410.SBI  Buy   LTP  Rs 641   StopLoss  Rs 616   Target  Rs 670700   Return  9 percentState Bank of India (SBI) underwent correction and retraced 50 percent of the rise it witnessed from Rs 555 to Rs 660. The correction halted around the 20week moving average (Rs 602) and witnessed buying interest from the crucial support zone.The daily momentum indicator provided a positive crossover from below the equilibrium line which is a buy signal. On the price front the stock has broken out of a falling channel indicating resumption a fresh leg of upmove.We expect the stock to rise towards the recent swing high of Rs 670 and extend towards the psychological level of Rs 700 from short term perspective. Structure shall become weak below Rs 616.",
    "Geojit s research report on HCL TechnologiesHCL Technologies Ltd (HCL) is into software development and business process outsourcing as well as providing IT infrastructure services. It has operations in 60 countries with a client base that includes Fortune 500 and Global 2000 companies. As of endQ3FY24 the employee count was 224756. The company delivered muted performance in Q3FY24 with slight increase in topline and margins amid a challenging macroeconomic environment. Consolidated sales grew 6.5  YoY to Rs. 28446cr (4.3  YoY in constant currency terms) owing to increase in recurring revenue in its software business. EBITDA margin widened 10bps YoY to 23.9  due to lower discretionary spends and furloughs. In Q3FY24 Company performed far better amongst its top competitors in the IT industry. Order pipeline rose at a tepid pace and remain optimistic on improving margin in the medium term.OutlookHence we upgrade our rating on the stock from HOLD to BUY with a roll forward target price of Rs. 1760 based on 23.5x FY26E adjusted EPS.For all recommendations report click here",
    "Net Sales at Rs 28446.00 crore in December 2023 up 6.54  from Rs. 26700.00 crore in December 2022.Quarterly Net Profit at Rs. 4350.00 crore in December 2023 up 6.2  from Rs. 4096.00 crore in December 2022.EBITDA stands at Rs. 7157.00 crore in December 2023 up 8.03  from Rs. 6625.00 crore in December 2022.HCL Tech EPS has increased to Rs. 16.06 in December 2023 from Rs. 15.13 in December 2022.HCL Tech shares closed at 1555.45 on January 16 2024 (NSE) and has given 34.82  returns over the last 6 months and 42.22  over the last 12 months.",
    "Net Sales at Rs 12531.00 crore in December 2023 up 1.07  from Rs. 12398.00 crore in December 2022.Quarterly Net Profit at Rs. 3349.00 crore in December 2023 up 4.79  from Rs. 3196.00 crore in December 2022.EBITDA stands at Rs. 5098.00 crore in December 2023 up 5.24  from Rs. 4844.00 crore in December 2022.HCL Tech EPS has increased to Rs. 12.37 in December 2023 from Rs. 11.80 in December 2022.HCL Tech shares closed at 1555.45 on January 16 2024 (NSE) and has given 34.82  returns over the last 6 months and 42.22  over the last 12 months.",
    "Sharekhan s research report on HCL TechnologiesHCL Tech reported strong revenues of  3415 million up 6  qoq 4.3  yoy in constant currency (CC) terms beating our estimates of 4.4  qoq CC led by ERS HCL Software and IT services which grew 8.7  32  and 1.9  qoq respectively in CC terms. EBIT margins improved  130 bps qoq to 19.8  owing to outperformance from the software (180 bps) that was offset by services margin (50 Bps) despite wage hike and furloughs. New deal win TCVs stood at  1927 million down 51  18  on a qoq and yoy basis respectively. FY24 CC revenue growth (including ASAP acquisition) guidance narrowed to 55.5  at company level as well as for Services segment. Ask rate for Q4FY24 at 0.3 to 2.1  and 1.6 to 3.5  at services level.OutlookWe believe HCL Tech is wellequipped to maintain its growth leadership among large peers in the medium term given the diversified portfolio that is wellaligned to growth areas and strong execution. Hence we maintain Buy with revised price target (PT) of Rs 1780. At CMP the stock trades at 22.5 19.1x its FY25 26E EPS.For all recommendations report click here",
    "Considering the impressive rally led by technology stocks in the market last Friday (January 12) experts suggest that the market is poised to reach the 2200022100 zone in the coming days before potentially entering a consolidation phase. Support is expected to move slightly higher to the 2180021700 area while the crucial support level remains at 21500.area while the crucial support remains at 21500 levels experts said.On January 12 the benchmark indices achieved a record closing high with the Nifty 50 gaining 247 points to reach 21894.5. The daily charts exhibited a bullish candlestick pattern indicating a formation of higher highs and higher lows for yet another session.The BSE Sensex climbed 847 points to 72568 but the broader markets underperformed frontline indices as the Nifty Midcap 100 and Smallcap 100 indices gained 0.4 percent each.Stocks that recorded healthy gains and better than benchmarks   broader markets included HCL Technologies Firstsource Solutions and IRFC. HCL Technologies has seen a decisive breakout of horizontal resistance trendline and climbed 3.8 percent to end at record closing high of Rs 1540.8. The stock has formed long bullish candlestick pattern on the daily charts with strong volumes while the stock traded way above all key moving averages (20 50 100 and 200day EMA  exponential moving average) which is a positive sign.Firstsource Solutions also participated in the IT rally rising 10.4 percent to Rs 210 the highest closing level since October 19 2021 and formed robust bullish candlestick pattern on the daily charts with significantly higher volumes.IRFC extended uptrend for third consecutive session with healthy bullish candlestick pattern on the daily charts and the volume remained above average for yet another session. The stock jumped 6 percent to end at record closing high of Rs 113.4.Here s what Rajesh Palviya of Axis Securities recommends investors should do with these stocks when the market resumes trading today Indian Railway Finance CorporationOn the weekly chart the IRFC broke above the  Rounded Bottom  pattern at Rs 92 in midDecember 2023 and consolidated for the past three weeks. Last week it surpassed the small consolidation range between Rs 10594 signalling a continuation of the uptrend postbreakout.The daily and weekly RSI (relative strength index) indicators are in a bullish mode indicating rising strength.Investors should buy hold and accumulate this stock with an expected upside of Rs 123130 with downside support zone of Rs 108103 levels.Firstsource SolutionsOn the weekly chart FSL broke above the  multiyear resistance  level at Rs 192 a barrier in place since January 2022. This breakout is accompanied by an increase in volume activity indicating an influx of market participation.The prior resistance zone around Rs 192 is expected to function as a support zone aligning with the  Principle of Change in Polarity  in technical analysis.Additionally the weekly RSI strength indicators are in a bullish mode holding above their reference line indicating rising strength.Investors should buy hold and accumulate this stock with an expected upside of Rs 230250 with downside support zone of Rs 197190 levels.HCL TechnologiesOn the weekly chart HCLTECH broke above the  Bullish Flag  pattern at Rs 1490 with a strong bullish candle signalling the continuation of an uptrend. The breakout is accompanied by an increase in volume activity suggesting a surge in market participation.The stock is establishing higher highs and higher lows maintaining its position above the mediumterm upwardsloping trendline indicating a continued uptrend.The weekly strength indicator RSI is in a bullish mode and holding above its reference line suggesting a positive bias.Investors should buy hold and accumulate this stock with an expected upside of Rs 16301700 and downside support zone of Rs 14901450 levels.",
    "Shares of HCL Technologies opened 4 percent higher on January 15 extending gains for a second day in a row with brokerages raising FY24 FY25 and FY26 earnings estimates for the company following a solid beat in Q3 FY24 numbers. At 9 17 am the stock was quoting at Rs 1603.70 on the NSE higher by 4.1 percent from previous close.For the December quarter the HCL Tech reported a 6.23 percent yearonyear (YoY) growth in net profit at Rs 4351 crore and 6.54 percent YoY in consolidated revenue at Rs 28446 crore. Both numbers beat   estimates.Before the results were announced on January 12 the stock had gained 4 percent in anticipation of strong results on the back of ASAP acquisition and Verizon deal.Also Read  Jio Financial Services Q3 results on Jan 15  Here s all you need to knowWhile December quarter is a seasonally weak quarter for Indian IT services companies HCL Tech is an exception due to its products vertical as per analysts. The growth in revenue was driven by seasonal gains in HCL Software (products and platform) which rose 34 percent sequentially  said analysts at Motilal Oswal Financial Services.Meanwhile the company has slightly reduced its revenue growth guidance for FY24 from 56 percent YoY in constant currency terms to now 55.5 percent though it has maintained its margin guidance of 1819 percent.Also Read  Avenue Supermarts Q3  DMart operator s net profit rises 17  to Rs 690 crore revenue up 17.3 EPS upgradesAfter the strong Q3 results and beat Motilal Oswal has raised FY2426E EPS by 34 percent.  We reiterate our BUY rating with a target price of Rs 1880. HCLT remains our top pick in the IT Services coverage for 2024. The stock is trading at  20x FY26E EPS which offers a margin of safety  it said.Nuvama Institutional Equities has also upgraded FY24 FY25 and FY26 EPS by 2 percent 0.6 percent and 2.7 percent respectively. We continue to value HCL at 23x FY26 PE yielding a target price of Rs 1780 (earlier Rs 1700). Retain BUY  Nuvama s analysts Vibhor Singhal and Nikhil Choudhary wrote in a note.Analysts at Morgan Stanley maintained an Equalweight call but raised the target to Rs 1600 per share from Rs 1470 highlighting the company s superior Q3 performance and notable beats in services business and EBIT margins. On the other hand CLSA downgraded HCLTech to Underperform from Outperform despite raising the target to Rs 1536 per share.Also Read  HCLTech bucks industry trend headcount up by 3617 in Q3FY24Key takeaways from concallAnalysts cheered that the management aspired to achieve and sustain a 20 percent margin trajectory in the longer term. Going ahead the company is betting big on GenAI.A key takeaway from the call as per Emkay Global is that GenAI holds immense potential and nearterm programs in this segment are likely to be small albeit expected to become sizable in the next 23 quarters. HCL Tech has signed 31 deals in Gen AI most of which are valued at sub 1 million.Also Read  Dalal Street Week Ahead  Q3 earnings Red Sea China GDP Europe inflation among 10 key factors to watchManagement does not see an uptick in discretionary spend yet. However cloud analytics remains strong noted Nuvama.  HCL Tech does not see any meaningful change in the demand environment in IT Services while seeing growth momentum in the ER D (Engineering and R D) business  it said.Over the past one year HCL Tech stock has outperformed most of its large peers and has gained over 42 percent.",
    "Motilal Oswal s research report on HCL TechnologiesHCL Technologies (HCLT) delivered a robust 3QFY24 performance with a 6.0  QoQ revenue growth in constant currency (CC) terms ahead of our estimate of  4.4 . This growth was driven by seasonal gains in HCL Software (P P) which rose 34  QoQ. HCLT s Services grew 3.1  QoQ in CC terms (110bp ahead of MOFSLe) with healthy growth in both the IT and ER D verticals. The TCV was at USD1.9b down from 2Q s high base of USD4.0b. HCLT narrowed its FY24 USD revenue growth guidance to 5.0 5.5  YoY in CC (vs. 5.06.0  YoY earlier including ASAP) for both consolidated and Services segment. The EBIT margin also exceeded expectations at 19.8  ( 130bp QoQ) led by HCL Software which achieved 32.9  margin. The Services margin contracted 50bp QoQ though. HCLT retained its EBIT margin guidance band of 1819 .OutlookAfter the strong 3Q results and beat we have raised our FY2426E EPS by 3 4 . We reiterate our BUY rating with a TP of INR1880 as we roll forward our P Ebased valuation to FY26 and assign a multiple of 24x.For all recommendations report click here",
    "IT services major HCL Technologies traded flat at Rs 1500 per share on December 20 morning deals after the company faced a ransomware incident within a restricted cloud environment associated with one of its projects. HCLTech has become aware of a ransomware incident in an isolated cloud environment for one of its projects. There has been no impact observed due to this incident on the overall HCLTech network  the IT company said in a stock exchange filing on December 20.Cybersecurity and data protection is a top priority for HCLTech. A detailed investigation is underway in consultation with relevant stakeholders to assess the root cause and take remedial action as necessary it added.Follow our market blog to catch all the live updatesFollowing a significant 10 percent increase in the span of three trading sessions HCL Technologies has been downgraded by Kotak Institutional Equities on December 19. The brokerage firm has taken this step due to its perception of limited potential for further gains. Furthermore Kotak has revised its rating on HCL Technologies downgrading it from  Buy  to  Add .Last week HCL Technologies India s No. 3 softwareservices exporter entered an exclusive group of companies with a market capitalisation (marketcap) of Rs 4 lakh crore.In a filing to the stock exchange on December 14 HCL Technologies announced that it has secured a contract from the Department of Transport and Planning in Victoria Australia. The agreement involves the development and support of a Concessions Entitlement Validation Platform (CEVP).The platform aims to automate the concession entitlement process for public transport users providing instant proof of concession entitlement and a passenger interface for applying for and managing concession entitlement. The financial details of the deal were not disclosed.HCL Technologies cut its revenue forecast for the current financial year in October attributing the adjustment to weakerthanexpected discretionary spending by its clients in the first half of the year. The company expects organic revenue growth for fiscal 2024 to fall in the range of 4 percent to 5 percent in constant currency terms. This is a revision from its earlier projection which had indicated an increase between 6 percent and 8 percent.HCL Technologies  consolidated net profit increased by 9.8 percent to Rs 3832 crore ( 460.35 million) for the second quarter ended September 30.        ",
    "Bulls of Dalal Street charged the market to hit the muchawaited psychological 21000 level and record the highest weekly gains since July 2022 but it failed to hold the level as some consolidation kicked in. The phase of consolidation may last as long as the index trades below the 21000 mark with immediate support at 20850 and crucial support at the 2050020300 levels but if the index decisively closes above 21000 then 21500 could be the possibility experts said.The Nifty50 has seen a strong gapup opening in the week ended December 8 and jumped 3.46 percent to end at a record closing high of 20969 forming a healthy bullish candlestick pattern on the daily charts with higherhighhigherlow formation for yet another week. In the upcoming week 20850 is viewed as an immediate support and sustained trading below this level could trigger a price correction potentially bringing prices towards the next support at 20700  Sameet Chavan research head for technical and derivatives at Angel One said.He further said the primary support zone remained the bullish gap created last week ranging from 20500 to 20300 and as long as it holds the secular bull run is expected to persist and any type of correction would be considered healthy for primary uptrend.On the other hand identifying key resistance is challenging in uncharted territory but the 21100 levels representing a reciprocal golden (161.8 percent) retracement of the recent fall holds technical significance he added.Ajit Mishra SVP of technical research at Religare Broking also said the Nifty has the potential to test the 2120021500 zone and expects the index to hold the 2030020550 zone in case investors decide to take some money off table.He maintains a positive view on the market despite the overbought conditions and suggests participants to look for buying opportunities on dips while Sameet advised traders to focus on thematic movements for potentially outperforming trades while remaining vigilant in the dynamic market environment.  collated the list of 10 stock picks from experts which can generate healthy returns in the coming 34 weeks from the closing price December 8 Subash Gangadharan senior technical and derivative analyst at HDFC SecuritiesKotak Mahindra Bank  Buy   LTP  Rs 1838   StopLoss  Rs 1750   Target  Rs 2000   Return  9 percentKotak Bank has shown relative strength last week. While the Nifty has gained 3.47 percent the stock has gained 5 percent. In the process the stock has closed above its recent trading range on the back of above average volumes which augurs well for the uptrend to continue.Technical indicators are giving positive signals as the stock is trading above the 20 and 50day SMA (simple moving average). Momentum readings like the 14week RSI (relative strength index) too are in rising mode and not overbought which implies potential for further upsides.With the intermediate technical setup too looking attractive we expect the stock to move up towards its previous intermediate highs in the coming weeks. Buy between Rs 18301850 levels. Stoploss is at Rs 1750 while target is at Rs 2000.EIH  Buy   LTP  Rs 247   StopLoss  Rs 237   Target  Rs 265   Return  7 percentAfter correcting from an intermediate high of Rs 275 tested in September 2023 EIH found support around Rs 205 levels in October 2023. These are strong supports as they also roughly coincide with the previous intermediate lows.The stock has since then bounced back and made higher tops and higher bottoms over the last few weeks. The stock has broken out of its recent trading range this week on the back of healthy volumes. This indicates it is set to move higher in the coming weeks.Technical indicators too are giving positive signals as the stock is trading above the 20 and 50day SMA. Momentum readings like the 14day RSI too are in rising mode and not overbought which implies potential for further upsides.With the intermediate technical setup too looking attractive we expect the stock to move up towards its previous intermediate highs in the coming weeks. Buy in the Rs 245250 levels. Stoploss is at Rs 237 while target is at Rs 265.Indiabulls Real Estate  Buy   LTP  Rs 90   StopLoss  Rs 80   Target  Rs 105   Return  17 percentAfter correcting from an intermediate high of Rs 196 tested in November 2021 Indiabulls Real Estate found support around Rs 46 levels in March 2023. These are strong supports as they also roughly coincide with the previous intermediate lows.The stock has since then bounced back and made higher tops and higher bottoms over the last few weeks. This week the stock has broken out of its recent trading range on the back of huge volumes. This indicates significant accumulation has happened in this counter which augurs well for the uptrend to continue.Technical indicators too are giving positive signals as there has been a positive moving average crossover. The 20week SMA has recently moved above the 50 week SMA. Momentum readings like the 14week RSI too are in rising mode and not overbought which implies potential for further upsides.With the intermediate technical setup too looking attractive we expect the stock to move up towards its previous intermediate highs in the coming weeks. Buy between Rs 8791 levels. Stoploss is at Rs 80 while target is at Rs 105.Mehul Kothari DVP   Technical Research at Anand RathiIRCTC  Buy   LTP  Rs 750   StopLoss  Rs 715   Target  Rs 795   Return  6 percentIn the past few months we witnessed an exceptional rally in the railway stocks but IRCTC (Indian Railway Catering   Tourism Corporation) was the one which was lagging behind. A couple of sessions back IRCTC confirmed a range breakout and the price structure resembles a bullish Inverse Head and Shoulder pattern.The price action is accompanied with the bullish placement of weekly ADX (average directional index) which is above 25. This might result in a strong upside momentum.Thus traders are advised to buy Rs IRCTC in the range of Rs 750  740 with a stoploss of Rs 715 on closing basis for an upside target of Rs 795 in coming 1 2 months.Jigar S Patel Senior Manager  Equity Research at Anand RathiJubilant Foodworks  Buy   LTP  Rs 559.75   StopLoss  Rs 499   Target  Rs 645   Return  15 percentOn a daily scale the said counter has taken out the previous swing high of Rs 556. On a weekly scale price action is sustaining above all major exponential averages which is a sign of bullishness.On the indicator front the daily RSI has taken out its previous swing high along with the daily DMI s bullish cross which further confirms our bullish stance in the counter.On a daily close basis one can buy in the zone of Rs 550560 with an upside target of Rs 645 and a stoploss of around Rs 499 on a daily close basis.Shrikant Chouhan head equity research at Kotak SecuritiesHCL Technologies  Buy   LTP  Rs 1364   StopLoss  Rs 1315   Target  Rs 1460   Return  7 percentOn daily and weekly charts the stock is consistently forming higher high and higher low formation which is largely positive. On last Friday the stock successfully cleared the shortterm resistance of Rs 1350 and succeeded to close above the same.It also formed bullish candle on daily charts which supports further uptrend from the current levels. We are of the view that as long as the stock is trading above Rs 1315 the bullish formation is likely to continue. Above which the stock could continue the positive momentum till Rs 1430 1460.Bank of Baroda  Buy   LTP  Rs 212   StopLoss  Rs 204   Target  Rs 227   Return  7 percentIn the past week the stock rallied over 5 percent. After a long time the stock successfully trading above 50day SMA. A bullish candle on weekly charts and uptrend continuation formation on daily and intraday charts supports further uptrend from the current levels.For the trend following traders now Rs 204 would act as a trend decider level above the same the stock could rally till Rs 222227.HDFC Life Insurance Company  Buy   LTP  Rs 671   StopLoss  Rs 660   Target  Rs 725   Return  8 percentAfter a promising uptrend the stock was witnessing some profit booking at higher levels. However the shortterm texture of the stock is still in to the positive side.We are of the view that the stock has completed one leg of correction and now. If it sustained above 20day SMA or Rs 660 level then it could move up till Rs 710. Further upside may also continue which could lift the stock till Rs 725.Omkar Patil Technical   Derivative Analyst at Ashika Stock BrokingUltraTech Cement  Buy   LTP  Rs 9414   StopLoss  Rs 9075   Target  Rs 10400   Return  10 percentUltraTech is currently experiencing a robust uptrend characterized by a healthy correction from June 2023 to November 2023. Notably this correction maintained a positive structure by avoiding lower lows and lower highs.Having emerged from consolidation the stock is now showing an uptick in volumes indicating potential price acceleration. Furthermore prices are positioned above shortterm averages and the RSI stands above the mark of 60 on both daily and weekly timeframes affirming the presence of positive momentum.We expect the prices to move higher till the mark of Rs 10400 where the stoploss must be Rs 9075 on daily closing basis.NOCIL  Buy   LTP  Rs 258.45   StopLoss  Rs 250   Target  Rs 290   Return  12 percentNOCIL s stock underwent a yearlong consolidation fluctuating between Rs 255 on the higher end and Rs 200 on the lower side. A notable development occurred as the stock recently broke out of this range with a rising gap highlighting robust demand fueling the breakout.The surge in volume accompanying the breakout further validates its strength. Additionally the RSI on the daily timeframe is above the 60 mark indicating a rising momentum in prices.We expect the prices to move higher till the mark of Rs 290 where the stoploss must be Rs 250 on daily closing basis.",
    "Shares of HCL Technologies  slipped 1 percent to Rs 1320 per share on December 5 after its UKarm is set to offload entire 49 percent stake in USbased State Street joint venture (JV).In the past three months the stock of this IT major jumped 8.5 percent as against 5 percent rise in the benchmark Sensex.Follow live blog for all the market actionHCL Tech Investments UK the stepdown whollyowned subsidiary of HCL Tech signed a memorandum of understanding (MoU) with its joint venture partner State Street International Holdings for selling entire 49 percent stake in the JV to State Street for  170 million plus net book value.Analysts at Morgan Stanley shared an  overweight  rating with a target price of Rs 1400 per share.  The transaction is expected to complete by second quarter of fiscal year 202324 (Q2FY24) or Q1FY25. State Street has a revenue base of  97 million and net worth of  94 million. State Street would own 49 percent of voting rights in the JV and 100 percent of dividend rights  the brokerage firm said.Nomura however shared a  neutral  call on HCL Tech post this deal with a target price of Rs 1200 per share. They believe that HCL Tech would lose  97 million of revenues or 80 basis points (bps) of its current revenues post this divesture. As part of this divesture HCL Tech would receive  170 million plus net book value on date of closing. The arrangement is expected to be effective from Q1FY25 onwards  analysts added.ALSO READ  Accumulate HCL Technologies  target of Rs 1374  KR ChokseyState Street Corporation is a USbased financial services provider to institutional investors including investment servicing investment management and investment research and trading. Bringing the State Street HCL Services capabilities and expertise inhouse will create a more simplified model to facilitate faster decision making and a more effective and efficient experience for its clients  HCL Tech said in an exchange filing dated December 4 2023.",
    "The market achieved a fresh milestone on December 1 the first day of the last monthly series of the current calendar year with the Nifty50 exceeding  its previous record high after twoandahalf months to hit 20285 points.Renewed buying by foreign institutional investors (FIIs) raging hopes that the US Federal Reserve has stopped raising the rates and a reversal is on the cards backed by strong fundamentals and robust economic growth back home in India have been the main growth drivers for the record rally in the equity market.Technically the Nifty50 looks on course to reach another milestone of 20500 points soon considering the healthy bullish candlestick pattern on the daily charts with continuation of higherhighshigherlows for four days in a row and staying above all key moving averages while 20000 is expected to be a crucial support from here on experts said.Historically December has been the best month for the Nifty50 with more than 3 percent average return if we were to consider the monthly performance data for the last 29 years. So the probability of the Indian markets continuing its upward journey this month looks high said Vinay Rajani CMT senior technical and derivative analyst at HDFC Securities.The Nifty50 jumped 136 points or 0.7 percent to 20269 at 1 22pm after the end of uncertainty related to exit poll in five state elections taking the total gains to 7.7 percent from the October low of 18837.85. All the sectors supported the market barring IT.Also read  Why Sensex lags behind Nifty in race to new highs  Blame it on these top gainers BSE index lacks The sentiment remains strong as long as it stays above the 20000 mark and also continued buyondips strategy. On the higher side the index could potentially move towards 2045020500  Rupak De senior technical analyst at LKP Securities said.The broader markets also maintained the upward move with the Nifty Midcap 100 index gaining 1.15 percent and Nifty Smallcap 100 index rising 0.7 percent while India VIX stayed below 13.The BSE Sensex which traded 494 points higher at 67482 is yet to surpass its previous record high of 67927.23 reached on September 15.Let s take a look at the top 10 trading ideas from experts for the next threefour weeks. Returns are based on the November 30 closing prices.Expert  Ashish Kyal CMT Founder and CEO of Waves Strategy AdvisorsAU Small Finance Bank  Buy   LTP  Rs 741.4   StopLoss  Rs 720   Target  Rs 780   Return  5 percentDespite the index rallying AU Small Finance Bank saw some profitbooking in the previous session. The chart shows that prices have just closed above the cloud keeping the overall tone positive. Wave b appears to be completed on the downside as prices have retraced nearly 78.6 percent of the previous leg.We used Supertrend on the hourly chart. It has served as a strong support and resistance and prices are taking support at the moment. We can now expect an upward bounce. Furthermore the entire sector is up so the overall outlook remains positive.Overall the trend for AU Small Finance Bank looks positive. Any break above Rs 755 will take the stock towards Rs 780 levels whereas on the downside Rs 720 can act as a nearest support.Gufic Biosciences  Buy   LTP  Rs 334.25   StopLoss  Rs 315   Target  Rs 350   Return  5 percentGufic Biosciences has been moving higher recently and intact in strong uptrend. On the daily chart in the previous session prices formed a bullish candle. Price has closed above Rs 333 which confirm breakout of the rounding bottom pattern.We have shown ADX (average directional index) indicator which gives an indication if the stock is trending or in a trading range. The low readings of ADX indicates that the stock is in a range. The ADX of this stock is 42.91 giving an indication of a trending market. The reading above 25 means strong directional strength.As shown on the hourly chart price has recently bounced from the Ichimoku cloud which can act as nearterm support zone. Closest support is placed at Rs 315.In short trend for this stock is positive. Use dips towards Rs 325 as a buying opportunity for a move towards Rs 350 levels as long as Rs 315 holds on the downside.Expert  Jigar S Patel Senior Manager  Equity Research at Anand RathiHindustan Unilever  Buy   LTP  Rs 2545.55   StopLoss  Rs 2490   Target  Rs 2700   Return  6 percentAfter consolidating for 8 10 weeks HUL gave a breakout from its previous trading range along with a bear trendline violation which is looking lucrative at current levels.On the indicator front weekly RSI (relative strength index) is consistently above 50 levels along with weekly DMI s (directional movement index) that are positive thus adding further confirmation of bullish bias.One can buy in the zone of Rs 2550 2570 and the target would be Rs 2700 and the stoploss would be Rs 2490 on a daily close basis.Jubilant Foodworks  Buy   LTP  Rs 560.85   StopLoss  Rs 520   Target  Rs 655   Return  17 percentOn a daily scale the said counter has taken out the previous swing high of Rs 556. On a weekly scale price action is sustaining above all major exponential averages which is a sign of bullishness.On the indicator front the daily RSI has taken out its previous swing high along with the daily DMI s bullish cross which further confirms our bullish stance in the counter.On a daily close basis one can buy in the zone of Rs 560 570 with an upside target of Rs 655 and a stoploss of around Rs 520 on a daily close basis.Chambal Fertilisers and Chemicals  Buy   LTP  Rs 318.25   StopLoss  Rs 285   Target  Rs 365   Return  15 percentChambal Fertilisers has been consolidating for some time on the weekly chart. Recently it had a breakout with huge volume. On the indicator front weekly RSI is about to enter the 70 zone along with weekly DMI which has turned positive thus looking lucrative.Thus we advise traders to go long in the stock in the range of Rs 315320 with a stoploss of Rs 285 and target of Rs 365Expert  Om Mehra technical analyst at SAMCO SecuritiesSAIL  Buy   LTP  Rs 92.30   StopLoss  Rs 87   Target  Rs 102   Return  10.5 percentSteel Authority of India stock is trading above 20 and 50 simple moving averages (SMA) ratifying the support in price action. Also Inverse Head and Shoulder formation is indicated in the daily chart. The price has been trading above Ichimoku Cloud   positive crossover is indicated in MACD (moving average convergence divergence) indicator indicating the continuity of the ongoing trend.There is minor resistance around Rs 94 levels once it sustains above these levels strong traction is expected.Hence based on the above technical structure one can initiate a long position at Rs 92.7. However on the safer side nearby Rs 9192 levels would be a better range to enter. Closing and sustaining above Rs 94 would lead toward Rs 102 levels in the coming days. Stoploss can be kept as Rs 87.Britannia Industries  Buy   LTP  Rs 4852.65   StopLoss  Rs 4748   Target  Rs 5200   Return  7 percentOn a weekly chart the stock has been trading with the support of a middle Bollinger band which suggests a positive bias. Additionally the stock has formed a strong base around Rs 4700 levels and is sustaining above these levels.Stochastic a daily momentum indicator shows a positive crossover which adds more bullishness to the price.Hence based on the above technical structure one can initiate a long position at current market price. Closing and sustaining above Rs 4920 will lead towards Rs 51505200 levels in the coming days. Stoploss can be kept as Rs 4748.Canara Bank  Buy   LTP  Rs 403   StopLoss  Rs 397   Target  Rs 440   Return  9 percentThe stock is forming higher high and higher low formation in the daily chart. Stock is trading above 20 and 50 DMA indicating strength in price action. Also positive crossover is indicated in MACD while RSI stands at 70 levels.Price is sustaining above Rs 405 levels with decent volumes pointing out buying interest among the shortterm traders.Hence based on the above technical structure one can initiate a long position at current market price. However on the safer side nearby Rs 410 levels would be a better range to enter for the target price of Rs 440. The stoploss can be kept as Rs 397.Expert  Vidnyan Sawant HOD  Research at GEPL CapitalSun Pharmaceutical Industries  Buy   LTP  Rs 1226   StopLoss  Rs 1170   Target  Rs 1350   Return  10 percentSun Pharma s stock has recently surged to its alltime high surpassing the previous peak of Rs 1200 in April 2015.Following a 15week consolidation period from July to November 2023 marked by a rectangle pattern the stock has broken out of this range signaling the end of the consolidation phase and indicating a continuation of the prior uptrend.During the consolidation the stock found consistent support around the 12week exponential moving average (EMA) which played a crucial role as a dynamic support level for the prices.Additionally the relative strength index (RSI) is noteworthy quoting above the 60 mark on higher time frames. This reflects the presence of positive momentum in the stock.Moving forward we expect the prices to ascend further towards Rs 1350 mark. It is advised to place the stoploss at Rs 1170 strictly based on the closing basis.HCL Technologies  Buy   LTP  Rs 1340.90   StopLoss  Rs 1290   Target  Rs 1475   Return  10 percentThe stock is currently experiencing a robust uptrend reaching an alltime high. The absence of lower lows and lower highs underscores the stock s healthy trend.After a breakout the stock retested the neckline of a rounding pattern signifying a continuation of the upward trajectory and the initiation of an upward trend.On the weekly charts prices have consistently adhered to shortterm averages affirming the prevailing uptrend. Additionally the RSI on both weekly and daily charts is above the 60 mark indicating the presence of positive momentum in the stock.Looking ahead we anticipate further upward movement in prices targeting Rs 1475 levels. It is recommended to set a stoploss at Rs 1290 based on closing values.Hero MotoCorp  Buy   LTP  Rs 3819   StopLoss  Rs 3630   Target  Rs 4284   Return  12 percentThe stock under consideration is currently demonstrating a robust upward trend characterized by a pattern of higher highs and higher lows. Notably the stock is trading at its alltime highs indicating a strong buying interest and an optimistic market sentiment.Furthermore key breakout points in August 2017 and February 2021 are significant milestones in the stock s trajectory. The fact that the current week s trading surpasses the high of the breakout candle provides confirmation of the continued upward momentum.The stock is trading above its 200week exponential moving average (EMA) a longterm trend indicator. This coupled with supportive trading volumes reinforces the positive trend.In addition to the stock s individual performance its relative strength against the Nifty as depicted in the ratio chart is noteworthy. The breakout from a downwardsloping trend line since August 2017 indicates that the stock is not only performing well in absolute terms but is also outpacing the broader market.Looking ahead we anticipate further upward movement in prices targeting Rs 4284 levels. It is recommended to set a stoploss at Rs 3630 based on closing values.",
    "Following a 6 percent correction from its alltime high in 2022 the index experienced a notable swing low at 18837 closely aligned with the polarity level observed in December 2022. From this point the index resumed its upward trajectory consistently forming higher highs and higher lows.After a period of steady rise the index entered a brief consolidation phase remaining within a range for a week. This phase concluded with a breakout at 19850 propelling the index s upward movement. Notably this surge was fuelled by shortcovering enabling the index to surpass the psychologically significant level of 20000.Approaching its alltime highs the index s upside potential could extend to 20200 followed by 20400.On the downside key support levels are anticipated at 19900 and 19850. This analysis suggests a positive outlook for the index with the potential for further gains in the near term.Here are three buy calls for short term Sun Pharmaceutical Industries  Buy   LTP  Rs 1226   StopLoss  Rs 1170   Target  Rs 1350   Return  10 percentSun Pharma s stock has recently surged to its alltime high surpassing the previous peak of Rs 1200 in April 2015.Following a 15week consolidation period from July to November 2023 marked by a rectangle pattern the stock has broken out of this range signaling the end of the consolidation phase and indicating a continuation of the prior uptrend.During the consolidation the stock found consistent support around the 12week exponential moving average (EMA) which played a crucial role as a dynamic support level for the prices.Additionally the relative strength index (RSI) is noteworthy quoting above the 60 mark on higher time frames. This reflects the presence of positive momentum in the stock.Moving forward we anticipate the prices to ascend further towards Rs 1350 mark. It is advised to place the stoploss at Rs 1170 strictly based on the closing basis.HCL Technologies  Buy   LTP  Rs 1340.90   StopLoss  Rs 1290   Target  Rs 1475   Return  10 percentThe stock is currently experiencing a robust uptrend reaching an alltime high. The absence of lower lows and lower highs underscores the stock s healthy trend.After a breakout the stock retested the neckline of a rounding pattern signifying a continuation of the upward trajectory and the initiation of an upward trend.On the weekly charts prices have consistently adhered to shortterm averages affirming the prevailing uptrend. Additionally the RSI on both weekly and daily charts is above the 60 mark indicating the presence of positive momentum in the stock.Looking ahead we anticipate further upward movement in prices targeting Rs 1475 levels. It is recommended to set a stoploss at Rs 1290 based on closing values.Hero MotoCorp  Buy   LTP  Rs 3819   StopLoss  Rs 3630   Target  Rs 4284   Return  12 percentThe stock under consideration is currently demonstrating a robust upward trend characterized by a pattern of higher highs and higher lows. Notably the stock is trading at its alltime highs indicating a strong buying interest and an optimistic market sentiment.Furthermore key breakout points in August 2017 and February 2021 are significant milestones in the stock s trajectory. The fact that the current week s trading surpasses the high of the breakout candle provides confirmation of the continued upward momentum.The stock is trading above its 200week exponential moving average (EMA) a longterm trend indicator. This coupled with supportive trading volumes reinforces the positive trend.In addition to the stock s individual performance its relative strength against the Nifty as depicted in the ratio chart is noteworthy. The breakout from a downwardsloping trend line since August 2017 indicates that the stock is not only performing well in absolute terms but is also outpacing the broader market.Looking ahead we anticipate further upward movement in prices targeting Rs 4284 levels. It is recommended to set a stoploss at Rs 3630 based on closing values.",
    "KR Choksey s research report on HCL TechnologiesDuring the quarter HCL Tech reported revenue of INR 266720 mn registering a growth of 8.05  on a YoY basis from INR 246860 mn and on a QoQ basis it grew by 1.43  from INR 262960 mn. The EBIT for Q2FY24 stood at INR 49340 registering a growth of 11.45  on a YoY basis and on a sequential basis it grew by 10.63 . The operating margin stood at 18.50  which showed an improvement by 154 bps on a QoQ basis and 57 bps on a YoY basis. Net profit for the quarter stood at INR 38330 mn registering a growth of 9.92  on a YoY basis and 8.55  on a sequential basis. The PAT margin stood at 14.37  which expanded by 94 bps sequentially and 25 bps on a YoY basis. The EPS for the quarter stood at INR 14.13 as against INR 12.88 YoY and 13.03 QoQ.OutlookThe company is currently trading at a PE multiple of 17.5. We have revised the target price to INR 1374 from the previous target price of INR 1206  with a P E multiple of 19x to the FY25 estimated EPS of INR 72.3 an upside of 8.3  over the CMP. Accordingly we revised our rating to  ACCUMULATE  to the stock.For all recommendations report click here"
]