[
    "The market trend remained positive despite being a rangebound session with the benchmark indices witnessing a fresh alltime closing high on June 20. About 1505 shares advanced and 807 shares declined on the NSE. The consolidation is expected to continue in the Nifty 50 with key resistance at 23650 and support at 23400. Here are some trading ideas for the near term Amol Athawale VPTechnical Research at Kotak SecuritiesHindustan Unilever   CMP  Rs 2482After the remarkable up move of the last couple of weeks HUL witnessed profit booking from the higher levels. However closing near the important retracement zone and shortterm moving average suggests a bullish continuation in chart structure. Therefore the counter is likely to resume its uptrend in the coming horizon.Strategy  BuyTarget  Rs 2650StopLoss  Rs 2390Bandhan Bank   CMP  Rs 208After the shortterm correction from the higher levels the downward momentum stopped and Bandhan Bank consolidated for a few weeks. On daily charts the counter has formed a Rounding Bottom chart formation and reversed its trend from its important demand zone. The structure suggests a revival of the uptrend from the current levels in the near future.Strategy  BuyTarget  Rs 222StopLoss  Rs 200Bata India   CMP  Rs 1467On the daily scale after the recent up move Bata witnessed a gradual decline. However it has given a breakout from its Flag chart pattern along with rising volume activity. The stock is representing a bullish continuation chart structure which indicates that a new leg of the up move is likely to resume from the current levels in the coming horizon.Strategy  BuyTarget  Rs 1570StopLoss  Rs 1415Mandar Bhojane Equity Research Analyst at Choice BrokingTata Chemicals   CMP  Rs 1154Tata Chemicals is ready for a breakout on the daily chart with a significant increase in trading volume indicating a potential breakout. If the price manages to close above Rs 1160 levels it may have the potential to reach a shortterm target of Rs 1320. On the other hand the immediate support level is located at Rs 1100. These levels can be considered as opportunities to buy on dips.The Relative Strength Index (RSI) currently stands at 62.3 and is trending upward indicating increasing buying momentum. To prudently manage risk it is advisable to set a stoploss at Rs 1080. This precaution will help protect your investment in case of an unexpected market reversal. In summary considering the technical analysis and the current market conditions Tata Chemicals appears to present an appealing buying opportunity for those aiming for a Rs 1320 price target provided that appropriate risk management measures are in place.Strategy  BuyTarget  Rs 1320StopLoss  Rs 1080Grasim Industries   CMP  Rs 2498.8Grasim has recently seen a breakout on the daily chart with a significant increase in trading volume indicating a potential breakout. If the price manages to close above Rs 2510 levels it may have the potential to reach shortterm targets of Rs 2660. On the other hand immediate support levels are located at Rs 2400. These levels can be considered as opportunities to buy on dips.The RSI currently stands at 61.6 and is trending upward indicating increasing buying momentum. To prudently manage risk it is advisable to set a stoploss at Rs 2315. This precaution will help protect your investment in case of an unexpected market reversal.Strategy  BuyTarget  Rs 2660StopLoss  Rs 2315New India Assurance Company   CMP  Rs 251.1New India Assurance Company has recently witnessed a breakout on the daily chart with a significant increase in trading volume indicating a potential breakout. If the price manages to close above Rs 254 level it may have the potential to reach a shortterm target of Rs 300. On the other hand immediate support levels are located at Rs 235. These levels can be considered as opportunities to buy on dips.The RSI currently stands at 60 and is trending upward indicating increasing buying momentum. It is advisable to set a stoploss at Rs 230.Strategy  BuyTarget  Rs 300StopLoss  Rs 230Virat Jagad Technical Research Analyst at Bonanza PortfolioMahindra Holidays   Resorts India   CMP  Rs 474.85On a daily timeframe Mahindra Holidays has given a breakout of a Symmetric Triangle pattern on the positive side indicating bulls control over the stock. The fast (21day) EMA has crossed the slow (50day) EMA. A positive trend with price trading above both the EMA indicates strength on the upside. The momentum indicator RSI is hovering towards the overbought zone showing strong buying interest in the script.Strategy  BuyTarget  Rs 555StopLoss  Rs 450Mahanagar Gas   CMP  Rs 1506.7On the daily chart Mahanagar Gas has established a strong hurdle zone between Rs 1480 and Rs 1495 where buyers have been actively accumulating shares pushing the stock above the hurdle mark. The recent positivity confirms the dominance of buyers resulting in the breakout of the Double Bottom (Adam   Eve) formation suggesting the potential for further upward movement. Additionally the stock is currently trading above significant moving averages supporting the bullish momentum and the RSI is trending upwards reinforcing the positive outlook for the stock.Strategy  BuyTarget  Rs 1645StopLoss  Rs 1436Clean Science   Technology   CMP  Rs 1443.6Clean Science   Technology has given a breakout of a Rectangle Pattern on a daily timeframe on the upside indicating an uptrend. The burst in volume during the last session suggests increased buying interest at the current price levels which further reinforces the positive outlook for the security. The price is trading above major EMAs indicating an uptrend. Additionally the momentum indicator RSI after cooling off has started moving in the northern direction confirming the strength of the current trend and implying the potential for further price appreciation.Strategy  BuyTarget  Rs 1600StopLoss  Rs 1380Vedanta   CMP  Rs 470On a daily timeframe Vedanta had formed a Flag and Pole pattern. In the current formation the stock has formed a bullish price action indicating buyers are keen to buy shares and are expecting the stock to move higher. The price is trading above major EMAs which indicates a positive trend. On the momentum indicator MACD the MACD line has crossed the signal line confirming the positivity in the stockStrategy  BuyTarget  Rs 530StopLoss  Rs 440Chandan Taparia Senior Vice President   AnalystDerivatives at Motilal Oswal Financial ServicesBharat Forge   CMP  Rs 1791.4Bharat Forge has given a narrow range breakout on the daily scale and formed a strong bullish candle on the daily chart.Strategy  BuyTarget  Rs 1920StopLoss  Rs 1740Federal Bank   CMP  Rs 178.88Federal Bank has given a range breakout on the weekly chart and is holding well above the same. It has given the highest daily close ever and the base is gradually shifting higher.Strategy  BuyTarget  Rs 193StopLoss  Rs 173Indian Hotels   CMP  Rs 638.4Indian Hotels has given a consolidation breakout on the weekly scale and formed a bullish Marubozu candle on the daily chart implying complete dominance by bulls.Strategy  BuyTarget  Rs 680StopLoss  Rs 618",
    "Shares of Whirlpool of India surged up to 1.8 percent to touch fresh 52week high of Rs 1827 apeice on June 13 after it announced a new marketing alliance for Surf Excel in partnership with Hindustan Unilever.So far this year shares of Whirlpool surged over 32 percent as against 7 percent rise in the benchmark Nifty 50 index. Earlier Whirlpool hit fresh 52week high of Rs 1836 apiece on June 13 2024.Catch all the market action on our LIVE blogWhirlpool said that the two brands have collaborated to deliver superior cleaning performance and convenience to households.  The integration of innovative technologies from both brands will help in delivering superior fabric care improving the daily laundry process and resulting in an enhanced customer experience  they added in an exchange filing.In a fresh campaign initiative the collaboration also exhibited advanced technology of Whirlpool Top Load Washing Machines alongside the effective cleaning prowess of Surf Excel Matic Liquid Detergent offering consumers a streamlined and efficient cleaning experience.ALSO READ  Whirlpool India Q4 results  Net profit rises 24  to Rs 78 crore By bringing together advanced technologies we aim to offer a superior solution for fabric care needs while also raising awareness about the importance of proper laundry practices. Our goal is to provide convenience and innovation to households across India making laundry routines easier and more effective than ever before  said Srinandan Sundaram executive director home care at Unilever.In the Marchended quarter Whirlpool clocked 24 percent onyear rise in consolidated net profit to Rs 79.5 crore while revenue from operations rose 3.7 percent to Rs 1734 crore.However the company s total expenses increased 2.1 percent YoY to Rs 1660 crore in Q4FY24.",
    "FMCG stocks traded with gains on June 4 as early trends showed that the incumbent government might not fare as well as the exit polls predicted.At 10 am the frontline indices traded with sharp cuts with Nifty 50 down more than 450 points or over two percent to 22800. On the other hand the Nifty FMCG index was higher by around 0.3 percent.Hindustan Unilever and Britannia Industries were the top gainers on the Nifty 50 index rising over two percent respectively.Excluding Nifty Pharma Nifty Healthcare and Nifty FMCG the remaining nine sectoral indices were in the red. Financial services and oil and gas stocks which led the Nifty 50 higher on June 3 dragged the index down today. If BJP doesn t get a majority on its own there will be disappointment and this is getting reflected in the market. Also it is possible that Modi 3.0 may not be as reformoriented as the market expected and may turn more welfareoriented. This is getting reflected in the strength in FMCG stocks  said V K Vijayakumar Chief Investment Strategist Geojit Financial Services.Follow our market blog to catch all the live updatesIn a report foreign brokerage Bernstein had suggested that consumption stocks might see a more favourable outcome if the opposition stocks gained favour at least in the nearterm.In the case that the NDA won over 340 seats the brokerage said that there would be a gradual recovery in rural consumption and it would likely stay weak near term. However in longterm macro fundamentals will take over leading to an exponential rise with manufacturing growth added Bernstein.In the case that the NDA government does not perform favourably there will be a quicker recovery in consumption.  Rural consumption will pick up with more money in the hands of the poor  said the brokerage. UBI schemes employment for 3 million and tax breaks will aid PFCE growth.",
    "The market participants are expected to remain cautious on the Nifty 50 given the rising volatility index from 10 to 17 levels in just nine trading sessions. Hence unless and until the volatility cools down the rangebound trade with negative bias is likely to continue with support at 22150 which coincides with the lower end of rising channel but if the volatility stabilises or falls from current levels then possibility of shortcoveringled uptrend can take the Nifty towards 2250022600 levels experts said.On May 7 the Nifty 50 dropped 140 points to 22303 and formed long bearish candlestick pattern on the daily charts while the BSE Sensex was down 384 points at 73512.The broader markets hit quite hard on Tuesday as the Nifty Midcap 100 and Smallcap 100 indices fell nearly 2 percent each on weak breadth.Stocks that bucked the trend and supported by bulls included Hindustan Unilever Dabur India and TCS. Hindustan Unilever was the biggest gainer in the Nifty 50 rising 5.5 percent to Rs 2379 and formed robust bullish candlestick pattern on the daily charts. The stock in fact went closer to its 200day EMA (exponential moving average) after climbing above 50 and 100day EMAs in a single session with multifold jump in volumes over previous day.Dabur India also acted in a similar fashion up 5.2 percent at Rs 558.5 and formed strong bullish candlestick pattern on the daily timeframe with significantly higher volumes. Now the stock traded well above all key moving averages which is a positive sign.TCS maintained higher highs higher lows formation and rallied for second consecutive session on Tuesday. The stock rose 1.5 percent to Rs 3979 and formed bullish candlestick pattern on the daily charts while it traded above all key moving averages now.Here s what Riyank Arora of Mehta Equities recommends investors should do with these stocks when the market resumes trading today Hindustan UnileverThe stock has given a strong breakout above its 21day EMA (exponential moving average) and 50day SMA (simple moving average) managing to give a bullish closing above its recent swing high resistance mark of Rs 2306.75 as well.With the RSI (relative strength index 14) being around 70 and seeing a good uptick the overall momentum looks strong and the stock should likely head higher towards Rs 2600 and above. We suggest investors to hold their positions with a trailing stoploss of Rs 2250 on Hindustan Unilever.Tata Consultancy Services (TCS)The stock has touched an important resistance mark of Rs 3980.00 on the daily charts. With the price hovering around its 21day EMA and 50day SMA this level should serve as a crucial resistance mark for the stock.Any move above Rs 4000 should push the rally towards Rs 4100 and Rs 4150 on TCS. We advise investors to hold on to their positions in TCS with a trailing stoploss of Rs 3900.Dabur IndiaThe stock has touched its upper end of triangle consolidation pattern on its daily time frame charts. With the RSI (14) being around 60 and witnessing a good uptick it appears that the stock should likely pick up momentum in the upcoming few trading sessions.Any breakout above Rs 567.50 should be considered as a strong bullish sign for the stock and we can expect the rally to push further towards Rs 600 as FMCG stocks continue to outperform. We suggest investors to hold on to their positions with a trailing stoploss of Rs 540 on Dabur.",
    "The leading performers on the frontline Nifty 50 index on May 7 were the FMCG giants  Hindustan Unilever Britannia Industries Nestle India ITC and Tata Consumer. These companies saw impressive gains of up to 5 percent on Tuesday.As the March quarter earning results trickle in experts have noted that the commentary surrounding the FMCG sector has mostly been positive. Despite largely unchanged demand trends from the previous quarter volumes have seen a minor uptick with rural recovery on the horizon.At 11 15 am the top gainer on the Nifty 50 was Hindustan Unilever and its shares were quoting Rs 2360.9 apiece higher by 4.6 percent.In comparison the Nifty 50 tumbled 0.75 percent to 22270 levels. Even  as the Nifty traded in the red the FMCG companies  shares were trading in the green.While all sectoral indices echoed the weak market sentiment the Nifty FMCG index jumped 2.5 percent with Marico leading the gains in the index.Follow our market blog to catch all the live updatesFMCG companies have taken a series of price cuts over FY24 in an attempt to boost volume growth. Motilal Oswal said  The impact of the price cuts will settle down in H1FY25 for most of the commoditysensitive categories and the second half of FY25 may see price hikes. In a report Nuvama Institutional Equities noted that following the end of the current quarter every consumer staples firm will see acceleration in volumes growth as the rural sector is poised to grow.The ongoing Lok Sabha elections improving rainfall and rising agricultural wages are key triggers for a sustained demand recovery in tier4 townsDuring late April FIIs sold Rs 3563 crore in the FMCG sector. Analysts attribute this to weak earnings as the FMCG witnessed subdued sales and flat profitability due to high expenses.",
    "Hindustan Unilever Ltd Chief Financial Officer Ritesh Tiwari struck an optimistic chord on rural consumption projecting high singledigit volume growth rates. Tiwari cited expectations of a favourable monsoon coupled with an improving macroeconomic environment as factors that would spur rural demand to outpace the industry average.In an interview Tiwari said the company s nearterm focus is on driving volume growth enhancing gross margins and maintaining Ebitda margins. Tiwari spoke about how the company is leveraging its premium products to drive growth while also looking to deepen its market share in large product categories.He also touched upon HUL s capital allocation strategy and its focus on prioritising high dividend payout for its shareholders. Edited excerpts Q  Can you provide an overview of the latest Q4 results and the strategy moving forward A  Our strategy moving forward revolves around prioritising volume growth amid the current landscape. Given the current state of commodities we anticipate minimal price growth in the coming quarters. Our approach therefore involves three key priorities  first driving volume growth  second enhancing gross margins to fuel further investment  and third ensuring competitiveness in the market by expanding market share.Q  Can you outline your capital allocation strategy considering your surplus and dividend commitments A  Absolutely. Our capital allocation strategy encompasses three key areas. Firstly we prioritise funding growth within our business. This means investing in initiatives that enhance our capabilities such as market research and digital advancements. For instance we ve recently allocated funds from a 350 basis points gross margin improvement towards business investments.Secondly we believe in rewarding our shareholders through high dividends reflecting our low capital intensity. We consistently maintain a dividend payout ratio of over 90 percent with recent growth of 8 percent yearonyear in dividends.Thirdly we actively explore bolton acquisition opportunities to expand our portfolio where there are gaps. Whether through brand extensions bringing in brands from Unilever s portfolio launching our own brands or pursuing acquisitions like our majority stake in OZiva and minority stake in Wellbeing Nutrition. This approach ensures we re continually building our portfolio for the future.Q  The stock performance seems to have plateaued despite promising business prospects. What do you attribute this stagnation to A  When assessing stock performance it s essential to consider several fundamental principles that guide investor sentiment. Firstly consistent growth is paramount. Investors value companies that demonstrate sustained growth over time. Secondly competitiveness plays a significant role. Growing ahead of the market indicates strength and resilience. As for margins while our current focus is on top line growth we aim to maintain it at the current range of 23 to 24 percent in the near term whilst making modest improvements in midlong term.In terms of our recent performance we ve consistently added substantial turnover to our top line showcasing the scale benefits of our wideranging portfolio spanning multiple FMCG categories. Despite challenges in certain quarters such as the impact of external market dynamics we ve remained steadfast in our commitment to growth and profitability.Furthermore our continuous focus on capital discipline and competitiveness in the market has been appreciated. Our diverse portfolio coupled with our talented workforce and thought leadership positions us strongly for the future. We ve always been at the forefront of innovation whether it s introducing new product formats or pioneering business models like our B2B initiatives with retailers.Q  Has the idea of a share buyback crossed your mind as part of the capital allocation strategy A  The board continually assesses various options including share buybacks. With a strong cash position we maintain a robust financial standing. Our capital allocation approach prioritises high dividend payouts ensuring returns to our shareholders. Additionally we remain open to strategic acquisitions that align with our business objectives. When evaluating the potential for share buybacks we consider factors such as market conditions shareholder value and available cash reserves. Ultimately our decisions are guided by maximising longterm value for our shareholders while maintaining financial prudence and flexibility.Q  When you talk about volume growth do you see overall demand growth complementing that or will it be through winning more market share A  It will include both. When analysing our latest quarter results we see distinct trends across our portfolio. Approximately half of our portfolio is experiencing growth in mid to high singledigit volumes which is promising. However a quarter of our portfolio is holding steady in terms of volumes while another quarter is seeing a decline.Our coffee segment has been affected by significant inflation in commodity prices resulting in decreased volumes. Similarly our skin cleansing segment has faced challenges due to pricing competitiveness though we re addressing these issues. Additionally our tea segment has been grappling with the market downgrading to loose tea due to widening price gaps between premium and lowertier teas.Moving forward our strategy is focused on agility and responsiveness to consumer behaviour and market dynamics. Rather than wait for macroeconomic shifts we re aligning our investments with areas of growth and consumer demand. For instance our premium beauty business is experiencing doubledigit growth while highpriority segments such as face cleansers serums and skincare are showing promising growth trajectories. We re also leveraging the ecommerce channel which is witnessing robust growth rates particularly in urban areas.Our approach entails doubling down on investments in these growth areas while remaining attentive to broader economic indicators such as GDP growth and monsoon forecasts. We anticipate that with continued investment and market recovery particularly in the second half of the financial year we ll see improvements in overall market conditions.Q  How do you plan to drive volume growth in the near to medium term A  Firstly we re committed to market development initiatives to expand the reach and consumption of existing large categories. For instance in highly penetrated categories like soap bars and laundry there s significant untapped potential to drive further growth by venturing into incremental premium consumer segments and other need spaces. By focusing on market development we aim to create more users and drive consumption particularly in premium segments.Secondly we re prioritising the expansion of our premium portfolio. Currently approximately onethird of our business sits in the premium segment which is experiencing aboveaverage growth. We re doubling down on this segment by investing in innovation and marketing to further drive growth.Additionally we re continuously seeding growth in emerging formats and demand spaces. In the beauty sector we re witnessing disproportionate growth in segments like skincare and haircare. Despite competition from challenger brands we remain confident in our marketleading positions and focus on expanding our portfolio to capture market value. By extending our existing brands into new spaces and launching new brands where needed we re poised to capitalise on the underpenetrated market and drive growth.Q  What growth rates do you anticipate for rural markets in the near future and how do you expect this growth to unfold A  When considering rural growth rates it s important to contextualise the numbers. Currently we re observing headline growth rates in the double digits around 12 percent. However this growth is measured against a base of a declining market from the same period last year. Looking at a twoyear compound annual growth rate (CAGR) we re beginning to see rural growth rates trending moderately positive indicating a recovery from the previous decline.I anticipate that rural markets will continue to strengthen with high singledigit growth rates in volumes becoming more prevalent. This recovery is significant as it signifies a transition from a declining base to a growing one. With factors like improved monsoon patterns and favourable macroeconomic conditions I foresee rural growth rates outpacing average FMCG growth rates in the coming years. As rural areas have historically been critical drivers of demand this upward trajectory is promising for the overall FMCG sector.Q  Looking ahead to the next three to four years do you see growth primarily originating from your premium portfolio A  Firstly we expect continued growth through market development initiatives in existing large categories. Categories like soap bars and liquid soaps have the potential to drive further growth. Similarly products like Horlicks cater to the prevalent dietary patterns in India offering functional nutrition solutions to address micronutrient deficiencies. By focusing on improving market penetration and consumption in such categories we anticipate sustained growth.Secondly we see opportunities for growth in premium segments. As consumer spending trends evolve particularly among urban consumers there s a growing demand for premium products across various categories. By expanding our portfolio into premium spaces and catering to the evolving needs of consumers we aim to capture this segment s growth potential. This includes areas like skincare where multistep routines are becoming increasingly popular among certain consumer segments.Additionally macroeconomic factors such as improvements in Indian GDP and overall consumption patterns are expected to contribute to growth. As the macroeconomic landscape strengthens it creates a conducive environment for FMCG growth providing further opportunities for expansion.Q  How do you envision the evolution of your distribution channels A  The landscape of distribution channels in India is dynamic with each channel playing a crucial role in reaching consumers effectively. Currently general trade (GT) stands as the dominant channel comprising around 6070 percent of our business. We anticipate GT to maintain its prominence for the foreseeable future with its significance likely to endure for the next few decades. Therefore investing in GT and ensuring its future readiness is a key priority for us.Additionally we observe a growing share of sales coming from modern trade (MT) and ecommerce channels. Modern trade represented by largeformat organised retail contributes approximately 20 percent while ecommerce accounts for 7 percent of our sales. While these channels are growing we don t foresee GT diminishing rapidly. Instead we expect it to be a gradual shift.Ecommerce in particular is witnessing significant segmentation and development. From traditional players like Amazon and Flipkart to emerging models such as quick commerce the channel is diversifying rapidly. Quick commerce offers unparalleled convenience allowing consumers to receive products within minutes.Our approach to ecommerce encompasses both B2B and B2C models. B2B transactions involve supplying products to kirana stores through digital platforms while B2C transactions cater directly to endconsumers. We ve observed substantial growth in ecommerce sales in recent years with the channel s share increasing from less than 5 percent to 7 percent.While we anticipate further growth in ecommerce we remain committed to nurturing our distribution network especially GT. Distributors play a pivotal role in ensuring lastmile connectivity and will continue to be a cornerstone of our distribution strategy. As such we re dedicated to investing in our distributor network to strengthen our presence across channels and adapt to evolving consumer preferences effectively.Q  On the margins front you spoke of maintaining the current EBITDA margins despite factors like the discontinuation of the GSK distribution business. How confident are you in sustaining these margin levels A  The decision to discontinue the GSK distribution business does have a 5060 basis points impact on our margins. However our strategy revolves around several initiatives to offset this impact and ensure margin stability.Our primary approach is to enhance gross margins through improvements in our supply chain raw material sourcing and pricing strategies. Over the past year we ve seen a significant improvement in gross margins reflecting our commitment to this strategy. Additionally we operate with a healthy level of net profit margin allowing us sufficient room for investment in various areas of the business.One of our key programmes Symphony focuses on generating annual savings of 78 percent across all lines of our profit and loss statement. These savings are then reinvested into the business to drive innovation enhance capabilities and improve market positioning.Q  Despite India s inflation being relatively moderate compared to other countries your recent commentary suggests that consumers have felt its impact. Can you elaborate on this A  Absolutely. While India s inflation may not seem alarmingly high on a global scale the cumulative effect over the last few years has significantly impacted consumers particularly in the FMCG sector. Over the past three years the cumulative inflation in the FMCG market equals that of the previous five years. This inflationary pressure has compelled the FMCG industry including us to adjust prices to account for rising costs of commodities like crude oil and palm oil among others.As a result consumers have experienced a decrease in their disposable income which has affected overall demand. While we re beginning to see signs of deflation prices are still higher compared to previous years. This adjustment period has influenced our market growth which while promising in high single digits is still below expectations given India s low per capita consumption.As GDP improves and consumer confidence strengthens we anticipate a more robust market environment. With efforts to drive premiumisation and address issues of low consumption and penetration we remain optimistic about the potential for accelerated growth in the FMCG sector surpassing current high singledigit levels.        ",
    "Prabhudas Lilladher s research report on Hindustan UnileverWe cut FY25 26EPS by 1.6 1.3  factoring in 1) slower than expected recovery in volumes in rural India 2) price cuts in personal wash and skin care to improve consumer price value equation 3) sustained competitive intensity across mass segment in HPC segment resulting in market share loss and 4) higher investments in A P and innovations to sustain LT growth. While HC F R and   Beauty segment are doing well across channels price correction in soaps and skin should provide growth push from 2H25 in our view. We believe normal monsoon can provide flip to rural demand although margin expansion from current levels will be very moderate (50bps over FY2426).OutlookLongterm growth levers led by higher growth in Ecom and categories of future (liquids Green Tea premium skincare etc.) and premium segments remains intact we estimate 8  PAT CAGR over FY2426 and assign DCF based target price of Rs2543 (Rs2600 earlier). Risk reward looks favourable post little returns in last 4 years  however significant rerating looks unlikely given valuations at 44.6xFY26 and market momentum in favour of cyclicals. We upgrade the stock to Accumulate (Hold earlier) for moderate returns over next 1215 months.For all recommendations report click here",
    "Religare Retail Research report on Hindustan UnileverHUL s Q4FY24 revenue was flat YoY while it witnessed a degrowth of 2.3  QoQ to Rs 15210cr. Underlying volume growth came in at 2  for the quarter while declining price impacted topline growth. Amongst segments beauty   personal care (33.7  of revenue) performance remain muted with degrowth of 2.5  YoY   11.4  QoQ to Rs 5125cr while positive growth was seen in home care segment (37.5  of revenue) which grew by 1.3  YoY and 4.9  QoQ to Rs 5709 along with food   refreshment segment (25.7  of revenue) which grew by 3.1  YoY and 4.7  QoQ to Rs 3910cr.OutlookOn the financial front we expect revenue EBITDA PAT to improve by 11.2  12.6  13.2  CAGR over FY2426E. So from a mid to long term perspective we remain optimistic on the growth prospect of the company and thus continue to maintain our Buy rating however with healthy correction in stock price and slow pickup for near term we have revised the target price downwards to Rs 2802.For all recommendations report click here",
    "Sharekhan s research report on Hindustan UnileverHUL s Q4FY2024 was yet another muted quarter with flat revenues and adjusted PAT declining by 3  yoy with volume growth remaining at 2 .About 50  of product portfolio registered midhigh singledigit volume growth in Q4. Recovery in rural demand will help overall volume growth to improve in the quarters ahead. HUL has corrected pricevalue equation and improved formulation in the mass and popular segment and intensified innovation in premium segment to improve volumes in the skin cleansing category. Recovery in soaps would be gradual.OutlookStock has corrected by 18  from its 52week high and is trading at 49x and 43x its FY2025E and FY2026E earnings. We retain a Buy on the stock with a revised PT of Rs. 2725.For all recommendations report click here",
    "Hindustan Unilever s fourthquarter financial results fell short of expectations even addition of premium products pushed revenue growth during the quarter. Margins shrank and net profit fell more than expected as volume growth slowed down on lower demand and rising competition.Brokerages slashed the target prices on the Hindustan Unilever stock as the outlook for the FMCG giant remained uncertain and growth prospects remained lacklustre.The Surf Excelmaker reported 6 percent onyear fall in standalone net profit at Rs 2406 crore in the fiscal fourth quarter. Hindustan Unilever s sales rose only marginally to Rs 14693 crore in the fourth quarter.Analysts projected a profit of Rs 2435 crore on a revenue of Rs 14913 crore according to the average of nine brokerage estimates.Volume growth disappointsThe consumer goods company s sales volume grew only 2 percent short of the Street forecast of 3 percent. The growth was led by midsingledigit growth in homecare while beauty and personal care (BPC) and foods and refreshments (F R) clocked flat volume.Also Read   HUL s personal care business sees 10  drop in sales in Q4The overall beauty and personal care business contributed 35 percent of the FMCG major s overall revenue for the March quarter with sales of Rs 5050 crore. While the personal care segment saw a decline in sales the beauty segment saw a 4 percent growth the company said.HUL has gained penetration in around 75 percent of its portfolio with three quarters of the firm s offerings gaining or maintaining the market share.The current thrust on premiumisation which has a 25 percent contribution to the business is largely focused on the laundry and shampoo segments. The premium portfolio saw growth across all categories but its mass portfolio was weak.Motilal Oswal said it expects a gradual recovery in volume growth in FY25. The growth will be driven by own initiatives and gradual improvement in demand. The impact of price cuts will persist in 1HFY25 but the volume print should improve during this phase and the full revenue recovery will be visible in 2HFY25  said the brokerage.The firm s management said that it was hopeful of a gradual recovery in the rural markets which is dependent on the improvement in monsoon scenario. Additionally measures such as price cuts should lead to better growth in the mass segments.Food   refreshment impresses soaps lose foamIn food and refreshments (F R) the functional nutrition drinks saw high singledigit growth as a result of increased penetration and market share gains. Soup and food solutions buoyed the foods growth while ice cream reported doubledigit volumeled growth. Coffee grew in doubledigits led by pricing.International brokerage Goldman Sachs said the deterioration in the soaps business is concerning as its weak performance continued. The recovery in the soap segment could take a few quarters. The fall in the soap business led to the miss in the beauty and personal care segment.EBITDA margin impactedHindustan Unilever s spending on advertisements and promotions (A P) saw a 23 percent onyear rise. In terms of spending as a portion of revenue it was 10.8 percent which is higher by 200 basis points (bps) onyear.Also Read   Hindustan Unilever eyes modest margin improvement on better product mixThe EBITDA margin contracted around 20 basis points onyear to 23.1 percent since there was an impact of 60 bps from the termination of the GSK consignment sales.Hindustan Unilever and GSK Consumer decided to terminate their distribution agreement in 2022. From November 2023 HUL stopped selling GSK Consumer products such as Sensodyne Crocin Otrivin and Eno brands in India.The raw material pricing in key categories remained benign and JM Financial noted that the company will realign its focus to improve the mix and reduce production costs to further grow the gross margin.Should you buy sell or hold HUL stock HSBC raised alarms regarding HUL s outlook as the rise in unorganised regional competition and poor rural demand showed poor growth prospects. The international brokerage maintained its  hold  call with a target price of Rs 2300 per share. With negatives largely known the stock s very low return over the last three years and valuation below historical average could likely provide some support on the downside. Given the tough operating landscape rerating will be contingent on better visibility on volume acceleration and doubledigit earnings growth  JM Financial said.The domestic brokerage had a share price target of Rs 2640 on the counter with a  buy  call.",
    "Motilal Oswal s research report on Hindustan UnileverHindustan Unilever s (HUVR) performance in 4QFY24 was in line with our estimates. Net revenue was up 1  YoY with 2  volume growth. Home care maintained midsingledigit volume growth. Beauty   Personal Care (BPC) and Food   Refreshment (F R) posted flat volume growth YoY. Demand drivers were steady in 2HFY24. Premium portfolio growth across categories was healthy while the mass portfolio remained weak.OutlookThere is no material change in our EPS estimates for FY25 and FY26.   We believe that HUVR s volume growth has bottomed out and expect a gradual volume recovery in FY25. HUVR s wide product basket and presence across price segments should help the company achieve a steady growth recovery. There is scope for a turnaround in part of BPC and F R  we will monitor the execution in these segments under the new CEO. The valuation  45x at FY26E EPS is reasonable given its last fiveyear average P E of 60x on oneyear forward earnings. We reiterate our BUY rating with a TP of INR 2900 based on 55x FY26E EPS.For all recommendations report click here",
    "Net Sales at Rs 15210.00 crore in March 2024 down 0.03  from Rs. 15215.00 crore in March 2023.Quarterly Net Profit at Rs. 2558.00 crore in March 2024 down 1.62  from Rs. 2600.00 crore in March 2023.EBITDA stands at Rs. 3766.00 crore in March 2024 up 0.86  from Rs. 3734.00 crore in March 2023.HUL EPS has decreased to Rs. 10.89 in March 2024 from Rs. 11.06 in March 2023.HUL shares closed at 2260.25 on April 24 2024 (NSE) and has given 8.76  returns over the last 6 months and 9.58  over the last 12 months.",
    "Net Sales at Rs 14857.00 crore in March 2024 down 0.24  from Rs. 14893.00 crore in March 2023.Quarterly Net Profit at Rs. 2406.00 crore in March 2024 down 5.72  from Rs. 2552.00 crore in March 2023.EBITDA stands at Rs. 3655.00 crore in March 2024 up 0.66  from Rs. 3631.00 crore in March 2023.HUL EPS has decreased to Rs. 10.25 in March 2024 from Rs. 10.86 in March 2023.HUL shares closed at 2260.25 on April 24 2024 (NSE) and has given 8.76  returns over the last 6 months and 9.58  over the last 12 months.",
    "Hindustan Unilever has renamed its  health food drinks  category as functional nutritional drinks (FND) a move after the Ministry of Commerce and Industry asked ecommerce websites to remove drinks and beverages from  heathy drinks  category on their platform. We have changed the labels of the category to FND which is a much better way to call it  said Ritesh Tiwari chief financial officer of Hindustan Unilever at the earnings press conference on April 24.Tiwari said that the FND category is underpenetrated and hence there is a big opportunity for growth in the same. Hindustan Unilever will focus on increasing customers increasing usage and giving more benefits for consumers to upgrade in the FND category said Tiwari. He also said that the company is seeing better growth in its premium FND range which caters to Diabetes and women s health.During FY24 Horlicks has seen strong penetration and market share gains said the company in its investor presentation.Also read Urban markets premium products continue to drive FMCG growth even as rural demand seeing recovery  HULThe National Commission for Protection of Child Rights recently had said that there is no definition for  health drinks  under the Food Safety and Standards Act 2006. The Food Safety and Standards Authority of India (FSSAI) earlier this month had asked ecommerce websites not to put dairy cereal or maltbased beverages under the  health drink  or  energy drink  categories.The reason  health drink is not defined in the food laws of India while  energy drinks  are just flavoured waterbased drinks under the laws argued FSSAI. FSSAI said using wrong terms can mislead the consumers and had hence asked the websites to either remove or correct the advertisements.All these developments happened after Mondalez Indiaowned Bournvita caught attention for its high sugar levels a year ago.As per Technavio an industry market research and advisory firm the health beverages market share in India is expected to increase by  3.84 billion from 2021 to 2026 and the market s growth momentum will accelerate at a CAGR of 9.89 percent.",
    "Hindustan Unilever Ltd (HUL) is focusing on six major segments in the beauty category to drive growth  Facial cleansers Weatherproof Bodycare Serums Face Cleansing and the Massitge segment.HUL reported a 10 percent decrease in underlying sales growth for its personal care business mainly due to a decline in its skin cleaning portfolio including brands such as Lux.The overall beauty and personal care business experienced a two percent decline in underlying sales growth with volume remaining flat. This segment contributed 35 percent of HUL s total revenue for the March quarter amounting to Rs 5050 crore.Despite the decline in the personal care segment the beauty segment witnessed a four percent growth according to HUL.The company has separated the beauty and personal care businesses and is aiming for the beauty segment to drive both profit and growth.Masstige is HUL s premium segment comprising of brands like  LOVE beauty AND planet  which is above Rs 100200 mark. The company is witnessing a fair amount of growth in ecommerce. Suncare product is already more than 250 crore business for us. It is still just the beginning  HUL s CEO Rohit Jawa said in a press conference on April 24.The management said that while its beauty product line primarily targets urban consumers it would be inaccurate to suggest that rural markets are neglected. It would be wrong to say that it doesn t cater to some consumers in rural areas like suncare as we have a glow and lovely for suncare as well. The total addressable market will be small for rural  said Jawa.The company said premiumization is more pronounced in urban markets which are typically more resilient especially among middleincome and higherincome households.FMCG inflation has been high overall rural consumers have had to adjust their consumption patterns particularly for discretionary items the company said. However with better monsoons and improvements in the agricultural economy it anticipates growth in rural markets. Products like Surf Excel and Ezee have been significant contributors to its growth particularly in rural areas the company noted. Of course there is growth but the scale of growth would be better when the macros are better for rural. But the urban is more resilient and the premium end more robust.  said Jawa.Hindustan Unilever Ltd on April 24 reported six percent fall in standalone net profit at Rs 2406 crore for the fiscal fourth quarter as against Rs 2552 crore in the yearago period.        ",
    "FMCG major Hindustan Unilever Limited (HUL) which on April 24 reported a 6 percent fall in standalone net profit for the March quarter said that urban markets and premium products are continuing to drive growth for FMCG players even as rural demand has seen gradual recovery. Rural markets have recovered on a quarteronquarter basis continuously for the last four quarters  said Ritesh Tiwari CFO HUL.HUL on April 24 reported six percent fall in standalone net profit at Rs 2406 crore for the fiscal fourth quarter as against Rs 2552 crore in the yearago period.The FMCG giant s sales rose only marginally to Rs 14693 crore in the fourth quarter with revenue in a key segment beauty and personal care declining 2.7 percent.Analysts had projected a profit of Rs 2435 crore on revenue of Rs 14913 crore the number being an average of nine brokerage estimates.Normal monsoonTiwari said that with the monsoon expected to be normal and an improving macrosituation rural recovery should continue going forward.However the rural segment has still not outpaced urban the management noted.Hindustan Unilever s CEO Rohit Jawa added that growth for the FMCG major is being driven by urban markets modern trade and ecommerce and its premium products portfolio.Commenting on the outlook for the FMCG sector the HUL management said that it sees FMCG demand to continue improving gradually.However they expect price growth to be lowsingle digit negative in the near term if commodity prices remain where they are.The management said that it is focused on driving what it termed as competitive volume led growth and is stepping up investments behind its brands and longterm strategic priorities.HUL announced a final dividend of Rs 24 per share for FY24 on equity shares of face value of Re 1. The company had earlier paid an interim dividend of Rs 18 per share on November 16 2023. The total dividend for FY24 amounts to Rs 42 per equity share of face value of Re 1 each.On April 24 HUL s shares on BSE closed trading marginally lower at Rs 2260.05 apiece.HUL clawing back market share in detergent and skin cleansingThe HUL management said that its market share in the detergent bar and the mass end of the skin cleansing segment is rebounding after a period of decline due to corrective pricing strategies.The company saw the most significant market share reduction in these two categories over the past two years.The management said that during times of relatively high inflation commodity scarcity and supply chain constraints larger players tend to benefit while smaller ones often exit the market. Conversely during periods of deflation the situation reverses with some market share returning to smaller players.In the previous earnings call Jawa had said in the quarter ended 31 December 2023  the trend of local players reentering the market has largely subsided. Following a period of commodity inflation relief the fastmoving consumer goods company encountered competition from smaller regional competitors particularly notable in the tea sector where consumers were opting for lowerpriced alternatives.The company has still been able to hold onto their market share.  If you look at our performance over the last two years which includes the inflation and deflation cycle we have added 200 basis points of market share which we are broadly holding onto.  said Jawa at the earnings conference on April 24.  There is some erosion but only slight.  he added.Tiwari added that prices of top three commodities for the company crude oil palm oil and tea are in the rangebound position and benign currently and will not affect volume growth in the coming quarters.Rising A P spendsMore of the company s advertising spends are currently focused on digital media said Jawa. HUL is focusing more on targeted digital advertising like social media and influencer media. He also said spends on traditional media advertising like television is reducing while digital advertising spends are increasing as a proportion of total Advertising   Promotion (A P) spends.A P spends for HUL increased by 200 basis points YoY during the JanuarytoMarch quarter. The increase in A P spends was led by a 60 percent increase in digital spends said the company said in its investor presentation.        ",
    "Hindustan Unilever Ltd on April 24 reported 6  fall in standalone net profit at Rs 2406 crore for the fiscal fourth quarter as against Rs 2552 crore in the yearago period.Hindustan Unilever s sales rose only marginally to Rs 14693 crore in the fourth quarter with revenue in a key segment beauty and personal care declining 2.7 . HUL announced final dividend of Rs 24 per share for FY24 on equity shares of face value of Re 1. The company had earlier paid an interim dividend of Rs 18 per share on November 16 2023. The total dividend for FY24 amounts to Rs 42 per equity share of face value of Re 1 each.Analysts projected a profit of Rs 2435 crore on revenue of Rs 14913 crore according to the average of nine brokerage estimates.On April 24 HUL s shares on BSE closed trading marginally lower at Rs 2260.05 apiece.Rohit Jawa CEO and Managing Director said   In FY24 we delivered a resilient performance with 3  USG and crossed Rs 10000 crores Net Profit mark. We remain focused on driving operational excellence and have continued to build back our gross margins whilst stepping up investment in brands and longterm capabilities. Looking forward I am optimistic of consumer demand gradually improving due to a normal monsoon and better macroeconomic indicators. With rising affluence underindexed FMCG consumption and a strong digital infrastructure I remain very confident of the medium to longterm potential of Indian FMCG sector. To serve the evolving aspirations of Indian consumers we have embarked on a journey of  Transform to Outperform . Our key thrusts of Growing our Core through Unmissable Brand Superiority Market making and Premiumisation Reshaping our portfolio to high growth spaces and Leadership in Channels of future backed by our distinctive capabilities will enable us to continue winning in the Indian FMCG sector. The company s homecare segment its biggest one which houses brands like Surf Excel and Comfort posted midsingledigit percentage volume growth led by outperformance in Vim liquid.        ",
    "Shares of Hindustan Unilever traded lower as the Street awaited the FMCG giant s earnings show for the quarter ended March. HUL will announce its results for the fiscal year and fourth quarter on April 24.At 9.20am HUL shares were quoting Rs 2254.1 on the NSE lower by 0.3 percent compared to the previous session s closing price.Follow our market blog to catch all the live updatesAccording to a   poll of nine brokerage estimates the FMCG major is likely to report a revenue of Rs 14913 crore clocking an onyear fall of around one percent from Rs 15053 crore in the same quarter of the previous year.As per the poll the consumer staples maker will see a profit of Rs 2435 crore down by almost 4 percent from the yearago quarter.Many players in the FMCG space have undertaken price cuts to boost volumes and increase market share. The price cuts are expected to negatively impact the topline growth as FMCG players seek to retain market share.The Surf Excelmaker took price cuts of around 2 percent with the raw material prices easing. This will lead to a volume growth of around 23 percent experts said. Its EBITDA margin will decline because of higher royalty payouts and loss of distribution income on account of termination of agreement with GSK Consumer  PhillipCapital said in a report.Over the past six months its share price has sunk around 8.5 percent. In comparison the Nifty 50 index has gained around 15 percent during the same time period.",
    "Global investors have cut holdings of Hindustan Unilever Ltd. to a fouryear low as the company grapples with weak consumer demand and rising competition.Foreign funds reduced their ownership of India s largest staples company to 12.7  at the end of March down from as high as 14.5  in June last year according to data compiled by Bloomberg. The firm s shares have slumped more than 9  in the past 12 months the second worst performer in the NSE Nifty 50 Index.Investors have sold Hindustan Unilever and its consumergiant peers as they found it hard to justify the expensive valuations of the companies amid faltering sales growth. The firm has been facing competition from newage brands while lower agricultural yields have sapped demand among its rural customer base. Overseas investors will look at the parent company trading at less than half the valuation multiple  said Abhay Agarwal a fund manager at Piper Serica Advisors Pvt. in Mumbai. Revenue growth has slowed significantly and the  threeyear sideways movement in the stock during a rising market has brought in some wariness  he said.While foreign funds have been selling the proportion of Hindustan Unilever s shares owned by domestic investors has risen to a record 13.2  data compiled by Bloomberg show. Parent Unilever Plc and other members of the group own just over 60  while retail investors have about 12 .Local investors have to buy the company given its size and weighting in the benchmark index Piper Serica s Agarwal said.Still the decline in Hindustan Unilever shares this year has helped improve its multiples. The stock is currently trading at 46 times its forward earnings below its fiveyear average of about 54 times. Consumer stocks focusing on the rural economy could see some positive momentum  said Souvik Saha an investment strategist at DSP Asset Managers Pvt. in Mumbai. Commentary from some of the consumer companies are indicating that the worst might be over and some of key subsidies for the rural areas is set to continue he said.Hindustan Unilever is forecast to report net income of 24.7 billion rupees ( 296 million) for the three months through March a decline of 0.9  from a year earlier according to the median estimate of analysts surveyed by Bloomberg before it announces results Wednesday.        ",
    "Hindustan Unilever (HUL) is expected to report subdued Q4 earnings as rural demand remained muted dragging volume growth during the quarter.According to a   poll of nine brokerage estimates the FMCG major is likely to report a revenue of Rs 14913 crore clocking an onyear fall of around one percent from Rs 15053 crore in the same quarter of the previous year.As per the poll the consumer staples giant will see a profit of Rs 2435 crore down by almost four percent from the yearago quarter.The EBITDA margin expected to decline owing to higher royalty payouts rising ad spends and lower sales growth as per experts.Hindustan Unilever will announce on April 24 its results for the fiscal year and fourth quarter ended March 2024. Over the past six months its share price has sunk around 8.5 percent. In comparison the Nifty 50 index has gained around 15 percent during the same time period.Rural demand price cuts to affect volumes toplineMany players in the FMCG space have undertaken price cuts to boost volumes and increase market share. The price cuts are expected to negatively impact topline growth.Due to lower realisation growth and lack of a sustainable recovery in the rural sector Hindustan Unilever is expected to see volume growth between 2.53 percent for the quarter. Currently the urban sector is outpacing the rural areas.Additionally as a result of benign raw material costs increased competition from unorganised regional players larger firms such as HUL s volumes will be impacted.Royalty payment GSK deal expiration to impact marginsNuvama Institutional Equities noted that Hindustan Unilever will see an adverse impact of 75 crore on sales for the quarter as a result of the expiration of GSK consignment arrangement.Hindustan Unilever and GSK Consumer decided to terminate their distribution agreement in 2022. From November 2023 HUL stopped selling GSK Consumer s products such as Sensodyne Crocin Otrivin and Eno brands in India.Also Read   Tata Consumer Q4 preview  Fastest revenue growth among peers margin expansion on cardsHUL shall also pay higher royalty payments to Unilever. HUL decided to increase its payout to parent Unilever. According to the new arrangement the royalties will see an increase of 80 bps over a period of 3 years from 2.65 percent to 3.45 percent of the total turnover.The first increase of 45 bps was put in effect for February to December 2023. The second increase of 25 bps was put in effect from January 2024 and will continue until December 2024. This is the first quarter to see an impact from the second hike in royalty payments which will add pressure to the EBITDA margin.",
    "The largest consumer company in the world s most populous nation has provided everyday products from detergent to instant coffee to Indians for decades.Now Hindustan Unilever Ltd is seeing its fortunes flag as an increasingly sophisticated consumer class with disposable incomes demands more. The Indian unit of Unilever Plc is battling a slowing rate of growth in revenue and profits while its share price is lagging.India s elite classes are becoming pickier consumers fueling the success of organic personalcare brands backed by slick social media marketing campaigns. The rise of companies like local upstart Honasa Consumer Ltd and the inroads made by global names including Estee Lauder Companies Inc. and Clinique Laboratories LLC is forcing Hindustan Unilever to spend more on product development and advertising.The company s challenges mirror those of other consumergoods giants such as Procter   Gamble Co. L Oreal SA and its Londonbased parent which in recent years have had to acquire the niche brands taking market share from their inhouse businesses. Challenger Brands  Simply put the large companies like Hindustan Unilever are slow to move and develop strategies compared to the newer brands that are far more agile  said Arvind Singhal chairman of consulting firm Technopak Advisors Pvt.  The power of large brands is decreasing by the day because there are challenger brands coming up at every price point. They offer better margins to retailers and the local shopkeeper is happy to try them out. Hindustan Unilever declined to comment because it is in an earnings quiet period a spokesperson said.India s personalcare sector is estimated to become a  33 billion market by 2027 from  20 billion in 2022 according to Redseer Management Consulting Pvt.The competition for wealthier customers comes as the maker of Dove soaps and Magnum ice cream has also had to offer price cuts for its cheapest brands due to a pullback in spending among the poorer rural consumers.That s squeezing the company at both ends which is often seen as a bellwether for consumer spending in India with its household products sold in every nook and corner of the country.The company s revenue grew 3 percent during the first nine months of the fiscal year through December   down from 17 percent growth in the yearago period. Likewise net profit is sagging increasing 4 percent to 77 billion rupees for the nine monthperiod ending Dec. 31 compared to 14 percent growth in the same period in the previous year.The consumer goods maker meanwhile spent 48 billion rupees ( 576 million) on advertising and promotional costs in the April to December period up from 36 billion rupees during the same time last fiscal year.In January Emkay Global Financial Services Ltd and Centrum Broking Pvt. cut their earnings expectations for Hindustan Unilever. The brokerages had concerns profit margins will be pinched further as it s forced to devote more resources to fend off new brands in the premium segment.The company has for long benefited from its entrenched ontheground supply chain that can fill up shelves at momandpop stores as well as supermarkets across the country.Direct SalesBut niche competitors selling directly to consumers online circumvent the distribution network according to Nitin Gupta an analyst at Emkay Global. Even when HUL does launch a premium product they have been late to the market  Gupta said.  Innovation has not kept pace with the consumer. The stock is down by 15 percent since the start of this year lagging the 4.5 percent decline in the broad index of consumer stocks in India. The market benchmark S P BSE Sensex has advanced in 2024.Hindustan Unilever is struggling to offer new products in the premium segment that create market buzz said Vidushi Agrawal an independent brand consultant based in Mumbai.Tapping InfluencersIts newage competitors are marketing products to specific demographic groups   such as young people or new parents   and tapping social media influencers to spread the word about their brands.Hindustan Unilever personalcare brands such as Simple or Love Beauty and Planet   launched a few years ago   are just now gaining some social media traction. Still each one has garnered less than 92000 Instagram followers for example. Mamaearth   a personalcare brand from newcomer Honasa Consumer   has more than 1.3 million followers on the platform.Mumbai accountant Karthik M said he now skips by most HUL items on store shelves. When he s shopping for personal grooming products he s looking for products from Bombay Shaving Co. and Marico Ltd.backed Beardo. I research quite a bit on the science behind shampoos and soaps and what chemicals I want on my face  he said.  Other than Pears soap I don t buy any of the other products for hair and beard  from Unilever s India unit.Recasting BusinessesHindustan Unilever has introduced a slew of new body care products in the last two years and in December split its personal care division in two in order to do better specialized marketing.More than 80 percent of the company s product lines are either growing or maintaining brand identity among consumers Hindustan Unilever Chief Executive Officer Rohit Jawa said on a January call with analysts.The premium beauty business unit   created three years ago   is generating more than a billion rupees in annual recurring revenue the company said. It does not disclose profit for the unit.Still the company s fight to maintain its decadeslong stranglehold on Indian consumers looks set to intensify. Nimble challengers are offering shoppers more variety and retailers more profits said Laxmichand Gada owner of Mumbai retail chain Society Stores.This means he s stocking fewer Unilever personalcare products on his shelves and more of local and foreign niche brands.        ",
    "The week ended April 5 favoured the bulls but the Nifty traded within a range of 22300 to 22600 points though it managed to end the week with a gain of 0.84 percent. It however failed to close above its previous alltime high of 22526.60 which raises concerns for the current week.The Nifty is trading above the S3 Camarilla pivot (22346) and it found support at this level in the previous trading session. Additionally since the Nifty is trading significantly above its 21day and 50day exponential moving averages (DEMA) there is a possibility of reversion towards the next support levels of 22340 and 22200.Overall the levels to watch out for on the higher side would be 22600  22800 and lower side 22200 22000.The Nifty Bank index emerged as a notable performer in the past week gaining almost 1368 points and closing with a substantial increase of 2.90 percent for the week.Looking ahead the level of 48636 poses an immediate resistance as it represents the previous high reached in December 2023. Coincidentally the 48600 mark aligns with R5 Camarilla resistance which could prompt some investors to book profits potentially leading to a pullback in the Nifty Bank index towards its immediate support levels of 48000 and 47500.Here are three buy calls for next 23 weeks Orient Cement  Buy   LTP  Rs 217   StopLoss  Rs 195   Target  Rs 250   Return  15 percentFollowing a peak near the Rs 293 level Orient Cement encountered a notable downturn marked by a sharp decline of 35 percent in its overall value. Despite this downturn Orient Cement has shown signs of stability around Rs 200 level for the week establishing a sustained support base.It s noteworthy that Rs 190200 level coincides with Fibonacci ratio clustering as indicated in the chart. Moreover during this period a 1 1 leg has also formed around this support zone further reinforcing a bullish sentiment in the stock.Analysis of the daily scale RSI (relative strength index) indicator reveals a bullish hidden divergence suggesting a favourable outlook for Orient Cement.Taking into account these factors along with chart patterns investors may find it prudent to consider initiating buy positions within the range of Rs 210220 with an upside objective targeted at Rs 250. To manage risk effectively it s advisable to set a stoploss order at Rs 195 on a daily closing basis providing protection against potential downside movements.Hindustan Unilever  Buy   LTP  Rs 2266.95   StopLoss  Rs 2145   Target  Rs 2500   Return  10 percentSince reaching its peak around Rs 2669 mark on January 1 2024 Hindustan Unilever has experienced a notable downturn witnessing a significant decline of 16 percent. However in the subsequent six trading sessions Hindustan Unilever has displayed resilience avoiding further declines and instead consolidating within a range spanning from Rs 2230 to Rs 2280.Notably within this price range a bullish AB CD pattern has formed on the daily chart of Hindustan Unilever. This range also corresponds with the 0.50 percent retracement level of a price swing observed between March 2022 and July 2023 as depicted on the chart.Additionally on a daily scale the relative strength index (RSI) has exhibited a complex structure (W shape) along with some regular bull divergence on the 4hour chart. Interestingly the mentioned range of Rs 22302280 aligns with S3 weekly Camarilla Pivot suggesting a potentially attractive buying opportunity.Therefore it might be prudent to consider buying within the range of Rs 22502280 aiming for an upside target of Rs 2500 while setting a stoploss near Rs 2145 on a daily closing basis.AU Small Finance Bank  Buy   LTP  Rs 634.75   StopLoss  Rs 585   Target  Rs 725   Return  14 percentAU Small Finance Bank reached a peak around Rs 813 on January 9 2024 but then experienced a decline of about 32 percent. However in the past two weeks the stock has shown a significant recovery and is currently trading near Rs 620 mark indicating a bullish sentiment.On the indicator side the weekly Scale Stochastics indicator has identified a  hidden Bull Divergence  close to its previous low point recorded on March 20 2023 (as shown on the chart). This divergence suggests the possibility of upward momentum and indicates a potential bullish sentiment.Therefore investors may consider adding long positions in the range of Rs 620640 with an upside target set at Rs 725. It s recommended to set a stoploss near Rs 585 on a daily closing basis to manage risk.",
    "The week ended March 28 proved to be a resounding success for bullish investors in the domestic markets leading to a highly optimistic closure for the week month and the financial year.Despite being truncated because of two national holidays the Nifty index consistently traded in the positive territory across sessions. Throughout the last week there were notable attempts by the benchmark to surpass the significant 22500 mark indicating a strong bullish sentiment in the market although it ultimately closed below this threshold.The last week however concluded with gains of over a percent reflecting the positive momentum and sentiment among investors. Overall it was a week marked by optimism and upward momentum underscoring the resilience and confidence in the domestic markets.Last week our analysis centered around the crucial support of the 50day exponential moving average (DEMA) for the Nifty index. Additionally we delved into the bullish harmonic shark pattern and the morning star candlestick pattern. The impact of these technical indicators was evidently observed throughout the week as they contributed to pulling the index back to the significant 22500 mark.However a notable occurrence during the final hour of the preceding trading session led to a substantial pullback driving the index towards the 22300 mark prompting a degree of scepticism in our outlook. Despite our prior bullish stance we now anticipate fresh rounds of buying activity only if the index surpasses the 22500 level or nears the 22100 levels owing to the emergence of negative divergence in the relative strength index (RSI) across multiple time frames. This divergence signifies a potential shortterm reversal in momentum.For the medium term we maintain our optimistic outlook asserting that as long as the support at 21700 remains intact the index retains the potential for further upward movement. Looking ahead the shortterm support level has been adjusted to 22000 for the current week starting from April 1 underscoring the dynamic nature of market trends and the importance of vigilant analysis in navigating fluctuations.Here are three buy calls for the next 23 weeks Orient Cement  Buy   LTP  Rs 196   StopLoss  Rs 179   Target  Rs 225   Return  15 percentFollowing a peak near the Rs 293 level Orient Cement encountered a notable downturn marked by a sharp decline of 35 percent in its overall value. Despite this downturn Orient Cement has shown signs of stabilisation around Rs 190 levels for the last week establishing a sustained support base.It s noteworthy that the level of Rs 190 aligns with the Fibonacci ratio clustering as indicated in the chart. Moreover during this period a 1 1 leg has also formed around this support zone further reinforcing a bullish sentiment in the stock. An analysis of the daily scale RSI indicator reveals a bullish hidden divergence suggesting a favourable outlook for Orient Cement.Taking into account these factors along with chart patterns investors may find it prudent to consider initiating buy positions within the range of Rs 190198 with an upside objective of Rs 225. To manage the risks effectively it s advisable to set a stoploss order at Rs 179 on a daily closing basis providing protection against potential downside movements.ABB India  Buy   LTP  Rs 6361   StopLoss  Rs 5950   Target  Rs 7000   Return  10 percentIn the recent trading session ABB India showed a significant breakout above the R4 camarilla pivot (Rs 6111.4) maintaining its position above this level. Additionally daily stochastics have ventured into the overbought territory suggesting a bullish momentum anticipated in the upcoming days.The combination of price action persisting above the R4 camarilla pivot and stochastics registering as overbought presents a compelling technical confluence reinforcing the bullish sentiment surrounding ABB India.Investors may consider initiating a  buy  position within the range of Rs 62506400 targeting an upside potential of Rs 7000 while prudently placing a stoploss near Rs 5950 based on the daily closing prices.Hindustan Unilever  Buy   LTP  Rs 2264   StopLoss  Rs 2145   Target  Rs 2500   Return  10 percentSince reaching its peak around the Rs 2669 mark on January 1 2024 Hindustan Unilever has experienced a notable downturn witnessing a significant decline of approximately 16 percent. However in the subsequent six trading sessions Hindustan Unilever has displayed resilience avoiding further declines and instead consolidating within a range spanning from Rs 2230 to Rs 2280.Notably within this price range a bullish AB CD pattern has formed on the daily chart of Hindustan Unilever. This range also corresponds with the 0.50 percent retracement level of a price swing observed between March 2022 and July 2023 as depicted on the chart.Additionally on a daily scale the RSI has exhibited a complex structure (W shape) along with some regular bull divergence on the 4hour chart. Interestingly the mentioned range of Rs 22302280 aligns with S5 Camarilla Pivot (Rs 2243) suggesting a potentially attractive buying opportunity.Therefore it might be prudent to consider buying within the range of Rs 22502280 aiming for an upside target of Rs 2500 while setting a stoploss near Rs 2145 on a daily closing basis. This comprehensive analysis highlights potential trading opportunities and risk management strategies for traders and investors considering positions in Hindustan Unilever."
]