[
    "Food delivery firm Swiggy has partnered with the country s largest private sector lender HDFC Bank to launch a cobranded credit card. The card will offer a hefty 10 percent cashback on food delivery grocery delivery under Instamart and its dining out platform Dineout. The card will be hosted on the Mastercard network.The cashback offered is much higher than the usual five percent offered by brands for shopping on their own platform. For instance Amazon Flipkart Paytm and Tata Neu only offer around five percent as cashback even though occasionally there could be a few extra offers. The Paytm and Tata Neu cobranded credit cards are also in partnership with HDFC Bank.The SwiggyHDFC card will also offer five percent cashback on shopping across other ecommerce platforms such as Amazon Flipkart Myntra Nykaa Ola Uber PharmEasy NetMeds BookmyShow and several others the statement said. In fact with an AmazonICICI credit card a customer cannot get five percent cashback on Flipkart and vice versa. Hence the Swiggy card makes more sense for anyone who shops across these platforms.ALSO READ  Visa says cobranding offers opportunities for new categories to emergeIn one fell swoop the card could make AmazonICICI and FlipkartAxis credit cards irrelevant for most users as the cashback remains the same whether a customer uses the Amazon card Flipkart card or the Swiggy card. However there is a catch. The benefits of such high rewards can be reaped only if the customer uses Swiggy a lot every month. Because the cardholders will get cashback in the form of Swiggy Money which can be used only on Swiggy.However the only catch being that the cashback will be deposited as Swiggy Money and can be used only on Swiggy. If a customer s monthly grocery purchases are more than Rs 40005000 it must not be difficult to use exhaust the Swiggy Money buying grocery on Instamart.For reference even the Amazon ICICI credit card offers the cashbacks as Amazon Pay Balance and can be used only on Amazon and its partner merchants. However the use cases of exhausting the Amazon Pay Balance is much wider with the platform offering insurance flight tickets and hotel bookings.The credit card launch and the aggressive cashback offers is happening at a time when Swiggy is gradually losing market share to Zomato and its grocery delivery platform Blinkit. The credit card could help cultivate loyalty and drive up its usage.The cobranded credit card success storyHDFC is the country s largest credit card issuer. The bank has issued close to two crore credit cards in the country whereas the overall number of credit cards in the country stands around 10 crore as of June 30 according to RBI data.Earlier this year Swiggy s Gurugrambased rival Zomato had ended its cobranded card partnership with RBL Bank which also offered 10 percent cashback on its premium Black edition while the Classic edition offered only five percent cashbacks. It is not clear why the partnership has not worked out.Some of the cobranded credit cards have been a runaway success among customers over the last fourfive years with both Amazon and Flipkart adding 40 lakh users each. These cards see fully digital onboarding of the majority of the users apart from high usage and activation rates. Paytm has around seven lakhs customers for its cards.Today Amazon ICICI credit card is almost 30 percent of the ICICI credit card portfolio and the Flipkart Axis credit card is almost 40 percent of Axis Bank s credit card portfolio indicating the importance of a successful cobranded partnership for banks. HDFC does not have such a huge success as of now. Today one in three credit cards are cobranded credit cards whereas it was just 10 percent a decade ago. This has been driven by the newage consumer internet brands.While airlines offline retail brands and oil marketing companies cards  used to be popular a decade ago digital brands have taken their place as customer spending has also shifted towards the platform and has often demonstrated loyalty and stickiness.For instance the overall credit card spending on digital platforms were close to Rs 90000 crore during the month of June whereas the credit card spending at Point of Sale terminals (or offline channels) stood at Rs 50000 crore that is almost 80 percent higher on online platforms.Who is the card forWhile there are around 10 crore credit cards in the country the unique number of credit card users is only around four crore. Most power users will have multiple cards and uses the cards to maximise value or cashbacks. Adding a Swiggy credit card will not hurt such users.The cashback benefit of five percent is also applicable on branded websites like Nike H M Adidas and Zara among others. Similar to Amazon and Flipkart credit cards this card also offers one percent cashback on all other spending. We recognise that modernday consumers actively seek rewards offers and cashback programs that add value to their spending  said Rahul Bothra Chief Financial Officer of Swiggy.As a welcome benefit the card is also offering a threemonth Swiggy One membership that offers free delivery and additional discounts. The credit card will be rolledout in a phased manner on the Swiggy app over the next 710 days post which all the eligible customers will be able to apply for it on Swiggy app and HDFC website. We strive to offer innovative and tailored solutions to meet the evolving needs of our customers. Dining and Grocery are at the core of customer s daily needs and with this strategic collaboration we are offering convenience of both categories bundled with great value  said Parag Rao country head for payment business consumer finance technology and digital banking at HDFC Bank.        ",
    "HDFC Bank s managing director and CEO Sashidhar Jagdishan on July 19 warned managerial level employees of transgression from good working culture saying he is aware of such instances and has the resolve to  nip this in the bud.  I am fully conscious of the fact that there may be instances where some people managers might transgress our defined way of working  Jagdishan said in his message to shareholders on July 19.   We have the resolve to nip this in the bud both by way of training counselling and appropriate action to ensure that the same is not attempted by anyone else  Jagdishan said.Jagdishan however added that the bank has  some distance to traverse on this front.   We are taking concrete steps towards building an inclusive organisation which will go a long way in reining in attrition in the coming years  he added.Why the comment is importantThe comment from the CEO assumes significance in the backdrop of an incident recently circulated on social media with respect to the alleged unruly behaviour of one of the senior executives of the bank towards junior staff.HDFC Bank on June 5 suspended the concerned officer in Kolkata for allegedly engaging in unruly behaviour with colleagues during an internal meeting. In a video circulating on Twitter the officer was heard shouting at his junior colleagues for not selling enough banking and insurance products.In a statement made available to   HDFC Bank said that on the basis of a preliminary enquiry into the matter the concerned employee has been suspended and a detailed investigation has been initiated which will be undertaken as per the Conduct guidelines of the bank.The banking major further added that they have a zerotolerance policy for any form of misconduct at the workplace and firmly believe in treating all our employees with dignity and respect.In the video the manager was asking his junior employee said  I don t understand today you re going to do 25 smart ones 25 sure covers and 25 health covers. Misselling complaintsIncidents of product misselling have been reported across the banking industry. In the past there have been instances where life insurance policies were sold to customers aged above 75 years in Tier IIIII cities. Usually branches of the banks push products of their subsidiary insurers.Bank executives face immense pressure from top management to sell thirdparty products like insurance. Failure to meet targets invites informal penal actions while meeting targets brings perks such as parties in fivestar resorts.Banks typically crosssell insurance products of their subsidiaries and sometimes of other companies along with loan products. Many a time banks insist purchase of policies along with loan products. Early this year the RBI had conducted a meeting with the board of directors of all public sector banks and private banks to discuss issues related to governance and ethics.Emphasis on cultureIn his message Jagdishan stressed the importance of good working culture saying that it defines the experience of each employee. Managers are uniquely positioned to represent the culture the Bank stands for. Talent Potential and Capabilities can best be harnessed through an enabling culture  Jagdishan said.Towards this aim the bank has adopted the managerial behaviour architecture based on the principles of  Nurture Care and Collaborate  said Jagdishan adding that this should translate into simple behaviours that managers can demonstrate in their interactions with their teams. The Nurture Care Collaborate initiative that covered over 12000  managers in the previous year was extended to the senior leadership levels and over 6000 new managers in FY 202223 the CEO added. The intent is to have all managers at the Bank equipped to fully live the cultural ethos of the Bank  Jagdishan said.Increase in attritionJagdishan said the bank has experienced an increase in attrition over the last financial year a significant part of which was in the  nonsupervisory staff  levels including sales officers.  Jagdishan attributed Covid as one of the reasons for high attrition that may have prompted the younger workforce to recalibrate what they  want from their lives  the CEO said. This has led to increased attrition across all sectors. It is a reality that all major employers are grappling with especially in the BFSI sector  Jagdishan added.Earlier in an interaction with the media the bank s chief financial officer Srinivasan Vaidyanathan had said that the lender witnessed a 30 percent employee attrition in the fiscal year 202223. On average we saw the attrition rate at around 30 percent. Highest attrition was seen at the entrylevel positions which stood at around 40 percent to 50 percent  Vaidyanathan said at a postresults media call.A few levels above the entrylevel Vaidyanathan said that the attrition rate is around mid20 percent to 30 percent the CFO added.HDFC and HDFC Bank got merged effective July 1 marking a major event in India s banking sector. Postmerger the loan book or advances of the merged entity jumped by 38.77 percent to Rs 22.21 lakh crore as against 16 lakh crore as on March 31 as per investor presentation of the bank.The merger gave HDFC Bank entry to India s booming housing loan market while for HDFC the decision made sense on account of vanishing regulatory arbitrage earlier available for nonbanking finance companies.        ",
    "Financials remain the darlings of Dalal Street with nonbanking financial companies (NBFCs) now grabbing the spotlight within this sector. In June mutual funds heavily invested in NBFC stocks while booking profits from private banking stocks.The current market sentiment suggests that the peak of the interest cycle is approaching its end according to analysts and fund managers. As central banks in developed markets begin to cut interest rates India is expected to follow suit. Resultantly the liability costs for NBFCs are likely to decrease leading to higher profit margins and increased profitability.Mutual funds in June raised their holdings across various NBFC segments be it housing finance consumer finance or microfinance. Loan demand remains strong across product categories like vehicle SME consumer segments and gold finance. The Street expects assets under management (AUM) growth above 20 percent year on year for most NBFCs in Q1 FY24. Credit growth is now wellentrenched and can continue for the medium term. The credit cycle also looks good and predictable. The probability of any big NPL (nonperforming loans) shocks coming over the next few quarters is very low  Vinay Sharma Fund Manager  Equity Investments Nippon India Mutual Fund said.In June asset management companies upped their stake in HDFC Shriram Finance Creditaccess Grameen and Mahindra   Mahindra Financial Services among several other names. While HDFC can be looked at as MFs jumping on an arbitrage opportunity ahead of merger with HDFC Bank inflows for other NBFCs were largely on the back of improving outlook on their asset quality and margins.Why the optimism NBFCs borrow from banks or raise money from nonconvertible debentures. In both cases they are borrowing at high rates but at the same time they are lending at even higher rates.  For instance select NBFCs are raising funds while offering yields up to 10 percent per annum but lending rates are also north of 14 percent. In that sense the gross margin picture for NBFCs looks better than that of many banks that accept deposits at 7.5 percent and lend at around the 9 percent range  explained Nirav Karkera of Fisdom.While some NBFCs could see their NIMs (net interest margins) contract by 515 basis points given the increase in the cost of funds analysts at Systematix Institutional Equities believe other NBFCs will likely maintain or see a marginal increase in NIMs aided by a change in their portfolio mix and upward revision in lending rates.Moreover when it comes to highyield segments like SME (small and medium enterprise) loans loans against property and unsecured personal B2C (businesstoconsumer) loans NBFCs are more willing to extend credit compared to several regulatory checks by banks. This is why NBFCs will be able to serve the increasing trend of financialisation better as they are playing the creditrisk game better said analysts.According to Krishna Sanghavi  CIO Equity Mahindra Manulife Mutual Fund NBFCs will continue to rerate as the focus shifts from margin pressures.  FY23 saw some derating for NBFCs on concerns over margins while banks saw profit gains as well as rerating. Q1FY24 saw a rerating for NBFCs as post the policy pause by RBI market expectations shifted away from margin pressure  he said.Bargain buysMoreover mutual funds also jumped at the opportunity to buy NBFC stocks at a bargain. For instance CreditAccess Grameen and Shriram Finance both saw big block deals in June at a slight discount to the then market price. Canara Robeco Axis Mutual Fund and HDFC AMC upped their stake in CreditAccess Grameen while Aditya Birla Sun Life AMC and Kotak Mahindra AMC among others bought into Shriram Finance. Meanwhile cash flows have held up well and contributed to better collection efficiencies which will translate into benign credit costs across most of the NBFCs  Ritesh Bhagwati  Head of Research  Rockstud Capital. In Q1 FY24 analysts expect the credit cost of most NBFCs likely to be maintained at Q4 levels except for a few like Mahindra Finance and Cholamandalam Finance which could see a normalised credit cost.And finally the space is also heating up with the entry of Jio Financial Services soon. While it is expected that JFS will disrupt the sector and heat up the competition fund managers do not seem to mind loading up on the already listed names to capitalise on India s growth story."
]