[
    "Motilal Oswal s research report on Asian PaintsAsian Paints (APNT) posted 1  2  YoY decline in consolidated standalone revenue in 4QFY24 with decorative volume growth at 10  YoY (vs. est. 9 ). The valuetovolume gap expanded to 12  in 4Q from 7  in 3QFY24. Revenue growth was hit by price cuts (3.5  in 4Q) and an unfavorable product mix (subdued growth of the premium segment). Benign raw material prices continue to drive GM which stood at 43.7  in 4Q the best in the last 12 quarters. APNT s gross margin will be the key monitorable in FY25 FY26 considering the changing competitive landscape and dwindling raw material price benefits.OutlookThere are no material changes to our EPS estimates. APNT launched the  Neo Bharat Latex  paint in Jan 24 that penetrated into the unorganized segment with a branded solution which is smart affordable and accessible to consumers. It will address a market size of INR5055b (management aims to achieve a 30  share in the medium term). With the entry of new players having deep pockets and massive commitments to investments the overall industry may see a shift in market share and cost structures. These will be the key monitorables for FY25. We remain cautious on both value growth and margin in FY25 FY26. Despite a correction in the stock the risk of competitive pressure still hovers around its earnings. Consequently we reiterate our Neutral rating with a TP of INR 3000 (based on 45x FY26E EPS).For all recommendations report click here",
    "Sharekhan s research report on Asian PaintsAsian Paints Limited s (APL s) Q4FY2024 performance was a miss on all fronts with consolidated revenue coming in flat at Rs. 8731 crore (affected by value decline) OPM declining by 125 bps yoy to 19.4  due to higher media spends and PAT remaining flat yoy at Rs. 1250 crore. Decorative paints  volume growth stood at 10  in Q4FY2024. Realisation decline was 12  due to price cut of 3  and downtrading to economy range of products. Volume growth to remain in doubledigits valuevolume gap will remain at 56 . We expect OPM to remain at the lower end of the guided band of 1820  due to higher media spends.OutlookAPL s management is confident of maintaining doubledigit volume growth in Q1FY2025 and the quarters ahead with a sustained recovery in rural demand and small towns. Value growth will remain lower due to mix impact. An expected buildup in competition from newly entered large players would pose a risk to the profitability in the near term. The stock trades at 47x and 42x its FY2025E and FY2026E earnings respectively. The risk of heightened competition in the core paint segment and its pressure on margin keeps risk reward unfavourable. Hence we maintain our Hold recommendation on the stock with a revised price target (PT) of Rs. 2960 (reducing the PT inline with the reduction in earnings estimates).For all recommendations report click here",
    "Prabhudas Lilladher s research report on Asian PaintsWe cut FY25 26 EPS estimates by 1.2  2.2  given little scope to improve margins (all time high levels ex of covid year) higher spends on distribution advertising and supply chain post Grasim s entry and high capex phase despite sustained double digit volume growth expectations. APNT has launched Neo Bharat latex based emulsion which can push volumes at the entrylevel segment and help boost volume growth. APNT is banking upon its brand equity strong distribution and innovations to ward off any threat from Birla Opus launch. Domestic outlook remains positive across decorative Auto and industrial segments while IBD has uncertainty due to Geopolitical issues. Home d cor is showing noticeable signs of improvement and it is looking at rebranding kitchen and Bath business under  Beautiful Homes  for improving sales. We believe success of Neo Bharat is a key factor to watch out for as it can boost its market and share at bottom end like it happened post GST. We believe next few quarters are key to gauge impact of Birla Opus on markets and APNT.OutlookAlthough valuations have moderated to 45xFY26 EPS  it does not factor in any significant change in market dynamics and 2.8  EPS CAGR over FY2426. We cut DCF based target price to Rs2672 (44.3xFY26 EPS) (Rs2698 earlier) and retain Reduce rating on the stock.For all recommendations report click here",
    "India s largest paint manufacturer Asian Paints delivered an earnings show that came under expectations revenue decreased despite a fall in volumes. Asian Paints reported a consolidated net profit of Rs 1275.3 crore for the March quarter posting a rise of 1.3 percent from a year ago.The total revenue stood at Rs 8730.76 crore down 0.64 percent from Rs 8787.34 crore last year it said in a regulatory filing.The revenue and profit missed estimates. The topline was expected to come in at Rs 9017 crore for the quarter gone by according to a   poll of seven brokerages. Profit after tax was expected around Rs 1313 crore for the March quarter.The EBITA saw a decline as a result of the higher investment in the brand along with advertisement and promotional spends per brokerages.However gross margins expanded 120 basis points onyear to 43.7 percent.  Margins continue to expand amid a softening commodity basket coupled with operational formulation and sourcing efficiencies  said Prabhudas Lilladher.Also Read   Asian Paints Q4 net profit rises 1.3  to Rs 1275 crore revenue down marginallyVolumes see uptickThe volumes saw a growth of ten percent for the quarter as Asian Paints undertook price cuts to boost demand but it failed to spur revenue. Instead consumers were downtrading  using cheaper offerings from competitors to fulfill their needs. The value growth will likely lag volume growth as a result of the price cuts taken said CLSA. Asian Paints saw a doubledigit 4Y volume CAGR of 19.4 percent in the decorative business. The business clocked doubledigit volume growth in urban areas in Q4.Demand forecastRural markets seem to be picking up and the company expects Q1FY25 demand to be supported by that sentiment. With a favorable monsoon forecast wages in the rural segment will see an uptick leading to increased discretionary spending.Nonetheless Prabhudas Lilladher said that with the entry of Grasim Industries into the paints business the outlook on Asian Paints  nearterm prospects remains subdued.However Motilal Oswal countered that point. The brokerage said  The new competition is not bringing any new technology  it is more of a metoo product playing on discounted pricing. Customers  loyalty plays a big role in the paints category and Asian Paints has a strong brand recall both at channel and consumer levels. Outlook International brokerage Citi retained  Sell  on the paints major with a target price of Rs 2600 per share.  CLSA also retained its  Sell  call on Asian Paints cutting its target price of Rs 2337 from Rs 2410 earlier.Motilal Oswal said  We remain cautious on both value growth and margin in FY25 FY26. Despite a correction in the stock the risk of competitive pressure still hovers around its earnings.  The brokerage reiterated its neutral call with a target price of Rs 3000 per share.",
    "HighlightsAsian Paints (CMP  Rs 2710  Market cap  Rs 259865 crore  Rating  Equal weight) India s leading paint and decor company delivered a muted set of numbers in Q4FY24 despite a strong volume growth of 10 percent yearonyear (YoY) in the core decorative business.Revenues came                                     ",
    "Check the brokerage calls and comments on the stocks in action. Today we cover the State Bank of India SRF BPCL and others following their Q4 results.State Bank of IndiaKotak Instl Eq On SBIBuy Call Target Raised To  950 ShReported 25  YoY Earnings Growth Led By Operating Profit Growth   Decline In ProvisionsSteady Loan Growth Stable NIM   Solid Asset Quality Metrics Were Key HighlightsMacro Environment Continues To Be Fairly Stable For LendersShould See Relatively Stable Performance From SBISBI Top Pick Don t See A Sharp Outperformance From Current LevelsCiti On SBISell Call Target Raised To  701 ShQ4 PAT Boosted By Few OneoffsQ4 Wage Revision Impact Est   Guided At  54000 Cr Came In Significantly LowerAt Core Level Spike In NonInterest Income   Contained Opex Led To PPoP BeatIT Refund Interest  1300 Cr Supported NII BeatCredit Growth Was Robust At 5  QoQ With Gained Traction In Corp Besides RetailBernstein On SBIMarket Perform Target  780 ShA High RoA   Multiple SurprisesMultiquarter High RoA Of 1.36  As Key Highlight Helping Drive Full Year RoA  1 Rise In NOI Gains   Continuation Of Low Credit Costs Helped Report PAT GrowthNIM Improved Sequentially By 8 bpsIncrease In Yield On Advances Outpacing Rise In Cost Of DepositsHSBC On SBIHold Call Target Raised To  900 ShNIM Improvement Was Led By LDROpex Was Lower Than Guidance Led By Reversals In Pension ProvisionsRevise EPS By 8.1 12.2 8.6  For FY25e 26e 27eUpgrade NIM Outlook   Lower Cost Ratio EstStock Already Trading At Premium MultiplesJefferies On SBIBuy Call Target  810 ShReported Profit Much Higher Than EstWhile NII Growth Of 3  Was A Tad HigherMajority Of Beat Is Led By Lower Staff Costs Higher Treasury GainsSome Of These Tailwinds May Not Be Recurring In NatureLoan Growth Stays Around 1516  Mark  Deposits Rose By 11  YoYSlippages Remain Low   Gross Net NPLs Are Down MarginallyIncred On SBIAdd Call Target  1000 ShPosted Superior Q4 PAT Despite InLine Operating PerformanceNIM Expanded By 8 bps QoQ As SBI Enjoys Ample LiquidityLDR AT 75  Providing Lending Dominance At Competitive Pricing Across SegmentsConsistent Delivery Of  1  RoA  16  RoE To Command A Valuation PremiumSRFKotak Instl Eq On SRFDowngrade To Add Target Cut To  2360 ShQ4 Did Improve Significantly QoQ But Lagged ExpectationsTimeline For A Strong Recovery Is Also Pushed Back Amid Intense China CompetitionCut FY202526 EPS By 1418  As Tone Down Expectations Particularly On Margin FrontJefferies On SRFUnderperform Call Target  2085 ShMgmt Provided An Optimistic Growth Guidance For Chemicals  Despite A Miss In FY24Refgas Biz Outlook Is Challenged By Lower Exports To The USSee Chinese Competition In RoWMgmt Expects Soft PF Margin In FY25Cut FY24 25 PAT Est By 6  3 Valn Doesn t Adequately Discount The Protracted Downcycle In Key Chemicals SegmentMS On SRFOverweight Call Target  2555 ShSRF Addressed Concerns Around Demand   Margins In Its VerticalsCo Pointed To A Gradual Improvement Over Course Of FY25Ops Leverage From Previous InvestmentsGradual Greenshoots In Pricing Will Be Key To Support 20  Growth In Its Chem SegmentMOSL On SRFNeutral Target  2100 ShChemical Business Expected To Witness 20  Growth In FY25Significant Growth Expected In H2FY25Positive Operating Leverage Can Lead To Margin Expansion In FY25Expects Packaging Business Margin To Remain Under PressureManagement Plans To Incur A Total Capex Of 2200 Cr In FY25BPCLCiti on BPCLBuy Call Target  760Reported A RefiningLed Miss In Q4 With QoQ Recovery In EBITDAPretax Profit Was Correspondingly 20  Below EstimatesNet Income Was 39  Below Due To  1800  Cr Impairment Of Investment In ArmFull Year FY24 EPS Was Nonetheless Very Strong At  125 ShMarch 2024 BVPS Stood At  350 Sh   FY24 RoE Was 42 Asian PaintsCiti On Asian PaintsSell Call Target  2600 ShPrice Cut (2.4  In Q4) Bundled With Downtrading Led To Revenue Decline YoYWhile GM Improved By 120 Bps YoY EBITDA PBT Declined By 9  7  YoYEBITDA PBT Decline Led By Higher Investment In Brand MarketingPAT Flat YoY Due To Lower TaxMgmt Expects Doubledigit Volume Growth   18 20  EBITDA Margin In FY25Punjab National BankMS On PNBUnderweight Call Target  70 ShCore PPoP Missed Est Owing To Higher Employee Related ProvisionsAsset Quality Was Steady And Coverage ImprovedCET 1 Ratio Increased QoQUnderweight On Expensive ValuationsTata PowerHSBC On Tata PowerDowngrade To Reduce Target Raised To  300 ShReported Earnings Missed Consensus EstExceptional Other Income Supported ProfitabilityBelieve Future Earnings Growth Is Dependent On Government ApprovalsFuture Earnings Growth Dependent On Competitive Intensity   Coal PricesUBLBoFA Sec On UBLDowngrade To Underperform Target Cut To  1850 ShTrim Earnings Est By 27 Stock Rally Current Valuation Capture Near Mid Term UpsideExpected Earnings Recovery Could Be Protracted Amidst A Volatile Business EnvironmentNeed To Keep Investments ElevatedBase Case Of Low Doubledigit Teens EBITDA Margin Over FY2527 EstKajaria CementsHSBC On KajariaBuy Call Target  1450 ShFY24 Was A Year Of Margin Recovery Despite Soft Volumes.Expect Better Volume Growth In FY25 With New CapacitiesThreeyear plan unveiled suggesting penetration led by doubledigit tile growthMahindra   Mahindra Financial ServicesGS On M M FinDowngrade To Sell Target Cut To  233 From  269 ShDowngrade On Back Of Elevated Credit Costs Given Low ECL CoveragePCR On Stage 3 At An Average Of 63  Which Is LowSee Higher Cost To Income Ratio At 43.5  Vs SHMF At 27.7 Loan Growth Has Moderated From 25  In FY24 To 17  15  In FY25 FY26Cut Earnings By 9  7  On A C Of Higher Operating ExpensesCut Earnings Est On Lower Disbursal Growth   Marginally Higher Credit CostsLowerthanguidedRoA Of 2.2  In FY25Expect Co To Deliver Avg RoAs Of 1.8  Over FY25FY26Believe Would Likely DeRate Further To 11.6x FY25 EPS 1.3x FY25 BVPSMS On CyientOverweight Call Target  2250 ShMgmt Cautious Pragmatic Approach To BackEnded Guidance For FY25Mgmt Confidence In Margin Performance In FY25 Regardless Of Quarterly VariationsConsideration Of TuckIn Acquisitions For White SpacesGrowing Captives A Sign Of Market OpeningOil Marketing CompaniesMS On OMCsIndian Fuel Refiners Reported Good Quarterly EarningsMore Importantly FY24 Earnings Highlights Structural Shift To Higher ProfitabilityRefinery Hardware Investments Are FructifyingBPCL Had Best Outperformance In Margin While HPCL Gained Fuel Market Share        ",
    "Asian Paints anticipates no disruptions in pricing moving forward owing to stable raw material prices.The management said in a post earnings conference call that some of the crude derivatives like monomers have shown some signs of pickup in the paint market.  But the key raw material which is Titanium dioxide (TiO2) is still stable in terms of the overall value.  said Amit Syngle Managing Director and CEO. Titanium dioxide (TiO2) is a white pigment used in over 90 percent of paint products to decorate and protect surfaces objects in both consumer and industrial settings.That management foresees prices to remain benign in Q1FY25 but going forward there might be some inflation it added.Read more  Asian Paints Q4 net profit rises 1.3  to Rs 1275 crore revenue down marginallyThe company has implemented a price decrease of approximately 3.7 percent which has narrowed the usual gap between volume and value numbers. As a result the overall value was slightly lower about minus 1.8 percent compared to the base.The management said that competitors consistently price themselves lower some even by up to 15 percent. The company does not see this gap narrowing down in the course of FY25.The company s strategy moving forward is to focus on enhancing the brand s equity rather than engaging in pricing pressure.  Such pressure tends to be unsustainable as competitors may always aim to undercut. Instead we aim to invest in the brand s longterm growth.  said Syngle. However the company remains adaptable to unforeseen geopolitical events that may require pricing adjustments.Asian Paints on May 9 reported a consolidated net profit of Rs 1275.3 crore for the March quarter posting a rise of 1.3 percent from Rs 1258.41 crore a year ago.The total revenue of the company stood at Rs 8730.76 crore down 0.64 percent from Rs 8787.34 crore last year it said in a regulatory filing.        ",
    "Asian Paints on May 9 reported a consolidated net profit of Rs 1275.3 crore for the March quarter posting a rise of 1.3 percent from Rs 1258.41 crore a year ago.The total revenue of the company stood at Rs 8730.76 crore down 0.64 percent from Rs 8787.34 crore last year it said in a regulatory filing.The revenue and profit missed estimates. The topline was expected to come in at Rs 9017 crore for the quarter gone by according to a   poll of seven brokerages inching up 2.6 percent onyear from Rs 8787 crore in the same quarter in the yearago period. Profit after tax was expected around Rs 1313 crore for the March quarter up 4.4 percent from Rs 1258 crore last year.Earnings before interest tax depreciation and amortization (EBIDTA) for the quarter was at Rs 1692 crore down 9.3 percent. EBITDA margins have declined by 170 bps YoY to 21.1 percent.The Board suggested a final dividend of Rs 28.15 per share in addition to the interim dividend of Rs 5.15 per share declared in October 2023. The total dividend for FY 24 stands at Rs 33.30 per share with a payout ratio of 60 percent. We crossed the   35000 crores consolidated revenue milestone in FY2024. Our Decorative   Industrial coatings combined delivered a volume growth of 10 percent and value growth of 3.9 percent for the year with our Industrial segment registering doubledigit value growth. Looking ahead we remain confident about a pickup in demand conditions with a favorable monsoon forecast. We will continue to innovate with speed and invest in our brand focusing on our consumers and keeping their interests at the forefront.  said Amit Syngle Managing Director and CEO.Syngle also noted that they made good progress on launching new collections and expanding our store footprint as well as integrating the Home D cor offerings within the company s Beautiful Homes network.  Profits for the year have grown in strong double digits supported by subdued material prices coupled with sourcing and formulation efficiencies.  he added.The company s automotive coatings business crossed the Rs 2000 crores revenue mark in the year. The Decorative Business (India) registered volume growth of 10 percent however revenue declined by 1.8 percent in Q4 FY 24. The revenue from decorative business was impacted by weak demand and downtrading in Q4FY24 and price cuts across categories.Home Decor BusinessBath Fittings business  Sales dropped by 8 percent in Q4 FY 24 to Rs. 88.7 crores from Rs. 96.4 crores last year due to weak retail demand.PBDIT suffered a loss of Rs. 10.0 crores in Q4 FY 24 compared to a profit of Rs. 1.1 crores in the same period last year. For the full fiscal year FY 24 sales fell by 16.2 percent to Rs. 340.1 crores from Rs. 406.0 crores last year resulting in a PBDIT loss of Rs. 18.4 crores compared to a profit of Rs. 6.6 crores in the previous year.Kitchen business  Sales rose by 2.8 percent in Q4 FY 24 to Rs 100.7 crores from Rs 97.9 crores.PBDIT was Rs 2.7 crores in Q4 FY 24 compared to a loss of Rs. 7.4 crores in the same period last year. However for FY 24 sales decreased by 7.5 percent to Rs 393.5 crores from Rs 425.5 crores last year with PBDIT at Rs 8.5 crores compared to a loss of Rs 15.6 crores in the previous year.White Teak and Weatherseal  Sales at White Teak grew by 33.3 percent in Q4 FY 24 to Rs 47.7 crores while Weatherseal sales increased by 63.4 percent to Rs 15.6 crores. For FY 24 White Teak sales rose by 23 percent to Rs 133.4 crores and Weatherseal sales more than doubled to Rs 51.7 crores benefiting from synergies with the Asian Paints network.Industrial business  APPPG sales increased by 8.1 percent in Q4 FY 24 to Rs 313.2 crores with PBT up by 2 percent to Rs 33.5 crores. For FY 24 APPPG sales rose by 12.6 percent to Rs. 1146.0 crores and PBT increased by 59.6 percent to Rs. 134.2 crores.PPGAP sales grew by 10.2 percent in Q4 FY 24 to Rs 471.2 crores with PBT up by 24 percent to Rs 68.9 crores. For FY 24 PPGAP sales increased by 10.3 percent to Rs. 2014.7 crores and PBT surged by 51.1 percent to Rs 356 crores.International BusinessIn Q4 FY 24 sales rose by 2.3 percent to Rs 812.3 crores from Rs 794.4 crores with a 4.7 percent increase in constant currency terms. PBT before exceptional items was Rs 44.2 crores compared to Rs 39.4 crores in the same period last year.However for the full fiscal year FY 24 sales dropped by 0.7 percent to Rs 3061.5 crores from Rs 3084.4 crores attributed to economic uncertainty forex crisis and liquidity issues in key markets in Asia and Africa.Despite this there was a 3.9 percent growth in constant currency terms. PBT before exceptional items for FY 24 stood at Rs 169.5 crores up from Rs  157.7 crores in the previous year.Following the earnings shares of Asian Paints were trading 4.22 percent down at Rs 2724.20 on BSE at 2 37 pm.         ",
    "India s largest paint manufacturer Asian Paints will likely report muted earnings for the quarter ended March as volumes remained subdued amid an ongoing slowdown in overall consumption.The topline is expected to come in at Rs 9017 crore for the quarter gone by according to a   poll of seven brokerages inching up 2.6 percent onyear from Rs 8787 crore in the same quarter in the yearago period.The EBITDA margin will see a marginal uptick of 10 basis points to 21.3 percent YoY but moderate 130 basis points on a sequential basis from 22.6 percent in the quarter ended December.Profit after tax will come in around Rs 1313 crore for the March quarter up 4.4 percent YoY from Rs 1258 crore.To boost demand Asian Paints implemented price cuts of around 3 percent. However this failed to meaningfully increase sales and will weigh on revenue growth for the quarter.Also Read   Asian Paints gains as subsidiary signs agreements with GCPL to set up facilityBrokerages expect volume growth to moderate as a result of the increased competitive intensity and slowdown in overall consumption.  Despite implementing price cuts in 4Q volume has not recovered. We believe that demand remained subdued throughout the quarter  Motilal Oswal noted.As the cost of raw materials moderates the gross margin is set to see an expansion. Asian Paints reported an improvement in its formulation efficiencies which will be partially offset by the recent price correction undertaken across the product portfolio.However EBITDA margin expansion will remain stable despite the gross margin expansion on account of higher adspends and opex.In the decorative segment overall demand trends for the industry were muted after a decent Q3 which was aided by festival and marriage demand said Nuvama Institutional Equities.Some of the key factors to monitor will be the demand outlook in Tier 2 and 3 towns the outlook for raw materials pricing actions and the rise in competitive intensity.",
    "New entrants in the paint sector are unlikely to replicate the extensive distribution network and market penetration achieved by Asian Paints over many years the company s managing director and chief executive officer Amit Syngle told   in an exclusive interview. He underscored the company s confidence in maintaining its competitive edge even in the face of the potential challenges posed by Grasim s entry into the paints business. We feel that even if newer players come in and ... look at opening a network... there is no way they can match this kind of distribution progress in terms of what we have and the kind of penetration we have across cities  Syngle said on the sidelines of the launch of Neo Bharat Latex Paint its first product in a new category of paints.The company s entry into the new category which is touted to be an affordable alternative to distemper aims to democratise the decorative paints sector. It comes more than a month after the Aditya Birla Groupowned Grasim s entry into the paints sector. Grasim s entry with a Rs 10000 crore investment caused brokerages to issue a cautious outlook for Asian Paints amid concerns over increased competition. Grasim aims to achieve a Rs 10000 crore gross revenue within three years of starting fullscale operations.Asked about the new entrant Syngle  said  We believe that our strategies are very strong. There have always been new players in the market for the last two decades. There have been international players like Sherwin Williams  which have kind of come into the market with huge investment muscle. So we feel that it s not a market that is easy to crack in terms of going forward. The sector which was initially dominated by a few key players is now seeing more new entrants backed by conglomerates reflecting the optimism in India s growth story.Syngle added  So we feel that the overall market is pretty big ... and it will continue to grow and give space to newer players. So far  the potential in the sector has prompted nonpaint players such as Birla group s Grasim JSW Group JK Cement  Pidilite and  pipes and fittings manufacturer Astral to venture into the business.Currently Asian Paints leads the market with over 50 percent market share followed by  Berger Paints with 18  Kansai Nerolac Paints with 15  and AkzoNobel (Dulux) with 7 .Big bet on rural demandAsian Paints announced its entry into a new category of paints an alternative to distemper on April 15 eyeing growth in the rural markets.Distemper is a preferred option in rural households mainly due to affordability and the traditional preference over emulsion paints. With  the launch of Neo Bharat Latex Paint Asian Paints is looking to democratise the decorative paints market with lucrative pricing. So this price point is less than Rs 1000 for a 20 kg pack....it therefore offers a very smart upgrade to the consumer and also a vast range of colors to freely choose from  Syngle  said.         ",
    "Asian Paints launched Neo Bharat Latex Paint on April 15 venturing into a new category of paint as robust growth in the sector driven by increasing urbanization rising disposable incomes encouraged existing players to tap into the booming demand and lap in more market share.The company which is the leading player in India touts the new segment to being affordable offering over 1000 shades for consumers. Neo Bharat Latex Paint marks one of Asian Paints  most significant launches to date. With this product we are revolutionizing the industry by introducing a completely new category making it more accessible to consumers across India  said Asian Paints  Managing Director and Chief Executive Officer Amit Syngle.The company also onboarded cricket player Virat Kohli as the brand ambassador for new launch.   By penetrating the unorganized segment with a branded solution we aim to expand the market and drive category growth as a market leader  added Syngle.Competition heats up with new players The move comes more than a month after Aditya Birla Groupowned Grasim s entry into the paints sector with the launch of the company s Birla Opus range of products.  Through the launch of Birla Opus Grasim aims to secure the second position in the decorative paints market which is currently dominated by rival Asian Paints.The development caused several brokerages issue a cautious outlook for Asian Paints amid concerns of increased competition.Last month  adhesives major Pidilite Industries (PIL) also ventured into the decorative paints market with the debut of Haisha paints.  The sector which was initially dominated by a few key players is now seeing more new entrants backed by conglomerates reflecting the optimism about India s growth story.        ",
    "Grasim s recently launched paint brand Birla Opus unveiled its dealer pricing which happens to sit at a discount of around 5 percent for most products to industry leader Asian Paints. Factoring in promotion volumes brokerage firm Jefferies noted that the total gap appears to be broadly 1015 percent across segments except in luxury where the prices are broadly similar to the market leader.With the discounted offering from Grasim Jefferies sees the battle intensifying in the Indian paints sector which also poses a downside risk to market leader Asian Paints. Accordingly Jefferies expects Asian Paints  earningsperstock to remain flattish over the next two years due to a rise in competition and sees downside risk to its already below consensus  forecasts.Jefferies has an  underperform  call on Asian Paints with a price target of Rs 2500 which reflects a downside potential of over 12 percent from the previous close. On the other hand the firm assigned a  buy  call for Grasim with a price target of Rs 2600 which factors in the scope of around 17 percent upside in the stock.Also Read   As Grasim gears up to launch Birla Opus Jefferies turns bearish on Asian PaintsWell preparedMeanwhile Jefferies also believes that Grasim has entered the paints segment with full preparation across all fronts. Birla Opus  product range straddles across price points and has a portfolio of 1200 SKUs (Stock keeping units) 145 products and over 2300 shades.  The company has even made claims of 98 percent product superiority over competition per blind tests  Jefferies noted.The company s entry in the paints industry will also increase the sector s capacity by 40 percent by FY25 and also offers a potential to further add 500 million litres in the medium term. The brokerage also believes that the use of latest technology and automation should show up in lower costs for Grasim along with high backward integration.Grasim also aims to set up a panIndia distribution by July 2024 and onboard 50000 dealers by March 2025 to develop the second largest network in the paints sector. Moreover the company is also offering a 10 percent extra product discount during the promotional period.Absolute advertising spends are expected to be similar to Asian Paints and 34x the next two players Jefferies highlighted. The company has also focused on strengthening its organisational structure as it already has 2400 employees onboard as compared to 40007000 for industry peers Asian Paints and Berger Paints.Also Read   Birla Opus not hurting Asian Paints much says Macquarie  cuts target price for Kansai Berger stocks ",
    "Macquarie has maintained its  Outperform  rating on Asian Paints Ltd with a target price of Rs. 4000 underplaying competition concerns from the launch of Birla Opus. Grasim Industries Ltd s paints foray with Birla Opus is not materially hurting Asian Paints said the brokerage firm.The recent price cuts by Asian Paints are more aligned with the history of keeping gross margin in a tight band Macquarie said.Asian Paints shares gained for the fourth session in a row on March 12. The stock closed flat at Rs. 2878. It has gained over 3 percent in the past year much lower than Nifty 50 s gain of over 30 percent during the same period.Also Read  Asian Paints gains as subsidiary signs agreements with GCPL to set up facilityChannel checks indicate that Birla Opus products may be priced 79 percent lower than Asian Paints prices at dealer level Macquarie said. Prices of Birla Opus products will see similar discounting as its peers Berger Paints and Kansai Nerolac it added.Macquarie has cut the earnings estimate for Kansai Nerolac Paints Ltd and Berger Paints India Ltd on rising costs of access for smaller players.Macquarie has maintained its  Neutral  rating for Kansai Nerolac while also reducing its target price to Rs 320 from Rs 360. The Kansai Nerolac stock continued its losing streak for the sixth session.The broking firm has maintained its  Underperform  rating on Berger Paints cutting its target price to Rs 490 from Rs 520.On March 12 Kansai Nerolac was down by nearly three percent at Rs 271 and Berger Paints was down 2.5 percent at Rs 562.        ",
    "Shares of Asian Paints gained 0.7 percent at the open on March 7 a day after the company said that its subsidiary had signed agreements with Gujarat Chemical Port Limited (GCPL) to set up ethylene storage and handling facility in Dahej.At 9.20 am the stock was trading at Rs 2846.85 on the NSE.Follow our market blog for live updatesIn a regulatory filing Asian Paints (Polymers) (APPPL) had entered into agreements with GCPL to set up an ethylene storage and handling facility in Dahej.Also read  Asian Paints Q3  Brokerages positive on rural recovery competition a worry. Buy sell or hold APPPL will be providing a security deposit of Rs 460 crore to GCPL which will be refunded over a period of 17 18 years. This would be in addition to the cost of setting up the VAM and VAE (vinyl acetate ethylene emulsion and vinyl acetate monomer) manufacturing facility of Rs 2100 crore.For Q3FY24 Asian Paints reported a consolidated net profit of Rs 1475.16 crore for Q3FY24 up 34.4 percent from Rs 1097.06 crore in the previous fiscal. Revenue for the same period also grew 5.4 percent yearonyear (YoY) to Rs 9104 crore against Rs 8636.7 crore in Q3FY23.",
    "Shares of Asian Paints continued its downward spiral falling around 7 percent in the past four days as Grasim s foray into the paints business has sparked fears of increased competitive intensity in the sector.At 11.54 am shares of Asian Paints were trading at Rs 2807 on the NSE.Grasim launched its paint brand Birla Opus last week which aims to attain the second position in the decorative paints market which is currently being dominated by Asian Paints.Not just that Grasim also targets to achieve profitability and a gross revenue of Rs 10000 crore within three years of commencing fullscale operations. While the bullish targets set by Grasim and an equally comprehensive strategy by the management to make it a reality has ushered optimism from the Street it has heated things up for Asian Paints.Even though brokerages believe Asian Paints will emerge as the industry leader after the shakeup they also feel that it is not the guaranteed winner hinting towards increased competition. These concerns have also triggered a flurry of downgrades and cuts in price targets for Asian Paints.Follow our live blog for all the live actionIn anticipation of an expected increase in competitive pressure within the industry brokerage firm CLSA has downgraded Asian Paints to a  sell  rating. Additionally the firm also reduced their price target for the stock by close to 25 percent to Rs 2425. Furthermore CLSA has adjusted its earnings estimates for Asian Paints for FY25 26 lowering them by 810 percent.CLSA also foresees a potential derating for Asian Paints with its stock price projected to align more closely with its 15year average multiple.Goldman Sachs also shares the same concern and thereby reduced its price target for the stock by approximately 14 percent to Rs 2850 while maintaining a  neutral  call. Moreover the firm has decreased its target multiple for the stock from the previous 58x to 52x. Additionally Goldman Sachs has adjusted its earningsperstock estimates for FY25 26 lowering it by 5.2 percent and 10.9 percent respectively.Moreover the stock s expensive valuations have also prompted brokerages to see limited upside in the stock from a near term perspective.Also Read   Grasim s paint foray turns brokerages bearish on Asian Paints as competition heats up  stock falls 4 ",
    "Grasim Industries staged its muchawaited entry into the paints sector with the launch of the company s Birla Opus range of products. Its foray into the paint industry is expected to shift dynamics within the sector as competition heats up.Through the launch of Birla Opus Grasim aims to secure the second position in the decorative paints market which is currently dominated by rival Asian Paints.The company aims to reach a gross revenue of Rs 10000 crore within three years of commencing fullscale operations. Grasim has already invested Rs 10000 crore upfront and commissioned three plants in Panipat Ludhiana and Cheyyar in Tamil Nadu.While Grasim s intensive business strategy to make a spot in the paint industry has garnered appreciation from analysts it has also weakened the stronghold for Asian Paints.Several brokerages has issued a cautious outlook for the paints major amid concerns of increased competition which triggered a fall in the stock on February 26. At 09.36 am shares of Asian Paints were trading 4 percent lower at Rs 2867.60 on the NSE while those of Grasim Industries were slightly up at Rs 2201.Anticipating a significant spike in competitive intensity within the sector brokerage firm CLSA downgraded Asian Paints to a  sell  and also slashed its price target for the stock by nearly 25 percent to Rs 2425. The brokerage house also cuts its FY25 26 earnings estimates for Asian Paints by 810 percent.While the firm remains optimistic about Asian Paints emerging as a leader in the paint industry post the shakeup it also feels that it is not the guaranteed winner. CLSA also sees a likely derating for Asian Paints with its stock price expected to move closer to its 15year average multiple.Goldman Sachs shares a similar concern for Asian Paints as the firm also cut its price target for the stock by nearly 14 percent to Rs 2850 while retaining a  neutral  call. The firm not only lowered its target multiple for the stock to 52x from the earlier 58x but also cut its FY25 26 earningsperstock estimates by 5.2 percent and 10.9 percent respectively.Goldman Sachs also believes that Grasim s strategy for its entry into paints was more comprehensive than assumed and based on product superiority and aggressive marketing spend.Also Read   Grasim Industries targets second spot in decorative paints market with Birla OpusBrokerage firm Citi is also feeling confident about Grasim s ability to achieve its desired vision of becoming the number two player in the paints sector. Grasim s plans to be panIndia by the end of FY25 another round of capacity addition and a clear dealer pull plan in place are some positives driving Citi s optimism for the company. Citi has a  buy  call on Grasim with a price target of Rs 2650.While the overall consensus doesn t see Grasim s entry dethroning big players in the business it could still flare up competition and put pressure on pricing profitability distribution and advertising.Macquarie doesn t anticipate a sharp spike in discounting levels in the industry either taking into account Grasim s revenue target for the next three years. The brokerage still prefers Asian Paints over smaller players and maintained its  outperform  call on the stock with a price target of Rs 4000.However Jefferies has a contrasting view as the firm expects Asian Paints to also feel some competition from smaller players like JSW Paints and Astral which are consistently spending around 1520 percent on marketing to increase market share and firm up their presence.Also Read   As Grasim gears up to launch Birla Opus Jefferies turns bearish on Asian PaintsJefferies has maintained its  underperform  rating on Asian Paints citing the stock s puzzling valuation of 55x oneyear forward PE and its limited growth over the past two years. The target price of Rs 2500 suggests a 17 percent discount from the current market price.",
    "Paint stocks came under pressure as Grasim Industries entered the space with the launch of Birla Opus on February.The flagship Aditya Birla Group company put on stream three paints manufacturing plants  in Panipat Ludhiana and Cheyyar  on stream the same day. Group Chairman Kumar Mangalam Birla shared the group s ambition to secure a profitable second position in the paints market in the coming years.Also Read   Grasim s Birla Opus aims for Rs 10000 crore revenue within 3 years expand distribution to 6000 towns this FYAt 2pm the shares of Asian Paints and Berger Paints pared their intraday losses of more than 2 percent. While Berger Paints was flat Asian Paints gained 0.7 percent on the NSE trading at Rs 3022.05.Kansai Nerolac shares gyrated between the red and green. The stock price was last quoting Rs 307.35 per share down 0.15 percent while Indigo Paints sank 2.5 percent into the red to Rs 1455.25.The biggest cause for concern for the paints makers has been the Rs 6000crore capex that Birla Opus has come with. Grasim Industries has tapped major advertising firms to market the product and may also tap into their preexisting distribution network for offerings such as Birla White and UltraTech Cement.Amnish Aggarwal of Prabhudas Lilladher noted that 25 to 30 percent of the paints market belongs to the unorganised sector which will be  easy prey  for Birla Opus to snap up. However even the large established players will feel the brunt of the increased competition.For paint players volume growth as well as margins can be impacted. There could be pressure on profitability as other paint companies increase A P raise spends on distribution and trade incentives.Follow our market blog to catch all the live updatesThe current underperformance of Asian Paints is likely to continue Aggarwal said. The paints major has limited scope to increase prices while margins will see no expansion due to Asian Paints  ongoing capex to develop new vertical. With the high valuation there seems to be little to no room for further growth and therefore no chance for a rerating.Birla Opus aims at a revenue of Rs 10000 crore within three years of commencing fullscale operations. Birla in his speech announced plans to expand the paints business by setting up 120 depots that will reach out to all cities and cover one lakh people by July. By the end of 2024 an additional 50000 people will be covered under the company s plan. Birla intends to replicate the successful distribution model of UltraTech in the paints business.",
    "Grasim Industries is all set to break the status quo in the paints industry with its Birla Opus range of products. Kumar Mangalam Birla will launch the business and inaugurate three facilities at Panipat Ludhiana and Cheyyar.The entry of Grasim Industries into the paints segment is expected to further intensify competition in the sector. In the first half of the current fiscal year 49 percent of Grasim Industries capex outlay of Rs 4900 crore was allocated to the paints business.Grasim announced that it plans on targeting the larger cities first following which it will enter the lowertier markets. The firm in onboarding deals finalising ads signing leases on depots. Grasim is likely to be a bigger threat in terms of a new entrant than players who have announced entry into the paint sector earlier given the group s strong distribution reach in cement and putty because of which Birla Opus in our view will be able to garner a strong distribution reaches in the shortest time  InCred Equities said in a December 2023 report.The consensus in the market is that Grasim will be faced with an uphill task. Smaller players will definitely feel an impact but Asian Paints is likely to remain unscathed.Follow our market blog to catch all the live updatesInternational brokerage Jefferies noted that while Grasim is eyeing the second spot in the paints market other companies such as JSW Paints and Astral are consistently spending around 1520 percent on marketing to increase their market share and firm up their presence. While success is not guaranteed the sheer magnitude of this investment by Grasim will likely push the new competitor to adopt an aggressive stance to ramp up  said Jefferies. The steps could be higher discounts promotions for dealers or even painters which would impact the industry s overall profitability.At 9.45 am shares of Asian Paints were trading almost 2 percent lower on the NSE at Rs 2949.8 apiece. Over the past six months shares have fallen more than 7 percent as compared to a 14 percent rise in the frontline index Nifty 50.Jefferies retained its  underperform  rating on Asian Paints as the counter has a perplexing valuation of 55x oneyear forward PE and has not risen much over the past two years. The target price of Rs 2500 implied a 17 percent discount from the current market price.According to Amnish Aggarwal of Prabhudas Lilladher the paints sector has witnessed the entry of multiple players including MNCs. While speaking to CNBCTV18 Aggarwal said that Grasim has already allocated a significant investment towards this sector with a capex of Rs 6000 crores by the end of the December quarter. This substantial investment has the potential to exploit distribution channels such as Birla White and Ambuja and gain a significant market share as nearly 2530  of the industry is still unorganised.Although this move by Grasim may not force big market players out of business it could put pressure on their profitability if they try to invest in distribution and advertising. Aggarwal believes this development is expected to bring interesting times ahead for the paints industry for the next 1215 months a situation that has not been witnessed in the past 2040 years in the industry.",
    "With two key events  the Union Budget and the Federal Reserve s monetary policy meeting out of the way investors will shift focus back to earnings and company fundamentals to choose and invest in quality stocks.Company fundamentals valuations and growth forecasts are likely to play a greater role in investors  stock selection. Here are seven stocks that still offer solid upside potential of over 30 percent with reasonable valuations and robust growth outlook.Adani Enterprises   CMP  Rs 3153Cantor Fitzgerald has a buy call with a target price of Rs 4369The flagship firm of the Adani Group has started to regain investor confidence after the apex court cleared the air for the company. Experts suggest that riskreward is in favour of the investors at current levels and the company is the most reliable for bringing energy resources into India ( this needs to be attributed). Its current valuation is largely driven by three main segments namely airports roads and its new energy ecosystem. Adani Enterprises shares have jumped over 43 percent in the past three months.HDFC Bank   CMP  Rs 1466CLSA has a buy call with a target price of Rs 2025Notwithstanding nearterm concerns over strain on the lender s net interest margin and sluggish deposits post its megamerger HDFC Bank s sharp slump in January has turned its valuations attractive. Analysts say that concerns over deposits and NIMs are an overall industry snag and not specific to HDFC Bank. Moreover analysts see the lender as a longterm growth story with the potential to sail through the nearterm headwinds as its merger settles down. HDFC Bank has delivered marginally negative returns in the past three months.PVR Inox   CMP  Rs 1434HSBC has a buy call with a target price of Rs 2140After a rather dull 2022 for Bollywood the multiplex company is gradually getting back on its feet. Analysts see light at the end of the tunnel and believe that the content pipeline in CY25 will improve. Global brokerage firm HSBC said that the business fundamentals have stabilised and most concerns are transient. Elara Securities said the company s concerns were overdone adding that PVRInox has a healthy outlook in the medium term. PVR Inox has fallen nearly 10 percent in the past three months.SBI Life Insurance   CMP  Rs 1432BNP Paribas has an outperform rating with a target price of Rs 2450The life insurer is one of the best bets out there in the insurance space. The company anticipates clocking in robust industrybeating growth in the medium term with solid VNB margins that are likely to stick around 28 percent for FY24. Brokerages are also buying into the management s bullishness as they expect SBI Life to show margin resilience. The cherry on the cake is the stock s underperformance in the past three months leaving room for a stronger comeback. The stock has gained 7 percent in the past three months underperforming the benchmark Nifty s 15 percent gains.Cyient   CMP  Rs 1939Morgan Stanley has an overweight call with a target price of Rs 2700Analysts at Morgan Stanley suggest a robust fourth quarter amid demand visibility in key verticals such as connectivity and aerospace. In the previous quarters communications bottoming out was a positive for the analysts who are of the view that the strong performance from different verticals has made the outlook promising. Cyient shares have surged 17 percent in the past three months.Asian Paints   CMP  Rs 2929HSBC has a buy call with a target price of Rs 4020After a stellar OctoberDecember quarter analysts see the growth outlook as strong and expect price wars to stabilise in the coming quarters. HSBC believes that fears of competitionbased prices are exaggerated. As for the rural demand the monsoon coupled with an uptick in government spending and moderating inflation is likely to bring in positivity for the rural economy. Asian Paints has lost 0.4 percent in the past three months.Sunteck Realty   CMP  Rs 470YES Securities has a buy call with a target price of Rs 586In recent years Sunteck Realty has showcased an impressive track record of acquiring projects and ramped up its execution capabilities. A strong balance sheet strong upcoming cash flow and a consolidating market make management optimistic about doubling its underexecution pipeline to Rs 600 bn in 3 years making the stock a favourite among analysts. Meanwhile current valuations also make the riskreward favourable for Sunteck Realty with new project additions being the key growth drivers. Shares of Sunteck Realty are up 7 percent in the past three months.",
    "KR Choksey s research report on Asian PaintsFor Q3FY24 APNT reported revenue of INR 91031 Mn a growth of 5.4  YoY  7.4  QoQ. Revenue was in line with our estimate. For 9MFY24 revenue grew by 4.1  YoY to INR 267640 Mn. Q3FY24 growth was supported by the extended festive season however there was some relative moderation in demand in the latter part of the quarter. APNT saw some recovery in the rural markets. Gross margin expanded by 504 bps YoY  24 bps QoQ in the quarter as raw material prices saw further deflation of 0.2  QoQ. The gross margins inched up despite a 1.3  price decrease taken in the portfolio. In 9MFY24 the gross margin expanded by 595 bps YoY. EBITDA for the quarter grew by 27.6  YoY  19.8  QoQ to INR 20561 Mn and was 3.1  higher than our estimate due to lower employee and other expenses. EBITDA margin expanded by 393 bps YoY  234 bps QoQ to 22.6 . EBITDA margin expansion was driven by material cost softening growth in luxury products and operating sourcing and formulation efficiencies. For 9MFY24 EBITDA grew by 34.1  YoY to INR 58936 Mn while EBITDA margin expanded by 492 bps YoY to 22.0 . PAT for the quarter was at INR 14477 Mn reporting a growth of 35.0  YoY  20.1  QoQ. PAT was 2.7  higher than our estimate flowing down from the higher EBITDA. PAT for 9MFY24 grew by 46.3  YoY to INR 42035 Mn. While there were no exceptional items for the quarter or comparable quarters on a 9MFY24 basis growth in Adj. PAT was 45.1  YoY.OutlookWe make small adjustments to our FY24E  FY25E EPS of  1.1   1.3  respectively as we factor in the strong margin performance in Q3FY24 but reduce our revenue assumption slightly. We introduce our FY26E estimates. We expect Revenue  EBITDA  Adj. PAT to grow at 10.0   14.6   15.4  CAGR respectively between FY2326E. The share currently trades at 54.4x  52.4x  47.5x FY24E  FY25E  FY26E Adj. EPS respectively. Since our last report the share price has increased by 5.6 . We roll over our valuation to FY26E and apply a P E multiple of 52x (earlier 55x on FY25E EPS) on FY26E EPS of INR 66.5 to arrive at a target price of INR 3460 (INR 3365 earlier)  an upside potential of 9.4 . Accordingly we maintain our  ACCUMULATE  rating on the shares of Asian Paints Ltd.For all recommendations report click here",
    "Motilal Oswal s research report on Asian PaintsAsian Paints (APNT) reported a volume growth of 12  YoY in 3QFY24 (est. 13 ) characterized by doubledigit expansion in both rural and urban markets. The revenue growth is supported by an extended festive season. However it has been sluggish due to price reductions and unfavorable mix (low mix of luxury segment). Benign raw material prices continue to drive gross margin. APNT clocked a gross margin of 43.6  the best in the last 11 quarters. The gross margin in FY25 FY26 will be the key monitorable considering the changing competitive landscape and dwindling raw material price benefits. EBITDA reported a beat led by a higherthanexpected gross margin improvement. EBITDA surged 28  YoY during the quarter. APNT achieved a 22  EBITDA margin in 9MFY24. However management reiterated its EBITDA margin guidance of 1820  in the medium term. We model a 21.5  margin for FY25 FY26.OutlookWe believe valuations are expensive at  53xFY25E EPS and 48xFY26E EPS especially considering the uncertain competitive pressure. We reiterate our Neutral rating with a TP of INR3340 (based on 50x Dec 25E EPS).For all recommendations report click here",
    "Sharekhan s research report on Asian PaintsAsian Paints  (APL s) Q3FY24 performance beat expectations with PAT growing 35  yoy to Rs. 1475 crore driven by a 393 bps yoy rise in OPM to 22.6 . Decorative paint volume growth improved to 12  from 6  in Q2 due to shift of festive season. Volume growth to remain in doubledigits in Q4 while value growth will remain lower due to a change in mix. 9MFY24 OPM stood at 22   management retained 1820  OPM guidance for near term.OutlookStock trades at premium valuation of 52x and 47x its FY2025E and FY2026E EPS. Premium valuations and risk of heightened competition on margins keeps riskreward unfavourable. We maintain Hold with a revised PT of Rs. 3490.For all recommendations report click here"
]