[
    "Generative AI is evoking strong interest from clients and there is a huge mobilisation of GenAI within Infosys as well CEO Salil Parekh has said asserting that he does not foresee any layoffs in his company on account of these newage technologies.On the USD 3.9billion GST tax demand Parekh said Infosys has already given out updates and made disclosures in the market (through BSE filing) and has no further update to share. We have no new update. The status is as it was in terms of what we shared externally a few days ago  Parekh said when asked if the company will be making provisions for the same given the demand in back taxes dating back several years.In an interview to PTI Parekh said there is a huge reception from clients on Generative AI and likened it to the adoption curve seen for digital and cloud technologies in the past.Parekh believes GenAI adoption will increase with time as enterprises experience the benefits and business outcomes arising from it. So we think this will accelerate as time goes on but we will waitandwatch how it develops. It is a bit like some years ago we started with digital or with cloud... these things startoff in a certain way... and then we see what benefits clients are getting. If they see benefits are substantial more and more adoption will happen  he said.It is pertinent to mention that Infosys  like its Indian and global peers  has been strengthening its AI play.Infosys earlier this year had said it is working on 225 Generative AI programs for clients and that over 250000 employees have been trained in the areas of generative AI.Parekh does not expect the advent of GenAI to lead to any layoffs in the company. Even for businesses overall GenAI is addressing newer areas say by finetuning credit analysis that may allow a bank to broaden its product offering bringing new revenue opportunity and productivity benefits. So at this stage my sense is that the technology will help business to grow even further as opposed to anything else. We don t see any layoffs in Infosys with these newage technologies and in fact we continue to increase our recruiting as the economic environment changes... as you saw in Q1 we had a strong growth quarteronquarter and yearonyear we have a very good large deals win number. And with that we increased our guidance. So we see growth slowly coming back  Parekh pointed out.Parekh noted that Gen AI has become  very critical  and that clients are looking at ways to leverage large language models for business benefits in areas ranging from software development to customer services. Infosys is seeing substantial benefits that clients can achieve on this according to him. The third area is when clients have knowledgeobjects whether it is in say a bank s credit department in a manufacturing company in product elements or what products to use or in a telco in say pricing of their programmes...anywhere there are knowledge elements and objects and ways to leverage them in more efficiently... generative AI becomes very useful  Parekh said.Infosys does not offer a specific breakup of revenue coming in from Generative AI work. Parekh further said there has been a huge mobilisation for Generative AI within Infosys which is focused on making itself an AIfirst entity.Infosys has invested in and scaled its digital reskilling program globally to include the latest courses on generative AI and its latest annual report points out that today the company s platforms are also enhanced with generative AI aspects.Infosys  bets on GenAI comes at a time when generative artificial intelligence s meteoric rise globally has spurred excitement.As per Deloitte technology trends 2024 report released in April this year GenAI is revolutionising operations and enhancing customer experiences across sectors such as healthcare retail education and agriculture.India s GenAI market is projected to achieve a compound annual growth rate (CAGR) of over 24.4 per cent from 2023 to 2030 according to the Deloitte report which also notes that is India poised to emerge as a global leader in AI innovation leveraging GenAI to drive inclusive progress and sustainable development.As such companies cutting across various industries are today keen to use generative AI tools to solve business challenges automate repetitive tasks customise and personalise customer interactions squeezing more out of sales and marketing efforts code generation and enhancing enterprise and organisational efficiencies.In fact Infosys Chairman Nandan Nilekani in Infosys  latest annual report penned a note on  What s next for the generative AI revolution  where the industry veteran emphasised that gen AI revolution presents an  unrivaled opportunity  and that the flux of change with the whole technological landscape being reset will create many large openings. We are into the second year of the generative AI revolution and some clarity is beginning to emerge from the noise and babble of the last 18 months. The initial hyperventilation of AI  doomerism  and the risk of human extinction by AI advances like Artificial General Intelligence (AGI) has quietened down  Nilekani wrote in the Infosys annual report.At present Infosys  work in AI and generative AI is available to its clients through Infosys Topaz.The Bengaluruheadquartered company is working on several client projects in software engineering process optimisation customer support advisory services as well as sales and marketing.        ",
    "After two acquisitions this year India s secondlargest IT services company Infosys is on the lookout to scoopup more firms and says the acquisition matching scale of recent intech buy is certainly a possibility.In an interview to PTI Infosys CEO Salil Parekh said the company is keen on acquisitions in areas like data analytics SAAS and may look at some geographies within Europe and the US.Asked if more acquisitions could be of the scale matching intech which came with a pricetag of 450 million euros Parekh said  Absolutely I think those would be the size that we will look at in terms of scale and given our structure we could do a few of those.  Back in January Infosys announced a definitive agreement to acquire 100 per cent of the equity share capital in InSemi Technology Services a semiconductor design services company headquartered in India for a consideration (including earnouts and management incentives and retention bonuses) totalling up to Rs 280 crore.A bigger acquisition followed in three months.In April Infosys Germany a whollyowned stepdown subsidiary entered into a definitive agreement to acquire 100 per cent of the equity share capital in intech Holding  leading provider of engineering R D services headquartered in Germany  for a consideration of up to 450 million euros (about Rs 4045 crore). ...we have very good business in engineering services already within Infosys and then we did those two acquisitions both of them in engineering services one on semiconductor side and one on the automotive side... very strong businesses and we feel quite good about expanding that footprint  Parekh said.Infosys is eyeing more acquisitions he said adding that the company is evaluating several firms. ...we have a good balance sheet and good cash generation and now we are quite comfortable with the integration of acquisition in different areas. We have done engineering services we will look at other areas... for example data analytics... may look at SAAS (software as a service) areas and maybe at some other geographies in Europe maybe the US as well  he said.Parekh however said a lot depends on strategic synergies financial cost cultural fit and integration aspects. We are continuing to look and we have things that are normally in the pipeline but those take their own time... there are a lot of discussions on strategic fit on financial cost of it and cultural fit into the company and then how will we integrate them. Many of those discussions are ongoing and we will see what comes out  the Infosys top honcho said.On whether he is hopeful of closing more acquisitions this fiscal year Parekh indicated that it is tough to put a timeline on the outcome of ongoing discussions. It is difficult to say... we are evaluating several (of them). But to get a fit on the strategic parameters financial parameters culture integration... all of it may not work out. But these two (InSemi and intech) happened relatively quickly... before that for some quarters we had not done anything. It is not a predictable thing but the evaluation is ongoing  he said.According to the Grant Thornton Bharat Dealtracker Q2 2024 report Indian dealmaking saw overall 501 deals valued at USD 21.4 billion. The report said the second quarter of 2024 witnessed the highest quarterly volumes since the second quarter of 2022 while values declined due to the absence of bigticket merger and acquisition transactions.Grant Thornton Bharat Dealtracker further said the merger and acquisition (M A) activity during the second quarter saw 132 deals worth USD 6.2 billion marking a slight increase in volumes but a substantial 50 per cent drop in values.As per the report domestic deals drove growth with volumes rising 29 per cent and values increasing 2.5 times compared to the first quarter of the current year. In contrast crossborder deals experienced a decline with volumes decreasing 24 per cent and values plummeting 85 per cent from the first quarter of 2024.        ",
    " India is likely to retract its demand that Infosys pay  4 billion in back taxes after weeks of lobbying by the IT giant and an onslaught of criticism from the software services industry said two government sources with direct knowledge of the plan.Authorities last month ordered Infosys to pay the additional amount arguing that its overseas offices should pay goods and services tax (GST) dating back to 2017.The country s tax investigation unit followed prevailing regulations in sending out the notice to Infosys but the federal finance ministry now believes the notice is against India s broader tax principle of not taxing services exports one of the sources said.The sources declined to be identified as a formal decision has yet to be made. India s finance ministry and Infosys did not reply to Reuters requests for comment.Tax notices worth more than  1 billion combined to 10 foreign airlines operating in India including Etihad and British Airways will also likely be made redundant as the issue is similar said the source.The GST Council comprised of state finance ministers and chaired by the federal finance minister will probably make a formal decision on Sept. 9 said a second source.Former Infosys board member and chief financial officer Mohandas Pai has called the tax notice  outrageous  and  a case of tax terrorism at its worst. Last week Infosys  executive vice president for finance Sunil Kumar Dhareshwar met top bureaucrats to seek relief arguing the tax demand was not warranted according to a third government source.The National Association of Software and Service Companies an industry lobby group called for government intervention so that the  notices do not create uncertainty and negatively impact perceptions on India s ease of doing business. It also said such tax demands reflect  a lack of understanding of the industry s operating model. Earlier this month the Indian government ordered tax officials to seek directions from the administration before pursuing cases over widely prevalent industry practices so that  ease of doing business  can be maintained and litigation avoided.Other recent key decisions that Prime Minister Narendra Modi s government has walked back on after criticism include a new property tax which has now been eased and efforts to recruit private experts to senior government positions as the advertisements did not have affirmative action categories for lower castes.        ",
    "The Centre is likely to give GST relief to Infosys foreign shipping lines and foreign airlines CNBCTV18 reported on August 22. The report said that the government is mulling to introduce changes on June circular in the forthcoming GST council which is scheduled for September 9 next month.The report said that the Centre feels that the service sector needs clarity in GST and ease of doing business as well. The report also added that DGGI had recently sent notices to India s second largest IT company along with many foreign airlines.On August 6 the Directorate General of Goods and Services Tax Intelligence (DGGI) had issued showcause notices to 10 foreign airlines including British Airways Lufthansa and Emirates for allegedly not paying Rs 10000 crore in taxes an Economic Times report said. The notices pertained to unpaid taxes on the import of services by Indian branches from their head offices.According to a PTI report the 54th Meeting of GST Council is likely to take up matters regarding reducing tax slabs rate rationalisation besides removing duty inversion under GST.After the June 23 meeting Union Finance Minister Nirmala Sitharaman had said in  the next meeting of the GST Council the Group of Ministers (GoM) on rate rationalisation under Bihar Deputy Chief Minister Sumant Chaudhary will give a presentation on the status of the work and aspects covered by the panel and work pending before the panel. The buzz around easing the  related party transaction  clause under the GST for foreign companies in India has been doing the rounds.   had earlier reported about the government plans where foreign airlines and shipping lines are likely to be exempted from paying GST at the time of import of services but which they can pay at the time of disbursal of services.Meanwhile a Bloomberg report the Centre s new efforts to resolve tax disputes with major companies has a China angle to it. The report said that analysts have warned that the unusual tax demands   issued with little warning   may hamper India s attempts to lure investment away from China while perpetuating perceptions that the country remains a difficult place to do business.        ",
    "Analysts across brokerage firms are expecting a recovery in the Indian IT sector in the latter half of FY25 as demand and performance stabilise across the board with the first quarter of the current fiscal providing the muchneeded turning point for the segment. Most IT companies have shown improved performance in Q1FY25 indicating a revision in demand and stabilisation of uncertainties in major global economies  stated Axis Securities in a report.This sentiment echoed across the industry with deal wins and the adoption of emerging technologies like AI and IoT driving the sector s rebound.Despite subdued discretionary spending especially in segments like telecommunications and hitech analysts have a positive outlook on the sector. Further analysts are optimistic about the strength of the pipeline even as the outlook for immediate growth remains tempered.Ajit Mishra Senior Vice President of Research at Religare Broking had told   that while shortterm volatility may persist the IT sector is expected to maintain a positive tone.Follow our live blog for all the market actionMishra believes that US election results and the resolution of recession concerns would bring clarity on demand in the BFSI sector and other IT services. The BFSI segment saw modest growth in Q1 FY25 with expectations for further improvement as FY25 progresses.In line with this JM Financial said  BFSI revenues and professional services grew in 2QCY24  signalling the end of a deceleration phase that had weighed heavily on IT services.Mixed MarginsMargin performance was a mixed bag in the June quarter. For instance while Wipro managed to expand margins through strong execution Tech Mahindra s margins remained in recovery mode.Although pressure from wage hikes and rising onsite costs was evident the easing of supplyside constraints offered hope for improvement.  The attrition rate has declined reflecting some easing in supplyside constraints which is expected to support improved operating margins for IT service companies  stated the Axis Securities report.Technical Signals Point to StrengthKushal Gandhi Technical Analyst at StoxBox also maintained a positive outlook for the IT sector recommending investors to hold their positions. He pointed out that the IT sector showed resilience despite a 33 percent correction following a 250 percent surge from Covid19 lows. According to Gandhi the recent breakout signals the start of a stage two uptrend.Also Read   Nifty Pharma climbs to alltime high  rises 10  in past one monthEyes on Jackson Hole SymposiumInvestors are eyeing the upcoming Jackson Hole symposium this week where Fed Chair Jerome Powell is expected to hint at the possibility of a rate cut in September. In a research report Nuvama mentioned that a potential Fed rate cut in September could lead to more positive management commentaries.Rishubh Vasa Research Analyst at Indsec Securities and Finance was cautiously optimistic about the sector. He told    A potential Fed rate cut could boost discretionary spending and deal flow for IT companies. Indian IT companies generate the majority of their revenues from outsourcing deals with US companies. Once macroeconomic conditions improve the sector is wellpositioned for a strong Vshaped recovery as per the Axis Securities report.On August 21 the Nifty IT index ended its sevenday winning streak. The IT index dropped 0.4 percent weighed down by declines in TCS Tech Mahindra and HCL Tech which fell between 0.4 to 1 percent. Tech Mahindra was the hardest hit among the IT stocks after CLSA downgraded the stock to  hold  due to concerns over stretched valuations.",
    "Indian IT stocks surged on August 16 leading a broader market rally as robust US economic data eased recession fears. The Nifty IT index climbed by 2.5 percent outperforming the 12 other major sectoral indices. TCS Infosys and Wipro led the gains in the IT index.August 16 marked the fifth day of gain for the Nifty IT index. At 1.40 PM Nifty 50 IT companies  Infosys HCLTech TCS Tech Mahindra LTIMindtree and Wipro  had risen between 1.53.6 percent. Meanwhile midcap IT stocks like Persistent Systems Coforge L T Technology Services and Mphasis posted even stronger gains trading 27 percent higher.The surge in IT stocks after the US s strong retail sales low jobless claims and benign consumer price inflation allayed recession concerns. The US market crucial for Indian IT companies due to the significant revenue they derive from the region saw the techheavy index Nasdaq Composite rise over 2 percent on August 15 further boosting sentiment in Indian markets.Follow our live blog for all the market actionThe upbeat sentiment was echoed by Kotak Institutional Equities which noted in its recent research report that  1QFY25 results provided positive evidence of modest recovery in outsourcing (IT services) and consumption.  The report said that there was an improvement in the IT services sector which had been a laggard in previous quarters.However Kotak also pointed out that the Indian market remains a mixed bag in terms of valuations.  We do not find much value in the Indian market with parts of the market trading at (1) fair valuations (financials) (2) full valuations (consumer healthcare IT services pharmaceuticals) and (3) frothy valuations (investment most PSUs)  the report said. Despite this the IT sector s modest beats in Q1 earnings have attracted investor attention.Also Read   Nifty IT index shines with 1.5  surge  TCS Infosys HCLTech lead gains in IT packKotak said  1QFY25 results and management commentary highlighted modest improvement in the laggard sectors of IT services and consumer staples.  This modest improvement restored investor confidence in IT stocks which had been under pressure due to global economic uncertainties.Analysts believe that positive U.S. economic data and recent earnings reports indicate the worst may be over for the IT industry.",
    "The benchmark indices closed flat with a positive bias after a volatile session on August 14. The market breadth was negative with about 1546 shares declining against 804 advancing shares on the NSE. According to experts the Nifty 50 is likely to march towards the 2430024500 zone if it manages to hold above 24100 in the coming sessions. However breaking below 24100 could drag it down towards the 2400023900 zone. Here are some trading ideas for the near term Hardik Matalia Derivative Analyst at Choice BrokingBajaj Healthcare   CMP  Rs 418.45Bajaj Healthcare presents a promising buying opportunity having experienced a breakout from a consolidation range on the daily chart. The price has been supported by strong trading volumes indicating strength in the move. If the price holds above Rs 420 it is likely to advance further towards a target of Rs 460. The Relative Strength Index (RSI) is at 66.91 and trending upward indicating increased buying momentum. Additionally Bajaj Healthcare has rebounded from key moving averages including the shortterm (20day) EMA mediumterm (50day) EMA and longterm (200day) EMA levels signaling a bullish outlook. Based on these technical indicators a long position in Bajaj Healthcare at Rs 418.45 is recommended.Strategy  BuyTarget  Rs 460StopLoss  Rs 398LT Foods   CMP  Rs 313.1LT Foods is currently trading near its alltime high at Rs 313.1 forming higher highs and higher lows on the daily chart. The stock has created a strong bullish candle supported by high trading volumes indicating a continuation of the uptrend. LT Foods recently bounced from its support zones and if it maintains its position above Rs 315 it could move further towards an upside target of Rs 340. The RSI is currently at 68.1 with a positive crossover indicating increased buying momentum. Moreover LT Foods is trading above its key moving averages confirming the strength of the current uptrend. Investors might consider buying on dips with a stoploss set at Rs 300 to manage risk. The target price of Rs 340 aligns with resistance levels and offers a favourable riskreward ratio making this a promising trading opportunity.Strategy  BuyTarget  Rs 340StopLoss  Rs 300Cholamandalam Financial Holdings   CMP  Rs 1569.5Cholamandalam Financial Holdings is on the verge of breaking out of a consolidation range. This potential breakout is supported by notable trading volumes indicating strength in the upward move. The stock has formed a strong bullish candle on the daily chart reinforcing the uptrend. There is potential for further upward movement with a target of Rs 1700. On the downside significant support is observed around the Rs 1510 level. The RSI is currently at 62.2 with a positive crossover indicating increased buying momentum. Additionally Cholamandalam Financial has bounced from its shortterm (20day) EMA levels signaling strong support at these levels. In summary based on the technical setup and indicators (RSI and moving averages) buying Cholamandalam Financial at Rs 1569.5 levels is advisable.Strategy  BuyTarget  Rs 1700StopLoss  Rs 1510Shitij Gandhi Senior Technical Research Analyst at SMC Global SecuritiesAGI Greenpac   CMP  Rs 850.8In recent times AGI Greenpac witnessed a smart recovery from Rs 640 levels surpassing its 200day EMA with momentum towards Rs 900 within a short span of time. However due to profit booking the stock once again saw a pullback towards its 200day EMA and took support around Rs 750 levels. Currently it has given a breakout above the Cup   Handle pattern on daily charts. Therefore one can buy hold or accumulate the stock for an expected upside to Rs 10001020 levels with a downside support zone of Rs 840820 levels.Strategy  BuyTarget  Rs 1000 Rs 1020StopLoss  Rs 760ICICI Securities   CMP  Rs 805.65ICICI Securities has been consolidating in a broader range of Rs 700800 for nearly the last four to five months with prices holding well above its 200day EMA. This week a fresh breakout was observed above its key resistance level of Rs 800 after a prolonged consolidation phase. Followup buying is expected as positive divergences on secondary oscillators point towards further upward movement. Therefore one can buy hold or accumulate the stock for an expected upside to Rs 900905 levels with a downside support zone of Rs 800790 levels.Strategy  BuyTarget  Rs 900 Rs 905StopLoss  Rs 740Amol Athawale VPTechnical Research at Kotak SecuritiesL T Technology Services   CMP  Rs 4916.85Post a shortterm correction from higher levels L T Technology Services  downward momentum stopped around its support area. On daily charts the counter has formed a reversal pattern at its important demand zone. The structure suggests a revival of the uptrend from the current levels in the near term.Strategy  BuyTarget  Rs 5250StopLoss  Rs 4740Sun Pharmaceutical Industries   CMP  Rs 1741.65After a remarkable up move Sun Pharmaceutical Industries has been consolidating for the last few sessions. The rangebound structure suggests a bullish continuation chart formation. Moreover the stock comfortably closed above its shortterm moving average indicating that the uptrend is likely to resume in the near horizon.Strategy  BuyTarget  Rs 1860StopLoss  Rs 1680Jindal Steel   Power   CMP  Rs 929.75After hitting highs of around Rs 1090 the counter plunged due to supply pressure. However Jindal Steel   Power has found support near its demand area. Additionally the formation of a Bullish Engulfing candlestick pattern with rising volume suggests a strong reversal in the counter from the current levels.Strategy  BuyTarget  Rs 990StopLoss  Rs 898Kunal Kamble Senior Technical Research Analyst at Bonanza PortfolioInfosys   CMP  Rs 1823.25Infosys has completed subwave 4 and subwave 5 has just begun indicating a continuation of the impulsive move. The security has closed above the falling window which also suggests bullishness. The declining volume during the fall indicated a retracement while higher volume today signifies increased buyer interest. The price is trading above both the 20day EMA (Fast) and the 50day EMA (Slow) with the EMAs trending upward signaling a potential upward move. Additionally the RSI after a period of cooling off is moving in a northern direction supporting the price action.Strategy  BuyTarget  Rs 2020StopLoss  Rs 1720Tata Consultancy Services   CMP  Rs 4295.25TCS is riding subwave 5 of subwave 3. The security has managed to close above the falling window that was acting as resistance. The increase in volume on buying days indicates strong buyer interest in the stock. Additionally the price has taken support from the Base Line and has closed above the Conversion Line which signals an uptrend. The upward movement of the RSI further supports the positive price action. Based on this technical setup a long position in TCS can be established.Strategy  BuyTarget  Rs 4550 Rs 4570StopLoss  Rs 4140Marksans Pharma   CMP  Rs 214.33On the daily timeframe Marksans Pharma has broken out to new alltime highs signaling a continuation of the uptrend. The security closed near its highs indicating strong buyer interest. The increase in volume supports this price action suggesting that buyers are keen on the security at the current market price (CMP). The price is trading above both the base line and the conversion line reinforcing the uptrend. Additionally on the directional front the DI  (directional indicator) is above the DI indicating an uptrend while the ADX (average directional index) above the DI shows strength in the upward movement.Strategy  BuyTarget  Rs 273StopLoss  Rs 185Rane Madras   CMP  Rs 1004.85Rane Madras has closed above resistance for two consecutive days with increasing volume indicating a buying opportunity. The price is trading above both the Base Line and the Conversion Line signaling an uptrend in the security. Additionally the RSI moving upward supports the positive price action. The DI  is above the DI indicating an uptrend and the ADX trading above the DI suggests strength in the upward movement. Based on this technical setup a buying opportunity is present.Strategy  BuyTarget  Rs 1200StopLoss  Rs 905Chandan Taparia Senior Vice President   AnalystDerivatives at Motilal Oswal Financial ServicesICICI Lombard General Insurance Company   CMP  Rs 1977.95ICICI Lombard has formed a rising three candle pattern on the daily scale which is a bullish continuation pattern. It is on the verge of giving a breakout on the daily chart. The stock has also bounced back up from its 20day EMA indicating bullish sentiment.Strategy  BuyTarget  Rs 2100StopLoss  Rs 1910Havells India   CMP  Rs 1845.95Havells has given a falling supply trendline breakout on the daily chart and is holding well above the same. It is trading above all crucial moving averages which has bullish implications.Strategy  BuyTarget  Rs 1950StopLoss  Rs 1800Vidnyan S Sawant Head of Research at GEPL CapitalHCL Technologies   CMP  Rs 1626.15HCL Technologies is forming higher tops and bottoms on the monthly scale indicating a bullish price structure. On the weekly scale the stock has shown a robust upward trajectory with a 15week correction being retraced in just 8 weeks. Notably on the daily scale the stock appears poised to break out of a Cup and Handle bullish chart pattern further supporting an optimistic outlook. The stock continues to trade above the key 12week and 26week EMAs with the weekly RSI above 60 reinforcing the bullish momentum. Looking ahead there is potential upside for the stock with a target of Rs 1950.Strategy  BuyTarget  Rs 1950StopLoss  Rs 1490Uno Minda   CMP  Rs 1107Uno Minda maintains a bullish trend on the higher timeframe. On the weekly scale the stock has demonstrated strong resilience indicating a robust price structure. On the daily scale it has experienced a bullish mean reversion from the 100day EMA. The stock continues to hold above key moving averages including the 12week and 26week EMAs. Additionally the MACD (Moving Average Convergence Divergence) momentum indicator is trending higher signaling a positive trend supported by sustained bullish momentum. Looking ahead there is potential upside for the stock with a target of Rs 1322.Strategy  BuyTarget  Rs 1322StopLoss  Rs 1013Jubilant Foodworks   CMP  Rs 637.45Jubilant Foodworks has demonstrated a strong price structure forming a large base indicative of an accumulation phase. In July 2024 the stock broke out from a significant level confirming robust momentum and setting the stage for a potentially strong upward trend. Regarding indicators the MACD is showing a positive trend with higher bases and remains above the zero line indicating accelerating momentum. Additionally the trend indicator has broken out of a sloping trend line extending from 2018 reinforcing the potential for substantial price growth. Looking ahead the stock appears poised for further gains with a target set at Rs 780.Strategy  BuyTarget  Rs 780StopLoss  Rs 587Federal Bank   CMP  Rs 202.73Federal Bank from the banking sector has shown robust price stability and bullish momentum across timeframes. On the weekly scale the stock continues to form higher tops and higher bottoms confirming a bullish trend. It is comfortably trading above key averages including the 12 26 and 50week EMAs. Additionally the MACD is trending upward and the RSI above 70 further reinforces the bullish trend backed by strong momentum. Looking ahead there is a potential upside for the stock with a target of Rs 237.Strategy  BuyTarget  Rs 237StopLoss  Rs 185",
    "Hyderabad has quietly overtaken Chennai to become Nasdaqlisted Cognizant s largest global centre signalling an important shift in the IT firm s focus within India.People familiar with the development told   that Cognizant s Chennai headcount is currently in the 5500056000 range. At the same time Hyderabad has grown to over 57000 employees and is growing faster partly driven by a larger business process outsourcing (BPO) presence in the city.While a thousand here and there could shift things by a quarter or two the recent announcement by Telangana Chief Minister Revanth Reddy and Cognizant chief executive Ravi Kumar assumes significance.Cognizant will lay the foundation stone for its new 10 lakh square feet campus on August 14. The company has announced adding another 15000 seats in Hyderabad thus giving it a definitive edge and pipping Chennai.  has sent queries to Cognizant. This story will be updated when they respond.Winds of changeJayesh Ranjan Telangana s Special Chief Secretary for the Department of Information Technology Electronics   Communications (ITE C) and Department of Industries   Commerce told   that while Chennai was indeed an attractive destination for IT companies to set up their India centres a few decades ago that aura has dimmed. Unfortunately the agility that other cities have shown particularly Hyderabad in improving infrastructure focussing on skill development and being proactive in making the global MNCs feel welcome hasn t been displayed by Chennai. It comes as no surprise then that Cognizant has now chosen to make Hyderabad their largest centre anywhere in India  Ranjan said in a statement to  . It won t surprise me at all if Hyderabad in days to come becomes Cognizant s largest footprint in the world also. They have had a great experience in Hyderabad and we the Government are committed to help them further thrive and flourish  he added.Kamal Karanth the cofounder of staffing specialist firm Xpheno told   that a combination of sophisticated infrastructure enterprisefriendly policies incentives and interventions have set Hyderabad on the fast track to becoming one of the top choices for global enterprises. A strong talent pull is evident with over 1.8 million jobseekers from other states stating Hyderabad as a preference to move in.  The city is best poised for new expansion and capacity creation plans of large players in the IT sector  Karanth said. Shift in centre of gravityIn 1994 when market research firm Dun   Bradstreet chose Chennai over Bengaluru to establish its inhouse technology centre it underscored the city s potential as a technology services hub.The captive unit would go on to become Nasdaqlisted Cognizant which today competes with Indian rivals such as Tata Consultancy Services (TCS) Infosys and Wipro.For three decades Chennai remained the centre of gravity for Cognizant with its headcount going from zero in 1994 to more than 65000 by mid2022.When the company expanded its office in Navalur in July 2022 it had over 81000 in Tamil Nadu with over 16000 in Coimbatore.As a result it became one of the largest employers in Tamil Nadu.But not anymore.Things changeIn the last two years Cognizant s global headcount has been coming down with every passing quarter. The company s headcount was 355300 globally and 258400 in India at the end of December 2022.By end of June 2024 the company s global headcount was 336300 a drop of 19000 professionals. A good portion of this drop was in India. Chennai bore the biggest brunt as the company has been selling off many of its fullyowned campuses in the city.From  2 million in revenues in 1994 to over  19 billion in 30 years the company has been synonymous with Chennai all these years. To be sure the only other Chennai based company that has reached a billion dollars in revenue in the IT services and SaaS space is Zoho at a little over  1 billion last year.        ",
    "Infosys a key player in the Indian IT sector has recently encountered a wave of downgrades despite reporting positive financial results for the AprilJune quarter. The company has seen its stock rated with  hold  or  sell  calls by 18 out of 36 brokerages that cover the company. The remaining 28 brokerages had a  buy  rating. In the last quarter 33 out of 48 brokerages had a  Buy  call on Infosys while the remaining 15 had a  Hold  or  Sell  call.The looming threat of a global recession combined with rising subcontracting costs and crosscurrency headwinds has cast a shadow over Infosys s operating margins according to Axis Securities. The brokerage expects a rebound in demand as current uncertainties subside over the next two to three quarters which could lead to consistent deal wins for the company.Follow our live blog for all the market actionInfosys reported a revenue increase to Rs 39315 crore for Q1 FY25 marking a 3.7 percent QoQ rise. However the net profit for the quarter fell by 20.1 percent QoQ to Rs 6368 crore largely due to a tax refund boost in the previous quarter. Despite these results Infosys is grappling with several challenges that have led to increased caution among analysts.While there are early signs of recovery in discretionary spending within financial services other verticals face challenges. The manufacturing sector continues to experience pressure and both the retail and energy and utilities (E U) segments are struggling with high interest rates and inflation. Prabhudas Lilladher said  The higher concentration of discretionary in its business mix is causing more volatility to its vertical portfolio.... Also Read   Govt unlikely to relax its Rs 32000crore tax demand on Infosys  ReportInfosys remains optimistic about the first half of FY25 and expects a slowdown in the second half due to furlough impacts in Q3 and Q4. The company reported its highestever free cash flow generation in Q1 FY25 and secured a record 34 large deals. However management has expressed concerns about discretionary spending and slow hiring which could affect future growth. In a conference call the company said that it will continue to assess the sustainability of the positive trend observed in the June quarter.Infosys shares which gained 11 percent and 19 percent in June and July respectively have seen a decline of over 6 percent since August began. As of 10.50 am Infosys shares were down 2 percent at Rs 1756.",
    "Outlook on Indian IT shares has turned cautious as rising unemployment in the US is stoking concerns of a recession there. That spells bad news for Indian IT companies which earn a lion s share of their revenues through outsourcing deals from US companies.The sector had recently regained favour with investors as demand showed signs of recovery and hiring by IT companies picked up in the first quarter. But the cheer appears to have been shortlived as the global economy itself appears to be headed for trouble.On August 5 the Nifty IT index plummeted by 3.3 percent mirroring the turbulence in global markets . Major players in the industry  LTIMindree Tata Consultancy Services (TCS) Wipro Tech Mahindra and Infosys  saw their shares fall by 24 percent.Glass half fullHowever there is a silver lining to the weakness in the US economy. Analysts say recession fears could prompt the US Federal Reserve to cut rates ahead of schedule. With the likelihood of a Fed rate cut in Sep24 rising management commentaries are turning positive too. We expect them to get better  said a note by Nuvama.Long term viewSumit Pokharna VP Research at Kotak Securities feels the current dip in IT shares could be an opportunity for strategic investment given the sector s capacity for recovery.  Our advice has been to be selective with IT stocks. Many largecap IT companies are currently overvalued  Pokharna said.Rishubh Vasa Research Analyst at Indsec Securities and Finance too is cautiously optimistic on the sector. With the possibility of a Fed rate cut on the horizon we could see a boost in discretionary spending and deal flow for IT companies  Vasa said. He points out that despite current fears growth in sectors like retail and healthcare could be positive for the IT sector. Vasa expects the Nifty IT index to consolidate between 37000 and 38500 with a potential rise to 45000 over the next year to 18 months.Historical ResilienceHistorical patterns show that the IT sector has weathered past recessions and emerged stronger. During the Great Recession of 20072009 and the COVID19 downturn in 2020 Indian IT firms faced significant disruptions but ultimately bounced back.Future OutlookPankaj Murarka of Renaissance Investment Managers added another layer of perspective. In an interaction with CNBCTV18 he said that although recent data from the US was weak the underlying economy is robust. A potential rate cut later this year or early next year could stabilise markets while also providing a boost to the IT sector he added.The IT industry a key pillar of the Indian economy contributes approximately 7.7 percent to GDP and is poised to reach 10 percent by 2025 according to 5paisa.com.",
    "The Indian government is not considering any relaxation over the Rs 32000crore tax demand it sent to Infosys Ltd Reuters reported on August 6 citing a government source.The tax demand on Infosys is in accordance to the good and services tax rules and the country s secondlargest IT services firm has sought ten days to submit its response after meeting tax officials the source said.Meanwhile CNBCTV18 reported on August 6 that Infosys had sought 10 days to reply to the preshow cause notice after a meeting with Directorate General of GST Intelligence (DGGI) Bengaluru on August 5.Shares of Infosys which were up 1.6 percent on August 6 before the report amid a broader market rebound trimmed gains to about 0.3 percent after the report.CNBCTV18 reported citing sources that DGGI said preshow cause notice was sent after proper assessment and due diligence.Infosys had made headlines last week after GST authorities slapped a Rs 32403 crore notice on it for services availed by the company from its overseas branches for five years starting 2017. This amounts to 85 percent of its revenue for the quarter ended June 30.The company had described the notice a  preshow cause  notice and categorically maintained that it believes that GST is not applicable on expenses mentioned.Infosys had strongly argued that GST payments are eligible for credit or refund against export of IT services. Infosys has paid all its GST dues and is fully in compliance with the central and state regulations on this matter  the company had contended.Last week apex IT body Nasscom said the latest tax demand reflects a lack of understanding of the industry s operating model and sheds light on sectorwide issues wherein multiple companies are facing avoidable litigation and uncertainty.In a detailed statement issued a day after Infosys  BSE filing on GST  preshow cause  notice Nasscom asserted that government circulars issued based on recommendations of the GST Council must be honoured in enforcement mechanisms so that notices do not create uncertainty and negatively impact perceptions on India s ease of doing business.        ",
    "In the wake of Q1 FY25 s IT company results Nuvama has dialled up its optimism on the sector. The brokerage firm anticipates a growth surge in IT as a potential interest rate cut by the Fed approaches. Nuvama has maintained its  Buy  rating on LTIMindtree Infosys TCS Coforge Persistent Systems Firstsource Solutions and HCLTech while keeping a wary eye on Tech Mahindra and Birlasoft. With likelihood of a Fed rate cut in Sep24 rising management commentaries are turning positive too. We expect them to get better  Nuvama said in a research report. This step by the Fed is likely to drive discretionary spending and bolster the strong deal flow that has persisted over the past two years the brokerage firm added.Follow our live blog for all the market action Q1FY25 results largely outshot our estimates with most companies posting revenue growth above estimates  Nuvama said. Notable performers included TCS Infosys LTIMindtree Persistent and Firstsource the brokerage said. Conversely Cyient LTTS Wipro and Birlasoft lagged behind expectations.The key highlight of Q1 FY25 according to Nuvama was the positive shift in headcount addition  indicative of a broader sector recovery after several quarters of reduction.Most IT companies have either maintained or upgraded their FY25 revenue growth forecasts pointed out Nuvama. Cyient however was an exception.Also Read   Tax row  Nasscom seeks clarity from FinMin after GST demand notice to Infosys other IT companiesDeal Wins and Sector DynamicsDeal flows have been solid across the board although a few companies reported yearonyear declines. Meanwhile Infosys saw a significant uptick in deal wins with a 79 percent yearonyear increase. However Intermarket Surveillance Group s (ISG) deal data suggested a neutral outlook for the IT sector prompting a slight revision of FY25 outsourcing guidance to 2 percent YoY from 3 percent YoY due to the ongoing weakness in BFSI caused by the delayed impact of central bank rate hikes.The BFSI segment did show signs of improvement said Nuvama. While the manufacturing and healthcare sectors sustained their growth momentum the telecom sector continues to struggle. On a geographical scale growth was observed across most regions.",
    "Infosys on August 3 said the Directorate General of Goods and Services Tax Intelligence (DGGI) is closing the preshow cause notice proceedings for the financial year 20172018 worth Rs 3898 crore. On July 31 India s secondlargest IT company received a demand for alleged tax evasion of over Rs 32000 crore from the DGGI. The Company has now received a communication from DGGI closing the preshow cause notice proceedings for the financial year 20172018. The GST amount as per the preshow cause notice for this period was Rs. 3898 Crs  Infosys said in an exchange filing.A DGGI report revealed nonpayment of Integrated Goods and Services Tax (IGST) on services received from the company s overseas branches between July 2017 and 202122. Therefore an amount worth Rs 28000 crore pertaining to FY22 still remains under consideration by the authorities.On August 1 the IT major said that Karnataka state authorities had withdrawn the preshow cause notice it received a day earlier and directed the company to submit further responses to the Directorate General of Goods and Services Tax Intelligence (DGGI) related to the issue.Infosys maintains that it has paid all dues and GST is not applicable on expenses claimed by DGGI.  Infosys has paid all its GST dues and is fully in compliance with the central and state regulations on this matter  the company said in an exchange filing on July 31.A day later the Bengalurubased company said that Karnataka state authorities had withdrawn the preshow cause notice it received on July 31 and directed the company to submit further responses to only DGGI related to the issue.Interestingly Infosys received the preshow cause notice from DGGI soon after the media reported that the Karnataka state GST authorities had issued the notice on the same matter the firm informed the exchanges on July 31.Also read  Nasscom seeks clarity from FinMin after GST demand notice to Infosys other IT companiesThe tax demand made by the authorities generated shockwaves considering Infosys  track record for being one of India s bestgoverned firms.Reacting sharply to the development Infosys  former chief financial officer Mohandas Pai labelled it as  tax terrorism  at its worst.  The finance ministry should immediately intervene. Such tax terrorism impacts investment into India in a big way  Pai who is also the chairman of Aarin Capital told  .Pai s comments reflect the broader concerns within the business community about the potential implications of such highprofile tax demands on investor confidence and business operations in India and for a company that is widely known for its robust compliance framework and strong governance standards.In September 2023 Infosys received a demand for GST totaling Rs 37.75 lakh which was also contested by the firm.Infosys manages the Goods and Services Tax Network (GSTN) portal. GSTN has built the indirect taxation platform for GST to help taxpayers in India prepare file returns make payments of indirect tax liabilities and make other compliances.Also read  Tax terrorism at its worst  Former Infosys CFO Mohandas Pai slams Rs 32000 cr GST demand to IT firmDGGI alleges that Infosys paid consideration to its overseas branch offices in the form of overseas branch expenses. Consequently Infosys might have to pay IGST under the Reverse Charge Mechanism (RCM) on these supplies.Typically the RCM in GST states that the recipient of goods or services is responsible for paying the tax instead of the supplier. The DGGI contends that Infosys included the expenses incurred towards overseas branches as part of their export invoice from India and based on these export values computed the eligible refund.However this process resulted in a significant underpayment of IGST by the Bengalurubased IT firm according to the DGGI.Also read  Explained  Why Infosys received a Rs 32000cr tax demand and why it may not need to make provisions ",
    "Dear ReaderThe Panorama newsletter is sent to   Pro subscribers on market days. It offers easy access to stories published on   Pro and gives a little extra by setting out a context or an event or trend that investors should keep track of.IT bellwether Infosys came face to face with a nightmare no company wants to have  a huge demand notice from the taxmen. The Directorate General of Goods and Services Tax Intelligence (DGGI) has asked Infosys to cough up a colossal Rs 32403.6 crore which is more than the IT giant s full year profits. This the taxmen state is towards IntegratedGST that is applicable on services received from its overseas branches.To be sure this is more of a cashflow problem for Infosys than an outright tax payment. As stated by DGGI the company must pay IGST for the services it provides through its foreign branches and take input tax credit under the reverse charge mechanism. In simple terms Infosys needs to pay tax upfront but can claim credit later citing these as business expenses.That said cashflows are the blood of any business and a sudden outflow can avalanche into bigger problems.Moreover the nature of the demand itself is being contested. The company has contested the notice saying that no tax is liable. NASSCOM has put its weight behind Infosys in the matter stating that the taxmen lack an understanding of the IT business model.This differing interpretation between tax authorities and Indian companies is not new. GST notices have been sent to scores of companies across sectors time and again. Most times the services industry has been at the receiving end. This has led to piling up of litigation and delays in resolutions. For companies it means loss of precious time and productivity and funds being stuck. Tax experts have called out the differing interpretation between GST enforcers and industry pointing out that such uncertainty sours the investment climate within the country.There are more questions than answers from the InfosysDGGI tussle. At the centre of the debate is the question of whether the IT sector should be given a different approach from the tax point of view. As such services are viewed differently than goods when it comes to taxation. Within services should the IT industry or indeed exporters or firms with branches overseas get a different treatment While NASSCOM holds that the business model is unique it remains to be seen whether the taxmen would view it likewise. Irrespective of how the Infosys episode unfolds uncertainty on taxes is negative for both business and investment sentiment.The bottomline is that a nation s tax policy is its frontline message to investors about the stability it offers. Tax policies must be steadfast well thought out and subject to minimal changes. Also importantly tax policy interpretation must not be arbitrary which in the case of Infosys could appear so.What s more tax notices are detrimental to the reputation of companies involved and therefore should be issued with utmost care and only when there is no doubt that there are dues.The Karnataka State Authorities who issued a demand notice have withdrawn their preshow cause notice on the GST claim. The DGGI notice still stands. The aboutturn by state authorities shows that the notices weren t fully thought through.Moreover the demand notice is for the period 201722. The tax authorities should have clarified upfront their stance on the matter instead of waiting all these years.Such episodes risk infusing a climate of mistrust between industry and the government which is detrimental to the Centre s efforts of attracting private investment. Moreover if there is unease in doing business for domestic players what does it say about foreign entities that wish to set up shop in India At a time when the government is aiming to shore up growth through investment alienating the private sector through tax policy interpretations open to question is ill advised. There should not be a need to protect the ease of doing business from taxmen. Tax policy should facilitate business not alienate it.Investing insights from our research teamWeekly Tactical Pick  Why this defence stock is still looking goodA mixed trip for the automotive sector in JulyITC  Healthy growth but margin contracts on input cost escalationZomato dishes out tasty earnings numbers helped by quick commerceTransport Corporation of India Q1  Why it s an investment worthy betTata Motors Q1 FY25  A muted quarter with a bumpy road aheadSun Pharma  Softness in specialty segment can weigh on valuationDabur  A sequential pickup in demand led by rural recoveryVGuard Q1  Margin expansion thesis playing outTata Steel  Uninspiring Q1 FY25 prompts revision of riskreward opportunityWhat else are we reading The art of putting an equities  trading strategy in placeSEBI cracks the whip on expiryday F O punts to curb risksITC s cigarettes business helps it sail through rough seasChart of the Day  Do banks want credit cardholders to swipe more but spend less It s Adani Vs Birla and Birla Vs Asian Paints in battle of giantsWhy India is missing the boat in shippingWhere s the competitive spirit in India s duty drill RIP semiconductor rally  (republished from the FT)UP enacts strict anticonversion law  A brief history of the antiProselytism law in India major judgments Centre s standBank of England summons up the courage to cutBringing Evan Gershkovich home will be Joe Biden s last big winTech and StartupsProductivity benefits from AI automation help Cognizant work with fewer employeesPersonal FinanceFrom FOMO to FOLO  Navigating investment trends with a longterm outlookTechnical Picks  Tata Power Godrej Consumer Products LIC Housing Finance and Power India (These are published every trading day before markets open and can be read on the app).Aparna Iyer  Pro ",
    "The tax department may issue notices to other infotech players as well news agency Reuters reported citing a government source amid scrutiny of alleged service tax evasion by their overseas offices a day after Infosys faced the tax demand. This is an industrywide issue  a senior tax official familiar with the developments told Reuters implying notices may be sent to other IT companies too.India s secondlargest IT company Infosys was slapped with a tax demand for alleged evasion of over Rs 32000 crore from the Directorate General of GST Intelligence (DGGI) as per a document seen by  . The document said Infosys was including expenses incurred towards overseas branches as part of their export invoice and computing the eligible refund based on that.Experts too said more tax notices may be in the offing for the alleged tax evasion on services by the overseas offices of some of the major IT companies. Issuing such a substantial showcause notice is likely to set a precedent leading to similar notices being issued to other multinational companies particularly in the IT sector  Rajat Mohan director at accounting firm MOORE Singhi told Reuters.Infosys clarified that it has paid all dues and GST is not applicable on expenses claimed by DGGI.  Infosys has paid all its GST dues and is fully in compliance with the central and state regulations on this matter  the company said in a statement.Former Infosys board member and Chief Financial Officer Mohandas Pai called the Rs 32000 crore GST demand as  tax terrorism  at its worst.  This is a business model issue not a tax evasion issue  he added.Shares of Infosys have been subdued in trade on August 1 weighed down by the tax demand.        "
]