[
    "HDFC Life and Max Financial fell up to 4 percent intraday on December 14 as the IRDAI proposed a higher surrender value on nonPAR products.The IRDAI has released a consultation paper that proposes a higher surrender value on nonPAR products. This will result in policyholders receiving a higher amount following lapses in their policies which will likely have a negative impact on the margins of nonPAR products.At close Max Financial shares closed lower by 3.16 percent at Rs 1023.5 while HDFC Life shares fell 1.75 percent to Rs 686 apiece on the NSE.Surrender value is the total payout that an insurance company gives the policyholder on the occasion of policy termination ahead of its maturity. Therefore this will only apply to those policies that have a surrender benefit.Follow our market blog for all the live updatesAdditionally this only impacts nonPAR products which are those in which the policy owner does not share in any profits or dividends made by the life insurance company. No bonus is paid on this policy.Over the past few months the IRDAI has been focussing on reforms to boost its vision of achieving  Insurance for All by 2047 .On October 30 the sector regulator issued a circular directing insurance companies on the Customer Information Sheet (CIS) implementation which aims to improve communication and transparency between insurers and policyholders. The CIS have the basic features of the policy in easily comprehensible words.The IRDAI has set up a highlevel panel to suggest steps to increase the participation of banks for easy availability of insurance products across the country.Also read   Sensex Nifty hit record highs on Fed s dovish pitch analysts expect largecaps to finally get goingDespite the large network of banks through their branches across the length and breadth of the country the contribution of the lenders as corporate agents was 5.93 percent of nonlife premiums and 17.44 percent of new business premiums for life insurance in 202223.",
    "This December will be  highly significant  for the overall growth of the life insurance industry this fiscal according to analysts at Emkay Global Financial Services.They expect retail annual premium equivalent (APE) to grow at 67 percent yearonyear (YoY) in FY24 led by private sector growth of 1112 percent and LIC s  low singledigit growth .Also read  LIC as an investor is key to its profitability as an insurerThe last month of the year is typically key for the industry but this year s December will be particularly important because the industry is likely to see a decline in March 2024 which will weigh on the overall annual growth.In their latest report the analysts wrote  as the industry moves past the festive disruption (in November 2023) as well as December typically being the key month (1112 percent of annual retail APE) growth in Dec23 will be highly significant for overall FY24 growth   this is owing to the industry likely to a decline in Mar24 on account of an extremely high base of Mar23 due to preponement of the large ticket nonlinked policy buying post taxation changes in Budget2023. We expect retail APE in FY24 to grow at 67 percent led by private sector growth of 1112 percent and LIC s low singledigit growth .This November s growth was muted with a 3.8 percent yearonyear (YoY) decline in retail APE because of the higher base in November 2022 said the analysts.This November saw the disruptions from Diwali spending while November 2022 came after Diwali. In the month the decline seen by private players was lower noted the report.It stated  Private players logged a minor dip of 1.3 percent YoY while LIC posted a sharper 8.7 percent drop in Retail APE during Nov 23. In November 2022  The industry saw strong Retail APE growth of 22 percent (private sector  27 percent  LIC  13 percent) bolstered by Diwali festivity disruption occurring earlier in Oct22 and some players running distribution incentive programs... in the month .Overall the analysts find the valuations of life insurers attractive and maintain a preference for SBI Life Max Financial and HDFC Life.They wrote  The sustained growth delivery by private life insurers addresses the overstated concerns on growth post the taxation changes on highticket nonlinked products.  Budget 2023 had removed tax exemption for insurance policies with premium over Rs 5 lakh.Also read  Budget 2023  Tax exemption removed in insurance policies with premium over Rs 5 lakhEmkay s analysts added  With the margin compression story already played out in FY24 private life insurers are on track to deliver robust VNB (value of new business) growth in FY25   beyond.         ",
    " The Indian equity benchmarks snapped a twoday winning streak to close lower on November 17 as financials came under pressure following the Reserve Bank of India s move to tighten norms for personal loans and credit cards. At close the Sensex was down 187.75 points or 0.28 percent at 65794.73 and the Nifty was down 33.40 points or 0.17 percent at 19731.80. About 1923 shares advanced 1674 shares declined and 121 shares unchanged. SBI Life Insurance Company Ltd  Shares of the insurance major surged 4 percent to Rs 1413 on November 17 extending gains for the third day in a row and becoming the top gainer on the index. As many as 21 lakh shares changed hands as against the 1month average of 8 lakh shares. The surge comes after global brokerage firm Morgan Stanley turned overweight on the company. HDFC Life Insurance Company Ltd  Shares of the company advanced nearly 3 percent to Rs 653 a day after the stock traded in the red. Over the last five sessions the scrip has surged nearly 5 percent on the exchanges. Over 26 lakh shares changed hands on the bourses higher than the 1month average of 21 lakh shares. Hero Motocorp Ltd  Shares of the twowheeler major climbed almost 2 percent to Rs 3334 extending gains for the fifth day in a row. The surge comes after it announced its highestever retail sales during India s monthlong festive season. The twowheeler manufacturer revealed in a Thursday exchange filing that it sold over 1.4 million units in the retail market during the 32day festive period marking a 19 percent yearonyear growth. L T Ltd  Shares of the construction major rose 1.9 percent to Rs 3109 on November 17 a day after the stock fell 0.5 percent on the exchanges. Apollo Hospitals Enterprises Ltd  Shares of the healthcare giant rose nearly 3 percent to Rs 5478 rallying for the third day in a row on November 17. About 5 lakh shares changed hands matching the 1month average. Brokerage firm Prabhudas Lilladher in a recent report mentioned its bullish stance on the stock citing a solid growth platform across segments. SBI Ltd  Shares of India s largest public sector lender slumped over 3 percent to Rs 563 a day after the Reserve Bank of India (RBI) tightened norms for personal loans and credit cards to check the unbridled growth in this segment. Axis Bank Ltd  Shares of the private lender tanked close to 3.5 percent to Rs 994 after the RBI tightened norms for personal loans and credit cards to check the unbridled growth in this segment. The central bank has raised credit risk weights on unsecured consumer loans by increasing the capital requirements for such loans as concerns have been growing over these borrowings. ONGC Ltd  Shares of the oil exploration major fell over 2 percent to Rs 196 after crude oil prices dropped to a fourmonth low. Typically a drop in the crude price has a negative impact on the company s profitability due to lower realizations from its revenues. Bajaj Finance Ltd  Shares traded in losses by falling 1.7 percent to Rs 7236 after the Reserve Bank of India (RBI) tightened the norms for personal loans and credit cards. A day earlier the central bank increased the risk weight on consumer loans as the unbridled growth of these unsecured loans has been causing concern. The move in the form of higher capital requirements could raise lending rates for unsecured customer loans. BPCL Ltd  Shares of the petroleum major fell 2.2 percent to Rs 390 snapping its threeday gaining streak on the bourses. The drop comes after crude oil prices dropped to a fourmonth low. Typically a drop in the crude price has a negative impact on the company s profitability due to lower realizations from its revenues.         ",
    "",
    "Net Sales at Rs 23097.18 crore in September 2023 up 0.89  from Rs. 22893.53 crore in September 2022.Quarterly Net Profit at Rs. 376.77 crore in September 2023 up 15.49  from Rs. 326.24 crore in September 2022.EBITDA stands negative at Rs. 186.96 crore in September 2023 down 162.37  from Rs. 299.78 crore in September 2022.HDFC Life EPS has increased to Rs. 1.75 in September 2023 from Rs. 1.51 in September 2022.HDFC Life shares closed at 641.80 on October 17 2023 (NSE) and has given 20.57  returns over the last 6 months and 20.81  over the last 12 months.",
    "HighlightsHDFC Life (CMP  Rs 625  Mcap  134379 crore) has delivered steady earnings in the first half of FY24 (H1 FY24) demonstrating the life insurer s resilience. The changes made in the Union Budget recently were expected to be largely unfavourable for                                     ",
    "Private sector insurance company HDFC Life Insurance on October 13 reported a net profit of Rs 376 crore in the September quarter of the financial year 202324 up by 15 percent from the yearago period.The company slightly beat market estimates which had pegged net profit at Rs 370 crore up 14.3 percent from the yearago quarter.The net premium income of the insurer came in at Rs 14755 crore up 28 percent from Rs 11479 crore in the same quarter of the previous year.Value of new business stood at Rs 801 crore compared to Rs 770 crore on a YoY basis. VNB margin of the company stood at 26.4 percent versus 27.1 percent YoY.The company reported annualised premium equivalent (APE) which is a measure of new business written by a life insurance company of Rs 3045 crore missing market expectations which expected APE to grow to Rs Rs 3201 crore.At 2.42 pm the HDFC Life Insurance stock was trading nearly 0.45 percent up at Rs 625.10 apiece on the BSE.HDFC Life for the JulySeptember FY24 quarter saw a drop in sales through direct channels brokers and agency. Compared to this the company s bancassurance channels saw a growth in total sales.In the first half of FY24 the lender sold 4.76 lakh policies compared to 4.34 lakh policies in the corresponding period last year.The insurer s solvency ratio dropped during the JulySeptember FY24 quarter and at 194 percent compared to 210 percent a year ago. The solvency ratio of a life insurance company measures its cash flow in comparison to the amount it owes as total life cover.        ",
    "Highlights The performance of life Insurance companies has been lacklustre in                                     ",
    "The next 10 years are of utmost importance for the insurance sector said the IRDAI chairperson Debasish Panda at the Global Fintech Fest 2023. We ll see a radical change in the nature of insurance buyers. As the level of awareness is on the rise we will see more and more customised products. This means we need more players more distributors and more capital needs to be infused in the sector  Panda said.Emphasising that technology will be the binding factor for Insurance 2.0 Panda said that a slew of reforms and initiatives in the insurance sector are now creating an environment that fosters innovation promotes necessary ease of doing business reduces compliance and facilitates avenues for growth. Today an insurance company can launch almost all types of insurance products without waiting for regulatory approval. It can even tie up with multiple distribution partners  Panda said.As part of its Mission 2047  Insurance for All  IRDAI is planning to launch Bima Trinity  Bima Sugam Bima Vistar Bima Vaahaks   in collaboration with general and life insurance firms.Also Read  Bima Sugam  A platform that may transform the insurance business The life insurance and general insurance councils which are the selfregulating industry bodies are also gearing up to support the industry in a more efficient way. They are also working towards enhancing customer experience particularly in health insurance by bringing 100 percent cashless claim settlement  Panda said.Currently insurers deduct 10 per cent or more during claims.Ushering investments into the insurance sectorTo facilitate more investments in the segment Panda said that insurance companies  boards now have more flexibility and autonomy for taking operational decisions independently and various redundant prior approvals have been dispensed off. The investment landscape is also being revamped to attract more investments in the sector. Be it in the increase in the limits for FDI promoter status or staggered lockin requirements. Moreover insurers can now invest in the funds of funds alternate investment funds debt instruments of INVITs and REITs as so on and so forth  he said.Earlier an investment of over 10 percent in the paidup capital of an insurer necessarily had to be made as a  promoter . Under the 2022 regulations the promoter threshold was raised from 10 percent to 25 per cent.        ",
    "HDFC Group on August 17 announced the launch of its life insurance and asset management services at International Financial Services Centre (IFSC) in Gujarat s GIFT City.HDFC International Life and Re has been set up by HDFC Life while HDFC AMC International (IFSC) Ltd has been established by HDFC Asset Management Company to offer services to NonResident Indians (NRIs) and the global Indian diaspora.While the new unit under brand name HDFC Life International will offer US dollardenominated life as well as health insurance solutions HDFC AMC International would provide fund management and advisory solutions as part of its offshore hub the group said in a statement. We look forward to further contributing to the India growth story and to make worldclass foreign currencydenominated insurance solutions available for NRIs and global Indians through HDFC Life International and  Indian investment solutions available to global investors and global investment solutions available to resident investors through HDFC AMC International (IFSC) Ltd  Deepak Parekh Chairman HDFC Life and HDFC AMC said.Also the first product by HDFC Life International US Dollar Global Education Plan is open for enrolment and is designed to help parents build a US dollardenominated corpus to meet future expenses for their child s overseas education. This product is aimed at eliminating any future mismatch between the currency of investment and the currency of expenses. Further HDFC AMC International plans to initially launch six funds which would feed into different HDFC Mutual Fund schemes covering strategies on equity and hybrids.This decision is aimed at expanding the global outreach and for opening up new markets for the products and services offered by the asset management firm. Over a period of time HDFC AMC International plans to boost its solutions with the addition of products on alternate strategies including those on private assets.        ",
    "Net Sales at Rs 23371.42 crore in June 2023 up 249.34  from Rs. 6690.11 crore in June 2022.Quarterly Net Profit at Rs. 416.72 crore in June 2023 up 26.74  from Rs. 328.79 crore in June 2022.EBITDA stands at Rs. 398.22 crore in June 2023 up 18.16  from Rs. 337.02 crore in June 2022.HDFC Life EPS has increased to Rs. 1.94 in June 2023 from Rs. 1.56 in June 2022.HDFC Life shares closed at 661.05 on July 20 2023 (NSE) and has given 11.94  returns over the last 6 months and 25.87  over the last 12 months.",
    "Net Sales at Rs 23340.22 crore in June 2023 up 296.54  from Rs. 5885.91 crore in June 2022.Quarterly Net Profit at Rs. 415.34 crore in June 2023 up 13.7  from Rs. 365.29 crore in June 2022.EBITDA stands at Rs. 396.74 crore in June 2023 up 6.6  from Rs. 372.19 crore in June 2022.HDFC Life EPS has increased to Rs. 1.93 in June 2023 from Rs. 1.73 in June 2022.HDFC Life shares closed at 661.05 on July 20 2023 (NSE) and has given 11.94  returns over the last 6 months and 25.87  over the last 12 months.",
    "In investing what is comfortable is rarely profitable  Robert ArnottNo official announcement by the stock exchanges but the market is convinced that LTI Mindtree will be the replacement for HDFC in the benchmarks Nifty and Sensex. That partly explains the flurry of activity in the call options for the July series. Usually it is a flavour of the season stock from a fancied sector that finds its way into benchmark indices.Like its peers in the IT space LTI Mindtree too had a middling run over the last year as the consensus view is that the IT sector will struggle because of the slowdown in the US. This is one of the rare instances when a new entrant in the index (if it comes to that) could increase the weightage of a sector that is right now not in favour with investors.Open interest in the 5200 strike call options in LTI Mindtree for the July series has rocketed. The demand for the options is coming from those who are betting on the stock being included in the Nifty thus attracting inflows from passively managed funds. The rise in premia over the last week has however been modest indicating that there are enough traders willing to bet that the fundamental picture will limit big upside in the stock.HDFC LifeThe stock was among the big gainers on Tuesday as parent HDFC bought 1.49 crore shares through a block deal and is said to need another 1.4 crore shares of to increase its ownership to over 50 percent. HDFC Life shareshave risen 44 percent from their March lows and has clearly been the star performer among insurance companies stocks over the last three months. But much of that has been driven by technical factors like HDFC increasing its stake in the company. In addition the exit of copromoter Abrdn through open market block deals has removed a major overhang in the stock.  There could be some more steam left as HDFC looks to buy the remaining shares to go above the 50 percent mark. That will then put the focus back on the fundamental side of the story. The market is still divided on the prospects of life insurers at this point. HDFC Life shares hit a peak of around 750 in September 2021 but have been struggling ever since.Heavy metalThe metal space sees a divergence now. Spot aluminium and zinc prices have softened monthonmonth compared with lead and copper weighed down by recession concerns in the West a marginally weaker dollar index and lesserthananticipated domestic growth in China.That said aluminum zinc and lead are expected to remain balanced  in slight deficit globally impacted by restricted supply.Aluminum prices in particular are expected to be supported by restricted supply lower inventory levels and the global cost curve. Lower costs (thermal coal caustic soda and crude derivatives have softened) and steady demand will aid domestic nonferrous companies  analysts at Antique Stock Broking said.Blowing hot Blowing coldThe sailor curses the rain the farmer prays for. A similar dynamic is at work in the airconditioner market.AC industry growth is expected to fall short of expectations in Q1 FY24 due to the erratic weather conditions Dolat Capital says in a note. Companies like Voltas Blue Star and Lloyd which have already posted lacklustre sales in the March quarter of FY23 due to the freakishly cool onset of summer are likely to register flattomid singledigit revenue increase on an unfavourable base.Although raw material prices are easing margins will be impacted due to elevated advertising spends amid highly competitive intensity.  However weather gods may not be as kind in the coming years. Coupled with the growing economy and disposable incomes this means AC sales can only go in one direction. So long term investors can take heart. Given low AC penetration (79 percent) harsh summer growing disposable income rise in residential and commercial projects and consumer finance options India s AC industry offers bright prospects in the medium to long term  Dolat added.Recession chatterThe US is likely to slip into recession in the fourth quarter this year and the economic weakness is likely to persist in 2024 according to HSBC Asset Management. The euro zone is not far behind and could be in a similar position in 2024. But HSBC analysts have some good news as well  inflation will fall quickly and the Federal Reserve will cut rates by the end of this year.Home pricesHome prices in US saw their first yearoveryear erosion in 11 years in April as measured by the S P CoreLogic CaseShiller National Home Price Index. Higher mortgage rates have made home purchases more expensive for buyers causing a slowdown in home sales reports WSJ.But prices haven t declined as much as many economists had thought because the higher mortgage rates made current homeowners reluctant to sell keeping the supply of homes on the market lower than normal.Slowing shaleSofter oil and natural gas prices and rising costs are squeezing the profit margins in the US shale patch where the business activity growth stalled in the second quarter of the year according to a report by mining.com. With oil and gas prices currently lower than at this time last year drilling activity is slowing down and could further slow amid uncertainties about the economy and the Administration s policies towards the industry.  US shale producers are no longer the world s swing producers as they are not boosting drilling activity too much even when oil prices surge. Dr CopperLondon Metal Exchange copper stocks have slid from 100100 tonnes to 77050 over the last three weeks despite almost 30000 tonnes of arrivals writes Reuters columnist and copper expert Andy Home. Combined copper stocks registered with the LME CME and the Shanghai Futures Exchange (ShFE) totalled 165000 tonnes at the end of last week the lowest it s been since 2008. However spot copper prices have not surged as they ideally should have given the low inventory.This could indicate that the market is betting on a lot more copper being out there in private stocks writes Home.Abhishek Mukherjee and Shubham Raj contributed to this article ",
    "Shares of HDFC Life Insurance were trading marginally up in the morning on June 26. The company has told exchanges that it received a Goods and Services Tax (GST) demand notice of Rs 942 crore for the period between July 2017 and March 2022.The private sector life insurer had on June 23 informed the bourses that it received a showcausecumdemand notice from the Directorate General of GST Intelligence Mumbai Zonal Unit. The GST office asked the company  why a tax of Rs 9421846028 pertaining to the period July 2017 to FY22 should not be demanded from the company  the filing said.Follow our live blog for all the market actionThe matter is related to claims of an input tax credit against the supply of services which the authority believes are ineligible. The company has been advised by its legal and tax counsel that it has a good contestable case it said. This is an industrywide issue and the company will be taking appropriate steps in due course to reply to the showcause notice and contest the matter. It may be noted that Rs 250 crore has been deposited under protest with the authority in this matter in the past  HDFC Life added.In September 2022 the Mumbai unit of the Directorate General of GST Intelligence (DGGI) said that an input tax credit of Rs 824 crore was availed by 16 insurance companies on the basis of fake invoices. Out of this insurers had voluntarily paid Rs 217 crore after the DGGI investigation.DGGI investigations revealed that these insurers were paying commissions beyond the Insurance Regulatory and Development Authority of India s permissible limit to their corporate agents in the garb of expenses related to marketing and brand activation.The GST law doesn t allow availing of such input tax credit as the supply of said service did not actually take place.In a filing on June 23 the company also said the insurance regulator had approved the transfer of shares of HDFC Life from HDFC Ltd to HDFC Bank. This comes ahead of the merger between HDFC and HDFC Bank. We also wish to inform that IRDAI vide its said letter has also granted its approval for HDFC Limited to acquire additional shares in HDFC Life so as to hold more than 50 percent of its total share capital  HDFC Life said.At 11 am HDFC Life was trading 0.55 percent up at Rs 630.40 on BSE.",
    "HDFC Life Insurance announced on June 23 that it has received a demand notice of more than Rs 942 crore for nonpayment of GST. Shares of HDFC Life Insurance were trading marginally up in the morning on June 26.The matter relates to the claiming of input tax credit against supply of services which the Directorate of Goods and Services Tax (GST) Intelligence (DGGI) believes are ineligible for such claims it said.Also Read  HDFC Life trades flat after GST demand notice of Rs 942 crore HDFC Life Insurance Company has received a show cause cum demand notice from the Directorate General of GST Intelligence Mumbai Zonal Unit asking the Company to show cause why a tax of Rs 9421846028 pertaining to the period July 2017 to FY 2022 should not be demanded from the Company  the insurance provider said in a regulatory filing.Stating that the input tax credit (ITC) case is an industrywide issue the company assured that it will take appropriate steps in due course to reply to the show cause notice and contest the matter.Also Read  CCI approves acquisition of stake by HDFC in two insurers It may be noted that Rs 250 crore has been deposited under protest with the authority (DGGI) in this matter in the past  the private sector insurer added.On June 20 HDFC Life said that the Competition Commission of India has approved HDFC Ltd   one of the promoters of the company   to increase its stake in HDFC Life to more than 50 percent.In a filing on Friday HDFC Life said the Insurance Regulatory and Development Authority of India (IRDAI) has granted its approval for transfer of shares of HDFC Life from HDFC Ltd to HDFC Bank.Also Read  Abrdn sells 1.6  stake exits HDFC Life Insurance We also wish to inform that IRDAI vide its said letter has also granted its approval for HDFC Limited to acquire additional shares in HDFC Life so as to hold more than 50 percent of its total share capital  HDFC Life said.(With inputs from PTI) ",
    "After Competition Commission of India s (CCI) green signal mortgage lender HDFC can now acquire over 50 percent stake in HDFC Life. The development pushed the stocks of HDFC Life HDFC and HDFC Bank higher on June 21.At 9 25 am HDFC Life was quoting at Rs 651.65 on the NSE higher by 1.24 percent from the previous close. HDFC too was quoting 0.6 percent higher at Rs 2677.Eventually HDFC Bank which will be the surviving amalgamated entity after the merger with HDFC will hold over 50 percent stake in HDFC Life. Similar approval has also come for the combined entity s shareholding in HDFC ERGO.Follow our live blog for all the market actionAs of March 2023 HDFC held 48.65 percent stake in HDFC Life.In April the Reserve Bank (RBI) of India permitted HDFC Bank or HDFC to increase shareholding in both insurance companies to over 50 percent prior to the effective date of the merger. After RBI s permission CCI approval is another step forward towards the merger.According to Emkay and Nuvama Research the decision by the RBI to hold more than 50 percent stake by HDFC twins in insurance entities is a significant boost for HDFC Life.  The management has not quantified the increase in the stake. The theoretical limit is 100 percent. We believe it should be 5060 percent. The Street had a high probability of this relaxation coming through. Last year the management had explained that a higher stake would also mean higher crosssell  Nuvama said.Second the concern of a possible 19 percent stake sale by HDFCHDFC Bank (which currently holds 48.65 percent stake in HDFC Life) if the RBI had directed them to keep their stake below 30 percent is now eliminated. It is now confirmed that HDFCHDFC Bank will acquire fresh or secondary over 1.35 percent stake before the merger completion an Emkay report said.",
    "Shares of HDFC Life jumped 6 percent in early trade on June 16 on post robust commentary by the top management. We have typically grown 1.8x to 2x of the private sector and slightly higher as a multiple of the overall industry. May was better than April and hopefully June will be better than May  MD   CEO Vibha Padalkar told In a CNBCTV18 on June 16.  That s how the turnaround from being a higher average ticket size focus sector we are moving into deeper penetration and that s again the right way to do it.   Retail AP business we grew 9 percent. This was 1.8x of the sector. Our market share expanded from about 16.5 percent to 16.7 percent. Similarly on group business also we retained our number one position in the private sector  she said.The insurer s market share grew there as well clocking 25 plus percent growth which was 2x of the private sector.She further added that  In May 2023 there was doubledigit growth in the number of policies. The company performed well despite strong base effect due to tax changes in the budget. Recent developments in the companyIn a filing with BSE on June 15 the company said  The stakeholders relationship committee of the board on June 14 2023 has allotted 35226 equity shares to the eligible option holders pursuant to exercise of stock options by them under various employee stock option schemes. Follow our live blog for all market actionAfter the allotment the company s paidup equity share capital stood at  Rs 21496794560 comprising of 2149679456 equity shares of face value of Rs 10 each .At 2.04 pm the HDFC life Insurance Company Ltd stock was trading 5.65 percent higher at Rs 610.80 on NSE.HDFC Life Insurance Company Ltd stock has given a return of 6.22 percent over the last six months against Nifty s 2.68 percent over the same duration.",
    "Private life insurance companies are expected to continue their strong growth momentum this fiscal though margins may remain under pressure as the focus shifts to higher distributor payouts and investments in stepping up new channels analysts say. Life insurers posted healthy growth in annualised premium equivalent (APE) in the fourth quarter of FY23 aided by customers rushing to buy highticket nonunitlinked savings products ahead of withdrawal of tax exemptions from April 1.APE is a common measure of ascertaining the business sales in the life insurance industry.The Union Budget 202324 withdrew tax exemptions on maturity proceeds of nonunit linked insurance policies (nonULIPs) with an annual premium exceeding Rs 5 lakh. While the Street remains skeptical we expect private life insurance companies under coverage to deliver 1318 percent APE growth on normalised basis. The oneoff business in March 2023 will likely weigh on March 2024 leading to 218 percent APE growth for the year  Kotak Institutional Equities said in a report.Life insurance companies will likely lose business in nonparticipating policies (where the profits are not shared and no dividends are paid to policyholders) above annual premium of Rs 5 lakh though policies below this threshold may become relatively more attractive as income from these policies remains taxfree while income from debt funds has been made taxable at the marginal tax rate.Margin PressuresChallenges on the margins front may impact life insurers in the near term feel analysts. Investments in new partnerships and income in agency business will likely put pressure on margin expansion. Levers include pickup in term business and the high share of nonpart (policies). We consequently model flattomarginal compression in margins in FY 2024E for listed private insurance companies  this is compared with the 145 bps to 981 bps expansion reported in FY202123  Kotak added.As per new rules by IRDAI effective April 1 life and general insurance companies will not have to adhere to any specific ceiling on commissions paid to agents distributor banks and other intermediaries.Also Read  Higher insurance agent commissions to continue but IRDAI asks insurers to adhere to EoM capsHowever the payouts cannot exceed the overall expenses of management (EoM) limits specified by the Insurance Regulatory and Development Authority of India (IRDAI).The industry has largely welcomed the regulator s directives though some smaller players said they could find the going tough in the days to come.Some analysts also believe that the larger listed players will be under pressure to deliver as unlisted insurers now have the flexibility to be more aggressive. This removal of explicit commission cap will bring in transparency and payouts to distributors will get reported under commissions. For listed larger players despite commission limits being freed up the struggle to deliver profitability to the shareholders while balancing policyholders and distributors  interests would mean the limited ability to materially tinker the payouts to their distributors  broking firm Emkay Global said in a recent report.Road AheadDespite these headwinds Kotak has retained its positive stance on the life insurance sector. We expect APE growth (exone offs in March) to remain strong in FY2024E with flat margins but investments provide visibility for better mediumterm growth. Nonpar savings and protection will be value drivers. We remain bullish across life insurers  it noted.However there are also some voices of concern.HDFC Securities said conversations with industry experts suggest that the top four private life insurers are likely to witness 2027 percent adverse impact on FY24E APE predominantly on account of the impending transition to the new tax regime.The optional new tax regime has removed most deductions including on life insurance premiums.Policies with a ticket size of less than Rs 1 lakh are believed to be sensitive to tax deductions under Section 80C of the Income Tax Act analysts at HDFC Securities noted. We expect an 18 11 16 percent impact on retail APE of SBI Life ICICI Prudential Max Life solely on the back of lower new business growth as customers move to a new tax regime (assuming resistance from 40 percent of the 80C sensitive customer pool)  they said.While HDFC Securities is constructive on the longterm prospects of the life insurance industry and the regulatory vision to improve penetration it said the sector will face growth challenges in the near to mediumterm from revised EoM guidelines the gradual elimination of taxinduced sales increasing competition within channels and forced pivot towards lower ticketsized policies.It s advice to players in the segment  We believe India is structurally moving towards a regime where  tax planning  as a motivation for insurance will become completely redundant. Hence companies that pivot sooner from  tax planning  to the  financial planning  plank will have a competitive advantage over peers  it added.",
    "Here is a collection of the most important stories this evening Fiscal deficit target at risk Nomura warns despite RBI s Rs 87416 crore dividend to govtConcerns have been raised by Nomura Research regarding the achievement of the fiscal deficit target of 5.9 percent of GDP for the fiscal year 202324. Nomura identifies several factors that contribute to this risk including the potential shortfall in nominal GDP growth lower tax buoyancy a constrained budget for revenue expenditure and ambitious goals for capital expenditure. More hereRBI dividend to govt could have been Rs 1.2 lakh crore if not for risk buffer changeOn May 19 the RBI s central board of directors approved the transfer of Rs 87416 crore as dividend to the government. While this was nearly double the Rs 48000 crore estimated by the government in the 202324 Budget as dividend from the central bank and stateowned lenders the RBI s board decision to raise the Contingency Risk Buffer to 6.0 percent from 5.5 percent deprived the government of another Rs 31000 crore or so. More hereAbrdn likely to sell 1.66  stake in HDFC Life via block deal tomorrowAbrdn formerly known as Standard Life is likely to sell 1.6 percent equity stake or 3.57 crore shares in HDFC Life Insurance company via block deal tomorrow sources told CNBC Awaaz on May 30. The shares of the private insurer will be offered at Rs 563585 per share the sources added. To be sure the offer range is in line with the current market price (CMP) of HDFC Life stock as on May 30 when it closed 1.10 percent higher at Rs 585.45 apiece on BSE. More hereHUL annual report  No salary jump for Sanjiv Mehta 19 brands in Rs 1000 crore club and moreBetween price hikes to boost earnings tepid sales volumes a sluggish rural recovery and the naming of a new boss Hindustan Unilever Ltd (HUL) had a truly eventful FY 2023. And there was more in a year the economy returned to normal after being hit by COVID19. More here Mc SelectsBlackRock cuts Byju s fair value by 62  for the second time since October 2022BlackRock the world s largest asset management company (AMC) has reduced the fair value of Byju s the world s mostvalued edtech startup by 62 percent. This is the second time BlackRock has reduced the fair value of Byju s since October 2022. BlackRock which holds less than 1 percent has pegged the value of its 2279 shares in the company at  4043471 effectively estimating Byju s fair value at  8.4 billion as of March 31 2023. More hereGo First Case  IRP argues Delhi HC can t decide on aircraft lessors  pleaThe Interim Resolution Professional (IRP) for Go First argued on May 30 that the airline s cashstrapped situation led its lessors to approach the Delhi High Court instead of availing the remedy to approach the Supreme Court against the National Company Law Appellate Tribunal s (NCLAT) order. Harish Salve representing the IRP as King s Counsel contended that the aircraft lessors initiated  parallel proceedings  despite a clear directive from the NCLAT to approach the National Company Law Tribunal (NCLT) regarding the status of aircraft leases terminated before the moratorium. More hereThe right way to get the first credit card and build a credit historyTypically people start their careers immediately after graduating. And in most cases they decide to go in for a credit card. It s good to apply for a credit card at the beginning of your professional career as it allows you to start your credit journey early and build a strong credit score over a period. But credit bureaus do not have a credit history or a credit score to evaluate the profiles of people starting jobs which poses a unique problem leading to some banks not providing a credit card. More here ",
    "Abrdn formerly known as Standard Life is likely to sell 1.6 percent equity stake or 3.57 crore shares in HDFC Life Insurance company through a block deal on May 31 sources told CNBC Awaaz.The shares of the private insurer will be offered at Rs 563585 per share sources added.To be sure the offer range is in line with the current market price (CMP) of HDFC Life stock as on May 30 (Tuesday) when it closed 1.10 percent higher at Rs 585.45 apiece on BSE.Notably HDFC life shares have seen some action in the past month or so after the Reserve Bank of India (RBI) allowed HDFC Bank or HDFC Limited to increase the shareholding in HDFC Life and HDFC ERGO to more than 50 percent.Meanwhile Abrdn has been paring its stake for quite some time now and with this stake sale it will exit HDFC Life Insurance.Earlier in September last year the UKbased firm had sold 2 percent stake in the private sector insurer. Post the stake sale Abrdn held a 3.7 percent equity stake in HDFC Life.Abrdn plc formerly Standard Life Aberdeen plc is listed on the London Stock Exchange and is a constituent of the FTSE 100 Index. It is the active asset manager in the UK with investments in equities multiasset fixed income liquidity sovereign wealth funds real estate and private markets In July 2021 the company changed its name from Standard Life Aberdeen to Abrdn.For the third quarter ended December 31 20022 HDFC Life Insurance had reported a 15 percent yearonyear (YoY) rise in net profit. Net premium income for the quarter increased by 19 percent YoY to Rs 14379 crore. The first year premium grew by nearly 29 percent on year to Rs 2724 crore.        ",
    "Food delivery platform Zomato has been added to three longonly portfolios and SBI Life Insurance has been had added to one by Jefferies.These changes have been made by removing HDFC Life and Standard Chartered and by reducing investments in JD.com and Alibaba.In the weekly Greed   Fear newsletter by Christopher Wood the global head of equities at Jefferies he wrote about the changes made in the Asia Pacific exJapan relativereturn portfolio and the longonly portfolios. The investments in HDFC Life Insurance and Standard Chartered in the Asia exJapan longonly portfolio will be removed and replaced by investments in SBI Life Insurance and India online food delivery platform Zomato  he wrote in the newsletter titled  Modi and the champagne socialists .Also read  Time to add exposure to realty stocks as end of Indian monetary tightening cycle is near  Jefferies  Chris WoodThe thrust of the newsletter was the improving sentiment around India and what could be the triggers for this.In the India longonly portfolio Jefferies will introduce Zomato with a 4 percent weighting while the investment in HDFC Life Insurance will be removed the newsletter stated.  The investment in REC Limited will be increased by two percentage points by shaving the investment in Oil   Natural Gas Corp  it added.Zomato will also be added to the global longonly equity portfolio which will be  paid for by shaving the investments in JD.com and Alibaba by two percentage points each  stated the Greed   Fear newsletter.Wood wrote that GREED   fear continues to believe that the Sensex will touch 100000  a target of fascination to India s delightfully noisy financial media . This target on a fiveyear view now assumes trend 15 percent EPS growth and that a fiveyear average one year forward PE multiple of 19.8x is maintained as discussed here previously (see GREED   fear   India and a 100000 Sensex 3 February 2022). Still like all longterm bull markets the Indian stock market will continue to climb the proverbial wall of worry  he wrote.Wood wrote about two risks that he sees in the near term.  One obvious worry over the next 12 months will be the inevitable questioning of the current consensus namely that (PM Narendra) Modi will be reelected. Another potential risk is a further reduction in retail investor activity following a period when the stock market has traded in a tight range. Active brokerage accounts have declined from a peak of 38m in June 2022 to 31m in April 2023  he added.        "
]