[
    "Hero MotoCorp on August 13 said its Q1 FY25 standalone net profit rose 36 percent to Rs 1122.63 crore from Rs 824.72 crore in the corresponding quarter previous year driven by strong sales recovery in the rural market and new launches in the 125cc segment like the Xtreme 125R. The numbers however missed Street estimates.India s largest twowheeler company s revenue from operations during the quarter under review stood at Rs 10144 crore which was up by 16 percent from Rs 8767 crore reported in the corresponding period of the previous financial year. It is the first time that the automaker s revenue from operations crossed Rs 10000 crore.A   poll of eight brokerage estimates pegged Hero MotoCorp s fiscal first quarter net profit at Rs 1190 crore and revenue at Rs 10520 crore. In consolidated terms the Revenue and profit after tax (PAT) for the quarter were Rs 10211 crore and Rs 1032 crore respectively.Furthermore  the Pawan Munjalled firm s EBITDA or earnings before interest taxes depreciation and amortization  went up by 21 percent at Rs 1460 crore during the previous quarter. The company s operating margin expanded by 60 basis points to 14.4 percent.The world s largest twowheeler manufacturer said that it has witnessed positive trends across domestic EV and global businesses during the quarter. The company also witnessed sequential improvement in retail sales (VAHAN) it added.  It expects the momentum to build up in the following quarters on account of positive customer sentiments good monsoons and the upcoming festive season. The company has a slew of product launches planned in both ICE and EV categories  Hero MotoCorp added.Commenting on the results Niranjan Gupta Chief Executive Officer (CEO) said  We are seeing a sharp recovery in market share in 125 cc segment charged by the new model Xtreme 125 cc while we continue to maintain formidable market share in entry and deluxe 100 110 cc segment of over 70  powered by our brands like Splendor Passion and HF deluxe. Hero MotoCorp is also setting its sights on the premium segment. As Gupta puts it  Our focus moving forward will be building our brands in premium segment on the back of launches done in last few quarters to win in this segment. We will be launching new models in scooters as well in next two quarters to re energise this portfolio. On EV sales the CEO said  We have seen now our EV brand Vida starting to increase its presence and market share and we will be expanding portfolio into affordable segment within this fiscal. The overall economic indicators in India are promising and the inclusive policies as well as capital allocation to infra and rural sector announced in union budget is expected to bolster demand. With inflationary pressures easing consumer spending power is set to rise further driving momentum as we gear up for a big festive season ahead.  Overall we are optimistic about the demand trajectory for the coming quarters. Our productlaunches and strategic initiatives are well aligned to capitalize on this positive marketenvironment ensuring continued growth and value creation for all our stakeholders  Gupta said.On August 13 the firm s shares closed 1.55 percent lower at Rs 5229.55 apiece.         ",
    "Hero MotoCorp the world s largest twowheeler company is set to release its earnings report for the first fiscal quarter of FY25 on August 13. Robust volume growth and premiumization trends are expected to help the company s sales rise by doubledigits.According to a   poll of eight brokerage firms the maker of Harley Davidson bikes in India is anticipated to record a 20 percent yearonyear increase in revenue reaching Rs 10520 crore. Net profit is projected to rise 44 percent to Rs 1190 crore from Rs 825 crore in the same quarter of the previous fiscal year.Follow our LIVE blog for all the latest updatesEarnings estimates from analysts polled by   are in a narrow range indicating that any positive or negative surprises could trigger a sharp reaction in the stock price.What factors are helping Hero MotoCorp s earnings Volume growth  Hero MotoCorp will likely post a 13.5 percent increase in volumes higher average selling prices due to price hikes during the year will bode well for the Delhiheadquartered company.Premiumization  The demand for premium motorcycles and a better product mix constituting a higher share of premium motorcycles will benefit the company. Analysts however expect that lower ad spending is likely to be offset by higher commodity prices.Improved margins  Auto analysts suggest that margins will likely improve by 90 basis yearonyear led by a richer product mix operating leverage and cost control efforts. Margins could decline sequentially due to a rise in some raw materials. Revenue growth YoY to be supported by robust volume growth and increase in realization. EBITDA margin to improve on better net pricing  Nuvama Institutional Equities said in its quarterly preview.What to look out for in the quarterly show Analysts suggest recovery in rural regions traction and timeline of new product launches and demand outlook are key factors to watch out for in the coming quarters.The company s shares were trading at Rs 5303 higher by two percent from the last close. The Hero Moto stock has rallied 28 percent since the start of the year.",
    "The domestic Electric TwoWheeler (E2W) industry saw monthly sales cross the onelakh mark for the second time this year in July as many prospective buyers advanced their purchases due to the expected phaseout of the current Electric Mobility Promotion Scheme 2024 (EMPS).As per the data available on the government portal Vahan retail monthly sales of electric twowheelers scaled a new high of 106949 units in July 2024 which is about 34 percent higher than June s 79868 units and a 96 percent yearoveryear surge from July 2023 s 54616 units. The numbers were still less than March retail figures which were around 140309 units (before the phaseout of FAME2 scheme).It may be recalled that the EMPS 2024 which came into force on April 1 was set to expire on July 31.  However on July 26 it got extended by another two months and will be valid till September 3o.The total yeartodate E2W sales are up by 29 percent 634770 units from 490324 units during the same period last year as per Vahan data.The top four OEMs in July remained unchanged with Ola Electric in the leading position followed by TVS Motor Bajaj Auto and Ather Energy.The IPOBound Ola Electric Mobility saw vehicle registrations of 41597 units in July as per Vahan portal. The BhavishAggarwal ledfirm saw a 114 percent increase in sales from 36 785 in June and commanded close to 40 percent market share.The Bangalorebased EV startup claimed that its strategic entry into the massmarket segment with the S1 X portfolio resulted in incremental volumes last month The scooters offered in three battery configurations (2 kWh 3 kWh and 4 kWh) are priced at Rs 74999 Rs 84999 and Rs 99999 respectively.Retaining the second position once again was TVS Motor which sold 19471 iQube escooters during the month thus cornering an 18.2 percent marketshare in July 2024.The Chennaibased twowheeler maker in an official release stated that its EV sales registered a growth of 61 percent with sales increasing from 13306 units in July 2023 to 21442 units in July 2024.Bajaj Auto which attained the third spot sold 17642 Chetaks sold in July. The Punebased automaker saw a 95 percent monthonmonth growth (9043 units) and secures a 16 percent marketshare. The Rajiv Bajajled automaker claimed that it has achieved 20000 bookings of the Cheatak escooters in July 2024.Hero MotoCorpbacked Ather Energy ranked fourth in the pecking order with sales going up to 10080 units in July from 6192 units in June achieving a 63 percent monthonmonth growth and a nine percent market share.Hero MotoCorp which secured the fifth position saw a 64 percent monthonmonth growth in sales. The Pawan Munjalled company saw its sales rising from 3074 units in June to 5044 units in July and capturing a five percent market share.         ",
    "Hero MotoCorp on Thursday said it has commenced operations in the Philippines.The strategic expansion marks a significant milestone in the company s efforts to strengthen its global presence it said in a statement.Terrafirma Motors Corporation (TMC) a part of the Columbian Group of Companies one of the leading automotive groups in the Philippines will serve as the exclusive assembler and distributor of the company s products and services it added. The commencement of operations in the Philippines will bolster our overall global presence...Partnering with TMC a distinguished entity within the Columbian Group we are poised to swiftly establish and expand our presence in this vital market  Hero MotoCorp CEO Niranjan Gupta said.An assembly unit and parts warehouse has been set up at Terrafirma Motors Corporation in Laguna Philippines.Spanning over 6000 square metre the facility boasts an annual capacity of over 150000 units.This new assembly facility will produce Xpulse 200 4V Hunk 160R 4V and the Xoom 110 scooter. Combining Hero MotoCorp s global expertise with our local knowledge we intend to make a significant impact in the market  TMC Chairman Bienvenido Sanvictores Santos stated.Hero MotoCorp is currently present in 48 countries with tech centres in India and Germany and manufacturing facilities in India Colombia and Bangladesh.        ",
    "HighlightsIn June 2024 the automotive sector showed a mixed performance. There was a sustained demand momentum for utility vehicles (UVs) and twowheelers (2Ws). However other segments experienced a subdued performance reflecting a varied landscape within the industry.Strong preference for UVsConsumers continued to favour mid and highrange utility vehicles (UVs) in the passenger car segment leading to                                     ",
    "Hero MotoCorp on Monday said it will hike prices of select motorcycle and scooter models by up to Rs 1500 with effect from July 1 2024 in order to partially offset the impact of higher input costs.The price revision will be up to Rs 1500 and the exact quantum of increase will vary by specific model and market the country s largest twowheeler maker said in a statement. The revision has been necessitated to partially offset the impact of higher input costs  it added.Hero MotoCorp sells a range of bikes including high selling Splendor range HF Deluxe and Glamour.Scooter range includes Xoom and Destini 125 XTEC.Shares of Hero MotoCorp were trading 0.46 percent up at Rs 5477.20 apiece on the BSE.        ",
    "Hero MotoCorp on Thursday said it will acquire an additional 2.2 per cent stake in Ather Energy for Rs 124 crore.Investment is being made in the form of purchase of additional shares from an existing shareholder of Ather Energy for acquisition of up to 2.2 per cent Hero MotoCorp said in a regulatory filing.The acquisition entails an investment of up to Rs 124 crore and is expected to be completed by July 31 2024 it added.Hero MotoCorp currently holds a 39.7 per cent stake in Ather Energy.Bengalurubased Ather Energy is engaged in designing manufacturing producing selling servicing software development and software management in relation to electric automobiles and charging infrastructure.The company is also engaged in storage distribution and management systems of electric power (including energy in the form of batteries) and other ancillary services.Ather Energy posted Rs 1753.8 crore revenue in FY24.        ",
    "Emkay Global Financial s research report on Hero MotoCorpWe reiterate BUY on HMCL as a defensive pick with strong growth and rerating triggers  HMCL trades at  20x FY26E PER vs.  2630x for other 2Ws ( 4  FY26E dividend yield). The 2W recovery continues to broaden with the rural segment also making a return  we continue to expect 23 year growth visibility led by return of firsttime buyers with likely normal monsoons in CY24 acting as a nearterm catalyst. Importantly HMCL s positioning in the fastgrowing 125cc motorcycle category has been uplifted by the recentlylaunched Xtreme 125R (over a month of waiting per channel checks despite strong competition  market share has improved to 17  in Apr24 vs. the recent 9  low). Potential rural focus by the GoI along with better affordability are added positives.OutlookOur estimates are unchanged  we retain our SoTPbased TP of Rs6000 share.For all recommendations report click here",
    "Hero MotoCorp Limited s shares surged by 4 percent to Rs 5314 in early trading on June 3 despite the company reporting a decline in sales for the month of May compared to the previous year.During May the renowned manufacturer of motorcycles and scooters witnessed a 4 percent decrease in sales with total units sold amounting to 498123. This figure marked a dip from the yearago period when the company had sold 519474 units.Follow our live blog for all the market updatesSpecifically domestic sales for the Splendormaker also experienced a decline with a drop of nearly 6 percent. In May the company sold 479450 units domestically down from just over 5 lakh units sold in the same month last year as per official data.However the company saw a notable increase in exports which surged by over 67 percent in May. Export figures for the month stood at 18673 units compared to 11165 vehicles sold during the same period in the previous fiscal year. The management is optimistic about increasing market share in FY25 driven by recent launches in the premium and 125 cc segments.  We anticipate accelerated growth in FY25 and are confident that the premium and 125 cc segments will gain market share  stated Hero MotoCorp s management during a postresults earnings call.Hero MotoCorp expects strong performance from its new premium segment bikes including the Maverick 440 Harley Davidson X440 and Karizma. Additionally the 125 cc segment featuring models like the Xtreme 125R Splendor and Glamour is receiving an excellent response.At about 9 20 am shares were trading at Rs 5270 up 3 percent from the last close on the NSE. Hero MotoCorp shares have risen 24 percent since the start of the year.",
    "Here s a quick look at which stocks will be in focus in trade on Monday from significant investments and major deals to monthly auto sales volumes announced over the weekend Monthly Sales Volumes Announced on June 1Maruti Suzuki India sales in May (YoY)Total sales down 2  at 1.74 lakh units Vs 1.78 lakh unitsTotal domestic sales rise 3.7  to 1.57 lakh units Vs 1.51 lakh unitsDomestic passenger vehicle sales up 0.2  at 1.44 lakh units Vs 1.43 lakh unitsTotal exports drop 34.4  to 17367 units Vs 26477 unitsTotal production increases 7.2  to 1.93 lakh units Vs 1.80 lakh unitsMaruti reduced prices of its auto gear shift variants across its models by Rs 5000 per unit effective June 1Tata Motors sales in May (YoY)Total sales grow 2.4  to 76766 units Vs 74973 unitsDomestic sales up 2  at 75173 units Vs 73448 unitsCommercial vehicle sales rise 2  to 29691 units Vs 28989 unitsPassenger vehicle sales up 2  at 47075 units Vs 45984 unitsMahindra and Mahindra sales in May (YoY)Total sales volumes grow 16.7  to 71682 units Vs 61415 unitsPassenger vehicle sales up 31  at 43218 units Vs 32886 unitsTractor sales increase 9  to 37109 units Vs 34126 unitsTractor exports grow 85  to 1872 units Vs 1013 unitsTVS Motor Company sales in May (YoY)Total sales grow 12  to 3.70 lakh units Vs 3.30 lakh units2wheelers sales up 13  at 3.59 lakh units Vs 3.19 lakh unitsElectric vehicle sales increase 4  to 18674 units Vs 17953 unitsExports jump 27  to 96966 units Vs 76607 units3wheeler sales down 8.8  at 10324 units Vs 11314 unitsHero MotoCorp sales in May (YoY)Sales volume falls 4.1  to 4.98 lakh units Vs 5.19 lakh unitsDomestic sales declines 5.7  to 4.79 lakh units Vs 5.08 lakh unitsExports grow 67.3  to 18673 units Vs 11165 unitsEscorts Kubota sales in May (YoY)Tractor sales drop 6.1  to 8612 units Vs 9167 unitsDomestic tractor sales down 5.4  to 8232 units Vs 8704 unitsEicher Motors sales in May (YoY)Royal Enfield sales down 8  at 71010 units Vs 77461 unitsInternational Business (Royal Enfield) sales grow 12  to 7479 units Vs 6666 unitsTotal VECV sales up 9.7  at 6901 units Vs 6289 unitsSML Isuzu sales in May (YoY)Sales up 21.2  at 1563 units Vs 1290 unitsPassenger vehicles grow 19.3  to 1245 units Vs 1044 unitsAtul Auto sales in May (YoY)Total sales up 112  at 2331 units Vs 1101 unitsVST Tillers sales in May (YoY)Power tillers   tractors sales down 34.1  to 2474 units Vs 3756 unitsStocks To WatchCoal IndiaCoal production in May grew by 7.5  yearonyear to 64.4 million tonnes and offtake increased by 7.2  yearonyear to 68.2 million tonnes.MOILThe manganeseore mining company has increased prices of all ferro grades of manganese ore with manganese content of Mn44  and above by 35 . It also hiked prices of all other ferro grades with manganese content below Mn44  by 30 . Furthermore it increased prices of all SGMR fines and chemical grades by 30  effective from June 1.Adani Ports and Special Economic ZoneAdani International Ports Holdings Pte (AIPH) a wholly owned subsidiary of Adani Ports has signed a 30year concession agreement with the Tanzania Ports Authority to operate and manage Container Terminal 2 at the Dar es Salaam Port Tanzania. The Adani Portsled consortium will acquire the project company in Tanzania which houses all port handling equipment and employees for  39.5 million. Container Terminal 2 has a capacity of 1 million TEUs and handles approximately 83  of Tanzania s container volume.Ashoka BuildconThe company has emerged as the lowest bidder for two projects worth Rs 2153 crore from the Maharashtra State Road Development Corporation.Ahluwalia ContractsThe company has received a contract worth Rs 2157 crore from India Jewellery Park Mumbai. The contract involves design engineering procurement and construction (EPC) for the construction and development of Gems   Jewellery Park in Mahape Navi Mumbai. It also bagged a contract worth Rs 88.15 crore from Daffodil Hotel.NMDCThe company announced total iron ore production at 2.34 million tonnes in May 2024 down 37  from 3.71 million tonnes in the yearago period. Iron ore sales fell 22  YoY to 2.82 million tonnes.Poonawalla FincorpThe NBFC company has achieved a milestone of gross NPA below 1  and net NPA below 0.5  as of May 31 2024.Oil and Natural Gas CorporationThe stateowned oil   gas exploration company said K C Ramesh ceased to be Chief Financial Officer with effect from June 1 due to superannuation.PuravankaraThe real estate developer through its subsidiary Purva Oak has acquired 12.75 acres of land in Thane. The land has an estimated potential carpet area of 18.20 lakh square feet and a potential gross development value (GDV) of Rs 4000 crore over the project lifecycle.Moschip TechnologiesThe Hyderabadheadquartered company has secured a Rs 509.37 crore contract from the Centre for Development of Advanced Computing (CDAC). The contract includes the design development and delivery of an HPC SoC based on 5nm technology.Shriram FinanceThe board has approved the reappointment of Umesh Revankar as Executive Vice Chairman of the company for 5 years with effect from October 26 2024 to October 25 2029. Further the board approved the elevation and redesignation of Parag Sharma as Managing Director   CFO of the company with effect from June 1 2024. Parag Sharma was Joint Managing Director   Chief Financial Officer of the company.Endurance TechnologiesSubsidiary Endurance Overseas Srl Italy has acquired a 100  stake in Italybased Ingenia Automation Srl for 3.6 million euros. Ingenia operates in the design production and installation of industrial automation systems.BSEThe country s oldest stock exchange has completed the acquisition of S P Dow Jones Indices  entire equity stake in Asia Index (AIPL) making AIPL a whollyowned subsidiary of BSE. AIPL will continue to provide its services to clients who are subscribed to AIPL s indices data products. AIPL was a joint venture between S P DJI and BSE and is best known for calculating and maintaining the popular index Sensex.RECThe staterun company has received approval from the board for raising funds up to Rs 1.45 lakh crore through the private placement of nonconvertible debentures. Further the board has approved the appointment of Harsh Baweja as Director (Finance) (as Additional Director) and Chief Financial Officer of the company with effect from May 14 2024.Canara BankThe bank has received approval for initiating the process of diluting a 14.50  stake in its subsidiary Canara HSBC Life Insurance Company by listing it on stock exchanges through an initial public offer (IPO). This will be subject to the approval of the Reserve Bank of India and the Government of India.PNC InfratechSubsidiary PNC Kanpur Highways has received Rs 390.62 crore from NHAI. This is part of the Settlement Agreement executed by the National Highways Authority of India and PNC Kanpur Highways due to a onetime settlement under the Vivad Se Vishwas II Scheme of the Government of India.Rossari BiotechThe company has incorporated its whollyowned subsidiary Rossari Global DMCC in Dubai. DMCC is the Dubai Multi Commodities Centre.Punjab National BankThe public sector lender has increased its marginal cost of fundsbased lending rate by 5 bps on 3month to 3year tenures with effect from June 1.Indian BankThe staterun bank has raised its marginal cost of fundsbased lending rate by 5 bps on its 3month to 1year tenures with effect from June 3.Vilas TranscoreThe company will make its debut on the NSE Emerge on June 3. The issue price has been fixed at Rs 147 per share. Its equity shares will be available in the TradeforTrade Surveillance Segment.Cartrade TechForeign investor CMDB II sold 1876059 equity shares (equivalent to 4  of paidup equity) in the company at an average price of Rs 900 per share. However TT Emerging Markets Unconstrained Fund bought 546012 equity shares (equivalent to 1.16  of paidup equity) in Cartrade at the same price.        ",
    "Hero MotoCorp reported sales of 4.98 lakh units of motorcycles and scooters in May 2024 marking a 4.1 percent decrease from the 5.19 lakh units sold in May 2023. Despite this decline the company saw a 12.6 percent growth in the first two months (AprilMay 2024) of the financial year 2025 with 10.31 lakh units sold compared to 9.15 lakh units during the same period last year.In the motorcycle segment Hero MotoCorp sold 4.71 lakh units in May 2024 down 3.7 percent from 4.89 lakh units in May 2023. The scooters segment experienced a nearly 11 percent dip with 26937 units sold in May 2024 compared to 30138 units in the previous year. Domestic sales also saw a decline of nearly 5.7 percent with 4.79 lakh units sold versus 5.08 lakh units yearonyear. However exports surged by 67 percent with 18673 units sold compared to 11165 units in May 2023.In a press statement Hero MotoCorp emphasised its focus on the premiumization of its product portfolio and ramping up production of the Xtreme 125R to meet continued unprecedented demand.  Hero MotoCorp registered a healthy growth in its export volumes during the month and continues to see increased demand for the VIDA V1 electric scooter. The company is gearing up for an energetic upcoming period with a slew of product launches and business expansions  the statement added.Also Read   Hero MotoCorp s Xoom to launch by September CEO promises  big strides  in EVThe world s leading twowheeler company reported robust Q4 results prompting brokerages to maintain a bullish outlook due to positive growth prospects. During the quarter Hero MotoCorp saw an 18.4  increase in net profit reaching Rs 1016 crore driven by robust volume growth a diverse product mix decreasing commodity expenses and increased average selling prices (ASPs). Revenue also increased by 14.6  reaching Rs 9519 crore in Q4 FY24 compared to Rs 8307 crore in the same period the previous year.Hero MotoCorp known for popular models like Splendor Plus HF Deluxe Passion Plus and Pleasure Plus continues to strengthen its market position with a strategic focus on product diversification and expansion.        ",
    "Hero MotoCorp is looking to expand its presence in the electric twowheeler segment as it aims to introduce new models below its current range to cater to a broader set of customers as per a senior company official.The country s largest twowheeler maker currently sells two electric scooters under its Vida range priced between Rs 1 lakh and Rs 1.5 lakh. We are expanding our portfolio in the first half of this year (current fiscal)..into the mid and the mass segment as well  Hero MotoCorp Chief Business Officer  Emerging Mobility BU Swadesh Srivastava said in an analyst call.With new product introductions this fiscal the company is going to be able to play in each of the three segments of premium mid and mass he noted. With this we are looking at significant growth within this year. And we are also looking to improve our cost structures  he said.The company is going to witness huge growth in the EV segment this year as well as next year he stated. We are looking at steep growth this year and next year based on the portfolio and the geographical expansion  Srivastava said.Hero MotoCorp has expanded the presence of the VIDA brand to more than 120 cities and over 180 touchpoints in the country.It has also entered into a partnership with Ather Energy for an interoperable charging network providing over 2000 charging points across 200 cities to its customers.To strengthen its global presence VIDA is also expected to make its debut in European and UK markets in FY25.Replying to a query Hero MotoCorp CEO Niranjan Gupta said the company s capex guidance remains between Rs 1000 crore and Rs 1500 crore for the current fiscal.He noted that there are new product launches in the offing. We are going to launch Xoom 125 Xoom 160  the scooter launches in the first half you will see more some more forays into the premium segment as well  he told an analyst.He further said   And we can confidently say that we are poised for accelerated growth moving forward for FY25 and beyond.         ",
    "Hero MotoCorp Limited which made its name in commuter motorcycles is upping the ante in the premium motorcycles segment (250cc to 500cc models). Apart from ramping up the capacities of models launched last year such as the Karizma XMR Hero Mavrick 440 and Harley X440 the company is looking at sales and distribution strategies to augment sales. FY 202324 has been the year of maximum number of launches while making big strides in the premium segment. We are now working on (increasing) the Premia (retail) stores (for higherend bikes) the (Hero) 2.0 upgrade digital journey customer experience etc. So it is a full 360degree approach to  Winning in Premium  segment  said CEO Niranjan Gupta. He added  You will see some more forays into premium segment as well. Hero MotoCorp had lunched the Karizma XMR (at an exshowroom price of Rs 1.72 lakh) Harley Davidson X440 (Rs 2.29 lakh)and most recently Hero Mavrick 440 (Rs 1.99 lakh). One of the segments where we can see an increase in the marketshare by a good quantum and I would not lay out the number is the premium one because we have launched three big brands HarleyDavidson X440 Mavrick 440 and Karizma last year. This year we are going to put investments behind scaling them up and brand building  Gupta told analysts in a postearnings conference call.The country s largest twowheeler manufacturer is looking to grow its market share in the premium range of motorcycles from around 5 percent in  the last fiscal. While it upgraded its network with the appointment of 75 Premia outlets (until Marchend) and the launch of over 400 Hero 2.0 stores it is also working on more variants of its existing premium bikes.Hero MotoCorp s Premia chain of dealerships currently houses the brand s premium motorcycles such as the Mavrick 440 X440 and the Karizma XMR in addition to its electric scooter Vida V1.Gupta said Hero would now focus investments to build awareness about its premium offerings.  So across the board you can see that acceleration in the actions very confident about our premium journey now  he said.Gupta had earlier indicated that the company would ramp up its Premia outlets to 100 by Juneend. In his view  the demand for premium motorcycles is not only coming from metros but also from tierII and III areas.Replying to a question on the response to the higherend motorcycles Gupta said  We did say that we want to increase the capacity to 10000 per month of these three brands. In another one or two months... we will have 10000 units per month capacity from a supply point of view. Talking specifically about the individual brands he said  Karizma (XMR) had a good response and it is building up. Mavrick sales have just started and the HarleyDavidson X440 is actually moving up as we are expanding to more stores.  The company claimed that it has established the HarleyDavidson at about 10 percent market share in areas it has been made available.Talking about other segments Gupta revealed that after the Xoom 125 the company is gearing up to launch the Xoom 160. The new ICE scooter debuts in the first half of the financial year.   We can confidently say that we are poised for accelerated growth moving forward for FY25 and beyond  Gupta said.Going forward Gupta said that Hero will consistently grow volumes thereby improving operating leverage aggressively grow its premium portfolio take its PAM or parts accessories and merchandise business growth into double digits and intensify cost saving initiatives across the value chain. While we do all this we will continue to invest behind new products and segments including EVs (electric vehicles) and premium going digital to enhance customer buying experience and new product development  he said.Early this year Gupta indicated that Hero will be launching three electric twowheelers this fiscal including an affordable variant of the Vida electric scooter.  As Gupta put it  We continue to expand in our EVs where we continue to build the infrastructure which is 180plus dealers and we have expanded to 120plus cities. To a question on the sales target for this year Gupta noted  We won t go as far as to call out the numbers on the volume guidance. We are fairly confident about our doubledigit revenue growth. Now what shape and mix of volume and price and mix and all that happens that one we will see how the industry navigates through.         ",
    "Net Sales at Rs 9519.30 crore in March 2024 up 14.6  from Rs. 8306.78 crore in March 2023.Quarterly Net Profit at Rs. 1016.05 crore in March 2024 up 18.29  from Rs. 858.93 crore in March 2023.EBITDA stands at Rs. 1539.19 crore in March 2024 up 16.61  from Rs. 1319.92 crore in March 2023.Hero Motocorp EPS has increased to Rs. 50.84 in March 2024 from Rs. 42.99 in March 2023.Hero Motocorp shares closed at 5141.35 on May 16 2024 (NSE) and has given 61.79  returns over the last 6 months and 90.99  over the last 12 months.",
    "LKP Research s research report on Hero MotocorpHero Motocorp Ltd (Hero) reported decent set of numbers in Q4 FY24 with the 2W industry in a sweet spot as volumes grew by 9.6  yoy. Topline grew by 14.6  yoy on 4.6  yoy growth in ASPs and better product mix. Net realizations grew by 4.6  yoy to  68.3K. Input costs to sales ratio in Q4 were at 66.4  down from 68  yoy and 67.3  qoq as commodity costs softened. Other expenses to sales moved down to 12.5  flattish qoq up 20 bps yoy from 12.3  on higher EV expenses expansion in dealerships new launches etc. EBITDA margins were still up both sequentially by 30 bps and 100 bps yoy supported by the input cost benefits cost cutting initiatives operating leverage and product mix tilted towards high margin premium products. However margins were dragged by  100200 bps because of EV products and related expenses. As depreciation expenses rose 10  yoy and 1.9  qoq and other income degrew by 24  yoy PBT grew by 18  yoy while PAT too grew by 18  yoy at  10.16 bn a sequential fall of 5 .OutlookEV spending may impact margins in the short to midterm till we see an expansion of scale and volumes. We therefore maintain our BUY rating on the stock with a slightly reduced FY26E target price of  5378 (valued at 18x v s current multiple of 16x).For all recommendations report click here",
    "Shares of twowheeler major Hero Motocorp on Tuesday closed higher by 3 per cent on Tuesday taking its market valuation to more than Rs 1 lakh crore for the first time.Continuing its winning run for the fifth session in a row Hero Motocorp shares hit a 52week high of Rs 5050 per share on BSE. The stock closed up by 3.15 per cent at Rs 5041.90.The stock hit a 52week high of Rs 5051 on NSE. Shares closed higher by 3.37 per cent at Rs 5050 apiece on NSE.At close the market valuation of Hero Motocorp stood at Rs 100803.27 crore on BSE and Rs 100965.21 crore on NSE.In volume trade 49178 equity shares were traded on the BSE while 13.35 lakh shares were traded on the NSE during the day.The 30share BSE Sensex benchmark jumped 328.48 points or 0.45 per cent to settle at 73104.61 while broader NSE Nifty gained 113.80 points to close at 22217.85.On Monday Hero MotoCorp said it has joined the Open Network for Digital Commerce (ONDC) to enhance reach and convenience and provide an easily accessible digital mode to customers.The open network will initially offer twowheeler parts accessories and merchandise.Last week twowheeler maker Hero MotoCorp Ltd reported a 16.3 per cent rise in consolidated profit after tax to Rs 943.46 crore in the fourth quarter ended on March 31 2024 riding on higher sales.The company had posted a consolidated profit after tax of Rs 810.8 crore in the same period a year ago.Consolidated revenue from operations during the quarter under review stood at Rs 9616.68 crore as against Rs 8434.28 crore in the corresponding period a year ago.        "
]