[
    "",
    "Oil and Natural Gas Corporation reported a decline of 1.4 percent in its total crude oil production in the first quarter of the financial year 202425 the company said in a press release on August 5.ONGC s total crude oil production came in at 5.237 million metric tonnes (MMT) compared to 5.311 MMT last year.The company s total gas production in Q1 declined 4.1 percent at 5.008 BCM compared to 5.221 BCM last year.The decline in oil and gas production comes despite the government s push for increasing domestic and gas production in the country to reduce reliance on imports for energy needs.India currently imports around 87 percent of its crude oil and almost 50 percent of its gas requirement.In Q1 ONGC posted a decline of 42.8 percent in consolidated net profit at Rs 10236 crore as compared to Rs 17893 crore in the same period a year ago.Sequentially ONGC s consolidated net profit fell 11 percent in the quarter ended June 30 from Rs 11526.53 crore in the March quarter.The stateowned oil and gas exploration major reported 1.7 percent increase in revenue from operations for the quarter amounting to Rs 1.66 lakh crore compared to Rs 1.63 lakh crore recorded in the same period of the previous year.        ",
    "Oil and Natural Gas Corporation (ONGC) reported a decline of 43 percent in consolidated net profit in the first quarter of the financial year 202425.The stateowned oil and gas exploration major witnessed a decline in crude oil and gas production in the quarter.  looks at the key highlights from the company s first quarter results The consolidated net profit came in at Rs 10236 crore in the first quarter as compared to Rs 17893 crore in the same period a year ago.ONGC s consolidated net profit fell around 11 percent in the quarter ended June 30 from Rs 11526.53 crore in the March quarter.The oil PSU reported 1.7 percent increase in revenue from operations for the quarter amounting to Rs 1.66 lakh crore compared to Rs 1.63 lakh last year.ONGC s earnings before interest tax depreciation and amortisation (EBITDA) for Q1 rose to Rs 18617.5 crore.Crude oil price realization from ONGC s nominated fields was  83.05 per barrel for Q1 compared to  76.36 per barrel for the same period last year.In the first quarter the company s total crude oil production declined 1.4 percent from last year at 5.237 million metric tonnes (MMT).ONGC s total gas production in Q1 declined 4.1 percent at 5.008 BCM compared to 5.221 BCM last year.The company said it has declared total five discoveries in FY25 so far.ONGC declared three more discoveries since May 20 in its operated acreages. Out of these two are prospect (one in onland one in offshore) and one is new pool (onland) discovery.On August 5 ONGC s shares closed 6.06 percent lower at Rs 310.15 apiece.        ",
    "Oil and Natural Gas Corporation (ONGC) posted a decline of 42.8 percent in consolidated net profit at Rs 10236 crore in the first quarter of the financial year 202425 as compared to Rs 17893 crore in the same period a year ago.Sequentially ONGC s consolidated net profit fell 11 percent in the quarter ended June 30 from Rs 11526.53 crore in the March quarter.The stateowned oil and gas exploration major reported 1.7 percent increase in revenue from operations for the quarter amounting to Rs 1.66 lakh crore compared to Rs 1.63 lakh crore recorded in the same period of the previous year.ONGC s earnings before interest tax depreciation and amortisation (EBITDA) for Q1 rose to Rs 18617.5 crore.Crude oil price realization from ONGC s nominated fields was  83.05 per barrel for Q1 compared to  76.36 per barrel for the same period last year.In the first quarter the company s total crude oil production declined 1.4 percent from last year at 5.237 million metric tonnes (MMT). ONGC s total gas production in Q1 declined 4.1 percent at 5.008 BCM from last year the company said in a press release.The company said it has declared total five discoveries in FY25 so far.On August 5 ONGC s shares closed 6.06 percent lower at Rs 310.15 apiece.        ",
    "Oil and Natural Gas Corporation (ONGC) has intensified operations to increase gas production in Tripura to feed power generation plants in the northeastern state an official said on Monday.The decision comes amid reports of a reduction in gas supply to various gasbased power generation plants in the state.ONGC produced 1527 million standard cubic metres (MMSCM) of gas in Tripura in the 202324 fiscal while it has set a target of extracting 1675 MMSCM gas in the current fiscal. ONGC has been working to increase gas production so that sufficient gas is supplied to the gasbased power plants in Tripura. We have already set a target of extracting 1675 MMSCM of gas during the current fiscal year (202425) while the production was 1527 MMSCM in 202324  ONGC s Tripura Asset Manager Krishna Kumar told PTI.He said that ONGC will dig as many as 20 new wells for gas exploration in the financial year 202425 and one more rig will be added shortly to boost the exploration drive. At present six rigs are being used by ONGC to explore natural gas in the northeastern state.Besides new exploration ONGC has also initiated the process of cluster drilling to extract gas using old well sites as existing wells already have facilities and approval for exploration. Due to rapid urbanisation in Tripura ONGC is focusing on cluster drilling to extract gas by using old wells because facilities are already available there. Also we don t need to get fresh approval from the state for gas exploration or extraction in those sites. There is also no need to acquire land which has become a costly affair  he said.Emphasising the issue of proper utilisation of gas Kumar said if one of the units of the Palatana power plant in the state shuts down for any reason the gas supply becomes surplus causing loss to ONGC. If gas becomes surplus due to the shutdown of any plant it becomes a problem because other plants operating in the state do not have the capacity to receive the surplus gas. It causes loss to the ONGC  he said.Various staterun agencies operate the gasbased power plants in Tripura.        ",
    "ONGC Videsh Ltd the overseas investment arm of stateowned Oil and Natural Gas Corporation (ONGC) has acquired Norwegian firm Equinor s stake in an Azerbaijan oilfield and an associated pipeline for USD 60 million the firm said in a statement.OVL  has signed a definitive sale purchase agreement (SPA) for directly acquiring 0.615 per cent participating interest (PI) in offshore Azeri Chirag Gunashli (ACG) oil field in Azerbaijan from Equinor. The agreement also includes acquiring 0.737 per cent shares of the Baku Tbilisi Ceyhan (BTC) pipeline company through its whollyowned subsidiary ONGC BTC Limited  it added.The acquisitions expected to be completed in the upcoming months involve a total investment of up to USD 60 million.OVL currently has a 2.31 per cent stake in the ACG field and 2.36 per cent in the BTC pipeline. The buyout of Equinor will help raise its stake.Equinor in December last year announced an agreement to sell all its remaining assets in Azerbaijan to SOCAR (State Oil Company of Azerbaijan Republic).The assets comprised a 7.27 per cent nonoperated interest in the Azeri Chirag Gunashli oil fields in the Azerbaijan sector of the Caspian Sea 8.71 per cent interest in the BakuTbilisiCeyhan (BTC) pipeline and 50 per cent in the Karabakh field.SOCAR already held a 25.0 per cent stake in ACG a 25.0 per cent stake in BTC via Azerbaijan BTC Limited and 50 per cent in Karabakh.It is not clear how Eqinor which had agreed to sell all of its stake to SOCAR ended up selling a 0.615 per cent stake in the oilfield and a 0.737 per cent stake in the pipeline. The statement made no mention of this.Originally OVL acquired a 2.72 per cent stake in ACG in March 2013.ACG contract extension till 2049 was signed between field partners and SOCAR in September 2017. As per the restated and amended production sharing agreement (PSA) for the extension period the stakes of international oil companies were reduced with OVL s interest becoming 2.31 per cent from 2.72 per cent.BP is the operator of the field with a 30.37 per cent stake. The remaining stake in the field is divided between Japanese firms and ExxonMobil. ACG is a supergiant offshore oil field in the Caspian Sea operated by oil major BP since 1999. The field has been developed in phases and a seventh production platform Azeri Central East has been commissioned in early 2024  the statement said.BakuTbilisi Ceyhan (BTC) pipeline carries oil from the AzeriChiragDeepwater Gunashli (ACG) field and condensate from Shah Deniz across Azerbaijan Georgia and Turkiye. It links the Sangachal terminal on the shores of the Caspian Sea to the Ceyhan marine terminal on the Turkish Mediterranean coast.OVL holds a stake in 32 oil and gas projects in 15 countries ranging from Vietnam to Venezuela. It currently produces some 200000 barrels of oil and oil equivalent natural gas per day from these assets.        ",
    "Shares of Oil and Natural Gas Corp are trading higher after Reuters reported citing industry source that India s largest oil and gas exploration company has sought a waiver from the U.S. Office of Foreign Assets Control to lift crude oil from Venezuela.The report said ONGC is optimistic of winning an approval according to a source who declining to be named.Earlier this year US had reimposed sanctions on Venezuela citing that the country had broken an accord to hold free and fair elections.India and even American oil refiners had increased imports of Venezuelan oil in 2023 after a sixmonth waiver from sanctions was announced which ended in April this year. Oil from Venezuela was among the cheapest for India s oil refiners with average landed cost reported at  60.60 a barrel in January this year.The Reuters report added that ONGC has been hopeful of recovering  500 million worth of dividends pending since 2014 for the stake it holds in Venezuelan projects. ONGC has instead sought oil instead of the pending dividend however there has not been much progress on that front so far.Crude oil has rallied this year helped by supply cuts by OPEC  though a volatility has declined to multiyear lows in June.        ",
    "ONGC shares gained after the firm announced it will invest around Rs 2 lakh crore to establish renewable energy sites and green hydrogen plants in an attempt to achieve its netzero carbon emission goal by 2038.Additionally the stateowned firm will invest Rs 97000 crore by 2030 to establish 5 gigawatts of renewable energy capacity green hydrogen biogas a pump storage plant and an offshore wind project.ONGC released a 200page document on July 9 explaining its process and path to achieving net zero emissions. It listed clean energy projects even though the company plans to boost its hydrocarbon output to meet India s energy needs.At 9.30 am ONGC shares were quoting Rs 299.25 on the NSE higher by 0.7 percent.Follow our live blog to catch all the updatesThe oil and gas firm said it will invest Rs 65500 crore more by 2035 for either a green hydrogen or green ammonia plant and the last Rs 38000 crore by 2038 in creating 1 GW of offshore wind projects.As a result of these projects ONGC will be able to offset around 9 million tonnes of carbon emissions it is directly or indirectly responsible for.The firm said it will put Rs 5000 crore to cut gas flaring to zero by 2030 through technological intervention. ONGC released 554 million cubic metres of methane in 202122 into the atmosphere mostly because it was an incidental byproduct of oil.Over the past year shares of staterun ONGC jumped more than 80 percent in the trade as against a 26 percent rise in the frontline Nifty 50 index during the same period.",
    "International brokerage Jefferies retained its buy call on ONGC noting that the central government s policy continuity should keep the oil PSU s profitability elevated.ONGC shares jumped over three percent in early trade on June 11 quoting Rs 267.6 on the NSE at 9.25 am. The oil player was the top gainer on the Nifty 50 index.Since the election verdict was announced on June 4 with the BJP unable to cross the 272mark to form a simple majority investors have offloaded their holdings in ONGC. The oil major s shares have tanked around 9 percent.According to Jefferies this correction appears overdone and can prove to be an attractive entry point for investors. The brokerage has a target price of Rs 390 per share on ONGC offering a 50 percent upside from current levels.Follow our live blog to catch all the updates ONGC s rampup in KG basin production in the third quarter of the current fiscal year and accretion to profitability are key triggers to monitor.Overall Jefferies remains confident that ONGC s profitability will remain elevated compared to its past averages.In its note on April 15 Jefferies said it expects the stateowned company ONGC to generate strong free cash flows and reduce consolidated net debt which would lead to a profitable growth over FY2426. In the past reforms in crude and gas pricing impacted the company s profitability above past decade averages. Going ahead we believe that a sharp rise or fall in crude prices could be potential risks for ONGC  they added.ONGC shares have jumped 67 percent in the past year as compared to a 25 percent rise in the frontline Nifty 50 index.",
    "Stateowned Oil and Natural Gas Corporation (ONGC) is seeking help from an internationallyproven technical service provider to raise oil and gas production from its flagship but old and maturing Mumbai field in the Arabian Sea.The firm has floated an international tender to identify the service provider who will help raise production from the field ONGC said in a post on X.  The giant multilayered Mumbai High field which commenced production 48 years ago in 1976 is currently in its mature stage of production and ONGC has implemented a number of schemes in this field to improve production  it said. As a custodian and operator of Mumbai High field ONGC is keen to collaborate with a global technical service provider. The service provider would be contracted for 10 years extendable by another five years.  Mumbai High field lies 160 kilometres off the coast of Mumbai and produces about 38 per cent of India s oil production. While it hit a peak output of 40000 barrels per day in 1989 the field is producing 134000 bpd and about 10 million standard cubic metres per day of gas.The field is estimated to hold a balance reserve of 80 million tonnes (610 million barrels) of oil and over 40 billion cubic metres of gas. The service provider would give technical solutions for raising the output. It will be paid a fixed fee and a biddable share from the revenue earned from incremental production over an agreed baseline. Mumbai High is one of the prime assets of ONGC and significant upside is still to be unlocked here if ONGC applies bestinclass reservoir management technologies and adopts globallybest operational and management practices  the firm said adding that the bids are due in midSeptember. The identified service provider would carry out a comprehensive review of field performance and identify improvements in wells reservoirs including water injection and facilities management (WRFM).It would suggest and help implement suitable technological interventions to improve production. Integrated reservoir FEED studies and development of detailed work plans for field development would also be within the scope of work it said.  All international oil and gas majors having annual revenue above USD 75 billion are invited to participate in this ICB.         ",
    "Motilal Oswal s research report on ONGCONGC s reported EBITDA stood at INR174b ( 7  YoY) in 4QFY24 3  below our estimate mainly due to higherthanexpected other expenses. The sharp rise in other expenses was due to oneoff charges of INR9b for taxrelated matters. 4Q PAT was 13  higher than our estimate mainly aided by lowerthan expected depreciation and dry well writeoffs. ONGC management expects total production (excl. JV) to rise to 47mmtoe in the next three years from 39mmtoe now mainly driven by KG98 2 and Daman upside development. Gas production from the KG98 2 asset which will begin in 3QFY25 is expected to ramp up to 10mmscmd by FY25 end while oil production could ramp up to 45000bopd by 4QFY25. FY24 capex stood at INR370b attributed to oneoff projects and the capitalization of some expenses. ONGC expects capex to normalize at INR330350b in FY25.OutlookONGC is trading at 2.8x FY26E EV EBITDA (SA) and 7.1x FY26E P E (SA). We value the company at 7x FY26E adj. EPS of INR34 and add the value of investments to arrive at our TP of INR340. We reiterate our BUY rating on the stock with a 21  upside potential.For all recommendations report click here",
    "Oil and Gas stocks bled on June 4 as investors rushed to book profits after the sharp rally in the previous session. The Nifty Oil   Gas index slipped over 5 percent in early trade with losses led by Adani Total Gas which nosedived over 10 percent.Shares of ONGC Gail India and other PSUs in the sector including HPCL Indian Oil and BPCL also fell up to 7 percent on account of profittaking.The Nifty Oil   Gas index had risen over 6 percent in the previous session after exit polls hinted at a thumping victory for the BJPled NDA with over 350 seats. Early leads show NDA leading in 294 seats.As early leads showed the NDA coalition s majority may not be as emphatic as exit polls had forecast Sensex and Nifty 50 dropped more than 4 percent eroding nearly Rs 25 lakh crore from BSE market capitalisation.Follow our market blog to catch all the live actionDeven Choksey MD of DRChoksey FinServ believes that the market is reacting with just two rounds of counting done. Also due to physical counting under VVPAT the process is slower this time around.He expressed concern over the market s response highlighting the uncertainty prevailing among traders particularly those holding positions based on anticipated election outcomes.However he emphasized that longterm investors were unlikely to make hasty decisions in response to the market volatility as the fundamental prospects of the economy and corporate sector remain intact despite the election outcome.According to the Choksey market will once again stabilize and the same high beta stocks will be bought.",
    "Prabhudas Lilladher s research report on ONGCOil and Natural Gas Corporation s (ONGC) operating profit was in line with estimates at Rs174.1bn (flat QoQ PLe  Rs175.5bn). PAT came in at Rs98.7bn (flat QoQ PLe  Rs79.6bn) on a standalone basis. Other income came in higher than expected at Rs36.8bn. On a QoQ basis oil production grew 3  while gas production remained flat. The company announced a final dividend of Rs2.5 share. Incremental production from KG Basin stands at 12000bopd of oil and 2.4mmscmd of gas. We estimate a 6  CAGR and 11  CAGR in total oil and gas production respectively over FY24FY26E.OutlookThe stock is currently trading at 6.2 6x FY25 26 EPS. We maintain  Hold  rating with a TP of Rs 265 valuing the standalone business at 7x FY26 adj EPS of Rs 28.1 and adding the value of investments of Rs 68.For all recommendations report click here",
    "Brokerages maintained their bullish bets on Oil   Natural Gas Corporation (ONGC) after the stateowned oil major posted higherthanexpected net profit for the quarter ended March.ONGC reported an increase of around 78 percent in consolidated net profit at Rs 11526.53 crore in the fourth quarter of the financial year 202324 as compared to Rs 6478.23 crore in the same period last year.The stateowned oil and gas exploration major reported marginal increase in revenue from operations for the fourth quarter of FY24 amounting to Rs 1.66 lakh crore.At 11 am shares of ONGC were trading flat at Rs 280.3 apiece on the NSE.Follow our market blog to catch all the live updatesONGC s management expects total production to rise to 47 million metric ton of oil equivalent (mmtoe) over the next three years up from 39 mmtoe currently.FY24 capex stood at Rs 37000 crore attributed to oneoff projects and the capitalization of some expenses. ONGC expects capex to normalise at Rs 3300035000 crore in FY25.Motilal Oswal increased its total production assumptions for FY25 FY26 by 2 percent 3 percent. The brokerage increased its price target to Rs 340 implying 21 percent potential upside and reiterated its buy rating on the stock.International brokerage Jefferies kept its buy call on the player steady with a target price of Rs 390 per share. This indicates an upside of nearly 40 percent from the previous session s closing price.Jefferies said that ONGC s jump in profit was 14 percent ahead of its expectations as a result of lower exploration costs and higher other income. Additionally ONGC s valuation is at a steep discount to Nifty compared to the longterm average.JM Financial also maintained its buy rating with an unchanged price target of Rs 300 per share as riskreward is still reasonable despite the recent rally. The brokerage said ONGC is a good play on high crude price scenario as well as robust dividend play.Over the past year ONGC shares have surged around 70 percent as compared to a 23 percent gain in the frontline index Nifty 50.",
    "Net Sales at Rs 34636.69 crore in March 2024 down 4.56  from Rs. 36292.55 crore in March 2023.Quarterly Net Profit at Rs. 9869.37 crore in March 2024 up 4084.4  from Rs. 247.70 crore in March 2023.EBITDA stands at Rs. 19570.70 crore in March 2024 up 41.82  from Rs. 13799.53 crore in March 2023.ONGC EPS has increased to Rs. 7.85 in March 2024 from Rs. 0.20 in March 2023.ONGC shares closed at 279.00 on May 18 2024 (NSE) and has given 41.02  returns over the last 6 months and 67.72  over the last 12 months.",
    "Oil and Natural Gas Corporation (ONGC) reported a 78 percent surge in its consolidated net profit for the fourth quarter of FY24 from last year. The explorer s revenue from operations however increased slightly during the JanuaryMarch 2024 period.ONGC reported a 1.6 percent slide in crude oil production in FY24 from last year despite the government s call for boosting domestic production to reduce reliance on imports.  takes a look at the highlights from the company s fourth quarter results  ONGC s consolidated net profit came in at Rs 11526.53 crore in the fourth quarter compared to Rs 6478.23 crore in the same period last year. Net profit however increased marginally in Q4 from the December quarter. The company s revenue from operations increased slightly amounting to Rs 1.66 lakh crore in the quarter ended March 31 compared to Rs 1.64 lakh crore last year. Its EBITDA for Q4 rose to Rs 25772 crore from Rs 15752 crore during the corresponding period last year. The company s board of directors recommended a final dividend of Rs 2.50 per equity share of a face value of Rs 5 each for FY24 subject to the approval of shareholders. Crude oil price realisation from ONGC s nominated fields was  80.81 per barrel for Q4 compared to  77.12 a year back. ONGC s total crude oil production increased 2.4 percent in Q4 from last year at 5.359 million metric tonnes (MMT) while its total oil production in FY24 declined 1.6 percent. ONGC s total gas production in Q4 declined 3 percent at 5.101 BCM (billion cubic meter) from last year while it fell 3.3 percent for the full year (2023 24). ONGC invested around Rs 37000 crore in capital expenditure for FY24 compared to Rs 30208 crore spent last year. During FY24 ONGC declared 11 discoveries (six on land and five offshore) in its operated acreages. Out of these six are prospects (one on land five offshore) and five are new pool (on land) discoveries. ONGC drilled 541 wells the highest recorded in the past 34 years comprising 103 exploratory and 438 development wells.        ",
    "Net Sales at Rs 166770.63 crore in March 2024 up 1.65  from Rs. 164066.72 crore in March 2023.Quarterly Net Profit at Rs. 10107.36 crore in March 2024 up 172.03  from Rs. 3715.48 crore in March 2023.EBITDA stands at Rs. 26329.83 crore in March 2024 up 11.29  from Rs. 23658.81 crore in March 2023.ONGC EPS has increased to Rs. 8.03 in March 2024 from Rs. 2.95 in March 2023.ONGC shares closed at 279.00 on May 18 2024 (NSE) and has given 41.02  returns over the last 6 months and 67.72  over the last 12 months.",
    "Oil and Natural Gas Corporation (ONGC) posted an increase of around 78 percent in consolidated net profit at Rs 11526.53 crore in the fourth quarter of the financial year 202324 compared to Rs 6478.23 crore in the same period last year.Sequentially ONGC s consolidated net profit increased marginally in the quarter ended March 31 from Rs 11104.50 crore posted in the previous quarter.The stateowned oil and gas exploration major reported marginal increase in revenue from operations for the fourth quarter of the current fiscal year amounting to Rs 1.66 lakh crore compared to Rs 1.64 lakh crore recorded in the same period of the previous year.The company s board of directors recommended a final dividend of Rs 2.50 per equity share of face value of Rs 5 each for the financial year 202324 subject to the approval of shareholders.ONGC s earnings before interest tax depreciation and amortisation (EBITDA) for Q4 rose to Rs 25772 crore from Rs 15752 crore during the corresponding period last year.According to the average of eight analysts estimates surveyed by   the upstream oil company s net profit was seen falling over 11 percent yearonyear to Rs 8434 crore.The company s Q4 revenue was expected to decline marginally by 1.11 percent to Rs 34404 crore. Meanwhile EBITDA was seen falling half a percent YoY to Rs 17251 crore on lower administered price mechanism (APM) gas price and lower oil and gas production by ONGC but partially offset by higher crude oil realisation.Crude oil price realization from ONGC s nominated fields was  80.81 per barrel for Q4 compared to  77.12 per barrel for the same period last year.In the fourth quarter the company s total crude oil production increased 2.4 percent from last year at 5.359 million metric tonnes (MMT). Meanwhile ONGC s total oil production in FY24 declined 1.6 percent.ONGC s total gas production in Q4 declined 3 percent at 5.101 BCM from last year the company said in a press release.During FY24 ONGC declared 11 discoveries (6 in onland 5 in offshore) in its operated acreages. Out of these 6 are prospects (1 in onland 5 in offshore) and 5 are new pool (onland) discoveries.ONGC drilled 541 wells the highest recorded in the past 34 years comprising 103 exploratory and 438 development wells.ONGC invested around Rs 37000 crore in capital expenditure in FY24 compared to Rs 30208 crore spent in the previous year.        ",
    "Norway s central bank has excluded Adani Group s port firm APSEZ from its government pension fund over ethical concerns making it the 15th Indian company to face such action with previous ones being the likes of ONGC GAIL NTPC and Vedanta. Norges Bank which manages the sovereign wealth fund on May 15 stated that it has decided to exclude Adani Ports and Special Economic Zone due to  unacceptable risk that the company contributes to serious violations of individuals  rights in situations of war or conflict. APSEZ which was on the central bank s watch list for possible exclusion from investment since March 2022 faced the action due to its business association with the armed forces in Myanmar. Sources however said the Adani group firm sold the Myanmar asset entirely in May last year and there has been no incremental disclosures made regarding that asset as the company has fully exited.The Norwegian fund s Council of Ethics acknowledged APSEZ s May 2023 disclosure that it had sold its portrelated operations in Myanmar to Solar Energy Ltd but said  no information on buyer is available and APSEZ has stated that it cannot share any such information on the grounds of confidentiality.  Lack of information means that the Council cannot establish whether APSEZ has links to the enterprise concerned. In a situation in which extremely serious norm violations are taking place this constitutes an unacceptable risk that the Norwegian Government Pension Fund Global s (GPFG s) investments in APSEZ may breach its ethical guidelines  it added.The Norwegian Fund started buying into APSEZ in midOctober post the May 2023 disclosure. It made near 70 per cent on its first purchase in nearly 6 months until it exited in April. APSEZ joins more than a dozen Indian firms which had faced similar action over the past few years according to information on the website of Norges Bank Investment Management.The Norwegian bank had excluded ITC in January 2020 over production of tobacco. Similar action followed against Zuari Agro Chemicals in October 2013 over alleged human rights violations. Vedanta faced similar action in January 2014 over  severe environmental damage .Coal India NTPC Reliance Power Tata Power and three other power producers faced a similar action in April 2016 for production of coal or coalbased energy. BHEL faced action in May 2017 and January 2023 over environmental damage and sales to states in armed conflicts.Oil and Natural Gas Corporation (ONGC) was charged with serious violations of individuals  rights in situations of war or conflict when it faced similar action in September 2021. GAIL was charged with the same in April 2023.        ",
    "The Oil and Natural Gas Corporation (ONGC) is likely to report a fall in net profit for the quarter ended March 2024 as analysts expect limited net realisation from oil and gas and flattish sales volume. The company will report its Q4FY24 earnings on May 20.The upstream oil company s net profit is seen falling over 11 percent yearonyear to Rs 8434 crore according to the average of 8 analysts estimates surveyed by  . The decline in profit after tax (PAT) is expected to be on account of lower oil and gas production and a lower administered price mechanism for gas.The company s Q4 revenue is expected to decline marginally by 1.11 percent to Rs 34404 crore. Meanwhile EBITDA is seen falling half a percent YoY to Rs 17251 crore on lower administered price mechanism (APM) gas price and lower oil and gas production by ONGC but partially offset by higher crude oil realisation.Sales volume estimatesMotilal Oswal expects oil realization (before windfall tax) to expand 5 percent YoY for ONGC in line with Brent movement in Q4FY24. Oil sales volumes are seen rising 4 percent onyear but gas sales volumes are expected to decline 2 percent YoY. The sales of Value Added Products (VAP) are also seen declining 4 percent YoY.Follow our market blog to catch all the live actionWriteoffs survey expenses to hit PATWith both oil and gas prices capped and volumes largely flat Kotak Institutional Equities expects a modest 35 percent QoQ EBITDA growth for upstream firms like ONGC led by lower operating expenses (Opex).The PSU s PAT is likely to decline 14 percent on a sequential basis as well due to likely higher writeoffs and survey expenses in the fiscal fourth quarter the brokerage said.Oil and Gas realisations estimatesJM Financial expects ONGC s Q4FY24 net crude and gas realisation to be largely flattish sequentially. Sales volume is also expected to be flat to slightly lower on a quarteronquarter (QoQ) basis.ONGC s net crude realisation adjusted for windfall tax will continue to be capped at  7273 per barrel with a tad lower gross crude realisation being offset by a slight cut in windfall tax the brokerage said.ONGC s gas realisations are also expected to be steady QoQ with domestic APM gas realisation being capped at  6.5 per metric million British thermal unit (MMBtu). Hence ONGC s Q4FY24 EBITDA is expected to be up 1.5 percent sequentially QoQ as we expect overall crude sales volume to be largely flattish QoQ while gas sales volume could go up 1.5 prcent QoQ  said JM Financial in its preview.Margins key monitorablesNomura expects Q4 margins to be at 50 percent while Elara Capital expects margins to be at 48 percent. According to analysts at Motilal Oswal an update on the rampup of gas production will be the key monitorable in the earnings report and postresult management commentary.Also Read   JSW Steel stock gains  reports 64.5  YoY decline in net profitONGC stocks triggerAccording to Motilal Oswal the potential operational and financial turnaround at ONGC Videsh Ltd (OVL) can be a major share price catalyst for ONGC. If ONGC manages to turn around ONGC Petro additions Ltd (OPaL) we believe this can add 58 percent to the current market price  the brokerage said. A delay in peak oil production from KG Basin or decline in oil prices below  75 per barrel are key downside risks it added.",
    "Oil and Natural Gas Corporation (ONGC) and NTPC Green Energy are reportedly in talks to form a consortium to bid for Ayana Renewable Power which is owned by the National Investment and Infrastructure Fund (NIIF) as interest grows in acquiring the Bengalurubased firm.According to reports ONGC and NTPC Green Energy may jointly bid for Ayana Renewable or ONGC could go solo. JSW Neo Energy Sekura Energy Masdar Macquarie and Sembcorp are also in the running to acquire Ayana Renewable.NIIF is expected to shortlist bidders in the coming weeks allowing them to conduct due diligence before submitting binding financial proposals.  couldn t verify the reports independently.Also Read  NTPC Green Energy inks pact with Indus Towers to develop renewable energy projectsEarlier this year ONGC launched ONGC Green a subsidiary dedicated to renewable energy projects while NTPC Green Energy has plans for an initial public offering. The two companies have in the past collaborated for offshore wind energy projects.Ayana Renewable Power boasts a substantial pipeline of over 4 GW of solar wind and hybrid power projects across multiple states. With an operational capacity of 1.3 GW in Andhra Pradesh Karnataka and Rajasthan Ayana is a significant player in the renewable energy sector.Also Read  Coal India NMDC ONGC Videsh to actively scout for critical mineral assets abroad  Govt ",
    "Shares of Oil and Natural Gas Corporation (ONGC) gained on April 18 as Morgan Stanley has issued an  overweight  call on the PSU stock with a target of Rs 304 per share. The brokerage expects the upstream oil company s outperformance to continue bolstered by improved capital allocation strategies.Additionally stable regulations are anticipated to support a steady 1820 percent return on equity (RoE).ONGC s slow rampup in domestic production by the end of 2024 has been well communicated adding to the positive outlook for the company Morgan Stanley said.The ONGC stock has gained over 5 percent in the last five trading sessions due to a surge in crude oil prices amid rising hostilities between Israel and Iran. The Brent crude prices have been hovering near  90 a barrel and are trading much higher than levels of  7580 a barrel seen in February this year.Follow our market blog to catch all the live actionAccording to analysts the upstream oil and gas producers as ONGC should benefit from higher crude prices.Jefferies also recently initiated coverage on ONGC with a  buy  rating driven by favourable crude and gas reforms as well as improved profitability. The brokerage has set a target price of Rs 390 apiece implying a potential upside of 37 percent from the previous close. The foreign brokerage also expects strong freecashflow (FCF) generation and netdebt reduction for the company.Why Jefferies is bullish on ONGCAccording to Jefferies analysts ONGC stands to gain from a tight crude oil market as the IEA (International Energy Agency). The government s pragmatism has also allowed it to increase ONGC net realization to  75 even in the face of industry underrecoveries.Also Special Additional Excise Duty (SAED) or windfall tax will not apply to new KGbasin output allowing for greater participation in the rise in oil prices.Reforms to gas pricing are expected to add to earnings for ONGC Jefferies added. Despite the higher operating expenses analysts believe that KG basin production would be profitable allaying a major investor concern. As a result of price reforms net realization per barrel of oil equivalent (boe) increased.Also Read   Buzzing Stocks  Adani Ent Infosys Tata Comm Vodafone Idea HDFC Bank Ambuja Cement Paytm Zee and othersAnalysts at Jefferies anticipate the trend to continue through FY24 26 estimated. Additionally after a 2 percent annualized decline in production over FY1424E ONGC s domestic production is expected to return to growth over FY2426.",
    "ONGC shares are seen rallying on bourses on April 15 a weak market day where BSE Sensex is down by 500 points at 10.45 am. ONGC shares are up by 3.63  percent trading at Rs 275 per share.ONGC shares alone are seen contributing to 200 points to recovery of BSE Oil   Gas index. The index is seen recovering by more than 1000 points from day s low. The index made a low of 27339 and is trading near 28400 levels  staging a recovery lead by IGL ONGC GAIL Linde India and Petronet LNG.In the derivative segment ONGC is one of the most active counter with action seen in 270 strike price CE and 280 strike price CE. Darpan Patil of Rupic consultancy believes that ONGC is near its 2014 multiyear breakout.ONGC shares are rallying after Jefferies initiated a  buy  call with Rs 390 per share target price. According to Jefferies the ONGC shares are trading at a steeper discount to the benchmark Nifty compared to its longterm average.  The valuation does not capture adequately due to its sharp discount as against the Nifty  they said in a note.Also read   Indicator flashes  buy  in these 3 stocks with buildup of positive momentumBSE Oil   Gas index outperforms Almost all the sectoral indices are down trading in red except BSE Oil   Gas index which is up by 0.77 percent. BSE Oil   Gas index has been one of the top performing indices in 2024 up by more than 22 percent on year to date basis. BSE Oil   Gas index has displayed one of the best outperformance over BSE Sensex in a sixmonth period since November 2023. Since November 2023 BSE Oil   Gas rose by 55 percent while BSE Sensex has gained by 15 percent."
]