[
    "United Nations  Climate Change Conference (COP 28) in Dubai is turning out to be a  practical  one and not just a COP of declarations with industry making commitments to back the global initiatives towards climate goals Satish Pai Managing Director of Hindalco Industries told   from his first trip to the annual conference.At COP28 the International Aluminium Institute (IAI) launched a new initiative that commits to reducing greenhouse gas emission. The aluminium industry s new initiative aims to transparently and publicly track ambition and progress in greenhouse gas reduction of all its member companies.Pai also the Chair of IAI said that the aluminium industry will play an important role in global electrification in the energy transition process. Aluminium plays a big part in electrification. The reason why the aluminium industry has come out so strongly and launched this initiative is because it is also an electricity intensive industry. We want to make sure that the aluminum that we produce has low carbon (emission)  Pai said. COP28 is the biggest climate conference ever held with over 95000 politicians diplomats business leaders journalists and activists registered for it.How will the initiative work The industry aims to state a longterm greenhouse gas emission reduction target by 31 December 2024 preferably netzero and preferably by 2050 along with a plan to achieve the target. It will identify an interim greenhouse gas emission reduction milestone ideally by 2030 to ensure early progress can be tracked.To ensure accountability it will disclose progress annually including all facilities utilizing the  IAI Good Practice for Calculation of Primary Aluminium IAI s Carbon Footprint Methodology  and the  IAI Guidelines on Transparency   Aluminium Scrap  as the calculation references.The emissions reduction will need investment in new equipment and technology at company and facility level.When asked if the industry has made any assessment of the total investment required Pai said  The investment profile is different depending on the region you are in. If you are in Europe you have access to hydropower and you have less of an investment to do. But I think what we should focus on is what they call the global south the majority of our power is from coal. To decarbonize our electricity profile and the grid this is where the majority of the investment will have to go  Pai said.He identified India China and the Middle East as geographies that will require substantial investment for decarbonisation.Hindalco s Decarbonisation PlansThe Aditya Birla Group s aluminium and copper flagship company has embarked on a plan to transform from a legacy aluminum producer into a sustainability leader.Hindalco is cocreating a solution for consuming 100 megawatts (MW) of  round the clock  (RTC) green power at its Aditya smelter involving renewable hybrid energy with pumped hydro storage. The concept is that we will be using a combination of solar wind and pumped hydro to give us an 85 percent load factor. We are actually going to start using this in our Aditya smelter from third quarter next year Pai said while adding that the success of this project can be used as a blueprint for the decarbonisation of the company. Just to be clear Hindalco has a target that 30 percent of its aluminium production will be low carbon by 2030. And the pumped hydro contract is actually one of the kingpins of our strategy to make that happen  Pai said.        ",
    "The market seems to be on a strong footing with the benchmark indices relentlessly hitting new highs day after day aided in large part by positive domestic and global cues. Technically too overall the Nifty50 looks positive though it seems to be in the overbought zone given the consistent run up in the recent past.Hence the ongoing rally may continue in the short to medium term but given the overbought levels a small correction and consolidation can t be ruled out. Generally such intermittent corrections and consolidations are always healthy for the market which can make it ready for the next uptrend experts said.They expect the Nifty to hit 2150022000 points in coming months. The Nifty has formed bullish candlestick pattern with long lower shadow on the daily charts on December 5 indicating buying interest at lower levels.The Bank Nifty has formed a High Wave or Doji kind of candlestick pattern on the daily scale indicating indecisiveness among buyers and sellers about future market trend.On December 5 the BSE Sensex had rallied 335 points to 69200 while the Nifty50 jumped 116 points to 20802 at 14 15 hours IST. The Nifty managed to hold on to the gains and also built upon it which indicates that there is more steam left in the rally. On the upside we expect it to stretch higher till 21500  said Jatin Gedia technical research analyst at Sharekhan by BNP Paribas.In case of a dip consolidation towards the support zone of 2055020500 it should be used as a buying opportunity he advised.Mandar Bhojane research analyst at Choice Broking also said a correction either in terms of time or price seems warranted suggesting that one should consider entering positions on dips for a more favourable riskreward profile.  collated the list of stocks that can give healthy doubledigit return in the short term given the continuation of bull run in the equity markets Expert  Riyank Arora technical analyst at Mehta EquitiesNBCC (India)  Buy   LTP  Rs 78.60   StopLoss  Rs 70   Target  Rs 100   Return  27 percentThe stock price has been finding support on its 21day EMA (exponential moving average) and 50day SMA (simple moving average) currently placed at Rs 69 and Rs 64.65 respectively. The primary trend for the stock has been bullish as it currently trades above all the important moving averages.The stock price has experienced a strong breakout above its recent resistance zone of Rs 72 to Rs 74 accompanied by a sharp increase in volumes. With the stock continuously forming higher highs and higher lows it appears poised for significant gains.Shriram Properties  Buy   LTP  Rs 119   StopLoss  Rs 102.50   Target  Rs 166.60   Return  40 percentThe stock has experienced a strong breakout above its crucial resistance mark of Rs 115.75. The formation of a Rounding Bottom Pattern accompanied by strong rising price bars and high volume activity indicates the possibility of a strong upward movement.The stock recently found support on the 21 EMA and bounced back indicating a bullish trend on all time frames. With immediate support placed at the Rs 102.50 mark it should serve as a good stoploss for a calculated target of around Rs 166.60 on the upside.Apollo Tyres  Buy   LTP  Rs 450   StopLoss  Rs 425   Target  Rs 500   Return  11 percentApollo Tyres has broken out of a bullish pattern on the daily time frame marked by a bullish candlestick and aboveaverage volumes indicating strength. The stock currently trades well above all its important EMAs which acts as a confirmation signal.The stock is observed breaking above its crucial resistance mark of Rs 440. With the immediate support placed at the Rs 425 mark it can serve as a good stoploss and the stock seems poised for a target price of Rs 500.Expert  Sheersham Gupta Director and Senior Technical Analyst at RupeezyFinolex Cables  Buy   LTP  Rs 1018   StopLoss  Rs 940   Target  Rs 1170   Return  15 percentFinolex cables has been correcting since September after hitting an alltime high of Rs 1200. After finding support at the 200DMA (daily moving average) the stock consolidated for one month and gave a breakout after forming a WPattern.Finolex Cables crossed its 50DMA in the previous week with good volumes and the daily RSI (relative strength index) is at 66 indicating the bullish momentum in the stock.The stock can be bought with a target of Rs 1170 and a stoploss of Rs 940 on daily closing basis.Hindalco Industries  Buy   LTP  Rs 519.25   StopLoss  Rs 488   Target  Rs 582   Return  12 percentThe Rs 500 level was a big resistance for Hindalco and the stock has been trading below it since April 2022. The stock decisively crossed this level with good volumes in the previous month forming a Cup and Handle pattern and has been holding above it since then.The daily RSI at 69 signals bullish momentum with good upside potential. Any move up from here can push the stock to its next resistance level in the next four to five weeks.Thus Hindalco can be bought at the current level with a stoploss of Rs 488 on daily closing basis for a target price of Rs 582.ABB India  Buy   LTP  Rs 4630.75   StopLoss  Rs 4365   Target  Rs 4990   Return  8 percentABB has been on a great bull run since November 2020 giving investors over a fivefold return since then. After crossing the big resistance at Rs 4600 the stock corrected 18 percent from there.Forming a Double Bottom pattern ABB has given a breakout with good volumes from this level. The bullish momentum in the stock is reflected in its daily RSI of 73.Thus ABB can be accumulated for a target of Rs 4990 while keeping a stoploss of Rs 4365 on daily closing basis.Expert  Kushal Gandhi technical analyst at StoxBoxIndian Energy Exchange  Buy   LTP  Rs 145   StopLoss  Rs 135.5   Target  Rs 164   Return  13 percentThe weekly pattern analysis shows that price action has potentially bottomed out and buyers are gradually seizing strength after a 63 percent deep correction. The stock has been forming a 13week base indicating further accumulation which is a positive sign. We reiterate a buy on IEX for a target of Rs 164 with a stoploss at Rs 135.50.Avenue Supermarts  Buy   LTP  Rs 3967.1   StopLoss  Rs 3767   Target  Rs 4610   Return  16 percentThe weekly pattern analysis exhibits that the price action is trading in a volatility contraction pattern. The constant shrinking of price and time correction in subsequent bases indicate the participation of smart hands attempting to absorb the available supply before it resumes its upward primary trend.We anticipate a potential upside of 16 percent for the target of Rs 4610 against a 5 percent risk with a stoploss at Rs 3767.Mangalore Chemicals and Fertilisers  Buy   LTP  Rs 118   StopLoss  Rs 112.5   Target  Rs 132   Return  12 percentThe pattern analysis on the daily timeframe shows that the price action is holding on to a relatively strong trend as it trades within an ascending channel pattern.The price action witnessed a tepid breakout following an elongated period of lateral trend within the channel along with signs of positive momentum burst. We reckon a buy on Mangalore Chemicals and Fertilisers for a target of Rs 132 with a stoploss of Rs 112.50 for a favourable risktoreward opportunity.Expert  Vinay Rajani CMT Senior Technical   Derivative Analyst at HDFC SecuritiesBank of India  Buy   LTP  Rs 109.2   StopLoss  Rs 102   Target  Rs 125   Return  14.5 percentThe stock has been finding support on its 20day EMA currently placed at Rs 104. Primary trend for the stock has been bullish as it has been trading above all important moving averages.The stock has formed a bullish inverted head and shoulder pattern on the daily chart. Indicators and oscillators like DMI (directional movement index) and RSI have turned bullish on the daily charts. The PSU Bank Index has resumed its primary uptrend after a small consolidation.",
    "Net Sales at Rs 54169.00 crore in September 2023 down 3.57  from Rs. 56176.00 crore in September 2022.Quarterly Net Profit at Rs. 2196.00 crore in September 2023 down 0.41  from Rs. 2205.00 crore in September 2022.EBITDA stands at Rs. 6075.00 crore in September 2023 up 6.77  from Rs. 5690.00 crore in September 2022.Hindalco EPS has decreased to Rs. 9.88 in September 2023 from Rs. 9.92 in September 2022.Hindalco shares closed at 500.25 on November 22 2023 (NSE) and has given 22.70  returns over the last 6 months and 16.16  over the last 12 months.",
    "",
    "Prabhudas Lilladher s research report on Hindalco IndustriesHindalco Industries (HNDL) 2QFY24 Consolidated revenue grew 2  QoQ to Rs 541bn (PLe Rs 554bn) on stronger Novelis and copper business performance. Novelis  Flat Rolled Products (FRP) volumes grew 6  QoQ to 933kt (5.2  YoY  PLe 940kt) on stronger North America   European volumes. Consolidated EBITDA declined 2  QoQ to Rs 56.1bn (8  lower Vs PLe Rs61bn) despite lower input costs in India and better Novelis performance. We believe HNDL is best placed amongst the metals space as a) Novelis is expected to witness gradual improvement in per ton EBITDA over next few quarters  b) opening up of captive coal mines to benefit India business post FY26  and c) rising focus on high margin value added products such as FRP expansion would drive volume growth from FY26.OutlookDespite business headwinds Novelis continue to perform well and invest significantly in growth. We have raised our FY24 25 26E EBITDA by 6  1  4  respectively on robust Novelis performance. At CMP stock is trading at attractive valuations of 5.2x 4.4x EV of FY25E FY26E EBITDA. Retain  Buy  rating with revised TP of Rs583 (earlier Rs557) valuing Novlies at 6.5x EV of Sept 2025E EBITDA as we roll forward.For all recommendations report click here",
    "The Odisha government has approved eight projects with a total investment proposal of over Rs 1397 crore in six districts a statement said. These projects will generate employment opportunities for 2860 people in the state.The State Level Single Window Clearance Authority on November 17 gave its nod to eight proposals with a total investment of Rs 1397.18 crore the statement said. The government has greenlighted the proposal of Sintex BAPL Ltd to set up a plastic pipes and tank manufacturing unit in Sambalpur district with an investment of Rs 479.47 crore.Hindalco Industries Ltd s plan to invest Rs 241.05 crore to build a whitefused alumina manufacturing unit in the same district got a goahead from the administration. The authority gave its nod to the proposal of HIL India to invest Rs 250 crore to set up a pipe manufacturing unit in Balasore.The state government also approved the proposals of Mega Flex Plastics Ltd (Rs 62.38 crore) Sandhu Tubes Pvt Ltd (Rs 99.54 crore) KAI Steel Pvt Ltd (Rs 89.44 crore) Anuj Autograph Business Park (Rs 105.30 crore) and GGL Chalet Pvt Ltd (Rs 70 crore).        ",
    "Hindalco Industries traded higher on October 6 morning trade after the aluminium producer announced signing a memorandum of understanding with the stateowned Odisha Mining Corporation (OMC). The move would ensure a longterm supply of bauxite ore to its proposed alumina refinery at Kansariguda in Rayagada district of the eastern state. The total proposed investment of Rs 8000 crore for the two million tonne alumina refinery along with a 150 megawatt captive power plant shall be in two phases. The first phase of 1 million tonne is expected to be commissioned in FY27 at an investment of Rs 5500 crore  the company said in a regulatory filing.The event for signing of the document was attended by chief minister Naveen Patnaik and Aditya Birla Group Chairman Kumarmangalam Birla among others.At 9.45 am Hindalco Industries was trading at Rs 471.15 on the NSE up Rs 0.13 percent from the previous close.Follow our live blog for all the market actionIn the June quarter the company reported an 8.66 percent yearonyear (YoY) decline in revenue from operations at Rs 52991 crore. Net profit dropped 40.42 percent YoY to Rs 2454 crore. The operating profit margins for the quarter contracted by 400 basis points on a yearly basis to 11 percent.Hindalco Industries part of the Aditya Birla Group is engaged in the business of aluminum and copper production. Its aluminum products find applications in sectors like transportation packaging and construction while its copper products cater to electrical and electronic industries.",
    "Three metal stocks namely JSW Steel Ltd Tata Steel Ltd and Hindalco Industries Ltd received the highest upgrades in   s analyst tracker in September. These upgrades were fueled by Chinese government support measures and expected infrastructure spending and government initiatives ahead of key elections.In September JSW Steel received 9 buy ratings 8 holds and 14 sell calls compared to 7 buys 9 holds and 17 sell calls the previous year. Tata Steel has 24 buy ratings 4 holds and 2 sell ratings while last year it had 24 buys 4 holds and 6 sell ratings. Hindalco Industries Ltd received 24 buy ratings and 1 hold rating whereas last year it had 22 buy ratings 1 hold rating and 1 sell rating.In the last year Hindalco Industries surged 24 percent JSW Steel advanced 23 percent while Tata Steel jumped nearly 29 percent. In the last month both Hindalco and Tata Steel rose around 7 percent each while JSW Steel remained flat.Metal firms are expected to experience a 6 7 percent growth due to increased infrastructure spending and government initiatives during an election year. Indian steel exports could rise supported by higher Chinese domestic steel consumption and steady production. Steel spreads are anticipated to improve in the second quarter of FY24 thanks to lower coal costs analysts said. Metal stocks are in high demand due to improved confidence in China s recovery. China has taken steps to boost auto and housing consumption as well as private sector investment including extending a 16point reform plan for real estate and offering incentives like lower interest rates and down payments to stimulate home sales  said BoB Capital in its latest note.Analysts anticipate steel margins to bounce back to midcycle levels by FY24 thanks to a gradual improvement in China s market balance that will ease pressure on steel prices and lower raw material costs. However they don t foresee margins significantly exceeding midcycle levels due to China s structural surplus and weaker demand prospects in the US and Europe which are expected to continue weighing on steel prices.JSW SteelAnalysts are positive about JSW s strong volume growth potential in India with its capacity set to increase from 27.7MT to 37MT due to ongoing projects. They believe JSW is wellpositioned to benefit from India s structural volume growth. While JSW is one of the lowestcost global steel converters valuations may seem high for FY24.Regarding margin outlook with Chinese HRC export prices at  550 t and stable to higher margins expected for Indian companies the weak Chinese domestic demand and increased Chinese steel exports over the past year are factors to consider.Tata Steel LtdRecently Tata Steel secured a 40  capex grant from the UK government to shift to a greener 3 millionton Electric Arc Furnace (EAF) from a 3.5 millionton Blast Furnace (BF) aligning with emission rules. They aim to retain 5000 out of 8000 jobs with union support revealing costs in their Q2FY24 earnings call. This move is expected to save GBP 150170 per ton potentially reversing losses and improving competitiveness by shifting from the fourth quartile of the BF cost curve in Europe to the left half of the EAF cost curve.Analysts foresee EBITDA potentially increasing from Rs 4600 crore (FY23) and a projected Rs 3600 crore (FY24) to a range of Rs 88009300 crore assuming steadystate profitability of  125 t for the Netherlands. Valuations may rise with additional EBITDA a 5.5x exit EBITDA multiple net capex of GBP 0.75 billion GBP 0.25 billion in restructuring costs and a 4.5year discounting period. However the valuation is sensitive to achieving cost savings  at GBP 100 t the potential benefit drops to Rs 2 per share from Rs 67 per share.Hindalco Industries LtdAnalysts anticipate that Hindalco s aluminium earnings will benefit in the short term due to declining coal costs. This improvement combined with higher Novelis EBITDA per ton is expected to boost earnings. While Novelis  EBITDA per ton is likely to improve in CY23 potential challenges in US demand may lead to margin volatility in FY2425.Hindalco s earnings are expected to accelerate from FY26 due to ongoing internally funded growth capex. However analysts predict a wide trading range for the stock in the next 1218 months driven by macro factors such as LME aluminium prices and US consumer demand in autos and cans. Overall analysts have a positive outlook for the stock s current levels believing that the combination of improving Novelis earnings and steady to higher LME prices will support the stock price.",
    "According to market experts the market is likely to consolidate unless the Nifty50 closes above 20200 levels which could push it towards 20500. The bulls are expected to receive good support if they hold on to the support area of 1990019800.On September 14 the benchmark indices closed higher with Nifty50 hitting new highs following a global uptrend.The Nifty50 jumped 33 points to 20103 and the BSE Sensex rose 52 points to 67519. Nifty Midcap 100 and Smallcap 100 were stronger than benchmarks rising over a percent each on positive breadth.The Bank Nifty closed at 46001 up 91 points but requires to hold the same for further upmove. Nifty IT closed above 33000 levels for the first time since April 13 last year rising 159 points to 33045.Stocks that fared better than broader markets including Hindalco Industries UPL and Bank of India. As a positive sign Hindalco Industries has seen a breakout of downward sloping resistance trendline adjoining highs of January 18 September 4 and September 12 with strong volumes. The index jumped 3 percent to Rs 497.35 and formed a bullish candlestick pattern with a long upper shadow on the daily charts indicating profit booking at higher levels.UPL seems to have bottomed out in August as it maintained upward trend despite intermittent corrections. The stock has formed a strong bullish candlestick pattern on the daily charts and closed nearly 4 percent higher at Rs 631.75 with robust volumes. It has taken support at 21day EMA (exponential moving average of Rs 607) and closed above 50day EMA (Rs 619).Bank of India has seen a breakout of a long falling resistance trendline adjoining highs of January 7 2019 and December 15 2022 on September 13. This was followed by the formation of yet another bullish candlestick pattern on the daily timeframe on September 14. The trading volumes remained robust on both days which is a positive sign. The stock rose 3.6 percent to Rs 107.25.Here s what Shrikant Chouhan of Kotak Securities recommends investors should do with these stocks when the market resumes trading today Hindalco IndustriesOn the weekly scale the counter is into a rising channel chart formation with higher high and higher low series patterns. Technical indicators like RSI (relative strength index) and MACD (moving average convergence divergence) also indicate further uptrend from current levels which could boost the bullish momentum in the coming horizon.As long as the counter is trading above Rs 480 the uptrend formation is likely to continue. Above this the counter could move up to Rs 535.UPLThe counter is trading in an upward trend from the past many sessions. Moreover the counter has formed an Inverse Head and Shoulder chart pattern on the daily charts. Therefore sustaining above the breakout of the range indicates a new leg of uptrend from the current levels.For the traders Rs 605 would be the key support level to watch out for. Above this the uptrend structure should continue until Rs 680.Bank of IndiaThe stock has shown a remarkable upmove in the last few months. The stock is trading in a rising trend continuously and forming the higher lows series. The strong bullish momentum on daily and weekly scale suggest that the counter is likely to maintain a bullish continuation chart formation in the coming horizon.As long as the counter is trading above Rs 102 the bullish formation is likely to continue. Above this the counter could move up to Rs 115. On the flip side a fresh selloff is possible only after the dismissal of Rs 102. Below the same it could retest the level of Rs 97.",
    "Shares of Hindalco Industries Ltd gained over 2 percent on the back of higher volumes. At 9.45am the stock was trading at Rs 460.60 on BSE up 2.31 percent from its previous close. India s benchmark Sensex fell 0.03 percent to 65200 points.The firm recently said in its annual general meeting that it will be investing up to Rs 2000 crore to set up a  first of its kind  copper and ewaste recycling unit in India. I am delighted to announce that your company is making an investment of Rs 2000 crore to establish the first of its kind Copper and Ewaste recycling facility in India. This move addresses the mounting challenge posed by ewaste recognised as the foremost waste stream on a global scale  Birla said in his keynote address.Also Read  Hindalco plans Rs 2000 crore copper ewaste recycling unitAt present due to lack of advanced metal extraction and refining technologies domestically a substantial volume of ewaste  considered as the foremost waste stream on a global scale  is exported to other nations he pointed out.Birla added that Novelis the company s USbased subsidiary recycled 2.3 million tonnes of aluminium scrap and increased the recycled content in its products to 61 per cent (up from 57 per cent in FY22).  This achievement firmly sets Novelis apart from its peers with a recycled content rate more than double its nearest competitor.         ",
    "Shares of Texmaco Rail and Engineering gained 2 percent to touch the 52week high of Rs 119.50 on August 11 after the company entered into a strategic alliance with Hindalco Industries for making aluminium rail wagons and coaches.Hindalco will provide profiles sheets and plates of its unique aluminium alloys along with fabrication and welding expertise a statement said on August 10. Texmaco will bring in technical expertise and be responsible for design setting up the factory production line and providing skilled workers.Texmaco swung back in the black with a net of Rs 12.75 crore in the June quarter as against a loss of Rs 20.54 crore a year back. Revenue of the company stood at Rs 656.82 crore as against Rs 298.70 crore.Catch all the market action on our live blogIn July the Texmaco board approved raising of funds up to Rs 500 crore by way of issuance of one or more instruments including equity shares preference shares convertible securities nonconvertible securities and warrants either by way of preferential issue or rights issue or qualified institutional placement or followon public offer or a combination thereof or through any other mode.Texmaco Rail   Engineering has a long presence in railway wagon manufacturing and has gradually diversified into commodityspecific wagons for private parties electric locomotive shells and subassemblies supplied to private parties.        ",
    "Weakness in the Chinese economy may trigger a rise in imports in India s metals industry said Hindalco Industries  managing director Satish Pai in a post earning interaction with reporters. We have started to see more imports coming in from China on the foils side. China tries to export more when their economy is not doing well. So yes we have started to see imports from China going up. Right now we are seeing it in foils but we remain worried that we will start to see it in other items as well if their economy doesn t pick up  Pai said.Aditya Birla Group flagship Hindalco Industries Limited (Hindalco) reported a 40.4 percent decline in its consolidated net profit to Rs 2454 crore for the first quarter of FY24 from Rs 4119 crore recorded a year ago. On a sequential basis the profit remained flat at 1.7 percent from Rs 2411 crore earned during the January  March period. The company filed its Q1 FY24 earnings in the stock exchanges on August 8.When asked about his outlook on aluminium prices Pai told   that it is likely to hover between  2100 and  2300 per tonne.  I think aluminium prices are going to remain between the  2100 and  2300 range largely because of the uncertainty of the Chinese economy. China is 50 percent of production and consumption of any big commodity and their economy is not showing signs of strength  he said.Also read  Hindalco  Downstream assets will keep the pot boilingPai further said the company s cost of production has declined due to low input costs.  Our cost of production is going down. This quarter it was 2 percent down compared to last quarter and next quarter it is going to be down another 3 percent. Coal availability has become much better and coal prices are coming down  he said.As coal prices continue to fall the company is now buying more coal through auction.  Prices are low and inventories are at about 26 days which is slightly on the higher side. We have bought more coal because it was available at a good price  Pai said.Consolidated revenue for the company fell 8.3 percent onyear to Rs 53382 crore in Q1 FY24 as against Rs 58229 crore a year ago and 5 percent from Rs 56209 crore recorded in the previous quarter.Revenue from aluminium (India) downstream business was at Rs 2435 crore down from Rs 2738 crore in the preceding quarter. The revenue from the copper business stood at Rs 11502 crore up 3 percent on quarter driven by higher sales volumes.Hindalco Industries is the world s largest aluminum company by revenue and a major player in copper serving more than half of India s copper requirement.        ",
    "Net Sales at Rs 52991.00 crore in June 2023 down 8.66  from Rs. 58018.00 crore in June 2022.Quarterly Net Profit at Rs. 2454.00 crore in June 2023 down 40.42  from Rs. 4119.00 crore in June 2022.EBITDA stands at Rs. 6105.00 crore in June 2023 down 29.34  from Rs. 8640.00 crore in June 2022.Hindalco EPS has decreased to Rs. 11.05 in June 2023 from Rs. 18.52 in June 2022.Hindalco shares closed at 464.85 on August 07 2023 (NSE) and has given 8.22  returns over the last 6 months and 10.31  over the last 12 months.",
    "",
    "The market negated higher highs of the last 17 weeks and closed down half a percent on the Nifty50 in the week ended July 28 but took a good support at the previous week s low of 19563 and formed a bearish candlestick pattern with lower and upper shadows on the weekly charts. The index closed at 19646.The 1960019500 zone is expected to be crucial for the index and if this is breached then correction can be seen towards 19300 points. On the higher side 1970019800 is important to watch out for as a decisive close above 19800 may take the Nifty50 towards its fresh alltime high experts said.Given the stable breadth and volatility falling to fresh historic lows experts are not worried about the recent fall as it was on the expected lines and could be considered as profitbooking after the recent rally to uncharted territory. Amid the ongoing breather in the market the chart structure construes optimism and it is likely to continue a cheerful run in the comparable period. Till the index firmly withholds the pivotal support of 19500 there is no sign of caution in the market  Osho Krishan Senior Analyst for Technical and Derivative Research at Angel One said.On the higher end he feels 1980020000 holds stiff resistance and a decisive move beyond which could trigger the next leg of the rally.He remains confident in the market but advises participants to avoid undue risk as the market lacks buying conviction in the current scenario.The broader market looks dazzling with immense opportunity to outperform the indices.  I would advocate traders to focus on stockspecific action  he said.Rohit Srivastava who founded Indiacharts.com and charts out investment strategies too sees more room for rally in the market and it is likely to head towards 20600 and eventually 21000 in the coming months. Valuations are high at a stockspecific or sector level but not at a marketwide level and cannot be a reason for concern yet for the general stock market  he said.Let s take a look at the top 10 trading ideas by experts for the next threefour weeks. Returns are based on the July 28 closing prices Expert  Subash Gangadharan senior technical   derivative analyst at HDFC SecuritiesTata Power  Buy   LTP  Rs 234.65   StopLoss  Rs 214   Target  Rs 265   Return  13 percentTata Power has shown relative strength last week. While the Nifty has lost 0.55 percent last week Tata Power has gained a healthy 8 percent. In the process the stock has closed above its recent trading range on the back of above average volumes which augurs well for the uptrend to continue.Technical indicators are giving positive signals as the stock is trading above the 20 and 50day SMA (simple moving average). Momentum readings like the 14week RSI (relative strength index) too are in rising mode and not overbought which implies potential for further upsides.With the intermediate technical setup too looking attractive we expect the stock to move up towards its previous intermediate highs in the coming weeks. One can buy between Rs 233237 levels with a stoploss of Rs 214 and target of Rs 265.Hindalco Industries  Buy   LTP  Rs 451.50   StopLoss  Rs 426   Target  Rs 485   Return  7.4 percentAfter correcting from an intermediate high of Rs 504 tested in January 2023 Hindalco found support around Rs 381 levels in March 2023. These are strong supports as they also roughly coincide with previous intermediate lows.The stock has since then been climbing higher and making higher bottoms in the process. Last week the stock has also seen breakout of its recent trading range on the back of healthy volumes indicating it is set to move higher in the coming weeks.Technical indicators are giving positive signals as the stock is trading above the 20 and 50day SMA. Momentum readings like the 14week RSI too are in rising mode and not overbought which implies potential for further upsides.With the intermediate technical setup too looking attractive we expect the stock to move up towards its previous intermediate highs in the coming weeks. Buy between Rs 449453 levels with a stoploss at Rs 426 and target of Rs 485.Laxmi Organic Industries  Buy   LTP  Rs 263.65   StopLoss  Rs 250   Target  Rs 290   Return  10 percentAfter touching a low of Rs 220 in March 2023 Laxmi Organic has gradually climbed higher and made higher tops and higher bottoms. On Friday the stock has broken out of its recent trading range on the back of above average volumes.Momentum readings like the 14day RSI too are in rising mode and not overbought. This augurs well for the uptrend to continue.With the intermediate technical setup too looking positive we believe the stock has the potential to move higher in the coming weeks. We recommend a buy between Rs 263266 levels with a stoploss at Rs 250 and target of Rs 290.Expert  Shrikant Chouhan head of research (retail) at Kotak SecuritiesNCC  Buy   LTP  Rs 148.95   StopLoss  Rs 125   Target  Rs 190   Return  27 percentLast Friday the stock successfully surpassed the multiyear resistance point of Rs 142 which it had not done in the past 15 years. This is a significant milestone and may lead to the stock reaching the next resistance levels of Rs 190 and Rs 237.The breakout is based on the stock s trading volume which suggests a more extensive trend. To take advantage of this opportunity investors should consider buying at the current levels and during dips from the 20day SMA currently at Rs 135. It is important to place a stoploss at Rs 125 or 50day SMA to minimize potential losses.Cipla  Buy   LTP  Rs 1177.80   StopLoss  Rs 1100   Targets  Rs 13001450   Return  23 percentThe stock has unexpectedly reached its alltime high at Rs 1185 in a short amount of time. It is a significant breakout in terms of volume and price which could potentially lead to a rally in the next few weeks.Additionally the formation is a swing high crossing prompting long traders to consider buying. If the stock surpasses Rs 1190 it may continue to rise towards Rs 1300 and Rs 1450 in the upcoming weeks or months.It is a recommended for medium to long termterm investment with two tranches. It is advised to purchase 50 percent at current levels and the remaining 50 percent at Rs 1150. To mitigate potential losses it is recommended to set a stoploss at Rs 1100.Macrotech Developers  Buy   LTP  Rs 746.90   StopLoss  Rs 700   Target  Rs 799850   Return  14 percentBased on its recent performance the stock has been following a rising corrective pattern and has found support from the 20day SMA whenever it has experienced a decline in the past 15 days.Looking at its weekly performance the stock has broken out of a narrow trading range of Rs 720 and is currently rallying towards Rs 750 levels. With the stock holding above Rs 660 and subsequently Rs 720 levels we anticipate it will continue to rise and reach its alltime high at Rs 799.This is a positive formation on both a weekly and monthly basis and our recommended strategy is to buy 50 percent of the stock at its current levels and the remaining 50 percent at Rs 720. We suggest setting a stoploss at Rs 700 and aiming for a target of Rs 799 and Rs 850.Expert  Ruchi Jain lead research at 5paisa.comApollo Hospitals Enterprises  Buy   LTP  Rs 5347   StopLoss  Rs 5170   Targets  Rs 55005640   Return  5.5 percentThe stock started moving higher from the start of April month and rallied upto Rs 5300 during midJune. The prices then consolidated within a range in last one month which just seemed to be a time wise correction.The momentum readings cooledoff from the overbought zone in this time and are now indicating a resumption of the trend. The stock has given a breakout from the consolidation and has hence the stock could rally higher in the short term.Traders can look to buy the stock in the range of Rs 53405320 for potential near term targets of Rs 5500 and Rs 5640. The stoploss on long positions should be placed below Rs 5170.VGuard Industries  Buy   LTP  Rs 286   StopLoss  Rs 268   Targets  Rs 300315   Return  10 percentThe stock had recently given a breakout from a long consolidation phase. Post the breakout the prices rallied higher upto Rs 297 and has seen some pullback move in last few days.The volumes were good during the breakout while the corrections have not seen higher volumes. Traders should use this dip as a buying opportunity as the broader trend seems positive on short to medium term charts.Traders can buy the stock in the range of Rs 285282 for potential near term targets of Rs 300 and Rs 315. The stoploss on long positions should be placed below Rs 268.Expert  Mitesh Karwa research analyst at Bonanza PortfolioFino Payments Bank  Buy   LTP  Rs 342   StopLoss  Rs 255   Target  Rs 490   Return  43 percentThe stock has seen breaking out of a rounding bottom like formation on the weekly timeframe and closing above previous swing high with a bullish candlestick pattern after almost 16 months. It is also sustaining above all its important EMA s (exponential moving averages) which indicates bullish strength.On the indicator front the Supertrend indicator is indicating a bullish continuation trend  the Ichimoku Cloud is also suggesting a bullish move as the price is trading above the conversion line base line and cloud.Momentum oscillator RSI (21) is at around 68 on the weekly time frame indicating strength by sustaining above 50.Observation of the above factors indicates that a bullish move in Fino Payments is possible for target upto Rs 490 in 34 weeks. One can initiate a buy trade in between the range of Rs 327333 with a stoploss of Rs 255 on daily closing basis.Advanced Enzyme Technologies  Buy   LTP  Rs 327   StopLoss  Rs 285   Target  Rs 423   Return  29 percentAdvanced Enzyme has seen breaking out of a Eve   Adam pattern on the weekly timeframe with a bullish candlestick and closing above the highs of last seven months with above average volumes which indicates bullish strength.On the indicator front the momentum oscillator RSI (21) is at around 63 on the weekly time frame indicating strength by sustaining above 50 while the Ichimoku Cloud is also suggesting a bullish move as the price is trading above the conversion line base line and cloud on the daily timeframe.Observation of the above factors indicates that a bullish move in Advanced Enzyme is possible for target upto Rs 423 in 34 weeks. One can initiate a buy trade in the range of Rs 322328 with a stoploss of Rs 285 on daily closing basis.Jagsonpal Pharmaceuticals  Buy   LTP  Rs 452   StopLoss  Rs 348   Target  Rs 552   Return  22 percentJagsonpal has seen giving a Rectangle Triangle Pattern breakout on the upside at the weekly timeframe and closing with a bullish candlestick above the highs of last eleven months and also closing above all its important EMAs which indicate bullish strength.On the indicator front the momentum oscillator RSI (21) is at around 69.78 showing strength by sustaining above 50. The Supertrend indicator is indicating a bullish continuation while the Ichimoku Cloud is also indicating strength as the price is trading above the conversion line and base line.Observation of the above factors indicates that a bullish move in Jagsonpal is possible for target upto Rs 552. One can initiate a buy trade in between the range of Rs 447452 with a stoploss of Rs 348 on daily closing basis.",
    "Shares of Hindalco Industries rose around 3 percent in early trade on July 13 after the company approved plans for a land sale.In a board meeting held on July 12 the company approved a proposal for the sale of land situated at Kalwa Maharashtra. The land will be sold to Birla Estates Pvt Ltd a subsidiary of Century Textiles for a total sum of Rs 595 crore which is to be received in multiple tranches over a period of time.The land sale is likely to be completed within the next 15 months.At 10.50 am shares of Hindalco Industries were trading at Rs 437.40 on the National Stock Exchange up 2.9 percent from the previous close. Trading volumes were also high as 44 lakh shares changed hands on the exchanges higher than the volumes of 29 lakh shares in the previous session.Follow our live blog for all the market actionWith the onset of the Q1 earnings season investors await the company s quarterly numbers. Most brokerages rolled out a weak earnings outlook for Hindalco on the back of a decline in LME Aluminum prices which is also expected to weigh down on its operating margins.Moreover the company s copper sales in the AprilJune quarter were also impacted by the smelter shutdown from early April to midJune brokerage firm Axis Securities highlighted. Revenue to decline for Hindalco on a yearonyear as well as sequential basis dragged by lower LME Aluminum prices Novelis shipments and lower Copper sales  Axis Securities stated in its report.Kotak Institutional Equities also pegged Hindalco s EBITDA (Earnings before interest taxes depreciation and amortization) for its India business at Rs 2160 crore  representing a 40 percent onyear decline and a 10 percent sequential fall.A weak growth outlook for the company has also weighed on its share performance in 2023. The stock is down nearly 8 percent in the year so far sharply underperforming the Nifty 50 s near 7.5 percent rise during the same tenure.",
    "Hindalco Industries Ltd the Aditya Birla group flagship said on July 12 its board has approved a proposal to sell land situated at Maharashtra s Kalwa to Birla Estates Private Limited for a sum of Rs 595 crore.According to an exchange filing by Hindalco the definitive documents are to be signed in due course and the sale is expected to completed within a period of 15 months.The total sale amount of Rs 595 crore will be received in multiple tranches over a period of time and 1.5 percent of the sales revenue.According to the filing the buyer Birla Estates Private Limited is a Wholly owned subsidiary of Century Textiles and Industries Limited. BEPL is not a part of Promoter Promoter Group Group Companies as defined under Securities and Exchange Board of India (Issue of Capital and Disclosure Requirements) Regulations 2018.         ",
    "Jigar S Patel Senior Manager  Equity Research at Anand RathiThey say  Sell in May and Go Away  but this time the markets proved them wrong. The domestic markets maintained the positive momentum throughout the month of May 2023. The index Nifty gradually retested the 18600 mark during the process and ended the month with gains of over 2.5 percent. The sentiment was uplifted in the absence of any negative triggers from the global markets and few positive news on the domestic front.During the month of May 2023 we were expecting profit booking from the zone of 18200   18500 but the bulls have managed to clear this zone with ease. Now at this juncture the index is hovering near the 88.6 percent retracement of the entire move from 18887 towards 16800.Hence going ahead the recent high of 18662 would remain an immediate trigger for the bulls. A sustainable move above the same might result in a new life high for the index.In a bestcase scenario we expect the ongoing momentum to take a halt near 18900   19000 zone since that is a placement of a rising trendline on larger degree charts. Currently the weekly RSI (relative strength index) is hovering near a resistance of falling trend line.The volatility index (VIX) is once again near the reversal zone of 11   10. Historically we have witnessed heavy volatility in the markets once the VIX sneaks below 11 mark. It would be wiser for traders to keep booking profits from here on.On the downside 18450 seems to be an important support since that is the support formed by rising trendline. A close 18450 might bring in the expected corrective impulse move in the markets.Meanwhile the Nifty Bank index outperformed the benchmark indices during May 2023 and registered a new lifetime high near 44500 mark. On the daily chart we witnessed that this price action was accompanied with negative divergence of RSI. Also we are now witnessing a lower bottom in RSI.At this juncture the Bank Nifty has rising trendline support at 43700. Going ahead a close below 43700 might spoil the party for the bulls and we might witness profit booking in the markets. On the upside 44500 seems to be an initial resistance and only a move above the same might extend the rally above 45000 milestone.Here are three buy calls for short term Hindalco Industries  Buy   LTP  Rs 420.75   StopLoss  Rs 390   Target  Rs 445   Return  6 percentSince May 2023 the said counter has been in freefall mode which resulted in a 13 percent cut in price. At the current juncture multiple bullish candlesticks patterns like Hammer and Doji have emerged along with daily RSI has reversed from 40 levels on a daily scale which is indicating further upside in the counter.One can buy in small tranches around Rs 415422 and another around Rs 410415 upside. Target would be Rs 445 and the stoploss would be Rs 390.Firstsource Solutions  Buy   LTP  Rs 131.3   StopLoss  Rs 114   Target  Rs 155   Return  18 percentFor the last year the said counter has been consolidating in the range of Rs 100120 approximately. Recently it gave a clean breakout along with heavy volume which hints towards further upside in the counter.Additionally on a weekly scale MACD (moving average convergence divergence) is displaying a bullish crossover exactly above the zero line which is a sign of further bullish momentum.One can buy in the range of Rs 125135 for a target of Rs 155 and a stoploss of Rs 114.Central Depository Services (CDSL)  Buy   LTP  Rs 1067.90   StopLoss  Rs 999   Target  Rs 1175   Return  10 percentFor the entire month of May 2023 it consolidated in the zone of Rs 9701000. In the previous trading session it gave massive breakout along with huge volume which is hinting bullish momentum in the coming few sessions.The best part of the abovementioned consolidation zone of Rs 9701000 is that those where the levels of monthly central pivot range (refer to the chart).So one can buy in small tranche in the zone of Rs 10601070 and another Rs 10301040 with upside target of Rs 1175 and stoploss would be Rs 999 on daily close basis.",
    "Analysts seem to have pinned their faith on the longterm business prospects of Hindalco one of India s biggest aluminium manufacturers. Yet they seem to be anxious about the metal company s nearterm performance.In the past year shares of Hindalco   that houses the USbased Novelis the largest producer of aluminium beverage can sheets   have only delivered 1 percent returns compared to the benchmark Nifty Metal index which has rallied 14 percent.Despite this underperformance analysts are happy to recommend this stock to investors. Of course with many caveats.Analysts see weakness in the Q1 FY2324 earnings of Novelis as well as in Hindalco s India operations brought on by lower volumes as well as prices. Hindalco brokerage recommendationsRising capex a worryThe company s management hopes to fund the major portion of its ongoing expansion through internal accruals both in India and at Novelis USA. The capex for FY2324 is guided to be Rs 50 billion for the Indian operation and  1.6 1.9 billion for Novelis. The capex was Rs 3000 crore in FY2223.Satish Pai Managing Director of Hindalco Industries said in a postearnings call that the company would fund its entire capex requirements through internal accruals and will not raise debt.Read more   India s copper and aluminium demand strong says Hindalco MD Satish PaiBut Nuvama Institutional Equities has expressed concerns about consolidated net debt rising in FY2324 and FY2425 considering that the entire capex might not be internally funded. It sees consolidated net debt rising to Rs 38100 crore in FY2324 and Rs 43100 crore in FY2425.The release of working capital led to a significant reduction in consolidated net debt during the quarter which came down to Rs 34000 crore from Rs 41700 crore in the December quarter.Earnings outlook   no great shakesThe management has not guided for any reduction in the cost of production. Also  as the copper unit which contributes substantially to domestic operations is undergoing a scheduled maintenance shutdown until midJune 2023 it will impact the company s margins to an extent Motilal Oswal Financial Services pointed out. This prompted the brokerage firm to lower its consolidated EBITDA and APAT (adjusted profit after tax) estimates by 2 percent and 5 percent respectively for FY2324.Nuvama Institutional Equities believes Hindalco will report a weak EBITDA in Q1 FY2324 because of softer aluminium prices and lower aluminium as well as copper volumes. Accordingly it has slashed its EBITDA estimate for FY2324 and FY2425 by 8.3 percent and 8.7 percent respectively and built in lower prices and higher costs.Aluminium prices have corrected 810 percent from the quarter ending March 2023  primarily due to persistently weak global demand outweighing supplyside risks in the market as per analysts.Kotak Institutional Equities has pointed out that even though Hindalco has guided for stable costs in the near term it believes LME (London Metal Exchange) aluminium prices will remain under pressure due to weak demand and declining cost support.Cans biz lacks fizzNovelis is the leading buyer and recycler of used beverage cans globally. Headwinds from channel destocking and a weak macro continue to impact beverage cans and specialty segments which form around 80 percent of its volumes.The management expects beverage can debottlenecking to continue in Q1 FY2324 and stabilise 2Q FY2324 onwards.Read more   Largest macroeconomic uncertainty is the status of the Chinese economy  Hindalco MDAxis Securities said the destocking phase of the key can segment is likely to persist till Q1 FY2324 at Novelis hence margin recovery will be gradual. Kotak Institutional Equities also raised a similar concern that Novelis continues to face demand headwinds in beverage cans and specialty segments making the brokerage firm believe margins will remain choppy in the near term.Given the uncertainties in the near term the company has deferred volume guidance for FY2324. The management expects normalisation of margins by Q4 FY2324 hence the next twothree quarters are likely to remain choppy.Longterm biz in good shapeDespite the nearterm uncertainty the longterm outlook for Hindalco continues to remain buoyant.The factors that have driven JM Financial Institutional Securities to believe that the metal major s longterm outlook is good are  Novelis maintaining mediumterm EBITDA per ton guidance of approximately  525 (expected by 4Q of FY2324) resilient performance by its Indian aluminium operations enhanced coal security post the acquisition of Meenakshi and Chakla coal mines and capex to augment capacity in downstream businesses.Time to buy the stock The stock has fully priced in headwinds such as a slowdown in China and the impact of highinterest rates and higher input costs according to Motilal Oswal Financial Services.Read more   Novelis Q4 profit decline disappoints Hindalco investors but brokerages retain BuyIt sees robust demand in India an increase in capacity utilisation higher spends on infrastructure better business sentiment and moderating commodity prices supporting the company s performance going ahead. We remain confident about the company s longterm growth opportunities and believe that any weakness in the stock after Q4 results should be an opportunity to buy  said Motilal Oswal Financial Services. Nuvama Institutional Equities also awaits a lower entry point in the stock.Though the stock trades at an inexpensive valuation of 5.4 times EV EBITDA FY25 the uncertain outlook of Novelis  earnings should keep the stock under pressure in the near term according to Kotak Institutional Equities.ICICI Securities also expects nearterm challenges to prevail on stock performance despite longterm benefits from capacity expansion at Novelis and valueadded capacity enhancement at India operations.",
    "Net Sales at Rs 19995.00 crore in March 2023 up 5.41  from Rs. 18969.00 crore in March 2022.Quarterly Net Profit at Rs. 832.00 crore in March 2023 down 48.03  from Rs. 1601.00 crore in March 2022.EBITDA stands at Rs. 1941.00 crore in March 2023 down 43.46  from Rs. 3433.00 crore in March 2022.Hindalco EPS has decreased to Rs. 3.75 in March 2023 from Rs. 7.20 in March 2022.Hindalco shares closed at 410.20 on May 23 2023 (BSE) and has given 5.32  returns over the last 6 months and 0.76  over the last 12 months.",
    "Net Sales at Rs 55857.00 crore in March 2023 up 0.17  from Rs. 55764.00 crore in March 2022.Quarterly Net Profit at Rs. 2411.00 crore in March 2023 down 37.39  from Rs. 3851.00 crore in March 2022.EBITDA stands at Rs. 5679.00 crore in March 2023 down 25.25  from Rs. 7597.00 crore in March 2022.Hindalco EPS has decreased to Rs. 10.85 in March 2023 from Rs. 17.31 in March 2022.Hindalco shares closed at 410.30 on May 23 2023 (NSE) and has given 5.32  returns over the last 6 months and 0.69  over the last 12 months.",
    "Hindalco Industries on May 24 reported net consolidated profit for the quarter ended March at Rs 2411 crore down 37 percent from Rs 3860 crore in the same quarter a year ago.Its revenue from operations came in at Rs 55857 crore rising 0.16 percent from Rs 55764 crore in the corresponding quarter last year the aluminium maker said in an exchange filing.Consolidated EBITDA of the company was at Rs 5818 crore down 23 percent year on year (YoY).Its USbased subsidiary Novelis  net Income was at  175 million down 7 percent YoY. Our Copper Business delivered exceptional results recording its highestever EBITDA driven by robust market demand stable operations and higher valueadded product sales  said Satish Pai Managing Director Hindalco Industries.  Our India Aluminium Downstream Business which experienced its highestever EBITDA growth in FY23 reflects our strategic focus on enhancing this segment. Despite macroeconomic headwinds Novelis has shown quarteronquarter recovery supported by improved product pricing and favourable product mix. The company said looking ahead a NetDebtFree India business and a strong balance sheet will continue to power its ambitions for organic growth.NovelisTotal shipments of flat rolled products from Novelis  plants were at 936 kilo tonnes (Kt) in Q4 FY23 vs 987 Kt in Q4 FY22 down 5 percent YoY and up 3 percent QoQ supported by higher aerospace and record automotive shipments in Q4.Novelis  revenue in Q4 FY23 stood at  4.4 billion (vs  4.8 billion) down 8 percent YoY impacted by lower average aluminium prices and subdued sales volume YoY. Novelis reported an adjusted EBITDA of  403 million (vs  431 million) down 6 percent YoY and up 18 percent QoQ supported by higher product pricing and volumes product mix. Novelis  adjusted EBITDA per ton at  431 was down 1 percent YoY and up 15 percent sequentially.Aluminium  India BizQuarterly Upstream revenue for this segment was Rs 8050 crore in Q4 vs Rs 9253 crore in the prior year period. Aluminium Upstream EBITDA stood at Rs 2192 crore compared with Rs 3742 crore down 41 percent YoY and up 38 percent QoQ supported by lower input costs the company said. Upstream EBITDA margins were at 27 percent.Downstream revenue was Rs 2738 crore vs Rs 3282 crore in the prior year period. Sales of Downstream Aluminium stood at 90 Kt vs 93 Kt down 4 percent YoY and down 1 percent sequentially. Downstream EBITDA stood at Rs 112 crore down 20 percent YoY and down 29 percent QoQ.        ",
    "Shares of Hindalco Industries dropped by two percent making it the top loser on Nifty 50 in response to the company s outlook that its subsidiary Novelis will continue to face headwinds in FY24.As of 9 38 am shares of the metal company were trading at Rs 399.20 down 0.8 percent on the BSE.The company said that Q3 of FY23 was a trough for subsidiary Novelis but it expects the headwinds to persist into FY24. However Hindalco pointed out that achieving  525 adjusted EBITDA per ton for its arm is still possible when the headwinds subside. Therefore Novelis is expected to achieve its longterm sustainable EBITDA per ton guidance of  525 per ton by 4Q of FY24.CLSA highlighted that Hindalco s mediumterm guidance is reiterated and capital expenditure is paced out. It has a  buy  recommendation on the stock with a target price of Rs 550.However the foreign brokerage firm pointed out that details on factors driving weakness and key items to monitor for recovery were missing. It believes a bounce back in profitability is key to a rerating.Catch up on all LIVE stock market updates hereThere is an expectation of turnaround for arm Novelis in the March quarter with a favourable metal price lag and an improvement in shipments of cans. For the Indian business the rise in the prices of aluminium and copper and better coal availability is expected to boost performance.  The worst is over  Satish Pai MD Hindalco had said after announcing the December quarter results.Hindalco has remained the most favoured pick of analysts in March. Hindalco had 24  buy  calls as per   s Analyst Call Tracker for March.Motilal Oswal Financial Services is of the view that Hindalco is adding downstream capacities at the right time to capture strong growth opportunities.  Despite nearterm headwinds for Novelis the longterm outlook remains positive.  It has retained its  buy  rating with a cut in target price to Rs 510 from Rs 570.        ",
    "Hindalco Industries shares corrected 5 percent on March 16 after a decisive breakdown of the consolidation range and fall below the February low indicating bearishness.The stock has been falling since it touched a ninemonth high of Rs 504 on January 18. In midFebruary the counter saw consolidation or sideways trade for several sessions following a decisive breakout of a bearish Flag and Pole pattern on the downside on February 24. It again entered consolidation mode forming another small Flag and Pole pattern since the start of March which also has been broken decisively on the downside on March 16.Hence there could be a possibility of the stock falling up to the low of September 2022 which is around Rs 359 or another 6odd percent correction from current levels.The aluminium major closed the day at Rs 385 on the NSE down 5.22 percent. It has fallen around 24 percent since the January high.The stock has seen a gapdown opening and formed a long bearish candlestick pattern on the daily charts with robust volumes while on the monthly scale it has seen the formation of a bearish candle with lower highs and lower lows formation. Hindalco has been in a corrective mode since January 2023 and formed a bearish Flag and Pole pattern. After the initial breakdown that was observed on February 24 the stock started trading sideways and broke below the consolidation once again with massive volumes  Viraj Vyas Technical   Derivatives Analyst  Institutional Equity at Ashika Stock Broking said.Lower highs lower lowsHe feels the current structure is also depicting lower highs and lower lows inferring that the stock remains a  sell on rise  until it can move past the Rs 420 level around the high of March.Further the stock has also given upward sloping support trendline breakout adjoining lows of September 28 2022 and February 28 2023 which also may be giving a possibility of further downside.Another negative signal comes from moving averages. The stock currently traded below all key moving averages whether SMA or EMA (5 9 21 50 and 100day). Hindalco has seen falling off from a rising channel  this channel was formed when the stock found its bottom near Rs 310312 and started a gradual up move while forming higher tops and higher bottoms. The recent corrective decline has seen the stock slipping below the 50 100 and 200DMA  Foram Chheda Technical Research Analyst and Founder of ChartAnalytics.co.in said.She said today s price has seen a downward breach of this rising channel  the price can find support near the previous lows formed near Rs 360365 from where a rebound can be expected.PSAR (parabolic stop and reverse) continues to remain in a continuous sell mode. A close above Rs 400 will turn the stock bullish again Chheda said.",
    "The market faced severe selling pressure in the week ended February 24 and closed at a fourmonth low following a hawkish commentary by Fed officials and increase in US bond yields and the dollar index.The Nifty50 shed 2.67 percent during the week the biggest weekly loss since June 2022 to close at 17466 and formed a large bearish candlestick pattern on the daily charts with decisively breaking 200day EMA (exponential moving average 17590). It also settled below long upward sloping support trendline adjoining the lows of March 2020 and of June 2022.Hence the next support is placed at 200day SMA (simple moving average  17368) which coincides with Budget day s low as breaking of the same can drag the Nifty towards 17000 level whereas the nearterm resistance is expected at 17600 followed by 1770017800 area experts said. There is a possibility that the index may head towards 1720017100 levels in the coming sessions as 1770017750 will act as a strong resistance  Mitesh Karwa Research Analyst at Bonanza Portfolio said.In the worstcase scenarios Sameet Chavan of Angel One feels the Nifty may find support around its intermediate levels of 17000 16700. Taking the current situation into consideration the Nifty is placed around its sacrosanct support zone 17350 which coincides with the 200day SMA. Hence till the time we do not break below this level we remain hopeful of some recovery in coming week  he said.Options data suggests a broader trading range in between 17200 to 17700 zones due to higher volatility while immediate trading ranges in between 17200 to 17600 zones.Let s take a look at the top 10 trading ideas by experts for the next threefour weeks. Returns are based on the February 24 closing prices Expert  Subash Gangadharan Senior Technical   Derivative Analyst at HDFC SecuritiesGAIL  Buy   LTP  Rs 103   StopLoss  Rs 96   Target  Rs 115   Return  11 percentGAIL has shown relative strength last week. While the Nifty has lost 2.67 percent last week GAIL has gained a healthy 7.92 percent. In the process the stock has closed above its recent trading range on the back of above average volumes which augurs well for the uptrend to continue.Technical indicators are giving positive signals as the stock is trading above the 20 and 50day SMA. Momentum readings like the 14week RSI (relative strength index) too are in rising mode and not overbought which implies potential for further upsides.With the intermediate technical setup too looking attractive we expect the stock to move up towards its previous intermediate highs in the coming weeks. Buy between Rs 101105 levels with stoploss at Rs 96 while target at Rs 115.Hindalco Industries  Sell   LTP  Rs 415   StopLoss  Rs 438   Target  Rs 375   Return  10 percentHindalco is in a short term downtrend as it has been making lower tops and lower bottoms for the last several weeks. Last week the stock broke down from its recent trading range indicating that the downtrend looks set to continue.Technical indicators are giving negative signals as the stock is now trading below the 20day and 50day SMA. Momentum readings like the 14week RSI too are in decline mode and not oversold which implies potential for more downsides.We therefore expect the stock to correct further in the coming sessions. Sell between Rs 414418 levels with a stoploss at Rs 438 while downside target at Rs 375.Vedanta  Sell   LTP  Rs 294   StopLoss  Rs 305   Target  Rs 280   Return  5 percentVedanta is in a short term downtrend as it has been consistently making lower tops and lower bottoms for the last several weeks after breaking the support of Rs 313. Recently the stock reacted from the 20day SMA and continued to trend lower.With the stock trading below key moving averages like the 20 and 50day SMA the 14week RSI in decline mode and the intermediate technical setup looking negative we believe the stock is headed lower in the coming weeks.We therefore recommend a sell between Rs 293297 levels with a stoploss at Rs 305 and downside target at Rs 280.Expert  Shrikant Chouhan Head of Equities Research (Retail) at Kotak SecuritiesTCS  Sell   LTP  Rs 3400   StopLoss  Rs 3580   Target  Rs 3250   Return  4.4 percentThe stock is making a series of lower tops and lower bottoms. It was at Rs 3575 on February 16 and is currently trading at Rs 3400 which is below the 20day SMA level.According to the major oscillator it is turning negative which is an indication of further weakness.From a trading perspective it is advisable to sell at the current level and on a rally of Rs 3450. Place the final stoploss at Rs 3580. On the downside it will find major support at Rs 3350 and Rs 3250.SAIL  Sell   LTP  Rs 83   StopLoss  Rs 86   Target  Rs 75   Return  10 percentIt has formed a bearish continuation pattern on the daily chart. A lower top and breaking of a flag formation is indicating further weakness in the near term.Depending on the formation the stock may slide further toward Rs 79 or Rs 75 in the coming weeks. The strategy should be to sell the stock at the current level and at Rs 85. However for that it is mandatory to keep the stoploss at Rs 86.GNFC  Buy   LTP  Rs 552   StopLoss  Rs 520   Target  Rs 600   Return  9 percentThe stock is forming a typical bullish consolidation structure since the beginning of the month of December. It is diverging positively and it is on the verge of absorbing the selling pressure which is at Rs 565.From a trading point of view we should be buyers but in tranches. Buy 50 percent at current levels and the rest at Rs 535. On higher levels it has scope for a rise towards Rs 565 and Rs 600. For the same place a stoploss at Rs 520.Expert  Ruchit Jain Lead Research at 5paisa.comPetronet LNG  Buy   LTP  Rs 222   StopLoss  Rs 211   Target  Rs 239   Return  8 percentThe stock had recently witnessed a breakout above its falling trendline resistance on the weekly charts. After an upmove upto Rs 230 prices retraced back towards the support and it now witnessing a positive momentum indicating possibility of a resumption of the uptrend.The momentum readings on the weekly charts are in positive zone. Hence short term traders can look for buying opportunities around current market price of Rs 221 for near term targets of Rs 230 and Rs 239. The stoploss for long positions should be placed below Rs 211.Expert  Mitesh Karwa Research Analyst at Bonanza PortfolioZomato  Buy   LTP  Rs 54.45   StopLoss  Rs 51.50   Target  Rs 65   Return  19 percentOn a weekly basis the price has witnessed long bearish trend from its alltime highs which is placed at Rs 169. Recently the price has taken support of its prior demand zone with bullish reversal candlesticks  Morning Star . The price has shifted just above the 9day EMA with spurt volume which indicates immediate support to the price.At the same time the indicator MACD (moving average convergence divergence) suggested a positive crossover confirming long position. However the price has faced immediate resistance of 20day EMA which is placed at Rs 57.10.Hence based on the abovementioned technical structure one can initiate a long position in Zomato at CMP Rs 54.80 or a fall in the price till Rs 54 levels can be used as a buying opportunity for the upside target of Rs 60   Rs 65. However the bullish view will be negated if Zomato closes below the support level of Rs 51.50.Siemens  Buy   LTP  Rs 3246   StopLoss  Rs 3050   Target  Rs 3610   Return  11 percentOn a weekly timeframe the price has been rising continuously with higher highs and higher lows formation. In addition the price has also been trading above 9 and 20day exponential moving averages from the last few weeks indicating a strong bullish trend. Recently the price has given a breakout of the Ascending Triangle Pattern confirming the continuation of the bullish trend.At the same time the MACD indicator suggested also a positive crossover with rising histograms and the daily Relative Strength Indicator traded above 60 level which indicates bullish strength.Hence based on the abovementioned technical structure one can initiate a long position in Siemens at CMP Rs 3245 or a fall in the price till Rs 3207 levels can be used as a buying opportunity for the upside target of Rs 3610. However the bullish view will be negated if Siemens closes below the support level of Rs 3050.Kirloskar Industries  Buy   LTP  Rs 2204   StopLoss  Rs 2110   Target  Rs 2430   Return  10 percentOn the daily charts the stock has given an  Ascending triangle pattern  breakout with good volume. In addition the stock has traded above the important nearterm moving average. Simultaneously the technical indicator Ichimoku cloud suggests that the price is trading above the conversion and base line which shows a Positive trend in the counter.The MACD histogram is hovering in positive territory with inclining trajectory confirming bullish trend may continue. A momentum indicator RSI (14) is reading above 50 levels which suggests a bullish move for the near term.Hence based on the abovementioned technical structure one can initiate a long position in Kirloskar Industries at CMP Rs 2204 or a fall in the price till Rs 2195 levels can be used as a buying opportunity for the upside target of Rs 2430. However the Bullish view will be negated if stock closes below the support level of Rs 2110."
]