[
    "Food delivery firm Swiggy has partnered with the country s largest private sector lender HDFC Bank to launch a cobranded credit card. The card will offer a hefty 10 percent cashback on food delivery grocery delivery under Instamart and its dining out platform Dineout. The card will be hosted on the Mastercard network.The cashback offered is much higher than the usual five percent offered by brands for shopping on their own platform. For instance Amazon Flipkart Paytm and Tata Neu only offer around five percent as cashback even though occasionally there could be a few extra offers. The Paytm and Tata Neu cobranded credit cards are also in partnership with HDFC Bank.The SwiggyHDFC card will also offer five percent cashback on shopping across other ecommerce platforms such as Amazon Flipkart Myntra Nykaa Ola Uber PharmEasy NetMeds BookmyShow and several others the statement said. In fact with an AmazonICICI credit card a customer cannot get five percent cashback on Flipkart and vice versa. Hence the Swiggy card makes more sense for anyone who shops across these platforms.ALSO READ  Visa says cobranding offers opportunities for new categories to emergeIn one fell swoop the card could make AmazonICICI and FlipkartAxis credit cards irrelevant for most users as the cashback remains the same whether a customer uses the Amazon card Flipkart card or the Swiggy card. However there is a catch. The benefits of such high rewards can be reaped only if the customer uses Swiggy a lot every month. Because the cardholders will get cashback in the form of Swiggy Money which can be used only on Swiggy.However the only catch being that the cashback will be deposited as Swiggy Money and can be used only on Swiggy. If a customer s monthly grocery purchases are more than Rs 40005000 it must not be difficult to use exhaust the Swiggy Money buying grocery on Instamart.For reference even the Amazon ICICI credit card offers the cashbacks as Amazon Pay Balance and can be used only on Amazon and its partner merchants. However the use cases of exhausting the Amazon Pay Balance is much wider with the platform offering insurance flight tickets and hotel bookings.The credit card launch and the aggressive cashback offers is happening at a time when Swiggy is gradually losing market share to Zomato and its grocery delivery platform Blinkit. The credit card could help cultivate loyalty and drive up its usage.The cobranded credit card success storyHDFC is the country s largest credit card issuer. The bank has issued close to two crore credit cards in the country whereas the overall number of credit cards in the country stands around 10 crore as of June 30 according to RBI data.Earlier this year Swiggy s Gurugrambased rival Zomato had ended its cobranded card partnership with RBL Bank which also offered 10 percent cashback on its premium Black edition while the Classic edition offered only five percent cashbacks. It is not clear why the partnership has not worked out.Some of the cobranded credit cards have been a runaway success among customers over the last fourfive years with both Amazon and Flipkart adding 40 lakh users each. These cards see fully digital onboarding of the majority of the users apart from high usage and activation rates. Paytm has around seven lakhs customers for its cards.Today Amazon ICICI credit card is almost 30 percent of the ICICI credit card portfolio and the Flipkart Axis credit card is almost 40 percent of Axis Bank s credit card portfolio indicating the importance of a successful cobranded partnership for banks. HDFC does not have such a huge success as of now. Today one in three credit cards are cobranded credit cards whereas it was just 10 percent a decade ago. This has been driven by the newage consumer internet brands.While airlines offline retail brands and oil marketing companies cards  used to be popular a decade ago digital brands have taken their place as customer spending has also shifted towards the platform and has often demonstrated loyalty and stickiness.For instance the overall credit card spending on digital platforms were close to Rs 90000 crore during the month of June whereas the credit card spending at Point of Sale terminals (or offline channels) stood at Rs 50000 crore that is almost 80 percent higher on online platforms.Who is the card forWhile there are around 10 crore credit cards in the country the unique number of credit card users is only around four crore. Most power users will have multiple cards and uses the cards to maximise value or cashbacks. Adding a Swiggy credit card will not hurt such users.The cashback benefit of five percent is also applicable on branded websites like Nike H M Adidas and Zara among others. Similar to Amazon and Flipkart credit cards this card also offers one percent cashback on all other spending. We recognise that modernday consumers actively seek rewards offers and cashback programs that add value to their spending  said Rahul Bothra Chief Financial Officer of Swiggy.As a welcome benefit the card is also offering a threemonth Swiggy One membership that offers free delivery and additional discounts. The credit card will be rolledout in a phased manner on the Swiggy app over the next 710 days post which all the eligible customers will be able to apply for it on Swiggy app and HDFC website. We strive to offer innovative and tailored solutions to meet the evolving needs of our customers. Dining and Grocery are at the core of customer s daily needs and with this strategic collaboration we are offering convenience of both categories bundled with great value  said Parag Rao country head for payment business consumer finance technology and digital banking at HDFC Bank.        ",
    "HDFC Bank s managing director and CEO Sashidhar Jagdishan on July 19 warned managerial level employees of transgression from good working culture saying he is aware of such instances and has the resolve to  nip this in the bud.  I am fully conscious of the fact that there may be instances where some people managers might transgress our defined way of working  Jagdishan said in his message to shareholders on July 19.   We have the resolve to nip this in the bud both by way of training counselling and appropriate action to ensure that the same is not attempted by anyone else  Jagdishan said.Jagdishan however added that the bank has  some distance to traverse on this front.   We are taking concrete steps towards building an inclusive organisation which will go a long way in reining in attrition in the coming years  he added.Why the comment is importantThe comment from the CEO assumes significance in the backdrop of an incident recently circulated on social media with respect to the alleged unruly behaviour of one of the senior executives of the bank towards junior staff.HDFC Bank on June 5 suspended the concerned officer in Kolkata for allegedly engaging in unruly behaviour with colleagues during an internal meeting. In a video circulating on Twitter the officer was heard shouting at his junior colleagues for not selling enough banking and insurance products.In a statement made available to   HDFC Bank said that on the basis of a preliminary enquiry into the matter the concerned employee has been suspended and a detailed investigation has been initiated which will be undertaken as per the Conduct guidelines of the bank.The banking major further added that they have a zerotolerance policy for any form of misconduct at the workplace and firmly believe in treating all our employees with dignity and respect.In the video the manager was asking his junior employee said  I don t understand today you re going to do 25 smart ones 25 sure covers and 25 health covers. Misselling complaintsIncidents of product misselling have been reported across the banking industry. In the past there have been instances where life insurance policies were sold to customers aged above 75 years in Tier IIIII cities. Usually branches of the banks push products of their subsidiary insurers.Bank executives face immense pressure from top management to sell thirdparty products like insurance. Failure to meet targets invites informal penal actions while meeting targets brings perks such as parties in fivestar resorts.Banks typically crosssell insurance products of their subsidiaries and sometimes of other companies along with loan products. Many a time banks insist purchase of policies along with loan products. Early this year the RBI had conducted a meeting with the board of directors of all public sector banks and private banks to discuss issues related to governance and ethics.Emphasis on cultureIn his message Jagdishan stressed the importance of good working culture saying that it defines the experience of each employee. Managers are uniquely positioned to represent the culture the Bank stands for. Talent Potential and Capabilities can best be harnessed through an enabling culture  Jagdishan said.Towards this aim the bank has adopted the managerial behaviour architecture based on the principles of  Nurture Care and Collaborate  said Jagdishan adding that this should translate into simple behaviours that managers can demonstrate in their interactions with their teams. The Nurture Care Collaborate initiative that covered over 12000  managers in the previous year was extended to the senior leadership levels and over 6000 new managers in FY 202223 the CEO added. The intent is to have all managers at the Bank equipped to fully live the cultural ethos of the Bank  Jagdishan said.Increase in attritionJagdishan said the bank has experienced an increase in attrition over the last financial year a significant part of which was in the  nonsupervisory staff  levels including sales officers.  Jagdishan attributed Covid as one of the reasons for high attrition that may have prompted the younger workforce to recalibrate what they  want from their lives  the CEO said. This has led to increased attrition across all sectors. It is a reality that all major employers are grappling with especially in the BFSI sector  Jagdishan added.Earlier in an interaction with the media the bank s chief financial officer Srinivasan Vaidyanathan had said that the lender witnessed a 30 percent employee attrition in the fiscal year 202223. On average we saw the attrition rate at around 30 percent. Highest attrition was seen at the entrylevel positions which stood at around 40 percent to 50 percent  Vaidyanathan said at a postresults media call.A few levels above the entrylevel Vaidyanathan said that the attrition rate is around mid20 percent to 30 percent the CFO added.HDFC and HDFC Bank got merged effective July 1 marking a major event in India s banking sector. Postmerger the loan book or advances of the merged entity jumped by 38.77 percent to Rs 22.21 lakh crore as against 16 lakh crore as on March 31 as per investor presentation of the bank.The merger gave HDFC Bank entry to India s booming housing loan market while for HDFC the decision made sense on account of vanishing regulatory arbitrage earlier available for nonbanking finance companies.        ",
    "Financials remain the darlings of Dalal Street with nonbanking financial companies (NBFCs) now grabbing the spotlight within this sector. In June mutual funds heavily invested in NBFC stocks while booking profits from private banking stocks.The current market sentiment suggests that the peak of the interest cycle is approaching its end according to analysts and fund managers. As central banks in developed markets begin to cut interest rates India is expected to follow suit. Resultantly the liability costs for NBFCs are likely to decrease leading to higher profit margins and increased profitability.Mutual funds in June raised their holdings across various NBFC segments be it housing finance consumer finance or microfinance. Loan demand remains strong across product categories like vehicle SME consumer segments and gold finance. The Street expects assets under management (AUM) growth above 20 percent year on year for most NBFCs in Q1 FY24. Credit growth is now wellentrenched and can continue for the medium term. The credit cycle also looks good and predictable. The probability of any big NPL (nonperforming loans) shocks coming over the next few quarters is very low  Vinay Sharma Fund Manager  Equity Investments Nippon India Mutual Fund said.In June asset management companies upped their stake in HDFC Shriram Finance Creditaccess Grameen and Mahindra   Mahindra Financial Services among several other names. While HDFC can be looked at as MFs jumping on an arbitrage opportunity ahead of merger with HDFC Bank inflows for other NBFCs were largely on the back of improving outlook on their asset quality and margins.Why the optimism NBFCs borrow from banks or raise money from nonconvertible debentures. In both cases they are borrowing at high rates but at the same time they are lending at even higher rates.  For instance select NBFCs are raising funds while offering yields up to 10 percent per annum but lending rates are also north of 14 percent. In that sense the gross margin picture for NBFCs looks better than that of many banks that accept deposits at 7.5 percent and lend at around the 9 percent range  explained Nirav Karkera of Fisdom.While some NBFCs could see their NIMs (net interest margins) contract by 515 basis points given the increase in the cost of funds analysts at Systematix Institutional Equities believe other NBFCs will likely maintain or see a marginal increase in NIMs aided by a change in their portfolio mix and upward revision in lending rates.Moreover when it comes to highyield segments like SME (small and medium enterprise) loans loans against property and unsecured personal B2C (businesstoconsumer) loans NBFCs are more willing to extend credit compared to several regulatory checks by banks. This is why NBFCs will be able to serve the increasing trend of financialisation better as they are playing the creditrisk game better said analysts.According to Krishna Sanghavi  CIO Equity Mahindra Manulife Mutual Fund NBFCs will continue to rerate as the focus shifts from margin pressures.  FY23 saw some derating for NBFCs on concerns over margins while banks saw profit gains as well as rerating. Q1FY24 saw a rerating for NBFCs as post the policy pause by RBI market expectations shifted away from margin pressure  he said.Bargain buysMoreover mutual funds also jumped at the opportunity to buy NBFC stocks at a bargain. For instance CreditAccess Grameen and Shriram Finance both saw big block deals in June at a slight discount to the then market price. Canara Robeco Axis Mutual Fund and HDFC AMC upped their stake in CreditAccess Grameen while Aditya Birla Sun Life AMC and Kotak Mahindra AMC among others bought into Shriram Finance. Meanwhile cash flows have held up well and contributed to better collection efficiencies which will translate into benign credit costs across most of the NBFCs  Ritesh Bhagwati  Head of Research  Rockstud Capital. In Q1 FY24 analysts expect the credit cost of most NBFCs likely to be maintained at Q4 levels except for a few like Mahindra Finance and Cholamandalam Finance which could see a normalised credit cost.And finally the space is also heating up with the entry of Jio Financial Services soon. While it is expected that JFS will disrupt the sector and heat up the competition fund managers do not seem to mind loading up on the already listed names to capitalise on India s growth story.",
    "Shares of Housing Development and Finance Corporation (HDFC) stopped trading on July 12 marking the end of an over fourdecadelong journey for India s oldest and biggest mortgage lender.HDFC now lives on as part of HDFC Bank but many market veterans view the company as a role model for corporate India and synonymous with the country s socioeconomic progress.Here are some key highlights of HDFC s market journey  Founded by H T Parekh uncle of Deepak Parekh. Incorporated on October 17 1977Deepak Parekh joined the company in 1978 leaving his Chase Manhattan Bank job where he was earning twice the salary offered by HDFC.Deepak Parekh approached UTI seeking investment in HDFC s IPO. UTI  the only mutual fund in India that time  refused saying retail lending for home loans was too risky.HDFC IPO launched in 1978. Issue size   Rs 10 crore (10 lakh shares of Rs 100 each). Shares issued to public at par (no premium).126 equity shares of Rs 100 taken up by the subscribers to the Memorandum of Association including 100 shares held by H T Parekh.50000 Equity shares of Rs 100 each subscribed by ICICI the IFC (W) and HH the Aga Khan IV respectively.450000 equity shares of Rs 100 issued for private subscription.399874 equity shares of Rs 100 offered to the public. The Corporation received 10697 applications for 473976 equity shares. The Corporation allotted the shares to 10543 applicants.The stock has posted a stellar CAGR of around 19 percent over the last three decades. However the CAGR for HDFC Bank is higher at 24 percent.Rs 100000 invested in HDFC in May 1995 would have grown to Rs 12639000 today (without dividends). However Rs 100000 invested in HDFC Bank would have increased to Rs 41400000 (without dividends).HDFC received approval for setting up HDFC Bank in 1994. The bank was inaugurated in February 1995 by the then Finance Minister Dr Manmohan Singh.HDFC took 33 years to hit the Rs 1lakh crore mcap mark. HDFC Bank reached the milestone in 15 years.HDFC s market capitalisation reached Rs 2 lakh crore in February 2015 Rs 3 lakh crore in February 2018 Rs 4 lakh crore in July 2019 and Rs 5 lakh crore in February 2021.In FY2000 HDFC s net profit at Rs 400 crore was almost four times that of HDFC Bank at Rs 120 crore.HDFC maintained its lead for the next decade. In FY2010 HDFC Bank overtook its parent in terms of net profit at Rs 2949 crore vs Rs 2826 crore for HDFC. The lead only widened over time.For the financial year ended March 2023 HDFC reported a net profit of Rs 16239 crore compared to Rs 44109 crore for HDFC Bank.Even in terms of topline growth HDFC Bank has usually outperformed its parent.The HDFC IPO was a tepid affair with shares listing below the issue price. Even at its last trading session on July 12 2023 the share closed in the red down nearly 1 percent at Rs 2724.30 on the NSE.        ",
    "On July 12 the shares of Housing Development and Finance Corporation or HDFC stopped trading on bourses post the merger with HDFC Bank that came into effect on July 1. That marks the end of a fourdecadelong journey for India s oldest mortgage lender.Founded by H T Parekh uncle of Deepak Parekh HDFC was incorporated on October 17 1977 and disbursed its first home loan in 1978 to D. B. Remedios in Mumbai. To start with the founding team had an unenviable job. Home loans were not a popular product back then and no one knew HDFC as a brand.But the team worked hard and steadily expanded the business. By 1984 HDFC had crossed annual loan approvals of Rs 100 crore a big milestone for the company. The company was listed in 1978 with a face value of Rs 100 each. The issue did not get a great response in fact it was undersubscribed.Yet that was the start of a remarkable journey to become a financial behemoth. On July 12 when the shares closed HDFC had a market capitalisation of over Rs 5 lakh crore.End of an eraDeepak Parekh the man who played a key role in building India s oldest mortgage lender from scratch hung up his boots after four decades with the company. With Parekh stepping down from all roles an era has ended.In his last letter to shareholders of HDFC on June 30 Chairman Deepak Parekh announced his retirement ahead of the mega merger with HDFC Bank saying it is time for him to hang up his boots.Parekh 78 will not take up any role in the bank while HDFC Chief Executive Officer Keki Mistry is likely to join the bank s Board subject to clearance from the Reserve Bank of India. It is my time to hang my boots with both anticipation and hope for the future  Parekh told shareholders. While this will be my last communication to shareholders of HDFC rest assured we now stride tall into a very exciting future of growth and prosperity  Parekh added. In a rather emotional letter Parekh said the HDFC experience is invaluable.  Our history cannot be erased and our legacy will be taken forward  said the veteran banker.Questions on HDFC cultureIn the letter Parekh reemphasised the importance of HDFC culture which helped the institution become a household name in India. An oftrepeated question is what happens to the culture of HDFC  My answer to this is that mergers are inherently about change. The work culture will be an amalgamation of the best of both organisations  Parekh wrote.Explaining further Parekh said the culture at the workplace is always a shared responsibility that needs daily reinforcement through the demonstration effect with the tone set at the top. As HDFC hands the baton my wish is that our core founding values of kindness fairness efficiency and effectiveness get woven deeper into the fabric of the HDFC group  Parekh added.In the letter Parekh said HDFC Bank managing director and CEO Sashidhar Jagdishan and his team at the bank will take the HDFC legacy ahead. With the proven execution capabilities of HDFC Bank we are confident that Sashi together with the leadership team will forge an era of new opportunities for the combined entity  Parekh wrote in the letter.Message to the bank In what appeared like a message or guidance to the bank with respect to home loan business Parekh said that every home loan customer has their own story and it is the empathy factor that is the key differentiator between housing finance providers. Dealing with home loan customers requires immense patience. It is about understanding the needs and feelings of a home loan customer assuaging their anxiety during this complex transaction customising solutions explaining financial implications of a mortgage product and lending responsibly to ensure a customer is not overstretched  the veteran banker said.Only home loan provider in the 80sFor CEO Keki Mistry too this is the end of a long journey as HDFC CEO. In an interview with   in March this year Mistry who is associated with the HDFC brand for nearly 42 years also highlighted that there will be structural opportunities in housing finance as the sector has seen tremendous change. In the early 1980s we were the only housing loan provider. Convincing people in the 80s that housing finance and loan would work was a major challenge. But now the sustained demand for housing loans has been strong  Mistry said.Though the merger was discussed a few years ago the plan entered a fast track in May 2021 with the bank deliberating the proposal at the top level and later approaching the parent with a proposal. HDFC Bank insiders say that compared with the previous boss of the bank Aditya Puri his successor Sashidhar Jagdishan was more amenable to the idea of a merger. Puri exited the bank in October 2020 and Jagdishan took charge as the new chief.A good match for both partiesWhile the merger gave the muchneed big entry to the bank into the lucrative home loan business for the parent too the decision made immense sense for one key reason. For NBFCs life was getting tougher in India.In his firstever exclusive media interview post the merger announcement Deepak Parekh told   that the NBFC business was getting tougher due to the tightening of the RBI regulations.  The constraint is that the RBI over the last few years removed the arbitrage between a bank and an NBFC  he said.Over the years the RBI had brought in banklike regulations for India s big nonbanks. Under the new multitiered structure for NBFCs (based on their asset size and systemic importance) bigger NBFCs were treated at par with banks on capital regulatory scrutiny and treatment of assets which made operations even more expensive for this class of companies.HDFC with an over Rs 5lakhcrore loan book logically fell in the upper layer which meant it will be now monitored inspected and regulated akin to a bank whereas the incentives in NBFC business were less. However when HDFC knocked on the doors of the regulator for a merger it got a key relief.The RBI gave critical relaxations on certain aspects such as priority sector lending norms and treatment of ownership of subsidiaries in April 21 2023. Also the RBI gave six months to HDFC customers to switch to new benchmarks.Postmerger the loan book of the merged entity will jump to Rs 22.21 lakh crore as on March 31 2023 while deposits are at Rs 18.84 lakh crore. Further HDFC Bank s market capitalisation will rise to Rs 14.6 lakh crore from Rs 9.45 lakh crore prior to the merger. For the HDFC group a great story ends and a new journey begins today.(Editor s note  Parts of this story were published earlier on  ) ",
    "Six of the top10 most valued firms together added Rs 119763.25 crore in market valuation last week with Reliance Industries Limited and ITC emerging as the major gainers driven by an overall positive trend in domestic equities.Last week the 30share BSE benchmark jumped 561.89 points or 0.86 percent. The Sensex hit its alltime high of 65898.98 on July 7. The valuation of Reliance Industries jumped Rs 57338.56 crore to Rs 1783043.16 crore the most among the top10 firms. ITC added Rs 21291.04 crore taking its market valuation to Rs 582602.46 crore.The market capitalisation (mcap) of State Bank of India rallied Rs 18697.06 crore to Rs 529898.83 crore and that of Tata Consultancy Services zoomed Rs 9220.81 crore to Rs 1216890.72 crore.ICICI Bank s valuation climbed Rs 8998.26 crore to Rs 662702.30 crore and that of Hindustan Unilever Limited advanced Rs 4217.52 crore to Rs 633532.04 crore. However the mcap of HDFC Bank fell by Rs 22926.37 crore to Rs 928657.99 crore. HDFC s valuation eroded by Rs 9782.7 crore to Rs 512585.94 crore and that of Bharti Airtel went lower by Rs 5219.66 crore to Rs 484844.10 crore.The market valuation of Infosys declined by Rs 1638.41 crore to Rs 552452.86 crore. In the ranking of top10 Reliance Industries continued to rule the chart followed by TCS HDFC Bank ICICI Bank Hindustan Unilever ITC Infosys State Bank of India HDFC and Bharti Airtel.        ",
    "Here is a collection of the most important stories this evening MC Investigates  The two big illegal reasons why finfluencers don t want to be SEBIregistered RAsThere have been many reasons shared for why finfluencers or financial influencers do not want to be registered as research analysts (RAs) with the market regulator SEBI including the restrictions placed on trading a stock that they have recommended and by extension live trading. Details here.Senco Gold IPO booked 2.68 times by second day of biddingThe public issue of Senco Gold has received good response from investors especially retail and high networth individuals with 2.68 times subscription through bids for 2.52 crore equity shares against an IPO size of 94.18 lakh on July 5 the second day of bidding. Read more here.Maruti Suzuki rolls out Invicto hybrid MPV at Rs 24.79 lakhWith the aim of widening its range in the premium segment of the passenger vehicle market Maruti Suzuki has launched Invicto MPV its largest and most expensive model. The MPV will be available at a starting price of Rs 24.79 lakh for the basic model and goes up to Rs 28.42 lakh for the topend variant exshowroom. Read more here.BSE rejig  JSW Steel to replace HDFC in Sensex from July 13JSW Steel will replace mortgage major Housing Development Finance Corporation (HDFC) in S P BSE Sensex index from July 13 according to the bourse s release on July 5. Details here.Battle Royale  Hero MotoCorp Bajaj and Eicher Motors set for an epic clash in premium motorcycle segmentThe battle for premium motorcycle segment is heating up with the entry of Harley Davidson X440 developed in collaboration with Hero MotoCorp and TriumphBajaj s Speed 400 and Scrambler 400 X. Details here.Marico optimistic about recovery in rural demand and growth prospectsMarico Ltd. said on July 5 that despite lack of clear signs of improvement in demand trends during the quarter the sector remained stable with urban markets maintaining a steady performance in their quarterly update of Q1 FY24. Read more.         ",
    "JSW Steel will replace mortgage major Housing Development Finance Corporation (HDFC) in S P BSE Sensex index from July 13 according to the bourse s release on July 5.The rejig is a result of the completion of the biggest corporate merger of HDFC with HDFC Bank which came into effect on July 1.On S P BSE 500 HDFC will be replaced by JBM Auto Components Ltd and on S P BSE 100 by Zomato. As on July 13 HDFC Ltd will be removed from all the other BSE indices.Shares of JSW Steel on Wednesday (July 5) closed 0.54 percent lower at Rs 792.45 apiece on BSE.Meanwhile on Nifty 50 index LTIMindtree a subsidiary of engineering giant Larsen   Toubro will replace HDFC from July 13.ALSO READ  HDFCHDFC Bank merger  As an era comes to end senior HDFC employees walk down memory laneHDFCHDFC Bank merger  All you need to knowThe merger of the country s largest private sector bank HDFC Bank and mortgage lender Housing Development Finance Corporation (HDFC) is effective from July 1. The boards have set July 13 as the record date to determine the eligible shareholders for allotment of shares under the merger deal.The twin entities had first announced their decision to get hitched on April 4 2022 after getting approvals from the board shareholders and regulatory authorities.The loan book of the merged entity is expected to increase by 38.77 percent to Rs 22.21 lakh crore as against Rs 16 lakh crore as on March 31 as per the investor presentation of HDFC Bank.Post this merger the home loan account with HDFC will be transferred to HDFC Bank. But the contractual terms of your loan agreement will remain unchanged. Your home loan account number will remain the same and continue to be the point of reference for all your future communication with the bank.         ",
    "HDFC Bank declined around 3 percent in morning trade on July 5 after the company announced its first quarter business update for FY24.At 10.57 am the stock was trading at Rs 1671.80 on the National Stock Exchange down 3.26 percent from the previous close.HDFC Bank informed the exchanges on July 5 that its advances aggregated to approximately Rs 16.15 lakh crore for the quarter ended June 30 up nearly 15.8 percent year on year (YoY) from Rs 13.95 lakh crore a year ago. The bank s advances grew around 0.9 percent on quarter over quarter (QoQ) basis against Rs 16 lakh crore in Q4FY23.The banks s deposits jumped 19.2 percent YoY for the said quarter to Rs 19.13 lakh crore as compared to Rs 16.04 lakh crore in Q1FY23. They were up 1.6 percent QoQ from Rs 18.83 lakh crore in the quarter ended March 31 2023.During the quarter under review the retail deposits were increased by Rs 38000 crore growing by 21.5 percent YoY and 2.5 percent QoQ. The wholesale deposits improved by approximately 9 percent YoY and declined by around 2.5 percent QoQ.In Q1FY24 the bank purchased loans aggregated to Rs 11632 crore through the direct assignment route under the home loan arrangement with HDFC Ltd.As on June 30 2023 HDFC Bank s CASA deposits aggregated to Rs 8.13 lakh crore an improvement of 10.7 percent over Rs 7.34 lakh crore as on June 30 2022. CASA deposits were down 2.7 percent over Rs 8.36 lakh crore at March end.  The retail CASA grew by 11 percent in Q1FY24 against Q1FY23 but fell by 2 percent QoQ. The Bank s CASA ratio stood at around 42.5 percent in the said quarter compared to 45.8 percent in Q1FY23 and 44.4 percent in Q4FY23.Commenting on the update analysts at brokerage firm Prabhudas Lilladher stated  Loan growth numbers are lower probably due to focus on the merger. While loan offtake seems to be lower for the system retail growth was strong at 4 percent QoQ which is a positive and the share of retail is expected to improve this quarter.  They further added that deposit accretion has been inline with credit offtake although the 2.7 percent QoQ decline in CASA seemed seasonal in nature. The brokerage firm has given a  Buy  rating on the stock at a target price of Rs 1925.Merged Entity Q1 UpdateSome key takeaways about HDFC Bank and HDFC s merged balance sheet Gross advances were up 13.1 YoY and 0.7 percent QoQ basis reaching  Rs 22.45 lakh crore. Deposits aggregated to approximately Rs 20.63 lakh crore in Q1FY24 up 16.2 percent YoY and 1.2 percent QoQ. The merged entity s average liquidity coverage ratio for the Q1 stood at around 120 percent on a proforma basis.",
    "HDFC Bank informed the exchanges on July 5 that its advances aggregated to approximately Rs 16155 billion for the quarter ended June 30 up nearly 15.8 percent from Rs 13951 billion a year ago.The bank s advances grew around 0.9 percent over Rs 16006 billion as of Q4FY23.Segment wise the bank s domestic retail loans grew by around 20 percent commercial and rural banking loans grew by around 29 percent and corporate and other wholesale loans grew by around percent on a yearonyear basis.The bank s deposits aggregated to approximately Rs 19130 billion in Q1FY24 posting a growth of around 19.2 percent over Rs 16048 billion from a year ago and a growth of around 1.6 percent over Rs 18834 billion from Q4FY23.Retail deposits grew by around Rs 380 billion during the quarter and grew by around 21.5 percent over June 30 2022 whereas wholesale deposits grew by around 9 percent on a YoY basis.The Bank s current account and savings account (CASA) deposits aggregated to approximately Rs 8130 billion as of June 30 2023 agrowth of around 10.7 percent over Rs 7346 billion as of June 30 2022.Also Read  HDFCHDFC Bank merger  As an era comes to end senior HDFC employees walk down memory laneThe merged entity s gross advances aggregated to approximately Rs 22450 billion in Q1FY24 up by nearly 13.1 percent over Rs 19859 billion as of June 30 and up by 0.7 percent over Rs 22302 billion as of March 31.The merger of Housing Development Finance Corporation (HDFC) India s oldest and largest mortgage lending firm with HDFC Bank came into effect on July 1. HDFC and HDFC Bank announced the decision to merge on April 4 2022.        ",
    "LTIMindtree a subsidiary of engineering giant Larsen   Toubro will replace mortgage major Housing Development Finance Corporation (HDFC) from Nifty 50 index from July 13.This comes in the aftermath of HDFC s merger with its twin entity and country s largest private lender HDFC Bank coming into effect on July 1. The Index Maintenance SubCommittee (Equity) of NSE Indices Limited has decided to make replacement of stock in various indices as listed hereunder on account of scheme of amalgamation of Housing Development Finance Corporation Ltd. with HDFC Bank Ltd. These changes shall becomeeffective from July 13  a release issued by the National Stock Exchange (NSE) stated.In the Nifty 100 and Nifty 500 indices HDFC will be replaced by Jindal Steel and Mankind Pharma respectively.Also Read   L T sees LTIMindtree among top 5 IT companies  SubrahmanyanAmong other indices HDFC will be replaced by LIC Housing Finance in Nifty Financial Services by Poonawalla Fincorp in Nifty Financial Services ExBank by Phoenix Mills in Nifty Housing by Brigade Enterprises in Nifty Core Housing and by Ambuja Cements in Nifty High Beta 50.  had last week reported that LTIMindtree would be the likely replacement for HDFC in the Nifty 50 index. Following HDFC s amalgamation into HDFC Bank LTIMindtree was set to become the 50th biggest company in India by market capitalisation.Notably LTIMindtree which is a merger between LT Infotech and Mindtree marked the commencement of trading on the domestic stock exchanges on December 5 2022.In the trading session on July 4 LTIMindtree s stock traded in the green. The scrip settled at Rs 5250.55 apiece at the NSE which was 0.75 percent higher as against the previous day s close.        ",
    "Shares of HDFC twins were in the limelight on Monday and ended in the positive territory the first day of trading after the merger amid an overall bullish equity market trend.The stock of HDFC climbed 1.76 per cent to settle at Rs 2871.20 on the BSE. During the day it jumped 3.70 per cent to its 52week high of Rs 2926.Shares of HDFC Bank went up by 1.05 per cent to end at Rs 1719.55. In intraday trade it advanced 3.29 per cent to Rs 1757.80   its 52week high. The combined market valuation of HDFC and HDFC Bank stood at Rs 1493119.33 crore on the BSE.The combined market valuation of HDFC and HDFC Bank stood at Rs 1493119.33 crore on the BSE. Housing finance major HDFC merged with its subsidiary HDFC Bank on Saturday. Rally in HDFC twins were significant in adding to the positive momentum in the equity market.Rallying for the fourth straight session the 30share BSE Sensex jumped 486.49 points or 0.75 per cent to settle at its alltime closing high of 65205.05. During the day it rallied 581.79 points or 0.89 per cent to its lifetime intraday high of 65300.35.The board of directors of HDFC Bank in consultation with the board of directors of HDFC Limited has fixed July 13 2023 for determining the shareholders of HDFC Ltd who would be issued and allotted the shares of HDFC Bank.Besides July 13 has been fixed for the continuation of warrants of HDFC Limited in the name of HDFC Bank.        ",
    "The merger of Housing Development Finance Corporation (HDFC) India s oldest and largest mortgage lending firm with HDFC Bank came into effect on July 1. And it is an emotional moment for many old HDFC employees who spent a lifetime with the company.Some HDFC employees   spoke to recall their early days including the struggles of selling home loans when the product wasn t popular.  I still remember the first day I joined HDFC. Now I ve worked for more than two decades with the company and it feels like home to me  said Nitin Walia Assistant Manager of a branch in Delhi.Another employee who did not wish to be named said after working 34 years at HDFC the culture of the company is what he will miss the most.  The spirit of working and the culture is the most important thing I experienced in my career at HDFC  said the employee. HDFC is an iconic brand. No one can take HDFC from us  said another senior employee. My 17 years in HDFC were full of a rollercoaster ride. Now to see that HDFC merged with HDFC Bank is a happy moment  said Shalabh Sharma Deputy Manager at an HDFC branch in Mumbai.Old daysHDFC opened in 1977 and was the sole mortgage lender in India at that time. Keki Mistry CEO and Vice Chairman HDFC in an exclusive interview to   in March 2023 said that initially it was the only mortgage lender in India and with time  we created our competition. Also read  Here s how much Deepak Parekh earned when he joined HDFC. See offer letter We trained some individuals and banks to start mortgage lending. During the early years of the company home loans were not popular in India  Mistry said.Echoing this Sharma said that his role in the initial years involved developing leads and contacts.  In the early years people did not know about home loans. Before selling there was a need for informing  said Sharma.Mahesh Shah former Corporate Communications Head at HDFC said that the first word that comes to his mind when he recalls his journey with HDFC is commitment. Shah recalled that in May 1987 Deepak Parekh Chairman HDFC came to Cross Maidan to motivate the HDFC Cricket team during the finals of the Corporate Cricket tournament  The Times Shield.  He took me for a stroll on the ground as it was a lunch break to discuss the status of the match which he responded HDFC will win. He wanted to know if we needed to strengthen the team to meet the challenges of a higher level and he stuck to his commitment of a spinner being recruited  said Shah.The evolutionHDFC Bank was incorporated in 1994 as a banking subsidiary of HDFC in Mumbai. With time HDFC and HDFC Bank became mammoths in their respective sectors. The bank s loan book over the years grew tremendously from Rs 2.3 lakh crore in 2013 to Rs 16 lakh crore in 2023. As of March 2023 the market capitalisation of HDFC Bank is Rs 9.5 lakh crore and that of HDFC is Rs 5.2 lakh crore.The struggle of selling a home loan was something that HDFC faced in the years of its evolution. Parekh in a press conference in Mumbai on June 27 said that he still remembers the first loan the company gave.  Our first home loan was of Rs 30000. We took photographs of the customer with his house and made it the cover picture of our first annual report  said Parekh.Shah recalled that during his time in HDFC he remembered the growth of the company and summed it up in one word   commitment.  The management of the company created an environment of subtleness and friendliness from the earliest days  said Shah.Also read  With Rs 14.7lakhcr MCap HDFCHDFC Bank united to outgrow top 4 private 13 PSU lendersCulture of HDFCParekh said HDFC and HDFC Bank have different cultures due to the nature of their business. However though there is some difference the company aims to have the same culture in the bank he added.  We want to have the culture of HDFC in HDFC Bank. Culture is the essential part of our organisation. A bank which does not do housing will have a different culture  said Parekh.Mistry also said that there is not much cultural difference in HDFC and HDFC Bank and that every single employee from the mortgage lender will get absorbed into the bank.  We don t see too many cultural differences between the two entities and all our staff. We have reassured that every single employee of HDFC will be taken into the bank  said Mistry.Also read  HDFCHDFC Bank merger  How did the story unfold over time The employee who did not wish to be named highlighted that the culture at HDFC is one thing he takes pride in.  Culture is the essence of a workplace. I felt a homelike culture at HDFC  said the employee.The mergerHDFC and HDFC Bank announced the decision to merge on April 4 2022. As per the plan HDFC will acquire a 41 percent stake in HDFC Bank through the merger.In fact Parekh had said back in 2015 itself that his firm could consider a merger with HDFC Bank if circumstances were favourable. But the wait for the merger got longer with the parent putting the idea on the backburner. Parekh had said that the merger makes sense provided there is no loss for shareholders.Sashidhar Jagdishan Managing Director HDFC Bank on an analyst call on May 24 said that the merger is only about a month away.Once the deal comes into force HDFC Bank will be 100 percent owned by public shareholders and existing shareholders of HDFC will own 41 percent of the bank. With the parent finally joining with the bank the combined entity will emerge as a powerhouse in the Indian banking industry.        ",
    "Having successfully executed the merger with parent HDFC HDFC Bank s managing director and chief executive Sashidhar Jagdishan on Saturday said the country s largest lender aims to double every four years.In a letter to the over 4000 employees from HDFC who joined the bank s rolls on Saturday Jagdishan said the future is bright and the work on realising the potential of the merger starts now. The runway for financial services and mortgage which are so underserved and under penetrated is going to be very large. HDFC Bank  the combined entity  with a large and growing distribution and customer franchise more than adequate capital healthy asset quality and profitability will be best positioned to capture growth. The pace at which we aim to grow  we could be creating a new HDFC Bank every 4 years  he said.HDFC Bank began the day one after the merger with a rebranding exercise wherein it is putting up its colours at all the over 500 branches and offices of HDFC Ltd.The erstwhile HDFC s corporate headquarters at Ramon House already sports the HDFC Bank branding and officials estimated that the entire exercise will be over in the next 24 hours.It can be noted that dedicated teams have been put in place to make the merger as seamless as possible right since its announcement on April 4 last year. As part of the USD 40 billion allshare deal the biggest in Indian corporate history HDFC Bank had committed to absorb all the over 4000 employees of its parent. Our work starts from today in realising the potential of what this merger holds for us  Jagdishan wrote.To realise its growth aims Jagdishan said the bank will be adding about 1500 branches every year for some years to better serve the middle class and upper segment of the country.It will continue investments on the digital front as well which Jagdishan said will make HDFC Bank into a  technology company into banking  and added that the same will get unveiled over the next three years.The bank will be assessing its people on the basis of how they conduct governance and compliance teamwork and their ability to delight customers he said.The canvas being offered to the HDFC Ltd employees is large  both professionally and personally the email said adding that an external expert was appointed to arrive at the right formula for inducting people into the bank and deciding their role in the hierarchy.Jagdishan said the costtorevenue ratio of HDFC at 0.04 per cent was the lowest for any mortgage company in the world and thanked its leadership including Deepak Parekh Keki Mistry and Renu Karnad for creating such an institution.He said from a customer perspective the home loan is a very emotional product which establishes a great bond between the financier and borrower and added that HDFC Bank would like to harness the same bond. The penetration levels of the home loan product in its (HDFC Bank s) customer base and the extent the distribution has been leveraged is quite low. This is an opportunity  The runway for growth is going to be large and for a long time to come  Jagdishan said.HDFC Bank will move from sales management to a relationship management model because of the opportunity to crosssell that exists within the franchise after the addition of mortgage finance insurance and asset management subsidiaries Jagdishan said. The velocity of product sales and the reduced touch points to serve the customer will be a game changer with this  power of bundling   he added.HDFC Ltd the parent of the country s largest private sector lender merged into HDFC Bank on Saturday with boards of both entities clearing the plan first presented on April 4 last year. HDFC Ltd the largest pureplay home financier ceases to exist 44 years after it was founded.The USD 40billion merger the largest such deal in Indian corporate history is driven by a changing regulatory landscape which limited the advantages for HDFC continuing as a nonbank lending entity.Postmerger HDFC Bank will become the fourth most valued lender in the world and narrow the gap by asset size with stateowned SBI to be the second largest Indian bank.The total business of the merged entity stood at Rs 41 lakh crore at the end of March 2023. With the merger the networth of the entity would be over Rs 4.14 lakh crore.The combined profit of both entities was to the tune of about Rs 60000 crore at the end of March 2023.With the deal getting effective HDFC Bank will be 100 per cent owned by public shareholders and existing shareholders of HDFC will own 41 per cent of the bank. Every HDFC shareholder will get 42 shares of HDFC Bank for every 25 shares they hold.The board of directors of HDFC Bank in consultation with the board of directors of HDFC Limited has fixed July 13 2023 for determining the shareholders of HDFC Ltd who would be issued and allotted the shares of HDFC Bank it added.Besides July 13 has been fixed for the continuation of warrants of HDFC Limited in the name of HDFC Bank.The board has fixed July 12 2023 for the transfer of nonconvertible debentures while July 7 for the transfer of commercial papers of HDFC Ltd in the name of HDFC Bank.The merged entity brings together significant complementarities that exist between both entities and is poised to create meaningful value for various stakeholders including respective customers employees and shareholders of both entities from increased scale comprehensive product offering balance sheet resiliency and ability to drive synergies across revenue opportunities operating efficiencies and underwriting efficiencies a statement said.        ",
    "The merger of India s largest private sector bank HDFC Bank and the home loan major Housing Development Finance Corporation has created a behemoth in the Indian banking industry second only to the State Bank of India in terms of assets. As per the   research the loan book or advances of the merged entity is expected to increase by 38.77 percent to Rs 22.21 lakh crore.HDFC and HDFC Bank have been part of the top 10 holdings of many equityoriented mutual fund schemes which helped multiply unitholders  wealth over the years. Believing in the longterm growth story of these companies many fund managers continued holding these stocks in their portfolios irrespective of the market gyrations. As per the latest data the overall mutual fund industry has held about Rs 117456 crore of the investment in HDFC Bank while Rs 61805 crore in HDFC Ltd.Largecap multibaggersBoth HDFC bank and HDFC multiplied the investors  money. As of June 30 2023 HDFC Bank and HDFC shares rewarded the investors with returns of 1589 percent and 618 percent respectively over the last 15 years.Both HDFC Bank and HDFC were the most favourite stocks of many actively managed schemes over period. Data compiled from ACEMF shows that there were 22 actively managed schemes (except sector funds) held the stock of HDFC bank in their portfolio for more than 15 years. Meanwhile as much as nine active schemes held the stocks of HDFC in their portfolio for the 15 years.Also read  Smallcap mutual funds outshine  here s the top schemes that surge up to 12 times in 10 years         ",
    "HDFC Bank started rebranding offices of erstwhile HDFC Ltd with its colours on Saturday on the first day of operations as a merged entity.Branding at all over the 500 offices and branches of the home loan major started getting the HDFC Bank look from Saturday morning onwards officials said.The entire exercise of changing the look at HDFC Ltd s offices and branches is slated to take about 24 hours they said adding that HDFC Ltd s corporate headquarters at Ramon House is among the places where the branding has already been changed.HDFC Ltd the parent of the country s largest private sector lender merged into HDFC Bank on Saturday with boards of both the entities clearing the plan first presented on April 4 last year. HDFC Ltd the largest pureplay home financier ceases to exist 44 years after it was founded.Sashidhar Jagdishan the managing director and chief executive of the HDFC Bank is slated to address a townhall later in the evening. Over 3500 employees of HDFC have been integrated into HDFC Bank after the merger.The USD 40billion merger the largest such deal in Indian corporate history is driven by a changing regulatory landscape which limited the advantages for HDFC continuing as a nonbank lending entity.Postmerger HDFC Bank will become the fourth most valued lender in the world and narrow the gap by asset size with stateowned SBI to be the second largest Indian bank.The total business of the merged entity stood at Rs 41 lakh crore at the end of March 2023. With the merger the networth of the entity would be over Rs 4.14 lakh crore.The combined profit of both entities was to the tune of about Rs 60000 crore at the end of March 2023.With the deal getting effective HDFC Bank will be 100 per cent owned by public shareholders and existing shareholders of HDFC will own 41 per cent of the bank. Every HDFC shareholder will get 42 shares of HDFC Bank for every 25 shares they hold.   Saturday July 1 2023 to be the  Effective Date  of the composite scheme of amalgamation on which date the certified order of the NCLT sanctioning the Scheme will be filed by HDFC Investments HDFC Holdings HDFC Limited and HDFC Bank with the RoC  HDFC Bank said in a regulatory filing late on Friday.The board of directors of HDFC Bank in consultation with the board of directors of HDFC Limited has fixed July 13 2023 for determining the shareholders of HDFC Ltd who would be issued and allotted the shares of HDFC Bank it added.Besides July 13 has been fixed for the continuation of warrants of HDFC Limited in the name of HDFC Bank.The board has fixed July 12 2023 for the transfer of nonconvertible debentures while July 7 for the transfer of commercial papers of HDFC Ltd in the name of HDFC Bank.The merged entity brings together significant complementarities that exist between both entities and is poised to create meaningful value for various stakeholders including respective customers employees and shareholders of both entities from increased scale comprehensive product offering balance sheet resiliency and ability to drive synergies across revenue opportunities operating efficiencies and underwriting efficiencies a statement said.In the statement issued on Friday Jagdishan said the combined strength will help create a holistic ecosystem of financial services.   We re truly happy to welcome the talented team of HDFC Ltd into the HDFC Bank family. I believe our journey will be defined by agility adaptability and a relentless pursuit of excellence. As we navigate the path ahead we will embrace challenges as opportunities learn from our experiences and strive to be the benchmark of success and integrity in the financial services industry  he said.        ",
    "The boards of mortgage lender Housing Development Finance Corporation (HDFC) and private lender HDFC Bank have approved July 1 as the effective date of merger and July 13 as the record date.The board has approved  July 1 2023 to be the  effective date  of the (amalgamation) scheme on which date the certified order of the NCLT sanctioning the scheme will be filed by HDFC Investments HDFC Holdings the Corporation and HDFC Bank with the Registrar of Companies (RoC)  a regulatory filing by HDFC stated.The Mumbaibench of the National Company Law Tribunal (NCLT) had given its clearance to the HDFCHDFC Bank merger in an order issued on March 17.The exchange filing further added that in consultation with the board of directors of HDFC Bank it was decided to fix July 13 as the  record date  for determining the shareholders of HDFC who  shall be issued and allotted the shares of HDFC Bank .Also Read   Deepak Parekh in last letter to HDFC shareholders   It is time to hang my boots July 13 has also been fixed as the record date for  continuation of warrants of the Corporation in the name of HDFC Bank  it added.The filing also noted that July 7 has been fixed as the record date for  transfer of commercial papers of the Corporation in the name ofHDFC Bank  and July 12 for  transfer of nonconvertible debentures .Commenting on the boards  final approval for the megamerger HDFC Bank MD and CEO Sashidhar Jagdishan said  This is a defining event in our journey and I m confident that our combined strength will enable us to create a holistic ecosystem of financial services. We re truly happy towelcome the talented team of HDFC Ltd into the HDFC Bank family. Notably the twin entities had first announced the decision to merge on April 4 2022. As per the plan HDFC is to acquire a 41 percent stake in HDFC Bank through the amalgamation.On March 10 in an exclusive interview with   HDFC Vice Chairman and Chief Executive Officer Keki Mistry said that the merger will lead to bigger growth opportunities for the combined entity. Gradually the objective is to expand housing loans from more and more branches of the bank. The growth opportunity on housing loans will be bigger in HDFC Bank (the combined entity) than HDFC  said Mistry.Once the deal comes into force HDFC Bank will be 100 percent owned by public shareholders and existing shareholders of HDFC will own 41 percent of the bank.        "
]