[
    "Shares of Larsen and Toubro Limited traded a marginal 0.5 percent lower to Rs 3091 early on November 20 after the income tax authorities in Qatar imposed two penalties on the company amounting to Rs 111.3 crore and Rs 127.6 crore citing discrepancies in the income declared by it and the authority s assessment.The penalties have been levied for the tax periods spanning from April 2016 to March 2017 and April 2017 to March 2018. L T has contested these penalties filing an appeal against them asserting that the company views them as arbitrary and unjustified.Follow our market blog for all the live actionAs per data the Middle East holds the position of the second most crucial geographical region for L T. During the first half of the fiscal year 202324 it constituted 41 percent of the company s order inflow. Additionally orders from the Middle East comprised 32 percent of L T s total order book which amounted to Rs 450700 crore as of the end of September. Reasonably confident of a favourable outcome at the appellate level  L T said in an exchange filing on November 17. It further added that no material impact is expected of this penalty.In the second quarter the company s net profit climbed 45 percent yearonyear to Rs 3223 crore while the revenue increased Rs 51024 crore compared to Rs 42763 crore clocked in the corresponding quarter of the previous fiscal.",
    "Prabhudas Lilladher s research report on Larsen and ToubroLarsen   Toubro (LT) reported healthy set of quarterly performance with consolidated revenue growth of  19.3  YoY while margins contracted 41bps YoY due to business mix and legacy project reaching completion. NWC to sales improved to 16.7  vs 19.8  in H2FY23 owing to strong cash collections with FY24 guidance maintained at 1618 . Tender prospects from Infrastructure stands at Rs5.06trn and Hydrocarbon Rs2.9trn for H2FY24. Hyderabad metro reported profit of Rs2.4bn vs loss of Rs3.3bn in Q2FY23 owing to increased ridership and TOD monetization. Management is confident to surpass its earlier guidance on order inflows and revenue growth of 1012  and 1215  respectively for FY24. Management revised its core margin guidance to 8.5 9  from 9  guided earlier factoring in multiple jobs not reaching margin recognition threshold in FY24. We believe L T is wellplaced to benefit in long run with 1) strong tender prospects 2) better order conversion in domestic market 3) significant traction in hydrocarbon and 4) renewable energy orders from international markets like Saudi Arabia and expected uptick in private capex in domestic market.OutlookThe stock is currently trading at PE of 30.3x 25.7x 22.1x FY24 25 26E. We revise our FY24 25E by 6.1  5  factoring in improved performance of Hyderabad Metro strong order book and tender prospects. We roll forward to Sep 25E and maintain  Buy  rating on stock with revised TP of Rs3437(Rs3302) valuing core business at PE of 24x Sep 25E.For all recommendations report click here",
    "Shares of Larsen and Toubro opened around 1.5 percent higher at Rs 2972.55 on November 1 after analysts raised the target prices and estimates following strong Q2FY24 earnings. But by 9 40am the stock lost some of its early gains as investors rushed to book profit driving the stock at Rs 2930.15.Prabhudas Lilladher analysts gave the group a  buy  rating with a revised target price of Rs 3437 (from Rs 3302 earllier) said that they were optimistic that the engineering company was wellplaced to benefit in the long run due to strong tender prospects better order conversion in domestic market significant traction in hydrocarbon and renewable energy orders from international markets like Saudi Arabia along with an expected uptick in private capex in domestic market.The brokerage has revised its FY24 and FY25 estimates to factor in  improved performance of Hyderabad Metro strong order book and tender prospects .Strong EarningsLarsen   Toubro (L T) recorded a 45 percent jump in net profit for the second quarter of fiscal year 202324 to Rs 3223 crore as per the financial results declared by the company on October 31. L T reported a 19 percent rise in consolidated revenue for Q2FY24 to Rs 51024 crore from Rs 42763 crore a year back. Earnings before interest taxes depreciation and amortisation (EBITDA) margin declined around 40 basis points to 11 percent in Q2FY24 from 11.4 percent in Q2FY23.Follow our market blog for live updatesAnalysts at Jefferies have given L T a  buy  call and raised the target price to Rs 3400 per share. According to the brokerage while the Q2 EBITDA was lower than expected the order flow was strong.During the reporting quarter L T won orders worth Rs 89153 crore at the group level during Q2 a 72 percent growth over the previous fiscal.Also read  MC Pro Inside Edge   A ringside view of the inner goingson of Dalal Street  What stocks veteran bulls are eyeing what the bears are ganging up against secret deals and moreThe L T management said that it has revised the margins to 8.59 percent from 9 percent earlier. Analysts at Jefferies say that if projects reach the margin recognition levels earlier this cut could surprise.Analysts at InCred have given L T an Add rating and raised the target price by Rs 3300 per share as the company s EBIDTA and net profit beat estimate.Also read  L T Q2 results  Profit jumps 45  to Rs 3223 crore revenue up 19  at Rs 51024 croreIn a postearnings media interaction the company said that it  expects growth momentum in the Indian market to continue on the back of sustained buoyancy in services consumer and business optimism higher government spending healthy balance sheets of banks and corporates upcoming festive season demand and supply chain normalisation. ",
    "Indian engineering research and development services provider L T Technology Services cut its revenue growth forecast for the current financial year on Tuesday citing longer deal decision cycles and macroeconomic challenges.The unit of engineering conglomerate Larsen and Toubro now expects revenue in dollars for this fiscal year ending March to grow 17.5 18.5  in constant currency as opposed to the previous estimate of a 20  jump. While longer term trends for ER D remain strong in the short term we are seeing longer decision cycles and incremental headwinds from the macroeconomic stress in various geographies  CEO Amit Chadha said in a statement.L T Technology follows larger IT service providers Infosys and HCLTech which last week cut revenue outlook after clients in major revenuegenerating markets of the U.S. and Europe scaled back spending amid fears of an economic slowdown.L T Technology however reported consolidated net profit for the second quarter at 3.15 billion rupees ( 37.85 million) up from 3 billion rupees a year ago.During the quarter the company won seven deals worth more than  10 million each across all industry segments it said in a filing.Revenue from operations climbed 4.6  to 23.87 billion rupees in the quarter led by a 15  rise in revenue in its mainstay transportation segment.The company restated yearago figures to incorporate results of Smart World and Communication a business it purchased from its parent earlier this year.L T Technology s shares closed down 1.6  lower ahead of the results. They have climbed 25.2  for the year so far compared with an 11  gain in the Nifty IT index.         ",
    "Larsen   Toubro Ltd (L T) a prominent engineering and infrastructure conglomerate is set to kickstart its equity share buyback program on September 18. The last date for tendering shares or closing of the buyback will take place on September 25.Larsen   Toubro announced a Rs 10000 crore share buyback along with its June quarter results in July. The tender offer buyback was supposed to be carried out at a price of Rs 3000 per share but the company announced on September 11 that it has increased the buyback price to Rs 3200 per equity share.Catch all the market updates LIVER Shankar Raman L T s CFO and wholetime director emphasized the company s commitment to improving its Return on Equity (RoE). This aligns with the central objective of the fiveyear strategic plan  Lakshya 2026  which aims to enhance shareholder value through RoE optimization. The buyback of L T shares is a significant step toward achieving this objective by returning capital to the shareholders.The engineering major is  walking the talk  on its RoE focus with a buyback price of Rs 3200 per share pointed out foreign brokerage firm CLSA.The EPC major anticipates that the buyback will have minimal effect on its profitability and earnings except for reducing the funds available for investment which could have otherwise been used to generate investment income.Under the buyback regulations a promoter can choose to participate in a buyback. However since L T is professionally managed and lacks identifiable promoters or a promoter group in control the disclosure of promoter intentions current holdings as of the Public Announcement date and trading details for the past 12 months is not relevant the company said.The financing for the planned buyback will come from the company s free reserves (retained earnings) current cash and cash equivalents and or internal earnings as well as any other permissible source according to the Buyback Regulations or the Act.L T is a professionally managed conglomerate valued at  23 billion. Founded in Mumbai in 1946 by Danish engineers Henning HolckLarsen and Soren Kristian Toubro the company operates in sectors including EPC projects hitech manufacturing and services. The company s shares are listed on the BSE since September 24 1952 and on the NSE since December 14 2000.        ",
    "Prabhudas Lilladher s research report on Larsen and ToubroL T has been issued letter of intent worth  US 3.9bn from Saudi Aramco for phaseII expansion of its Jafurah unconventional gas production project which itself can meet  13  of FY24 order inflow guidance. The company bagged orders worth Rs655.2bn in Q1FY24. We believe L T to comfortably surpass its order inflows guidance of 1012  growth for FY24 ( Rs2.3trn in FY23) aided by large international and domestic order wins. The company had revised its tender prospects in Q1FY24 to Rs10.07trn for 9MFY24 vs Rs9.73trn guided for 12MFY24. The prospect revision was mainly in hydrocarbon business (Rs3.47trn guided in Q1FY24 vs Rs2.44trn in Q4FY23) mainly from Middle East market. We believe L T is wellplaced to benefit in the long run given 1) strong tender prospects 2) better order conversion in domestic markets 3) significant traction in hydrocarbon and 4) renewable energy orders from international markets like Saudi Arabia and expected uptick in domestic private capex.OutlookWe revise our FY24 25E estimates by 1.7  3.7  post factoring in healthy growth prospects for hydrocarbon business. The stock is currently trading at PE of 32.9x 27.1x FY24 25E. Maintain  Buy  rating on stock with revised SoTP based TP of Rs3302 (Rs2955 earlier) valuing core business at PE of 25x FY25E (22x earlier) given recent large order wins aiding strong revenue visibility and improving Hyderabad Metro Performance.For all recommendations report click here",
    "ICICI Securities research report on Larsen and ToubroAs per media reports (Link) L T is the preferred contractor for USD 3.9bn order for Jafurah Unconventional Gas Field Saudi Arabia (Source  MEED). Also till date in FY24 L T has announced orders worth over INR 750bn. With this significant accretion in orders L T could report  20  growth in order inflow in Q2 (excl. services) in our view. Note L T has highlighted that order prospects have improved QoQ (for the first time on prospects from the Middle East hydrocarbons). However it has maintained its order inflow growth guidance of 15  YoY for FY24. Given the order inflow including the above mentioned order we expect L T to beat its earlier order inflow guidance. Also we like the renewed focus of L T to reward minority shareholders with a significant buyback announced in Q1FY24. We believe RoE is likely to improve by 200bps in the medium term. We raise FY25E PAT and also increase target multiple for the standalone business. Upgrade to BUY.OutlookWe upgrade the stock to BUY on strong consecutive order inflow for two quarters (Q1 Q2FY24) which could likely result in beat to order inflow guidance for FY24 a significant buyback to reward shareholders and consequent improvement in RoE. We expect margin improvement in Q4 and FY25E for core business amidst benign RM prices. We upgrade the stock to BUY with SOTP based TP of INR 3141 (assigning 30x FY25E to EPC business).For all recommendations report click here",
    "Larsen and Toubro (L T) have fixed September 12 2023 as the record date for determining the entitlement and eligibility of equity shareholders for participation in the company s share buyback plan. On July 25 the board of directors of the company approved a proposal to buy back shares worth up to Rs 10000 crore excluding tax on buyback.On August 25 shareholders of the company approved the buyback of up to 33333333 fully paidup equity shares of face value of Rs 2 each for an aggregate consideration not exceeding Rs 10000 crore at a price of Rs 3000 per equity share on a proportionate basis by way of a tender offer route using stock exchange mechanism. In a public notice on Monday the company said the equity shares proposed to be bought back shall be divided into two categories   the reserved category for small shareholders and the general category for other eligible shareholders.On the objectives behind the move the company said it had formulated its  Lakshya 26 strategic plan in FY22. One of the key strategic objectives in Lakshya 26 is to improve return on equity and maximize shareholder value. Increased profitability release of working capital higher dividends apart return of extra capital to shareholders in the form of buyback of shares is one such initiative which can help in meeting these objectives.         ",
    "Emkay Global Financial s research report on Larsen and ToubroLT reported better than expected numbers for the quarter with sales growth at 34  YoY and PAT growth at 46 . EBITDAM at 10.2  was below our estimate but high topline growth more than offset the margin decline. The infrastructure segment saw sales growth of 55  though EBITDAM slipped to 5.1  vs 6.5  YoY due to job mix and legacy Covid jobs nearing completion. Order inflow ex services grew  80  YoY with Infrastructure (100  YoY) and Energy (66  YoY) being the major contributors. Management has maintained guidance of 1012  sales growth 1215  inflow growth though it looks conservative on current runrate basis. EBITDA margin is expected to clock at 9  for the Projects business as improvement is expected in H2FY24.OutlookOrder prospects for 9M are up 34  (largely backed by international hydrocarbon projects) and are a key positive. We maintain HOLD with Jun24E TP of Rs2550 sh.For all recommendations report click here",
    "India s biggest engineering company Larsen   Toubro (L T) plans to give back extra money to its shareholders by repurchasing up to Rs 10000 crore worth of shares through a buyback.The engineering conglomerate s board has approved the proposal to buy back 3.33 crore shares representing 2.4 percent of the total paidup equity share capital at a tentative price of Rs 3000 per share which is the maximum being considered by L T at the moment. The offer represents an over17 percent premium to the July 25 closing price of Rs 2561.95.Once the shareholder s approval for the buyback is received L T will decide on a date and the final price the infrastructure giant s Chief Financial Officer R Shankar Raman said in a postearnings conference call with the media.Boost returns The buyback is part of L T s plan to improve its Return on Equity (RoE) as part of the group s  Lakshya 2026  plan Raman added.According to an analyst from a foreign brokerage firm the buyback is expected to boost L T s Earnings per share (EPS) and Return on Equity (RoE). The analyst foresees a potential enhancement of RoE by 4060 basis points (bps) while EPS could see a slight upward revision of merely 45 percent.When a company buys back its own stock it reduces the number of outstanding shares. As a result the company s earnings are divided among fewer shares which automatically increases its EPS. The return on equity would also improve because there is less outstanding equity. This (buyback) will likely help the company achieve its strategic target of 18 percent RoE by FY2526  said ICICI Securities.Even Nuvama Institutional Equities believes the buyback is a positive surprise.The conglomerate s decision indicates its confidence in the future growth and the perception that its stock is undervalued pointed out Sonam Srivastava Founder and Fund Manager at Wright Research. This may buoy the stock price in the shortterm but in the longterm its performance will be dictated by its capital allocation policy. If the company is able to deploy capital to drive higher growth and better quality of earnings the stock will see good compounded growth  she said.As on June 30 2023 L T s cashonbooks stood at around Rs 4000045000 crore on a consolidated basis.Brokerage commentaryThe buyback has largely been factored in the stock price. What would now carry the stock higher or make it ripe for rerating is the divestment of noncore assets such as the Hyderabad Metro or Nabha Power.Kotak Institutional Equities is of the view that L T s stock is expensive given its 28 times and 23 times its one and twoyear forward earnings.However Prabhudas Lilladher is optimistic about the engineering major s prospects. It believes L T is wellplaced to benefit in the long term due to several factors including strong tender opportunities improved domestic order conversion a notable increase in hydrocarbon and renewable energy orders from international markets like Saudi Arabia and an anticipated rise in private investment in the domestic market.The EPC major registered an order inflow of Rs 65500 crore up 57 percent yearonyear (YoY) in Q1 FY24 taking the order book as of Juneend 2023 to an alltime high of Rs 4.1 trillion which is around 2.3 times its FY2223 revenue. The domestic market accounts for 71 percent of this the rest being international business.Management commentaryThe management has maintained sales growth guidance of 1215 percent and an order inflow growth target of 1012 percent.Raman had said during the conference call that L T is likely to meet the higher end of its revenue and order inflow guidance for 202324 and may consider revising its guidance for both revenue and operating margin after the OctoberDecember 2023 quarter.He said that L T s order inflow is likely to taper towards the second half of 202324 due to the upcoming general election in India between April and May 2024. We will have to be wary of a slowdown in order inflow due to the upcoming general election and plans of the subsequent government that may take over  Raman said.        ",
    "HDFC Securities  research report on Larsen and ToubroLarsen   Toubro (LT) reported yet another strong quarter beating our estimates on all fronts led by robust execution owing to a strong opening order book. EBITDA margin came in at 10.2  (87 155bps YoY QoQ  vs. our estimate of 11.3 ) impacted by the Covidera legacy projects nearing completion (Q3FY24 should complete) partly offset by lower employee expenses and better overhead absorption. The Hyderabad metro saw ridership improving to 422k per day from 408k per day in Q4FY23. The consolidated net D E stood at 0.58x as of Jun 23 vs. 0.62x as of Mar 23. The Q1FY24 NWC to TTM sales ratio (exoff financial services business) stands at 17 . Given  (1) the recordhigh order book (OB) of INR 4.1tn  (2) bottoming out of infra margins  (3) improvement in subsidiary performance  and (4) higher public capex towards a green economy we continue with our standalone P E multiple of 24x.OutlookWe maintain a BUY on the stock with an increased TP of INR 3002 sh (Jun25 EPS rolled over).For all recommendations report click here",
    "Sharekhan s research report on Larsen and ToubroQ1FY24 revenue and net profit recorded stellar growth of 33.6  46.5  yoy beating the street s estimates by a wide margin while OPM missed estimates as infrastructure biz margin fell yoy. Order inflow for Q1FY24 was robust at Rs. 65520 crore (up 57  yoy). Order book continues to grow at a swift pace and stands at an alltime high of  Rs 4.1 lakh crore (2.1xTTM revenue). L T maintained 1215  revenue and 1012  order intake growth guidance for FY24. Core business OPM is expected to be at  9  (up 40 50bps yoy). Working capital sales to be at 1618 . Special dividend of Rs. 6 per share and share buyback at Rs. 3000 per share comprising  2.4  of total equity is sentimentally positive.OutlookWe maintain a Buy on L T with a revised PT of Rs. 3005 factoring in strong execution margin tailwinds in the near to medium term and upward revision in valuation of its subsidiaries.For all recommendations report click here",
    "LKP Research s research report on Larsen and ToubroLarsen   Toubro Limited (L T) reported a good quarter better than estimates led by strong execution and better ordering activity providing healthy execution visibility ahead. L T (consolidated) reported a healthy 34  23  36  YoY growth in revenues EBITDA PAT. Ordering inflows surged 57  YoY driven by driven by Rail Renewables Rural Water Supply Power T D Building   Factories and Onshore   Offshore verticals of the Hydrocarbon business. Strong ordering led to the ordering backlog at  4.1tn growing 14  YoY translating into 3.1x TTM sales strengthening the prospects of L T reaching the upper end of the 1215 . Domestic order book accounts for 71  of this total while international constitutes 29  from Middle East (87 ) and Africa (5 ) with the remainder coming from various countries in the SEA. Tendering pipeline too remains strong at  10.1tn for 9MFY23 is higher than the endFY2023 number of  9.7tn primarily boosted by a sharp increase in Hydrocarbon order prospects. NWC intensity stood at 17  in Q1FY24 up by 360bps YoY continues to improve on better collections. TTM RoE stood at 12.8  up 60bps vs Mar 23 and RoE is trending well toward L T s 18  targeted levels by FY2026. Improving ridership in the Hyderabad metro and growing support from the state government enhancing the case for monetization of the asset. Going forward management has maintained its guidance for revenue growth of 1215  for FY24 with order inflows growth at 1012 . For Core E C business L T has maintained its guidance guided for EBITDA margin of  9 . NWC sales will remain in the band of 1618  backed by increase in GCC orders timely payment and certification.OutlookGiven record OB with strong order pipeline revival in private capex healthy outlook ahead. We have tweaked FY24 to factor strong order inflow while FY25 estimates are largely unchanged. We maintain  BUY  with a SOTP based TP of  2945.For all recommendations report click here",
    "Prabhudas Lilladher s research report on Larsen and ToubroLarsen   Toubro (LT) reported healthy set of quarterly performance with consolidated revenue growth of  34  YoY while margins contracted 86bps YoY due to business mix and legacy project reaching completion. Margins are likely to improve from H2FY24 with legacy orders likely to be completed by Q2 Q3FY24 and new projects reaching margin recognition threshold. NWC to sales improved to 17  in Q1FY24 vs 20.6  in Q1FY23 owing to strong cash collections with FY24 guidance maintained at 1618 . Tender prospects from infrastructure stands at Rs5.85trn HydrocarbonRs3.47trn PowerRs0.45trn and HiTechRs0.29trn. Management is confident to achieve its ROE target of 18   by FY26 driven by strong business outlook prudent balance sheet management and returning surplus cash to shareholders (announced Rs100bn buyback   special dividend). We believe L T is wellplaced to benefit in long run with 1) strong tender prospects 2) better order conversion in domestic market 3) significant traction in hydrocarbon and 4) renewable energy orders from international markets like Saudi Arabia and expected uptick in private capex in domestic market. The stock is currently trading at PE of 29.1x 24.4x FY24 25E.OutlookMaintain  BUY  rating with revised SoTP of Rs2955 (Rs2615 earlier) valuing core business at PE of 22x FY25E (21x earlier) given strong revenue visibility prudent NWC management and improving Hyderabad Metro operational performance.For all recommendations report click here",
    "Infrastructure company and market leader Larsen   Toubro is expected to report a strong yearonyear (YoY) performance in the quarter ended June led by a healthy order book and execution.L T s consolidated revenue for the June quarter is expected to rise 14 percent YoY to Rs 40813 crore. Meanwhile its net profit is likely to grow 24 percent on year to Rs 2110 crore as per an average of four brokerage firms by  .Broking house Sharekhan has the most optimistic revenue and net profit expectation of Rs 42257 crore and Rs 2188 crore respectively for L T during the June quarter. The net profit and sales expectations by Kotak Institutional Securities at Rs 2012.6 crore and Rs 40273.6 crore respectively were the lowest among the estimates given by four brokerage firms.Revenue and profit growthImproved construction activity across projects during the quarter along with a healthy opening order book are seen driving revenue growth.Growth in IT energy projects hitech manufacturing and developmental projects is expected to drive consolidated revenue growth of 12.4 percent YoY according to Prabhudas Lilladher. Strong tender pipeline from domestic as well as exports market is likely to drive order inflows  it added.During the quarter L T announced that it had bagged orders in range of Rs 750017500 crore. The company s robust order inflow for the June quarter according to Kotak Institutional Equities is potentially because of the benefits of upfronting orders before the General elections in 2024.Margin expansionLower commodity prices along with execution of highmargin orders could improve the operating margin slightly on a YoY basis.Analysts expect the operating margin to come in at 11.3 percent in the June quarter implying a 29 bps expansion on a YoY basis and a contraction of 38 basis points on a QoQ basis.Key monitorablesL T recently announced its firstever share buyback. Details of the buyback along with the special dividend will be disclosed by the company today while announcing the results. Market participants are keenly awaiting these details.Management commentary on the status of noncore assets such as Nabha power metro ridership and financial assistance will be other key monitorables said Prabhudas Lilladher.",
    "Shares of Larsen   Toubro (L T) gained nearly 1 percent on July 24 hitting a lifetime high at Rs 2607 after the company recently announced its first share buyback in its history. L T will discuss a proposal for equity share buyback and a special dividend on equity shares for the financial year 202324 during its board meeting on July 25 today. Buyback of equity shares of the Company in accordance with the provisions of the Companies Act 2013 and SEBI (Buyback of Securities) Regulations 2018. Special Dividend on equity shares for the financial year 202324. If approved the record date for the purpose of determining the entitlement of the equity shareholders for the said dividend shall be Wednesday August 2 2023  the company said in a filing to exchanges.The total number of equity shares to be bought back by the company has not been disclosed. The outcome of this buyback will be communicated to the Stock Exchanges shortly after the conclusion of its Board meeting L T added.Catch up on all LIVE stock market updates hereIn August 2018 the company s board approved a buyback of up to 4.29 percent of its paidup equity capital amounting to around Rs 9000 crore. Unfortunately the proposal did not receive SEBI approval due to compliance issues while also citing concern about the increased debt on the company s books. This led to L T shelving its buyback plan.The new buyback proposal comes after the conglomerate turned debtfree last year.The company will announce its results on July 25.According to Kotak Institutional Equities the company is seen reporting a 12 percent YoY improvement in core Engineering Procurement and Construction revenues as it builds in the improved construction activity across projects during the quarter. The brokerage firm believes lower commodity prices will aid margins.Meanwhile Sharekhan sees L T posting a revenue growth of approximately 18 percent with a 21 bps expansion in operating margin and about 29 percent surge in net profit during the June quarter.",
    "Larsen and Toubro (L T) on Monday said it has bagged  large orders  in the water   effluent treatment segment in the domestic market.The work order has been received from the State Water   Sanitation Mission Uttar Pradesh to construct a water supply scheme for the Hanumanganj multigroup of villages in the districts of Ballia and Firozabad L T said in a statement.L T Construction an arm of the company has been awarded large contracts for its water   effluent treatment business it said.The company did not disclose the order value. According to the company s project classification large orders are in the range of Rs 2500 crore to Rs 5000 crore.Homegrown L T is a USD 23billion company engaged in Engineering procurement and construction (EPC) projects hitech manufacturing and services and operated in over 50 countries worldwide.        ",
    "Shares of Larsen   Toubro (L T) climbed over a percent on June 19 after the EPC major reportedly won a significant order for a bullet train project.At 10 34am the L T stock was trading at Rs 2393.6 up 1.2 percent on the BSE.The National High Speed Rail Corporation on June 16 opened the financial bids for a major contract package of the MumbaiAhmedabad High Speed Bullet Train Project in New Delhi according to reports.Catch up on all LIVE stock market updates hereL T has emerged as the lowest bidder for the 135.45km section of the MumbaiAhmedabad High Speed Rail project between Shilphata and Zaroli in Maharashtra and three elevated bullet train stations at Thane Virar and Boisar the report said.L T is said to have placed the bid at Rs 15697 crore. According to Macquarie this bid value is one of the largest order wins.The company has received a major boost with MSCI upgrading its ESG rating to BB from B Macquarie added.",
    "Larsen and Toubro (L T) on Wednesday said it has bagged  significant  engineering procurement and construction (EPC) orders from the domestic market for its buildings and factories business.The buildings   factories (B F) business of its arm Larsen   Toubro (L T) Construction has won an order from a developer to construct residential towers in Thane Mumbai the infrastructure major said in a statement.The scope of the work includes construction of core and shell works for five towers comprising ground five podiums 54 floors and allied parking areas. The project is to be executed within stringent timelines the company said.The company did not disclose the deal value. According to its project classification significant orders range between Rs 1000 crore to Rs 2500 crore.Another order has been secured from a client to construct commercial office space in Bengaluru with an approximate builtup area of 16 lakhs sq. ft.The scope of work includes civil works for the composite structure warm shell finishes among others. The project is scheduled to be completed in 18 months the statement added.        ",
    "Prabhudas Lilladher s research report on Larsen and ToubroLarsen   Toubro (LT) reported decent set of quarterly performance with consolidated revenue growth of 10.4  YoY while margins contracted 74bps YoY due to cost pressure in certain EPC project. NWC to sales improved to 16.1  in FY23 vs 19.7  in FY22 owing to robust operational cash flows supported by smart execution and customer s advances. Project and Manufacturing (P M) margins came in at 8.6  in FY23 below guidance of 9  owing to impact of increase in commodity prices and freight issue. Margins are likely to improve from H2FY24 with new projects reaching margin recognition threshold. NWC to sales guided to be 1618  for FY24. Tender prospect from Infrastructure stands at Rs6.5trn Energy  Rs2.9trn and Hitech Rs0.25trn. We believe L T is wellplaced to benefit in long run with strong tender prospects better order conversion in domestic market significant traction in hydrocarbon segment from exports market and expected uptick in private capex. We revise our estimate by 0.6 1.0 for FY24 25 factoring in lower margins in P M business in short term.OutlookThe stock is currently trading at PE of 26.7 22.7 FY24 25E. Maintain BUY rating with revised SoTP of Rs2615 (Rs2479 earlier) valuing core business at PE of 21x FY25E (20x earlier) given sustainable growth visibility in revenue and order inflow front.For all recommendations report click here",
    "Sharekhan s research report on Larsen and ToubroQ4FY2023 numbers slightly lagged estimates as revenue OPM PAT came lower by  3   30 bps  6 . Working capital  sales improved considerably to 16.1 . Order inflow for Q4FY23 was up by 3  19  yoy to Rs. 76072 crore Rs. 230528 crore respectively. Annual order inflow beat guidance of a 1215  growth. Order book is at an alltime high at  Rs 3.99 lakh crore (2.2xFY23 revenue). L T targets 1215  revenue and 1012  order intake growth in FY24. OPM for the core business to be at  9  (up 40 50bps yoy). Working capital sales to be at 1618 . Management expects order inflow  execution momentum to continue. Margins may remain under stress in H1FY24 after which a gradual expansion is possible.OutlookWe maintain a Buy on L T with a revised PT of Rs. 2700 factoring in an optimistic outlook and revision in valuation of its subsidiaries.For all recommendations report click here",
    "HDFC Securities  research report on Larsen and ToubroLarsen   Toubro (LT) reported Q4FY23 revenue EBITDA APAT at INR 583.4 68.3 39.9bn in line (missing) with our estimates by 0.1 (8.4) (7.5)  respectively. EBITDA margin  11.7  (65  78bps YoY QoQ) vs. our estimate of 12.8 . The margin was impacted largely by higher input prices in projects and manufacturing portfolio. The Hyderabad metro saw ridership improving to 408k per day from 394k per day in Q3FY23. The consolidated net D E stood at 0.81x as of Mar 23 similar to the Dec 22 level. The FY23 NWC to sales ratio (exoff financial services business) was at a fiveyear low level of 16.1 . Given  (1) the recordhigh order book (OB) of INR 4tn and order inflows (OI) of INR 2.3tn  (2) bottoming out of infra margins  (3) improvement in subsidiary performance  (4) improvement in net working capital levels  and (5) pickup in private and public capex in coming years we have increased the standalone multiple to 24x from 23x.OutlookWe maintain a BUY on the stock with an increased TP of INR 2724 sh (24x core Mar25 EPS).For all recommendations report click here",
    "The engineering procurement and construction (EPC) major Larsen   Toubro (L T) is seen reporting lukewarm numbers on a yearonyear (YoY) basis but the sequential performance could enthuse the Street indicates a poll of brokerages conducted by  .As per the poll the company s consolidated revenue for the March quarter is expected to come in at Rs 58839.13 crore a growth of 11.3 percent YoY and 26.8 percent quarteronquarter (QoQ). Some analysts highlighted that a pickup in execution could drive revenue growth. Net profit is likely to rise 1.6 percent YoY and 63.8 percent QoQ to Rs 4182.10 crore. L T estimates for Q4Kotak Institutional Equities sees a 10 percent YoY improvement in core EPC revenues as it bakes in improved construction activity across projects in Q4 FY23. It believes the earnings before interest taxes depreciation and amortisation (EBITDA) margin of the company s core engineering and construction business will expand 40 basis points (bps) YoY to 10.4 percent driven by lower commodity prices.Overall the brokerage firm sees margin at 12.4 percent in the March quarter up from 10.9 percent in the previous quarter and 12.3 percent in Q4 FY22.Talking about sales Prabhudas Lilladher expects consolidated revenue growth of 11.6 percent YoY led by growth in IT energy projects hitech manufacturing and developmental projects.L T is wellplaced to benefit from overall diversified tender prospects with better order conversion in the domestic market significant traction in capital expenditure (capex) from oil exporting countries mainly the hydrocarbon segment and expected uptick in private capex the brokerage firm said. It expects L T to report a compounded annual growth rate (CAGR) of 12.2 percent and 19.8 percent in revenue and profit after tax respectively between FY22FY25.Order inflowAnalysts believe that order inflow for most capital goods companies is expected to be robust as those announced by companies like L T KEC International VA Tech Wabag ISGEC Heavy Engineering and BEL have been encouraging. Strong tender pipeline from domestic as well as exports markets is likely to drive order inflows  according to brokerage house Prabhudas Lilladher.Read more   Cheaper pizzas burgers  Zomato starves in trade as ONDC poses a threatDuring the quarter L T announced orders in the range of Rs 2100034000 crore.Kotak Institutional Equities has factored in inflows of Rs 63000 crore for Q4 FY23. Announced order inflows for the quarter so far are lower and mostly includes orders from hydrocarbon water B F metals and mining and transmission the brokerage firm said. Players like L T and KEC are expected to report strong doubledigit growth rates for FY23 inflows  ICICI Securities said.HDFC Securities is of the view that L T will witness improved order inflow and likely improvement in core margins owing to improved bid discipline commodities price correction and largesize order wins.Key monitorablesAs per analysts management outlook on order pipeline margin trajectory working capital and cash flow management would be key monitorables. Management commentary on status of noncore assets like Nabha Power Metro ridership and financial assistance will be key monitorables  Prabhudas Lilladher said.        "
]