[
    "",
    "Bajaj Finserv Health a wholly owned subsidiary of Bajaj Finserv is acquiring 100 percent stake in Vidal Healthcare Services Pvt Ltd a regulatory filing said on January 30.The acquisition has taken place at an enterprise value of Rs 325 crore and is expected to close in the fourth quarter of financial year 202324 a release stated.Upon completion of the acquisition Vidal Healthcare Services and its subsidiaries shall become wholly owned subsidiaries of Bajaj Finserv Health it added.After this transaction Vidal Health Insurance TPA Pvt Ltd and VH Medcare Pvt Ltd two wholly owned subsidiaries of Vidal Healthcare Services would in turn become indirect wholly owned subsidiaries of Bajaj Finserve Health.Further Bajaj Fiserv Health would indirectly acquire 21.3 percent equity stake in IntentHealth Technologies Pvt Ltd which is an associate of Vidal Healthcare Services the exchange filing added. Vidal Health brings deep domain knowledge and vast experience in healthcare administration in India. This combined with Bajaj Finserv Health s superior digital experience and data management prowess enables the company to be uniquely placed to lead healthcare transformation that is underway in India  said Devang Mody Chief Executive Officer Bajaj Finserv Health.Bajaj Finserv Health have an extensive network covering over 100000 doctors 5500 lab touch points and 2100 hospitals. The company is recognised as a partner in the Ayushman Bharat Digital Mission and a key player in facilitating healthcare transactions on the Unified Health Interface (UHI) network.The acquisition of VHC significantly expands Bajaj Finserv s capabilities in the healthcare space empowering it to service consumer needs for hospitalisation one of the largest healthcare spends categories the exchange filing further noted.Vidal Healthcare s wholly owned subsidiary Vidal Health Insurance TPA Pvt Ltd (VHITPA) services premium of over Rs 5000 crore covering 130 million lives.JM Financial Limited acted as the exclusive financial advisor for Bajaj Finserv Health while Ernst   Young conducted Financial and Tax Due Diligence and Chitale Legal were the legal advisors.PwC Corporate Finance acted as the exclusive financial advisor to Vidal Health.        ",
    "Bajaj Finserv Ltd on January 30 reported a 21.08 percent onyear rise in consolidated net profit at Rs 2157.67 crore for the third quarter of the current financial year.This was on back of strong growth in the arm Bajaj Finance Ltd. The company s consolidated total income rose 33 percent onyear to Rs 29038 crore .In the reporting quarter interest income of the company rose 33.5 percent onyear to Rs 13922.38 crore. The Premium and o1tier operating income from insurance business for the company in OctoberDecember quarter rose to Rs 12308.62 crore as compared to Rs 9102.50 crore in a year ago period.A day earlier Bajaj Finance which is part of Bajaj Finserv reported a consolidated net profit of Rs 3638.95 crore for the December quarter up 22.4 percent from the previous year.Bajaj Finance recorded highest ever quarterly increase in the customer franchise of 3.85 million and number of new loans booked of 9.86 million in Q3FY24.The wholly owned subsidiary of Bajaj Finance Bajaj Housing Finance Ltd recorded growth of 31 percent in profit after tax. Further Bajaj Finance consolidated assets under management crossed a milestone of Rs 3 lakh crore in Q3FY24.Bajaj Allianz General Insurance Company (BAGIC) recorded growth in gross written premium of 19 percent  excluding bulky tenderdriven crop and government health business growth was strong at 20 percent. It continuedto deliver an excellent combined ratio despite several natural catastrophes (NATCAT) in the quarter release said.Net earned premium of BAGIC increased by 13 percent to Rs 2358 crore for Q3FY24 as against Rs 2086 crore in Q3FY23.Bajaj Allianz Life Insurance Company (BALIC) recorded market beating growth of 24 percent in individual rated new business premium and growth of 20 percent in net new business value for the quarter. Further its assets under management crossed a milestone of Rs 1lakh crore in Q3FY24.Renewal premium for Q3FY24 stood at Rs 2903 crore as compared to Rs 2215 crore in Q3FY23  an increase of 31 percent.At 1.41 pm Bajaj Finserv was trading at Rs 1598.40 on the National Stock Exchange down 2.35 percent from the previous close.        ",
    "Mutual funds have become a good choice for investors seeking strategic avenues for financial growth. Among the many mutual fund investment platforms out there Bajaj Finserv mutual funds platform stands out providing not only a diverse range of mutual funds but also introducing innovative tools like the SIP calculator to empower investors in making informed decisions.Understanding mutual funds as a wealth creation toolWhy Mutual Funds Mutual funds with their inherent diversification and professional management have become synonymous with wealth creation. These investment vehicles pool money from various investors to collectively invest in a diversified portfolio of stocks bonds or other securities. This diversification minimises risk while providing an opportunity to participate in the potential growth of the market.The Bajaj Finserv mutual funds advantageBajaj Finserv mutual funds platform offers a comprehensive range of mutual funds (1000  mutual fund schemes) catering to diverse risk profiles and investment goals. Whether investors seek stability high growth potential or a balanced approach the Bajaj Finserv platform has something for everyone.What sets the Bajaj Finserv mutual funds platform apart is its extensive selection of funds. With 0  commission you can make investment decisions with confidence knowing that your returns are optimised without unnecessary fees. This unique advantage ensures that every rupee you invest works harder for you aligning with your wealth creation goals.Strategies of the best mutual funds investors1.  Disciplined approach through SIPs  Systematic investment plans (SIPs) represent a cornerstone of the strategies employed by successful mutual funds investors. Bajaj Finserv has an SIP calculator a tool designed to assist investors in planning their systematic investments. SIPs involve investing a fixed amount at regular intervals fostering a disciplined approach .2. Thorough research and due diligence  Successful mutual funds investors are diligent researchers. They conduct thorough analyses of fund performance historical data and market trends. Bajaj Finserv mutual funds platform provides clear information about a fund s performance NAV etc. This diligence enables them to make informed choices based on a deep understanding of the market and the specific characteristics of the funds they are considering.3. Portfolio diversification  Mitigating risk is a key strategy for successful mutual fund investors. They understand the importance of diversification and build wellrounded portfolios by investing across different asset classes sectors and market caps. Diversification spreads risk ensuring that the performance of one investment does not have a disproportionate impact on the entire portfolio.4.  Regular portfolio review and adjustment  Good mutual fund investors do not adopt a  set it and forget it  mentality. They regularly review their portfolios to ensure they remain aligned with their financial goals and risk tolerance. Based on market conditions and changing personal circumstances they make adjustments to their holdings ensuring that their investment strategy evolves with the dynamic nature of the market.Introduction to the SIP calculator  Empowering investorsWhy a SIP calculator Bajaj Finserv mutual funds platform introduces the SIP calculator as a gamechanger for investors. This innovative tool is designed to empower investors by providing a clear projection of their SIP returns. By inputting key variables such as the SIP amount tenure and expected rate of return investors gain valuable insights into the estimated future value of their systematic investments.How to use the SIP calculator Utilising the Bajaj Finserv SIP calculator is simple. Investors need to input    Their monthly SIP amount   The intended investment tenure   The expected rate of return.With the help of this information the calculator generates a projection showcasing the potential future value of the investments. This foresight enables investors to make informed decisions about their SIP contributions.Benefits of the SIP Calculator The Bajaj Finserv SIP calculator offers several advantages 1. Clarity and transparency  The calculator provides a transparent view of how SIP investments can grow fostering a deeper understanding of the power of systematic investing.2. Goal planning  Whether saving for shortterm or longterm goals the SIP calculator helps investors set objectives by illustrating the financial outcomes of their investment strategy.3. Portfolio customization  By adjusting variables like monthly SIP amount and tenure investors can tailor their investment strategy to align with specific financial goals and risk tolerance.4. Informed decisionmaking  Armed with projections investors can make wellinformed decisions about their SIP contributions ensuring their investment strategy is in harmony with their financial aspirations.ConclusionBajaj Finserv mutual funds platform not only aligns with these strategies but also introduces the SIP calculator as a tool to empower investors in their wealth creation journey. Whether you are a seasoned investor or new to the world of investment Bajaj Finserv provides a comprehensive platform to elevate your wealth creation endeavours.Explore the possibilities and join the league of  mutual funds investors with Bajaj Finserv.  Journalists are not involved in creation of this article.  ",
    "The Bajaj Finance stock gained over 3 percent on January 4 a day after the company shared business update for the December quarter in its assets under management (AUM) grew 35 percent onyear to Rs 3.11 lakh crore suggesting a strong festive period.This is the first time that the company s AUM has crossed the Rs 3lakhcrore mark.Bajaj Finance s deposit book also grew by 35 percent to Rs 58000 crore. During the quarter it booked 98.6 lakh new loans a YoY growth of 26 percent.At 9 17 am Bajaj Finance shares were trading 3 percent higher at Rs 7613.00 on the National Stock Exchange (NSE).Follow our market blog to catch all the live actionBajaj Finance s total franchise stood at 8.4 crore up 22 percent YoY. New customer acquisition remained healthy with the NBFC acquiring 38 lakh new customers against 31 lakh in the yearago period.Bajaj Finance s customer addition trend was largely in line with prior festive quarters  suggestive of the fact that the RBI ban on two of its products did not have any outsized impact  analysts at Motilal Oswal said.In November the Reserve Bank of India had asked Bajaj Finance to stop issuing new loans through its  eCOM  and  Insta EMI Card  for noncompliance with digital lending guidelines.The company successfully leveraged traditional channels (except digital ecommerce) for newer customer acquisitions it added. The brokerage has a buy rating on the stock.Bajaj Finance said in its regulatory filing that its liquidity position remains strong at Rs 11600 crore. In November the company raised Rs 8800 crore through a Qualified Institutional Placement (QIP) issue.Post the QIP it also completed its fundraising worth Rs 10000 crore which the board had approved in October. Earlier it raised Rs 1200 crore through a preferential issue of shares to promoter Bajaj Finserv.Also Read   Analyst Call Tracker  Banks infra dominate Dec  buy  lists  Bajaj Finance in top bets of 2023On January 3 shares of Bajaj Finance ended half a percent lower at Rs 7381.20 on the National Stock Exchange (NSE). In the past year the stock has risen around 12 percent underperforming benchmark Nifty gained 18 percent during the period.",
    "The Sensex and the Nifty are in a consolidation mode trading absolutely flat at noon on the first trading session of the calendar year. HDFC Bank the heaviest on the index broke its fourday gaining streak putting pressure on the benchmarks.At 12 05pm the Sensex was down 92.99 points or 0.13 percent at 72147 and the Nifty was down 10.50 points or 0.05 percent at 21720. About 2340 shares advanced 963 declined and 133 traded unchanged.At the time HDFC Bank was trading 0.5 percent lower quoting Rs 1700.05 on the NSE as one of the top negative contributors to the index.Follow our live blog for all the market actionSectoral trendsBroader markets fared better as the Nifty Midcap 100 and the Nifty Smallcap 100 traded 0.7 percent and 0.6 percent higher.Most sectors were in the green with Nifty PSU Bank up 1 percent Nifty Energy 0.4 percent and Nifty Metal 0.6 percent. Nifty Auto index ticked slightly higher as December auto sales numbers trickled in.Fundamental viewAs we enter the new year 2024 hopes run high that the market will continue to rally this year too extending its winning streak to the ninth year in a row.In a   Markets Poll nearly half of the 35 analysts and fund managers surveyed said they see the Nifty in the range of 23000 to 25000 by the end of 2024. That means a potential return in the range of 615 percent.However the start might be slow as the stellar run has induced some cautiousness among market participants who believe valuations are now stretched.Also read  F O Manual   Bulls bears fight it out near 21700 for Day 3 rangebound trade likely The returns in 2024 will depend on the tussle between fundamentals and sentiment. In an entirely  fundamental  market returns will likely be modest for the market and negative for many stocks  analysts at Kotak Institutional Equities said.Technical viewAccording to Mandar Bhojane of Choice Broking it is advisable for traders and investors to consider buying opportunities during dips in the Nifty while maintaining an appropriate stoploss.  Stay vigilant and make informed decisions in today s market  he said.A close below 21600 may send the market to 21500 analysts added while the resistance is at 21900.For the Bank Nifty the resistance is near the 48500 level with nearterm support maintained near 48000 zone.  The Bank Nifty is expected to have a daily range of 47900 48600 levels  domestic broking firm Prabhudas Lilladher said.Also read  2024 could be the year of alpha stock pickers than macro chasers says S KrishnakumarKey Nifty gainersAdani Enterprises Adani Ports Coal India UPL Tata MotorsKey Nifty losersEicher Motors Bharti Airtel M M HUL Bajaj AutoKey Sensex gainersTata Motors Nestle ITC Tech Mahindra Tata SteelKey Sensex losersBharti Airtel M M HUL Ultratech Cement Bajaj Finserv",
    "In the world of investments emotions often take the lead influencing decisions in unpredictable markets. Acknowledging this psychological factor Bajaj Finserv Asset Management Ltd. has recently launched the Bajaj Finserv Balanced Advantage Fund combining financial strategies with a deep understanding of investor behaviour. Launched on November 24 2023 this fund aims to transform investment decisions by addressing challenges posed by emotions like greed and fear. Here are a few reasons to consider the Bajaj Finserv Balanced Advantage Fund with a behavioural edge as the scheme reopens on December 18 2023.1. Dynamic asset allocation strategyAt the core of the Bajaj Finserv Balanced Advantage Fund is its dynamic asset allocation strategy. In simple terms this means the fund adjusts its investment mix based on changing market conditions. This adaptability seeks to optimise returns and effectively manage risk. Investors can benefit from a portfolio that remains resilient across various market phases providing relative stability amid financial uncertainties.2. Navigating market volatilityMarket volatility often leads to impulsive decisions that may deviate from longterm financial goals. The Bajaj Finserv Balanced Advantage Fund acts as a stabilizing force in volatile markets. By capitalizing on investor sentiment the fund guides decisions during periods of feardriven selling or excessive greedinduced buying. This approach empowers investors to make informed decisions mitigating the impact of market ups and downs.3. Longterm diversified investment perspectiveThis fund promotes a longterm diversified investment perspective aligning with the patience of investors. Recognizing the uncertainties in shortterm market movements it focuses on sustained growth over an extended period. Diversifying investments across different asset classes the fund aims to build a robust portfolio capable of withstanding market fluctuations offering investors a strategic advantage for longterm wealth creation.4. Readily adapts to changes in trends and cyclesUnlike merely following trends the Bajaj Finserv Balanced Advantage Fund adapts to them. In a world where financial trends and cycles shift rapidly the fund s ability to adjust its strategy ensures its relevance. Whether in a bullish or bearish market the fund stays dynamic actively seeking opportunities aligned with prevailing market conditions. This adaptability is paramount in an everchanging financial landscape.5. Adjusting allocation basis market shiftsRecognizing the dynamism of markets the Bajaj Finserv Balanced Advantage Fund adjusts its allocation based on these market movements. If there s a shift in market dynamics the fund s model recommends changes in allocation. This proactive approach ensures the fund remains wellpositioned to capitalize on emerging opportunities while minimizing exposure to potential risks.In conclusion the Bajaj Finserv Balanced Advantage Fund can help investors manage the complexities of the financial world. Its unique blend of a dynamic asset allocation strategy focus on longterm perspectives and adaptability to changing trends makes it a suitable choice for those seeking a balanced and resilient investment option. As the scheme reopens on December 18 2023 investors have an opportunity to leverage the fund s behavioral edge aligning their investments with a strategy designed to weather the storms and capture the opportunities in the everevolving investment landscape.Who should consider this scheme This innovative scheme is suitable for investors who          Desire dynamic asset allocation in their portfolio.          Seek diversification to manage risk effectively.          Prefer professional fund management to navigate market complexities.          Aspire for potential capital appreciation over the long term while mitigating downside risk.          Have a longterm investment horizon and value the benefits of sustained growth over time.In conclusion the Bajaj Finserv Balanced Advantage Fund goes beyond traditional investment approaches by incorporating behavioral insights and financial strategies. To learn more about the scheme and invest in it you can visit the official website of Bajaj Finserv AMC. Act now  invest in Bajaj Finserv Balanced Advantage Fund  scheme reopens on 18th December 2023.Mutual Fund Investments are subject to market risks read all scheme related documents carefully.This document should not be treated as endorsement of the views   opinions or as an investment advice. This document should not be construed as a research report or a recommendation to buy or sell any security. This document is for information purpose only and should not be construed as a promise on minimum returns or safeguard of capital. This document alone is not sufficient and should not be used for the development or implementation of an investment strategy. The recipient should note and understand that the information provided above may not contain all the material aspects relevant for making an investment decision. Investors are advised to consult their own investment advisor before making any investment decision in light of their risk appetite investment goals and horizon. This information is subject to change without any prior notice. MC EDITORIAL HAS NOT WRITTEN THIS ARTICLE         ",
    "We often tend to delay our larger expenses until a time when we have surplus funds to address them. Take for instance a home renovation project or that postgraduation course that you ve been eyeing for a while. Both these usually demand a huge expense and we typically push these for a later time. But what if you could make these expenses and split the costs into manageable EMIs Personal loans could be very useful in these circumstances. These loans can be utilised for a variety of objectives such as paying for unexpected medical expenditures organising an extravagant wedding upgrading your home and more. There are various NBFCs and banks that provide lowinterest personal loans with minimal documentation requirements. Bajaj Finance Limited is one such NBFC that provides personal loans with several attractive benefits.Follow these simple steps to avail of a Bajaj Finance Personal Loan          Visit the  Personal Loan  page on the Bajaj Finserv website.         Click on  APPLY  to open the online application form.         Enter your 10digit mobile number and the OTP sent to your phone.         Fill in the application form with your basic details such as your full name PAN date of birth and PIN code.         Now click on  PROCEED  to visit the loan selection page.         Enter the loan amount that you need. You can choose from the three personal loan variants   Term Loan Flexi Term and Flexi Hybrid.         Choose the repayment tenure   you can select a tenure option from 6 months to 96 months. Now click on  PROCEED .         Complete your KYC and submit your application.That s how easy it is to apply for a Bajaj Finance Personal Loan.Now that you know how to apply for a Bajaj Finance Personal Loan let s also look at the key benefits it offers          No requirement for collateralYou are not required to put up any asset as collateral for a Bajaj Finance Personal Loan. These loans are easier to obtain for individuals who lack collateral or are unwilling to offer their assets for this purpose. Furthermore because there is no need for asset verification or valuation the personal loan verification process is faster and more convenient.         Minimal documentationTo avail of a Bajaj Finance Personal Loan you don t need to submit lengthy paperwork. The eligibility criteria and documents needed are simple. All you need to submit are your KYC documents PAN Card employee ID and the latest three months  salary and bank statements.         Rapid disbursalPersonal loans are processed and issued faster than other types of loans. As a result it is a popular option for those in need of money urgently. Bajaj Finance Personal Loans are normally disbursed within 24 hours  of loan approval. This makes it the best alternative for dealing with unexpected or urgent expenses.         Substantial loan amountThe amount of the loan provided to borrowers is one of the key benefits of applying for a personal loan. Bajaj Finance Personal Loan allows you to pay for large expenses by providing a loan of up to Rs. 40 lakh. This provides you with the financial flexibility you require to cover the large expenses you have been delaying.         Convenient tenuresBajaj Finance Personal Loans have flexible payback terms making debt repayment simple for borrowers. Customers can choose a loan duration ranging from 6 to 96 months. This may be the best choice for those seeking greater freedom and flexibility in their repayment journey.A Bajaj Finance Personal Loan is a dependable and secure way to meet your large or small demands. You can also estimate your monthly payments in advance by using their EMI calculator to plan your loan finances wisely. It just requires basic inputs such as loan amount tenure and interest rate.Visit the Bajaj Finserv website and apply for a personal loan today.  Journalists are not involved in creation of this article.  ",
    "A Systematic Investment Plan (SIP) offers a clever approach to mutual fund investments. With SIPs investors can regularly commit a fixed sum of money be it on a monthly or quarterly basis. This method of investing in mutual funds is highly effective because it aids in spreading out the cost of investments over time and mitigates the impact of market fluctuations.Here are ten tips for maximising returns with SIP mutual funds         CommissionsThe expense ratio can vary from one mutual fund scheme to another.  A higher expense ratio means that a larger portion of your investment returns will be consumed by fees and expenses. Additionally brokers or mutual fund platforms may charge a commission reducing your overall investment.However platforms like the Bajaj Finserv Mutual Fund platform don t charge any commission meaning you get to keep more of your returns ultimately increasing your overall profits.In conclusion SIP is a great way to invest in mutual funds by following these ten tips you may can maximise your returns and may achieve your investment goals. Bajaj Finserv Mutual Funds and Bajaj Finserv SIP are great options for investors who want to invest in mutual funds. Use the SIP return calculator to calculate your expected returns and invest in a mutual fund that suits your needs on the Bajaj Finserv platform.",
    "Sharekhan s research report on Bajaj FinservBajaj Allianz Life Insurance reported strong growth in new business premium APE up 30  yoy at Rs. 1620 crore. Value of new business (VNB) grew by 25  yoy to Rs. 237 crore. VNB margins stood at 14.6  vs. 15.2  yoy. Bajaj General Insurance s gross written premium grew by 53  yoy. Net earned premium grew by 8  yoy. Claims ratio increased to 78  vs. 75.5  yoy. Combined ratio improved to 95.3  vs. 99.8  yoy led by better expense ratio despite higher claims. Underwriting profit stood at Rs. 37 crore in Q2FY2024 vs. Rs. 18 crore loss in Q2FY2023. On the lending business side Bajaj Finance reported earnings growth of 28  yoy in Q2FY2024 driven by strong operating profit growth and contained credit cost.OutlookWe maintain our Buy rating on the stock with a revised SOTPbased PT of Rs. 2040.For all recommendations report click here",
    "Bajaj Finance shares jumped 1.9 percent in trade as the financial services giant issued 15.5 lakh warrants to promoter Bajaj Finserv for a total consideration of Rs 1188.85 crore.The board of the company issued the warrants at a price of Rs 7670 apiece. The warrants are convertible into equivalent equity shares with a face value of Rs 2 each. Compared to Bajaj Finance shares  closing price of Rs 7670 on November 1 the warrants are issued at a premium of 2.65 percent.As of 12.20 pm shares of Bajaj Finance were trading at Rs 7489.10 per share on the NSE higher by 0.23 percent from the closing price of the previous session. On the other hand Bajaj Finserv stock was lower by 0.31 percent at Rs 1568.05.Shareholding stock price movementCompared to the frontline index Nifty 50 that has risen 5.22 percent Bajaj Finance shares have risen around 20 percent over the past six months. The company has a marketcapitalisation of Rs 4.5 lakh crore.Follow live blog for all the market actionPromoter shareholding stayed the same in the most recent quarter at 55.87 percent. FIIs have increased holdings from 16.68 percent in the June quarter to 17.01 percent in the quarter ended September. DIIs held 16.5 percent in the company of which 9.1 percent are mutual funds. The number of mutual fund schemes were unchanged at 40. The public held 10.5 percent in the company.",
    "Net Sales at Rs 26022.66 crore in September 2023 up 25.09  from Rs. 20803.22 crore in September 2022.Quarterly Net Profit at Rs. 1928.96 crore in September 2023 up 23.9  from Rs. 1556.93 crore in September 2022.EBITDA stands at Rs. 9949.85 crore in September 2023 up 34.68  from Rs. 7387.73 crore in September 2022.Bajaj Finserv EPS has increased to Rs. 12.10 in September 2023 from Rs. 9.80 in September 2022.Bajaj Finserv shares closed at 1572.85 on November 01 2023 (NSE) and has given 16.59  returns over the last 6 months and 7.97  over the last 12 months.",
    "Net Sales at Rs 1011.05 crore in September 2023 up 50.6  from Rs. 671.33 crore in September 2022.Quarterly Net Profit at Rs. 754.34 crore in September 2023 up 55.51  from Rs. 485.08 crore in September 2022.EBITDA stands at Rs. 967.47 crore in September 2023 up 50.39  from Rs. 643.32 crore in September 2022.Bajaj Finserv EPS has increased to Rs. 4.70 in September 2023 from Rs. 3.00 in September 2022.Bajaj Finserv shares closed at 1561.10 on October 30 2023 (NSE) and has given 15.72  returns over the last 6 months and 7.49  over the last 12 months.",
    "Bajaj Finserv on October 27 reported a 24 percent rise in its net profit to Rs 1929 crore. In a year ago period the net profit of the company stood at Rs 1557 crore.In the reporting quarter consolidated total income of the company rose 25 percent onyear to Rs 26023 crore from Rs 20803 crore in a year ago period.Bajaj Finserv recorded quarterly increase in the customer franchise of 3.58 million and number of new loans booked of 8.53 million in 02 FY24.On the subsidiary front Bajaj Finance s profit after tax rose 28 percent onyear to Rs 3551 crore in the reporting quarter.Total income of Bajaj Finance for Q2FY24 increased by 34 percent onyear to Rs 13382 crore as compared to Rs 9974 crore in a similar period last year.Bajaj Finance s Assets Under Management (AUM) as on September 30 2023 stood at Rs 2.90 lakh crore as against Rs 2.18 lakh crore as on September 30 2022 an increase of 33 percent onyear.Gross nonperforming asset (NPA) ratio and Net NPA of Bajaj Finance as on September 30 2023 stood at 0.91 percent and 0.31 percent respectively as against 1.17 percent and 0.44 percent as on September 30 2022. Provisioning coverage ratio on stage 3 assets is 66 percent.Bajaj Allianz General Insurance CompanyBajaj Allianz General Insurance Company reported a 39 percent rise in its net profit to Rs 468 crore in JulySeptember quarter.Gross written premium for Q2FY24 increased by 53 percent to Rs 7298 crore as against Rs 4781 crore in Q2FY23.Net earned premium for Q2 FY24 stood at Rs 2250 crore as compared to Rs 2090 crore in Q2FY23.Assets Under Management (AUM) represented by cash and investments as on September 30 2023 stood at Rs 29511 crore as against Rs 26052 crore as on September 30 2022 an increase of 13 percentBajaj Allianz Life Insurance CompanyBajaj Allianz Life Insurance Company reported 21 percent onyear rise in its net profit to Rs 193 crore during the reporting quarter.New business premium for Q2FY24 increased by 26 percent at Rs 2821 crore as against Rs 2235 crore in Q2FY23.Renewal premium for Q2FY24 stood at Rs 2517 crore as compared to Rs 1920 crore in Q2FY23 an increase of 31 percent.Stock Market LIVE Updates  Nifty around 19050 Sensex gains 670 pts  Maruti Suzuki Q2 profit up 80.3  at Rs 3716.5 cr ",
    "Bears ruled the trade as the Nifty witnessed selling pressure throughout the day on October 18. The index found resistance at 19850 which led to a fall towards 19650.Going forward the index may witness a rangebound move until it breaks out in either direction. A fall below 19650 might give bears more strength and the Nifty might fall towards 19250. On the higher end a decisive move above 19850 might open the way towards 20200.The Bank Nifty index experienced a bearish phase encountering strong resistance at 44500 where the highest open interest is concentrated. The weak undertone in the market suggests a preference for selling on price rallies and a breach of the 43800 support level is expected to lead to further selling pressure.The index s position below the 20DMA reinforces the bearish sentiment in the near term.Here are two buy calls and one sell call for short term Ujjivan Small Finance Bank  Buy   LTP  Rs 57.15   StopLoss  Rs 54.8   Target  Rs 62   Return  8.5 percentUjjivan Small Finance Bank has experienced a rounding bottom pattern breakout on the 30minute chart indicating an increase in optimism. The stock found support around the 20SMA (Rs 55.24) before recovering towards higher levels.According to the current setup the stock might move towards Rs 62 in the near term. On the lower end support is positioned at Rs 54.80.Dr Reddy s Laboratories  Buy   LTP  Rs 5677   StopLoss  Rs 5580   Target  Rs 5900   Return  4 percentDr Reddy s Labs stock has broken out of a falling trendline with strong volume support confirming a bullish sentiment. The positive RSI (relative strength index) crossover suggests increasing upward momentum. The stock has support at Rs 5580 and potential upside targets are in the range of Rs 5800 to Rs 5900.Bajaj Finserv  Sell   LTP  Rs 1628   StopLoss  Rs 1680   Target  Rs 1500   Return  8 percentBajaj Finserv has fallen following a double top formation on the daily chart. Additionally the stock has formed a Bearish Engulfing pattern and the RSI is showing bearish divergence.Over the short term the stock might decline towards Rs 1500. The resistance is located at Rs 1680.",
    "Govind Parikh has an investment track record of more number of years than the average age of fund managers in India and perhaps double the age of the newgen traders in the derivatives segment.For the very first time in a formal media interaction he speaks exclusively to   s Santosh Nair about his journey investment thinking hits and misses.How did you get initiated into investing  After I completed my engineering course my uncle Naresh Khandwala put me in touch with KC Shroff the managing director of Excel Industries. I went to see Shroff armed with a project work for a plant making santalin dye from sandalwood the study having been done by a classmate. Two questions and Shroff caught my bluff. I said the project was for a 100 tonne per day plant. And he laughed saying  Son there is not enough sandalwood on earth to make a plant of this capacity.  He told my uncle that a better career for me would be trading and not a factory shop floor.Then I had a chance visit to KR Choksey s home   a veteran investor of those times. He ran me through some of numbers of Bajaj Auto from its annual report and explained why the company will do well. That was a turning point I got seriously interested in investing. Choksey become my mentor and guide. He took me with him on many company AGMs and plant visits.Take us through some of your early bets...Ramco Cements (then Madras Cements) and Lakshmi Machine Works were my early bets and they worked out quite well. There was a lot of 20 shares of Ramco which was on offer when the company s market cap was Rs 1.6 crore and the Rs 100 paid up share was available for Rs 60.The investment in LMW was accidental. I bought shares of its arm Lakshmi Electric Control and when I went to visit the plant to find out more about the company one of the senior executives there asked him to have a look at the LMW plant. The Rs 100paid up stock was available for Rs 180 at a market cap of around Rs 8 crore. Impressed by the size of the plant and the long waiting list of customers I decided to invest in the stock which would eventually go on to hit Rs 15000 (adjusted for bonus) over the next few years. But I sold way before the stock peaked because I was making a profit which seemed too good to be true Also Read  MC Exclusive   Won t argue over price  smallcaps microcaps is a 10year game  Mukul AgrawalYou are known to visit factories and managements before investing. Tell us about some big winners you were able to spot because of this approach I once had a chance to impress my mentor KR Choksey  I arranged a meeting for him with the usually reclusive MRF management in the 80s. The stock was quoting around Rs 40 and the company was expanding its capacity. After we stepped out from the meeting Choksey clasped my hands and shook it hard.  Very good very good  he said.I did not understand the cause of his excitement but he had worked out that MRF s profits were set to more than double once the new plant was commissioned in 18 months because turnover would double and the margins were much better. And since there was no equity dilution the EPS (earnings per share) would reflect the profits soon. I myself bought 500 shares at Rs 40 but as usual cashed out quickly.Were managements always welcoming with information about how their companies were faring Well there were occasions when plant visits disappointed though at times in an amusing way. Once I travelled to interior Andhra Pradesh to meet up with the management of a tyre retreading company. I endured a bumpy ride in an Ambassador car on the last leg of the journey to reach the plant. I had gone prepared with a long list of questions written on a paper and was expecting to be taken on a tour of the plant by the managing director. That did not happen.When I started asking the questions from the paper the MD took it from me read the questions and handed it back.  All this is not required. The company is doing well. Let s have lunch  he said. I was presumptuous in thinking that the company would take a small shareholder like me seriously Jokes apart management quality is a critical tick box in the list of attributes I look for in a company. You will get value if you look hard enough and the companies may make profits as well but capital allocation is where most managements trip up sometimes the promoter will buy an aircraft or some such using shareholder funds. For us it matters how well the promoters treat minority shareholders. Because that is often an indicator how the capital allocation decisions are likely to be.Most people understand how to buy but when to sell is always a challenge We buy shares to hold but also keep reviewing our positions. There would just be a handful of shares that we have not sold at all 3M is one of them. We definitely sell to book profits but not all of it at the same time. As long as we see growth we keep some shares.Two changes I made to my approach after the market crash of 2008 was one always keep a part of your portfolio in cash and two don t wait till the prices fall all the way. We are OK as long as a stock falls up to 20 percent not more. Our first aim is to protect capital. While identifying a stock we think in terms of how much money we could possibly lose and then decide if the upside is worth the risk.For example we picked up Tata Motors around Rs 80 when the stock was in a free fall during the COVID meltdown in March 2020. I was not sure how much money I would make when things improved but I was certain that I had little to lose at that price.Also Read  Noisy promoters information overload make spotting mid small cap winners tough  Jatin KhemaniYou invest in holding companies something most investors are averse to We look for holding companies where either there is a sharp discount to the NAV (net asset value of the companies held by it) or where the underlying companies have strong growth potential. In the first case just the narrowing of the discount even if the underlying companies  value remains the same is good enough to earn a handsome profit.We doubled our investments in Maharashtra Scooters when the discount to the value of its holdings in Bajaj Auto and Bajaj Finserv reduced from 84 percent to 68 percent.Besides there are times when the strong performance of the underlying like in the case of Bajaj Holdings which held shares of Bajaj Finserv and Bajaj Finance resulted in much heftier profits.Why not buy the underlying companies directly then  We do buy the underlying companies directly but we also buy the holding company because the margin of safety is much higher. And we have made huge profits from our investments in holding companies over the years.Do you invest in cyclical stocks  Yes we do. We buy them when they are very very cheap and sell them when they are less cheap. We don t wait for the fair value to be realised or for them to be overvalued. Because in a bull market you will hear crazy price targets for the same stocks that nobody was willing to touch at onetenth the price. We should not forget that these are cyclical stocks and after two years again the cycle will again turn for the worse.But how do you know when stocks are extremely cheap For steel you should look at what is happening in China in other global markets look at the input prices. They will give you an idea. We buy metal companies only when there is a general feeling in the market that the world is coming to an end.Tell us about your selling strategyLet me give you a little background. Sometime in the early 80s I had bought 500 shares of Kinetic Engineering at Rs 30. As soon as the price doubled my father started pushing me to sell the shares. His thinking was that 18 percent (per annum) gain was good enough and anything more than that was risky unsustainable and amounted to usury. Finally I gave in to his wish when the stock reached Rs 80 but on one condition. I would sell 400 shares but retain 100 shares since we had recovered our capital and made a good profit. He agreed.The stock eventually went on to hit Rs 720 (adjusted for bonus) in five years. Obviously you regret when the stock moves up a lot after you sell but it is not a bad idea to take profits home periodically.Usually when clients buy shares initially they have a selling target but as the price moves up they keep increasing the target. They become possessive about the stock and forget the prudent principles of selling. I keep reminding them about the uncertain nature of the market. Things can change overnight. You have nothing to lose by booking profits. Some clients say they are afraid of selling because they may not get a chance to buy the shares at lower levels. I tell them they don t have to buy the same stock there are plenty of other shares you can buy and make money on.Also Read  What makes Karma Cap s Rushabh Sheth bullish on pharma ports and media Have you ever sold a stock and then changed your mind on it Auto ancillary company Bosch was one such case. I was bullish on the stock for many years till 2015 and had accumulated a huge quantity. When the price hit Rs 20000 we started selling thinking it was overvalued selling our last quantity at the peak price of around Rs 27000 because a fund was buying aggressively at that point. To date that has been my only best sale where the price has still not come back to the level I sold at. We thought the company s earnings were unlikely to grow as fast as before as the world was now moving towards electric.We had intended to buy it at lower levels but when prices fell for some reason we stayed out. Finally after touching a low of 7500 when the stock started rising we began building a position again. Now we are bullish on the stock because there is better clarity on the company s business. The diesel fuel injection system engines will be around till 203132. And what we had not thought was that if investors could see the hit to the company s earnings because of the shift to electric vehicles the company would have seen it coming even earlier and planned accordingly. Today in electric vehicles Bosch has gone so much ahead of others.Do you regret selling stocks early While I do sometimes regret having sold shares early on the approach has worked well on the whole. Booking profits helps you create that powerful asset called bear market buying power. Having learnt a hard lesson in 2008 we had some cash on hand when the market nosedived at the peak of the COVID panic in March 2020. We expected the market to go down to 10000 and stabilise. But the market kept sliding. We were able to buy some quantity at an index level of 8000 when blue chips were available at unbelievable prices and we still had some ammo left.Your worst nightmare that came true When the global financial crisis hit (in 2008) my portfolio value shrank nearly 80 percent. It hurt but thankfully it was not borrowed money and so we were not pushed out of the market.Most importantly it did not affect our lifestyle since we were always conservative in our expenses. But the experience taught me the importance of keeping a part of the portfolio in cash.Also Read  SME IPOs  How they are rigged and why in September Take us through your misses...One big miss was the initial public offering of Infosys even though I had a chance of being allotted 500 shares. The late Manek Bhansali one of the founders of Enam had asked me to apply for 500 shares in the firm allotment portion. I happened to be with Vinod Sethi (former Morgan Stanley fund manager) when he got a call informing him that the Infosys issue had bombed. His reaction was   that s great.  I was yet to apply for the IPO but Sethi s reaction made me wary. I did not ask him the reason for that. I wish I had Some years later when I asked him the reason he told me that Infosys issue being undersubscribed was good news for investors who understood the value of the business as they would be allotted more shares.Another miss  the massive upside in TTK Prestige. I read too much into a friend s decision to sell the stock. That friend happened to be a midlevel executive in one of the TTK Group companies. I had identified the stock when it was going for Rs 20 and it had appreciated to Rs 200 over time. I thought that because my friend had sold he would be aware of something that the market did not know.I asked him the reason and he said he was not allowed to discuss matters relating to the group with outsiders but he wrote out a letter of introduction for me which I could show at the Bangalore plant and speak to the people there to get an idea of how the company was doing. I kept telling myself there had to be a reason why my friend sold the shares. And I was too lazy to take the trouble of going to Bangalore and find out for myself about the company. So I took the easy way out of selling my shares. It was to be a costly mistake. The stock would go on to hit Rs 9000 in some years. And the reason my friend had sold his shares was that he had been planning to go on a Europe tour and needed the money.What s your advice to new investors Never have a lifestyle that cannot be sustained when stock prices fall.Accept mistakes and try to correct them instead of saying you are right and the market is wrong.The primary goal should be to protect capital.It s difficult to make very large money through shortterm trading.Think long term.Read as much as possible and meet as many experts as possible  both investors and companies.        ",
    "Shares of Bajaj Finance extended their early gains and surged around 4 percent to hit a 52week high of Rs 8169.30 on October 6 as investors cheer for the company s Rs 10000crore mega fundraise plan.The country s biggest nonbanking finance company (NBFC) plans to raise up to Rs 8800 crore via Qualified Institutional Placement (QIP) and Rs 1200 crore through preferential allotment to promoter Bajaj Finserv.Buoyed by the news shares of promoter Bajaj Finserv also soared around 6 percent. Both the stocks were the top gainers on the Nifty 50.At 2.36 pm shares of Bajaj Finserv were trading at Rs 1635.20 up 6 percent on NSE while those of Bajaj Finance were up nearly 4 percent at Rs 8155.95.The sharp uptick in the counters were also backed by strong volumes that were significantly higher than their respective onemonth daily traded averages.Bajaj Finance QIP detailsAccording to Bajaj Finance s regulatory filings it will raise Rs 1200 crore through a preferential issue of up to 15.5 lakh warrants convertible into an equivalent number of equity shares within 18 months to Bajaj Finserv. If the option to convert warrants into shares is not exercised the warrants will lapse according to BSE filing.The issue price is yet to be determined. After the conversion of preferential warrants into equity shares Bajaj Finserv s share in the company will rise to 52.57 percent from 52.45 percent.Also Read   Bajaj Finance to raise Rs 10000 crore via QIP preferential issueBajaj Finance share price targetBajaj Finance shares closed marginally lower at Rs 7849.25 on October 5 ahead of the announcement. After the funding plan was confirmed Jefferies assigned a  buy  rating to Bajaj Finance with a target price of Rs 8830 a share. The fund raise slightly ahead of time was justified by company s strong asset growth of 33 percent in Q2FY24 the foreign brokerage firm said.Share performance technicalsBajaj Finance shares have outperformed the Nifty Financial Services as well as the benchmark Nifty in the past six months. The share has jumped around 32 percent during this period compared to a 6.5 percent rise in the Nifty Fin Services and an 11 percent gain for the Nifty.For the year the stock has rallied nearly 20 percent so far. Technicals show that the relative strength index (RSI) stands at 64.8 implying that the stock is trading neither in the overbought nor in the oversold territory.Also Read   Buzzing Stocks  Adani Wilmar Lupin Sun Pharma BHEL Som Distilleries   others in newsThe oneyear Beta of Bajaj Finance stands at 1.03 implying average volatility. The stock is trading above its 5 10 20 50 100 and 200day moving averages according to Trendlyne data. Its pricetoearnings (PE) ratio is 38.52 higher than the sector PE ratio of 24.48.",
    "Shares of Bajaj Finserv on October 4 opened 1.2 percent lower at Rs 1542.05 after subsidiary Bajaj Allianz General Insurance Company (BAGIC) received a show cause cum demand notice of Rs 1010 crore on October 3.Follow our market blog for more updatesAccording to a regulatory filing Bajaj Allianz General Insurance Company (BAGIC) an unlisted material subsidiary of Bajaj Finserv  received a show cause cum demand notice from the Directorate General of GST Intelligence Pune alleging a tax demand of Rs 1010 crore.This show causes cum demand notice pertains to nonpayment of GST on the coinsurance premium and reinsurance commission for the July 2017 to March 2022 period.Also read   Bajaj Finserv Q1 net profit up 48  on customer franchise growthIn September 2023 Bajaj Finserv subsidiary Bajaj Allianz reported strong numbers for August 2023.  The insurance company s gross direct premium underwritten for August was at Rs 1677.87 crore and the premium in the current financial year up to August was Rs 9228.81 crore. For August the total premium stood at Rs 926.41 crore and premium for FY2024 ( up to August 2023) was Rs 3828.06 crore."
]