[
    "Net Sales at Rs 11982.90 crore in March 2024 up 9.63  from Rs. 10930.67 crore in March 2023.Quarterly Net Profit at Rs. 2654.58 crore in March 2024 up 33.77  from Rs. 1984.47 crore in March 2023.EBITDA stands at Rs. 3641.09 crore in March 2024 up 14.67  from Rs. 3175.41 crore in March 2023.Sun Pharma EPS has increased to Rs. 11.10 in March 2024 from Rs. 8.30 in March 2023.Sun Pharma shares closed at 1540.95 on May 21 2024 (NSE) and has given 27.98  returns over the last 6 months and 64.38  over the last 12 months.",
    "Net Sales at Rs 5639.14 crore in March 2024 down 5.2  from Rs. 5948.22 crore in March 2023.Quarterly Net Profit at Rs. 867.60 crore in March 2024 up 184.99  from Rs. 1020.82 crore in March 2023.EBITDA stands at Rs. 2012.41 crore in March 2024 down 18.89  from Rs. 2480.95 crore in March 2023.Sun Pharma EPS has increased to Rs. 3.60 in March 2024 from Rs. 4.30 in March 2023.Sun Pharma shares closed at 1541.15 on May 21 2024 (BSE) and has given 27.97  returns over the last 6 months and 64.51  over the last 12 months.",
    "Sun Pharmaceutical Industries is expected to post a 22 percent increase in earnings in the JanuaryMarch quarter driven by strong sales of its specialty drugs contribution from blockbuster generic cancer drug Revlimid and resilient growth in the domestic market.Sun Pharma s Q4 net profit is likely to climb to Rs 2412.60 crore from Rs 1984.50 crore in the year ago period according to a poll of eight brokerages collated by  . The company is slated to report its Q4 results on May 22.Revenue is likely to grow almost 12 percent to Rs 12241.25 crore from Rs 10930.60 crore a year earlier according to the poll.Sharekhan had the most bullish earnings target for Sun Pharma while Kotak Institutional Equities pegged the least growth.Strong speciality and US sales Sun Pharma s highmargin lowcompetition speciality segment will continue to drive growth in Q4. Brokerage SMIFS attributed the growth in Sun Pharma s speciality segment to a rampup in prescription volumes for dermatology drugs Ilumya Winlevi and Odomzo.ICICI Securities expects Sun Pharma s speciality portfolio sales at  284 million in Q4 driven by Ilumya and Winlevi. Sun Pharma is increasing its contribution towards speciality drugs where it faces lesser competition and can command premium prices  Sharekhan said in its report.In addition blockbuster cancer drug Revlimid will remain a significant contributor to Sun Pharma s US sales. JM Financial pegged a  30 million contribution from Revlimid in Q4.The resumption of supplies from the drugmaker s Mohali plant which was caught in regulatory snags will aid Sun Pharma s US sales.Steady domestic growthAside from its US sales Sun Pharma is expected to deliver midteen growth in its India revenue. Nomura expects the company s growth in the domestic formulation segment to remain ahead of the broader market.Most brokerages anticipate a 1115 percent onyear rise in Sun Pharma s sales from the India formulation segment.However the company s EBITDA margin may moderate slightly on account of weak seasonality in the speciality segment and higher research and development spending.Kotak Institutional Equities anticipates Sun Pharma s R D spending to come in at about 7 percent of revenue in Q4 up 30 basis points from the previous quarter.",
    "Drug makers Dr Reddy s Laboratories Sun Pharma and Aurobindo Pharma are recalling products in the US market due to manufacturing issues as per the latest Enforcement Report of the US Food and Drug Administration (USFDA).Dr Reddy s Laboratories Inc based in Princeton New Jersey is recalling Javygtor (sapropterin dihydrochloride) Powder for Oral Solution (100mg) due to it being a  Subpotent Drug  as stated by the USFDA. The company is also recalling another lot of sapropterin dihydrochloride for the same reason it added. The USFDA said the drug maker initiated the Class I recall in the US on April 8 this year.The USFDA said Sun Pharma is recalling 11016 vials of Amphotericin B Liposome for Injection used to treat fungal infections in the US market. The company s USbased arm initiated the Class II recall on April 19 this year due to  Out of specification for assay  the USFDA stated.Similarly Aurobindo Pharma is recalling 13605 bottles of Clorazepate Dipotassium Tablets (3.75 mg and 7.5 mg) used to treat anxiety in the American market. The company s USbased arm is recalling the affected lot due to  Discoloration  Dotted and yellow spots on tablets  USFDA stated. The company initiated the Class II recall on April 24 this year.The USFDA stated that another drug firm FDC Ltd is recalling 382104 units of Timolol Maleate Ophthalmic Solution used to treat glaucoma in the American market due to  Defective Container .As per the USFDA a Class II recall is initiated in a situation in which use of or exposure to a violative product may cause temporary or medically reversible adverse health consequences or where the probability of serious adverse health consequences is remote. The US generic drug market estimated to be around USD 115.2 billion in 2019 is the largest market for pharmaceutical products.        ",
    "Motilal Oswal s research report on Sun PharmaIn this note we explored the specialty pipeline of SUNP examining products under development the commercialized portfolio and the competitive dynamics within each segment. The overall R D expenditure is expected to increase by 33  YoY in FY24 and maintain an 18  CAGR over FY2426 to support clinical development of certain assets. Despite some delays in the clinical trial processes of Ilumya (additional indication) MMII and GL0034 the innovative discovery pipeline continues to be the most promising within the India listed space.OutlookWe expect 19  earnings CAGR over FY2426 led by 20  12  12  sales CAGR in Specialty EMROW DF segment. We expect margin expansion by 210bps over FY2426 on the back of improved operating leverage. We value SUNP at 30x 12M forward earnings to arrive at a price target of INR 1870. We reiterate our BUY rating on the stock.For all recommendations report click here",
    "The US Food and Drug Administration (US FDA) has released a detailed report on six observations it reported following a recent inspection at Sun Pharmaceutical Industries plant in Dadra.The US drug regulator had classified the plant as Official Action Indicated (OAI) after the inspection that took place between December 4 to 15 last year.  We will work with the regulator to achieve fully compliant status  Sun Pharma had informed exchanges on the matter on April 11.An Official Action Indicated (OAI) is the most stringent regulatory designation as defined by the US FDA. It signifies that regulatory and or administrative measures are likely to be recommended for the facility. This classification indicates that the regulatory body has issued observations to the plant and found the company s response to be unsatisfactory or insufficient. Facilities marked with OAIs typically undergo reinspection by USFDA officials to ensure compliance before being cleared of any regulatory concerns.Specific observations in the Dadra plant include the following 1. Out of Specification (OOS) investigations are not thoroughly carried out to determine the root cause(s) for longterm stability samples failures for the drug products sold into the US market.2. Equipment and utensils are not cleaned and maintained at appropriate intervals to prevent contamination that would alter the safety identity strength quality or purity of the drug product.3. There is a lack of Quality Unit oversight on the issuance handling retrieval and reconciliation of GMP (Good Manufacturing Practices) documents that are used in the manufacturing of drug products at the site.4. Procedures describing the handling of written and oral complaints related to diug products are deficiently written or followed.5. The firm failed to submit a Field Alert for Product Quality Complaints6. Reserve samples from representative sample lots or batches of drug products selected by acceptable statistical procedures are not examined visually at least once a year for evidence of deterioration.The recent OAI classification for Sun Pharma s Dadra unit comes on the heels of regulatory challenges faced by its Halol and Mohali facilities leading to a downturn in the company s generic sales.Dadra s specialisation lies in the production of oral solid dosage forms and the manufacture of the blockbuster drug Revlimid a vital revenue driver for Sun Pharma s generics segment. Taking into account Revlimid s substantial contribution of  170 million Nomura projects Dadra s annual sales to the US market to hover around  240 million in FY24.        ",
    "Regulatory troubles continue for Sun Pharma as the drug manufacturer s Mumbai unit has been issued an  official action indicated  (OAI) tag by the US Food and Drug Administration which may affect new launches.Analysts at HSBC expect the FDA move to add to the regulatory overhang for the drugmaker while those at Nomura see it as a negative surprise.After a 4 percent fall in the previous session shares of Sun Pharma opened another 2 percent lower on April 15.The OAI classification for Sun s Dadra unit follows recent regulatory trouble for Halol and Mohali facilities in the recent past which had an impact on Sun Pharma s generic sales.In that backdrop Nomura said the recent development is likely to increase concerns among investors.HSBC also expects the drugmaker s US generic sales excluding cancer drug Revlimid to remain rangebound due to regulatory issues.Follow our market blog to catch all the live updatesNomura anticipates new product approvals from the site to be stalled until the compliance requirements are addressed and FDA clears the site. In our view it is likely that new approvals may not come through from the site over the next two years factoring in the time for remediation and subsequent reinspection by the USFDA  the brokerage said in a note.The existing sales from the plant however could sustain unless the remediation measures require temporary suspension of production Nomura said.The Dadra formulation site makes oral solid dosage forms. The site also manufactures blockbuster drug Revlimid which is a significant contributor to Sun Pharma s generic revenue. Including Revlimid contribution of  170 million Nomura estimates a contribution of around  240 million in annual sales from the Dadra site to the US market in FY24.In the wake of delays in new generic launches HSBC said specialty sales remain key for Sun Pharma s earnings growth offsetting challenges in US generics.The drugmaker s strong standing in the specialty segment however has HSBC bullish on growth prospects. The brokerage retained its  buy  call on the stock with a price target of Rs 1790. Nomura has a  neutral  call on Sun Pharma with a target price of Rs 1444.",
    "Nifty took investors on a wild ride this week as it climbed steadily throughout the week but surrendered most of its gains on April 12 due to concerns about rising US inflation delay in interest rate cuts and heightened geopolitical tensions. The coming week will be crucial for the market as fresh worries regarding the IsraelIran conflict emerge.Iran launched its first direct attack on Israel with explosive drones and missiles on April 13 raising a threat to security and peace in the Gulf region. Israeli Prime Minister Benjamin Netanyahu has said that Israel has been preparing for a direct attack by Iran.The event also garnered attention from leaders around the globe. Any significant escalation in tensions may incite panic selling and heighten volatility in global stock markets said analysts.Also Read   IsraelIran tensions  How should investors navigate the impact on financial market In the upcoming holidaytruncated week investors will be watching for developments in the Middle East. Here are some stocks that will remain in focus due to escalating tensions between Israel and Iran.1. Adani Ports  Adani Ports owns the Haifa port in northern Israel. It completed the purchase in January 2024 for about US  1.03 billion and operates the port with a local partner. Although the war has not yet impacted the port in any way a broader escalation in the conflict could make critical infrastructure within Israel such as this port a potential target.2. Sun Pharma  Sun Pharma s subsidiary Taro is an Israeli firm. If some of the staff is potentially called for active duty in the war it could impact production to an extent but it is unlikely to have a big impact on Sun Parma s overall consolidated financials.3. OMC stocks  If the IranIsrael conflict deepens it is expected to drive crude prices higher to potentially hitting  100 per barrel in the near future. This may directly hit the stock of Oil Market Companies (OMCs) such as Hindustan Petroleum Corporation (HPCL) Indian Oil Corporation (IOCL) and Bharat Petroleum Corporation (BPCL).These scrips may see increased volatility as higher crude prices not only put pressure on marketing margins but also lead to a rise in working capital requirements since OMCs import crude oil to meet the country s petroleum products demand. As crude prices rise they need to spend more on imports.4. Paint Stocks  Whenever crude oil prices go up the paint sector is hit hard as the main inputs in the manufacture of paints are crude oil derivatives. These companies have no control over these input prices.If tensions in the Middle East escalate pushing crude price to above  100 per barrel stocks of paint manufacturers like Akzo Nobel India Berger Paints Indigo Paints and Shalimar Paints may come under pressure as crude derivatives account for almost 40 percent of the input bill for these paint manufacturers. A rise in the price of crude can mean narrower profit margins.Also Read   IsraelIran escalating tension to trigger correction in equities  Check Nifty Bank Nifty levels to watch5. Tyre stocks  Since the tyre industry uses crude oil derivatives for manufacturing synthetic rubber several tyre stocks including MRF CEAT Apollo Tyres JK Tyres and Goodyear Tire   Rubber India will remain in focus as a rise in crude price will hit their margins.",
    "Sun Pharmaceutical Industries shares dropped 3.4 percent as the US FDA labelled its Dadra facility as  official action indicated  (OAI) indicating recommended regulatory or administrative actions.The stock was trading at Rs 1549.30 on the BSE down 3 percent from previous close.Following an inspection from December 4 to 15 2023 Sun Pharma disclosed the classification status in an exchange filing.Sun Pharma Ltd recently announced that the Australian Therapeutic Goods Administration (TGA) has approved Winlevi (clascoterone cream 1 percent) for treating acne Vulgaris in patients aged 12 and above. This approval grants Sun Pharma exclusive selling rights in Australia starting June 24 (Q1FY25). Sun Pharma holds rights to sell Winlevi in the US and Canada since FY22.Additionally the company has exclusive development and commercialisation rights for Winlevi in the US Japan Australia New Zealand Brazil Mexico and Russia from Cassiopeia SpA. Winlevi is a key product in Sun Pharma s portfolio alongside Ilumya Cequa Levulan Absorica Odomzo Bromsite Xelpros Yonsa and Sezaby contributing to the growth of its global specialty sales. We expect Sun Pharma s global specialty segment sales growth to get a boost from the recent additional marketing approval for Winlevi in Australia. We therefore increase Sun Pharma s sales and net income estimates to 10.9 percent and 16 percent CAGR from 10.6 percent and 15.3 percent CAGR . We also increased the valuation multiple by 10 percent to 32x on FY26 EPS. The company has been seeing steady growth in revenue and net income over the last few quarters on the back of strong growth witnessed in specialty revenue which now corresponds to 19.2 percent of overall sales as of Q3FY24 as against 16.5 percent it was in Q3FY23 and 16.4 percent it was in Q2FY24 and market outperforming growth in IPM  KR Choksey said in its latest note.Sharekhan predicts that Sun Pharma serving as a proxy for specialty sales in the US will continue to grow significantly despite a higher base. This growth is driven by investments in the R D pipeline with specialty R D accounting for around 40  of total R D spending. The partner product Nidlegy is expected to file for approval in Europe during H1CY24E enhancing Sun Pharma s offerings in skin cancers and complementing its Odomzo franchise in Europe. Additionally Sun Pharma and its subsidiary have entered a licensing agreement with Aclaris Therapeutics Inc granting exclusive rights to use Deuruxolitinib Sun Pharma s JAK inhibitor or other forms of Ruxolitinib for treating alopecia areata.",
    "Select equity market segments have widely outperformed the benchmark NSE Nifty 50 in the last one year but with much higher volatility exposing investors to a higher degree of risk.The Nifty PSE and Nifty Defence indices have for example delivered a whopping 110 percent and 125 percent returns in the one year to February 2024 which is three times as much as Nifty 50. The Nifty PSE index has been twice as volatile as Nifty 50 and the defence index has been three times as volatile. It is measured in standard deviation for the one year to February 2024.This is traditional wisdom  higher returns come with greater risks. However there are a few thematic and strategy indices which have given better returns than the Nifty 50 with lesser volatility.Also read  Debtfree capital goods MNCs outperform Nifty on capex boostersThematic indices that beat Nifty 50 returns with lower volatilityThe themes that focused on MNC stocks India (domestic) consumption story and ESG have delivered excess returns with lower volatility than the key benchmark indices. The Nifty MNC index has risen 38 percent in one year beating the Nifty 50 s 32 percent rise. It had a volatility reading of 9.72 compared with 9.98 for the Nifty 50.The ESG index gained 36 percent with 9.73 volatility while the consumption index surged 43.81 percent with 9.23 volatility.The chart below highlights the price performance of thematic indices with reduced volatility  Nifty Thematic Indices outperformStrategy indices with low volatility and excess returnsBeyond thematic indices strategy indices that focus on low volatility have also outperformed Nifty 50 returns. The Nifty 100 Low Volatility Index has gained  41 percent in one year but its volatility reading was at 8.84.The chart below highlights the price performance of Nifty 100 low volatility index when compared to Nifty 50. Nifty 100 Low Volatility index outperformsAlso read  Indicator flashes  buy  on 33  Nifty smallcaps as bulls return to broader marketsRisk aversion at play What is interesting about low volatility stocks is that mutual funds have been buying such stocks since last year. This trend is expected to continue and hence I won t be surprised if largesized lowvolatility stocks continue to do well  said Darpan Patil founder of Rupic Consultancy. Basically riskaversion is at play and hence the low volatility stocks and largecap mutual fund schemes are in demand even amongst the retail investors. Siddharth Srivastava Head   ETF Product and Fund Manager Mirae Asset Investment Managers explains   In last one year Nifty100 low volatility 30 index has performed better than its parent Nifty 100 index due to higher allocation to healthcare which has done well and lower allocation to financial services which has underperformed. The Low volatility strategy tends to perform better when the markets are volatile and or sentiments are weak. It is suited for investors who want more stability and focus on risk adjusted returns. The table below details the complete list of thematic and strategy indices that displayed lower volatility when compared to the Nifty and at the same time delivered better returns in the one year period ending February 2024. Higher riskadjusted returns in low volatility indices and thematic indicesWhat is Nifty 100 Low Volatility 30 IndexNifty 100 Low Volatility 30 index picks 30 stocks with lowest volatility measured in terms of standard deviation of daily price returns from the top 100 companies in terms of market capitalisation. Thus all the components are from the Nifty 100 index and should be available for trading in F O segment.Sun Pharma ICICI Bank RIL Nestle and BOSCH are among the top index constituents in Nifty 100 Low Volatility 30 index.Unlike the Nifty 100 Low Volatility index which ranks stocks based entirely on volatility the Nifty Alpha Low Volatility 30 index lists stocks based on the combination of Alpha and Low Volatility. The index consists of 30 stocks selected from Nifty 100 and Nifty Midcap 50.How to take exposure to low volatility strategy indicesSeveral mutual funds have ETFs that replicate the performance of such low volatility indices. For example Kotak MF ICICI Prudential MF and Mirae Asset MF all offer ETFs that track the performance of Nifty 100 low volatility 30 ETF.",
    "Drug major Sun Pharma is recalling around 55000 bottles of a generic medication to treat gout from the American market due to manufacturing practices norms deviations according to the US health regulator.The New Jerseybased unit of the Mumbaibased drug major is recalling Febuxostat Tablets in 40 mg and 80 mg strengths US Food and Drug Administration (USFDA) said in its latest Enforcement Report.Sun Pharmaceutical Industries Inc is recalling 47520 bottles (40mg) and 7488 bottles (80 mg) respectively of the medication due to Current Good Manufacturing Practice regulations (CGMP) deviations it stated. Microbial contamination was reported in stagnant water in the duct of the manufacturing equipment  the USFDA stated.The affected lot was produced at Sun Pharma s Dadrabased plant for Memphisbased Northstar Rx LLC the US regulator noted.Febuxostat is used to lower uric acid levels in people with gout.As per the USFDA the company has initiated the Class II nationwide (US) recall on March 4 this year.As per the USFDA a class II recall is initiated in a situation in which the use of or exposure to a violative product may cause temporary or medically reversible adverse health consequences or where the probability of serious adverse health consequences is remote.Sun Pharma is one of the leading generic pharmaceutical companies in the US. The US generic drug market was estimated to be around USD 115.2 billion in 2019. It is the largest market for pharmaceutical products.        ",
    "Shares of Sun Pharmaceutical Industries rose around 2 percent and hit a 52week high of Rs 1606.75 on March 6 afternoon after the US Food and Drugs Administration reportedly gave the company s Ankleshwar API (Active Pharmaceutical Ingredients) unit the allclear to manufacture and export.A CNBC Awaaz report said the USFDA classified the unit as No Action Indicated (NAI) paving the way for manufacturing and export from the plant.The NAI classification issued by the US FDA is the most sought after and corresponds to the highest level of compliance.At 2.57 pm Sun Pharma was trading at Rs 1605.30 on the NSE.Follow our market blog to catch all the live updatesInvestors cheered the development more so since the company has struggled with the adverse impacts of an import alert for its Halol unit and another compliance snag at its Mohali facility in recent times. These regulatory troubles have put pressure on the drugmaker s US market revenue.Shares of Sun Pharma have gained 29 percent in the past three months.",
    "Pharma company Sun Pharma announced that it will acquire a 16.33 percent stake in Michiganbased Surgimatix Inc for  3.05 million by the end of this month subject to fulfilment of some conditions.The drugmaker made the disclosure on February 20 through a disclosure to the exchanges.Surgimatix is engaged in developing a proprietary soft tissue fixation device for laparoscopic hernia repair and other minimally invasive surgeries.The company is yet to commence its commercial operation.The market capitalisation of Sun Pharmaceutical Industries (Sun Pharma) surpassed the Rs 3 lakh crore mark in December 2023.On December 13 2023 Sun Pharma s speciality product  Ilumetri  was included in category B of China s national reimbursement drug list which was then officially implemented from January 1 2024.Sun Pharma beat the Street estimates with a 16.5 percent rise in consolidated net profit of Rs 2524 crore for the  December quarter of the fiscal as against Rs 2166 crore recorded a year ago.At 3. 18pm on February 20 shares of Sun Pharma were marginally up 0.52 percent at Rs 1538.20 apiece.        ",
    "Frontline pharmaceutical majors Cipla Sun Pharma and Dr Reddy s have had bumper earnings over the last few quarters thanks to the highmargin blockbuster cancer drug Revlimid.But that effect could soon wear off in the coming quarters because of the high base effect and the impending entry of peers like Aurobindo Pharma who will be allowed to sell the drug. The patent for Revlimid will eventually expire in January 2026.That means the Big 3 of the Indian pharmaceutical industry will need to have other tongs in the fire to maintain the growth in earnings.The Revlimid factorRevlimid sales make up a significant chunk of overall revenue and profit margins for companies like Dr Reddy s Labs Cipla Sun Pharma and Zydus Life.HDFC Securities estimates Dr Reddy s to earn  372 million from Revlimid out of the expected US revenue of  1159 million for FY24.Strong contribution from Revlimid not only helped Cipla report its highest quarterly US revenue for the third straight time in Q3 but will round up around  165 million in sales for FY24 and  185 million for FY25 according to Elara Capital.For Sun Pharma however the opportunity is quickly diminishing due to loss of market share and its strategy to focus on specialty rather than generics.Also Read   Revlimid overdose boosts Dr Reddy s Q3 earnings but turns brokerages cautiousDr Reddy s game planTo make up for the loss of Revlimid contribution along with divestment of certain domestic brands Dr Reddy s is looking at acquiring other companies with complementary portfolios. The company has Rs 5910 crore in its kitty and is said to be eyeing opportunities in US India Europe and other markets.Faster product filings is the other strategy. The firm has identified 2530 material product launches for FY2530 HDFC Securities said. Meanwhile the drugmaker also sees its recently acquired Mayne portfolio scaling up and gaining volume in the US.However analysts worry that the increasing competition in key products will hurt volumes and market share loss and keep base business growth under pressure in the near term.Cipla s trump cardsCipla is banking on two major launches respiratory drug Advair and cancer drug Abraxane both commanding a  700 million revenue opportunity each to make up for the loss of Revlimid sales.However the twist is that both these launches have faced repeated delays due to regulatory issues at two of Cipla s manufacturing units  Goa and Pithampur where the drugs were to be manufactured. Due to these delays the full effect of these launches can now only be seen from FY26 instead of FY25.Regardless the management has hinted towards a significant undisclosed peptide product launch in Q1 of FY25 which according to Elara Capital can more than offset the delay in Advair and Abraxane.Also Read   Delayed drug launches to hurt Cipla s earnings in FY24Sun Pharma s specialty betSun Pharma is looking to bet heavily on global specialty products and reduce dependence on US generics. This could hit nearterm earnings believes Nomura.On the other hand upsides from productspecific opportunities in generics and specialty will be realised only with a lag according to Nomura.Sun Pharma s global specialty sales have rose 29 percent on year to  871 million in FY23 going from making just 7 percent of total sales in FY18 to the current 16 percent.Nonetheless Sun Pharma still has the expected launch of Deuruxolitinib filed recently for alopecia areata which could aid its momentum in the second half of FY25. The firm discovered the molecule by applying its recently acquired Concert Pharma s deuterium chemistry technology. As per Elara Capital s estimate the product could become a  200 million opportunity exclusively for Sun Pharma in the next couple of years.The drugmaker also recently launched Sezaby which is the first and only product approved in the US for treating seizures in neonatal patients. Factoring that in HDFC Securities expects momentum to continue for Sun Pharma in the near term with traction in existing specialty products like Ilumya Winlevi Cequa (prescription growth in H1 FY24) and the recently launched Sezaby. Sun Pharma s pipeline (five molecules under clinical phase) Concert acquisition (deuruxolitinib) M A (strong balance sheet) and inlicensing (has commercial infrastructure in a few large markets) will drive longterm growth  the firm believes.",
    "Motilal Oswal s research report on Sun PharmaSun Pharma (SUNP) delivered inline earnings for 3QFY24. SUNP delivered robust performance in domestic formulation (DF) specialty portfolio US generics as well as the ROW market. This was partially offset by subdued show in emerging markets for the quarter. The R D expenditure remained lower than earlier guidance partly driving better profitability for the quarter. We raise our earnings estimates for FY25 FY26 by 4  5  factoring a) superior execution in global specialty sales b) revival in growth prospects in Taro and c) industrybeating growth in the branded generics DF market. We also raise our PE multiple to 28x (from 26x earlier) factoring a) increased contribution from specialty and branded generics portfolio b) expanding specialty portfolio by adding new molecules as well as utilizing existing molecule for alternate indications and c) robust ANDA pipeline comprising niche products. Accordingly we arrive at a price target of INR1635.OutlookWe also raise our PE multiple to 28x (from 26x earlier) factoring a) increased contribution from specialty and branded generics portfolio b) expanding specialty portfolio by adding new molecules as well as utilizing existing molecule for alternate indications and c) robust ANDA pipeline comprising niche products. Accordingly we arrive at a price target of INR1635.For all recommendations report click here",
    "ICICI Securities research report on Sun PharmaSun Pharma (Sun) s Q3FY24 results after adjusting for the milestone income of USD 20mn were inline with our expectations. Specialty business rose a massive 23  QoQ to USD 291mn led by traction in Ilumya Cequa and Levulan while India grew at a faster pace of 11.4 . The company is likely to file Nidlegy in Europe in H2CY24 which will likely further boost specialty sales in the near term. In India the new MRs are helping Sun gain market share and boost volume growth while the company had launched 28 products in Q3. Management maintains its singledigit growth guidance for FY24. We broadly maintain our FY25E earnings estimate.OutlookWe lower our rating on the stock to HOLD (Add earlier) due to pricey valuation though raise our target price to INR 1400 based on 27x FY26E earnings.For all recommendations report click here",
    "HighlightsSun Pharma (CMP  Rs 1417  Market cap  Rs 339902 crore  Rating  Overweight) posted a strong result for Q3FY24 on the back of global specialty sales. They grew by 24 percent year on year (YoY) in dollar terms excluding a milestone payment. The specialty business witnessed                                     ",
    "",
    "Net Sales at Rs 5073.75 crore in December 2023 up 9.21  from Rs. 4645.75 crore in December 2022.Quarterly Net Profit at Rs. 721.31 crore in December 2023 up 48.2  from Rs. 486.73 crore in December 2022.EBITDA stands at Rs. 1435.80 crore in December 2023 up 34.51  from Rs. 1067.41 crore in December 2022.Sun Pharma EPS has increased to Rs. 3.00 in December 2023 from Rs. 2.00 in December 2022.Sun Pharma shares closed at 1418.45 on January 31 2024 (NSE) and has given 24.06  returns over the last 6 months and 34.87  over the last 12 months.",
    "Sun Pharma beat the Street estimates with a 16.5 percent rise in consolidated net profit of Rs 2524 crore for the  December quarter of fiscal as against Rs 2166 crore recorded a year ago.Revenue came in at Rs 12381 crore up 10.1 percent from Rs 11241 crore last year the company said on January 31.A poll of eight brokerages collated by   had pegged net profit at Rs 2373 crore and revenue at Rs 12277.8 crore. We are pleased by our continued broadbased growth including in Global Specialty. We are keenly looking forward to EMA filing of Nidlegy in coming months. Once approved Nidlegy will significantly expand our oncoderm franchise in Europe  said Dilip Shanghvi Managing Director of the Company in a press statement.The company s earnings before interest taxes depreciation and amortization (EBITDA) came in at Rs 3477 crore up 15.8 percent from Rs 3003.7 crore in the yearago period. The EBITDA margin was at 28.8 percent against 26.7 percent in the yearago period.Most brokerages anticipated a high singledigit or low doubledigit onyear growth for Sun Pharma s domestic business.The company reported India formulation sales at Rs 3778.5 crore and the US formulation sales at US  477 million. The company spent Rs 8245 crore on Research and Development (R D) in the quarter. l. For the quarter  the company filed 5 ANDA were and 3 approvals were received.Its subsidiary Taro Pharma reported net sales of   157 million for quarter ended Dec23 up 12.9 percent principally due to new launches and GrosstoNet ( GTN ) adjustments. Excluding the impact of GTN adjustments sales growth was in high single digit. Net profit for Q3FY24 was US  20.2 million compared to US  7.3 million in Q3FY23.The company declared an interim dividend of Rs. 8.5  per equity share of the Company for the financial year 202324.(This is a developing story. Please stay tuned for more)         ",
    "Sun Pharmaceutical Industries shares traded over a percent higher at Rs 1267 early on December 19 after the company announced it has agreed to acquire about 16.7 percent shares on a fully diluted basis for  30 million. This is a strategic investment to support the development of innovative pharmaceutical delivery technologies and get access to the technology for certain molecules and territories  the pharma major said in a regulatory filing on December 19.Also read  Sun Pharma market cap breezes past Rs 3 lakh crore stock hits 52week highAt 9 20am the counter was trading at Rs 1261 up 0.6 percent from the previous close on the NSE extending gains for the third straight trading session in a row. In the last six months the stock has gained over 25 percent.Follow our market blog for all the live actionLyndra Therapeutics Inc is a Massachusettsbased company with its registered office in Watertown MA. It is involved in the business ofdeveloping novel delivery technology for longacting oral (LAO) therapies.Read more  Sun Pharma s specialty product Ilumetri included in China s national reimbursement drug listAs per a regulatory filing the acquisition is expected to be completed by the end of December 2023 subject to certain conditions.Lyndra has raised  260 million to date through investors and partners including  100 million in nondilutive grants according to the company website. Lyndra has achieved rapid progress in a short span of time formulating 19 therapies in the lab and advancing four therapeutic products to the clinic validating the feasibility of its platform with multiple APIs.",
    "Indian Pharma major Sun Pharmaceuticals Ltd. said that it has entered into agreement to acquire about 16.7 percent shares on fully diluted basis in Lyndra Therapeutics Inc. for  30 million.Lyndra Theraputics is a company based in Massachusetts USA engaged in the business of developing novel delivery technology for longacting oral (LAO) therapies.Sun Pharma stated that the strategic investment is to support development of innovative pharmaceutical delivery technologies and get access to the technology for certain molecules and territories.The US company had a turnover of  10.7 million in 2022. Lyndra was founded in 2015 with technology that emerged from the Langer Lab at MIT. Robert Langer Sc.D. Giovanni Traverso M.D. Ph.D. Andrew Bellinger M.D. Ph.D. and Amy Schulman J.D. founded the company to develop expand and eventually commercialize the technology that would ultimately become the LYN drug delivery platform.In July 2023 the company elevated its ten COO Jessica Ballinger to the Chief Executive Officer post.Lyndra has raised  260 million to date through investors and partners including  100 million in nondilutive grants according to the company website. Lyndra has achieved rapid progress in a short span of time formulating 19 therapies in the lab and advancing four therapeutic products to the clinic validating the feasibility of its platform with multiple APIs.The company was last in news in September after Fierce Pharma reported that Lyndra Therapeutics cuts nearly a quarter of staff.        "
]