[
    "Private sector lender Kotak Mahindra Bank (KMB) plans to focus on brickandmortar business strategies and aims to open 170200 branches in 202425 the bank s group president and head of consumer banking Virat Diwanji said.The bank which recently faced regulatory actions from the Reserve Bank of India (RBI) plans to focus on its existing customers. The central bank in April issued a ceaseanddesist order under Section 35A of the Banking Regulation Act 1949 after weaknesses were detected in its operational risk management. The regulator prevented the bank from enlisting new customers through online and mobile banking channels and from issuing fresh credit cards.The unsecured loans business on which the bank has set an annual growth target of around 1516 percent is a section where the bank will continue to focus and target existing customers Diwanji said. Edited excerpts from the interaction Also read  RBI curbs on Kotak Mahindra Bank to hurt retail business stock may fall up to 5  says expertHow is Kotak Mahindra Bank looking at growing its retail and unsecured business after the RBI restrictions The RBI restrictions are on digital acquisition of new customers and fresh issuance of credit cards. On the account opening side we always had two streams one being digital and the other through our frontline staff in branches through direct contact of potential customers using biometric verification. While we may not be able to cover the entire shortfall on account of digital acquisition we are trying to improve productivity of our frontline branch staff through data analytics providing better quality leads to our ground team.The loss of book growth in value terms for credit cards would be real. However we will focus on our huge customer base through advanced analytics to prequalify customers for personal loans and business loans.With restrictions in place on your bank s digital business how and what will be the focus to grow CASA (current account and savings account) deposits  What are the new things that the bank is looking at We are taking multiple steps to improve CASA deposits. First we are focusing on increasing both the number and quality of customers acquired through our physical channel teams. Second we are enhancing customer service and engagement to ensure customers do not move their money out of the bank. Third we have relationship managers engaging with customers to make Kotak Bank their primary account. This includes encouraging customers to subscribe to services like SIPs (systematic investment plans) utility bill payments and EMI (equated monthly instalment) payments through their Kotak account.We have relaunched our ad campaign for Active Money which had given us good upside on CASA in addition to deposits. These measures aim to increase customer engagement and retention thus improving CASA deposits.What would be your ideal growth target for the unsecured loans business in FY25 We have always maintained that our unsecured portfolio would be around the midteens of our overall asset book. We will aim to still pursue this target. In the recent past our credit cards business has been growing fast and we already have a strong base. Our focus is on offering immense value to our customers by enhancing customer engagement through multiple propositions loyalty programmes and thereby increasing the overall spends on the cards.How is your bank looking at branch expansion  Will we see more of it in FY25 compared to FY24 As we know 95 percent to 96 percent of savings account customers transact outside the branch either on mobile or on net banking and hence the expansion has been focused on the area where essentially there is a business community.Infra development and urbanisation coupled with increasing prosperity in rural India are opening up new opportunities. For branch expansion we re figuring out the pockets where we are underpenetrated and where the availability of liabilities is easy. We have been adding roughly 150odd branches for several years now. This year too the momentum is going to continue. We are looking to add about 175 200 branches this financial year.Also read   Robbing Peter to pay Paul   Uday Kotak makes veiled remarks on Vodafone Idea s share sale to Nokia EricssonOn the retail side which subsegments are working well for your bank and what are some trends that you ve seen in the businesses in the past few months Our other businesses such as the mortgage which includes home loans and loans against property and business banking segments are doing very well. Our mortgage book crossed the Rs 1 lakh crore milestone in the quarter ended March 31 2024. In general with rapid infra development such as highways and airports across the country urbanisation and industrial clusters coming up there s good momentum in the economy and we are capitalising on it. The focus on the SME (small and medium enterprise) sector is also yielding positive results on lending book growth.Our mortgage lending business which is both a home loan and LAP on the consumer side continues to grow well with a yearonyear growth of 15 percent as we saw in Q4. This momentum is continuing as the economic environment is stable and there is buoyancy in the market. The performance of the portfolio continues to be extremely robust reflecting strong credit quality.How is business banking working for Kotak We have seen robust demand and have grown over 25 percent on a yearonyear basis in Q4. Our portfolio quality is extremely good and we expect to continue the pace of growth. We are encouraged by the demand coming from the tier 2 and 3 cities where we have made investments in terms of manpower and technology to tap this potential. We are also using analytics to predict customer requirements as well as to smoothen transactions for them like auto renewal preapproved limits. Customers in this segment are highly engaged and consume more products of the bank compared to other asset products. We are designing products focused on specific segments like healthcare and renewable energy which we feel will grow tremendously in the next few years.        ",
    "Kotak Mahindra Bank led among the Nifty 50 stocks with the highest number of brokerage upgrades in May due to its attractive valuations and a decrease in gross nonperforming assets (NPAs).According to   s Analyst Call Tracker  buy  recommendations for Kotak Mahindra Bank increased to 28 in May up from 23 in April.  Hold  calls decreased to 10 from 14 and  sell  recommendations dropped to five from seven the previous month.JP Morgan upgraded its rating to  overweight  citing the bank s  very cheap  valuation.  Kotak Mahindra Bank has reasonable flexibility on operational expenses to mitigate any margin pressures. After consistent EPS upgrades over the last year and following the derating we think valuations are inexpensive at 10x FY26 earnings  the brokerage stated.JP Morgan also projected that Kotak Mahindra Bank s balance sheet would grow by 16 percent annually over the next two years with earnings expected to increase at a compound annual growth rate (CAGR) of 1617 percent during the same period.Ajit Kumar Kabi a research analyst at LKP Securities noted a significant reduction in the bank s gross NPA ratio due to slower slippages and improved recoveries. The gross NPA stood at 1.39 percent down from 1.78 percent a year earlier while the net NPA ratio remained stable at 0.34 percent compared to 0.37 percent at the end of FY23.RBI action noted but impact considered limitedThe Reserve Bank of India (RBI) imposed restrictions on Kotak Mahindra Bank on April 24 prohibiting new customer acquisitions through its online and mobile banking channels and halting the issuance of new credit cards citing significant compliance failures in its technology platforms.During its Q4 FY24 results conference call the bank stated that the RBI s measures would likely impact profit before tax by about 23 percent equating to a financial effect in the range of Rs 300450 crores on an annualised basis. The bank also plans to enhance its relationships with existing customers to mitigate the impact on its operations.Although the restrictions could affect the growth of new credit cards and customer acquisition the bank intends to increase investment in technology to resolve the issues according to JP Morgan.BOB Capital maintained a  buy  rating on the stock noting in a May 7 report  The recent regulatory restrictions on new credit card issuance and digital onboarding of new clients may slow growth momentum and margins and the overall return ratio. However the recent price correction has already factored in most of the negatives. ",
    "A weaker majority for the Prime Minister Narendra Modiled alliance may increase welfare spending but not result in additional borrowing limiting a rise in bond yields a top executive at India s Kotak Mahindra Bank said.Modi s Bharatiya Janata Party failed to get an outright majority in the recently concluded parliamentary elections making them dependent on support from regional parties to form a government.That raised concerns that the new government will take populist measures which will increase spending and could in turn see additional borrowing pressure. I do not expect the government to raise gross borrowing for the current financial year in the final budget as they have received an unexpectedly large amount as dividend from the Reserve Bank of India  said Rajeev Mohan president of treasury and global markets at Kotak Mahindra Bank the country s fourth largest private lender in terms of assets.The Indian government will table the final budget for this year before end of July.Last month the RBI transferred a record surplus of 2.11 trillion rupees to the central government more than double of expectations. That money  can be easily used for any welfare schemes that they may undertake  Mohan said in an interview late Thursday.India s gross borrowing is aimed at 14.13 trillion rupees ( 169.32 billion) in the current financial year aiming to contain fiscal deficit at 5.1 .Mohan also ruled out any possibilities of a supply cut as speculated by some sections of the market.At best the government could  cancel auctions occasionally if the yield that the market demands is higher than their expectations  he said.On Tuesday the 10year benchmark bond yield shot above the 7  mark and witnessed its biggest single session rise in eight months as voting trends and counts turned out to be sharply different from exit poll predictions of a thumping BJP majority.Mohan said demand from banks as well as longterm investors will continue to support the benchmark and the 10year yield may not rise above 7.10  mark over the next six months.He also said he prefers longer duration bonds due to higher demand and lower supply expecting yields to decline longterm while visibility on liquidity remains low. On the downside I do not see the 10year yield crossing the 6.90  mark till we see the RBI delivering a cut in repo rate. Our base case for an interest rate cut is December as inflation is expected to reach closer to the 4  target by then  Mohan said.        ",
    "LKP Research s research report on Kotak Mahindra BankKotak Mahindra Bank (KMB) has shown a decline in performance over the last three years (3Y return  7.4  1Y return  13.3 ) compared to the returns of Bank Nifty (3Y return  37.4  1Y return  11.5 ) and Nifty (3Y return  43.6  1Y return  21.6 ). This underperformance can be attributed to several factors including the stepping down of Mr. Uday Kotak slower business growth relative to Kotak s usual standards and supervisory actions by the RBI. However the bank has maintained strong asset quality during this period. Looking ahead to FY25 there are indications of a revival particularly evident in robust deposit growth which is expected to bolster business expansion given the comfortable Capital to Deposit Ratio (CDR) level at 84 . We anticipate that margins will remain steady in the near term supported by favourable credit costs. Our estimate for FY26E Return on Equity (ROE) stands at 18.5  up from the current level of 15.5  driven by a projected credit growth of 18  CAGR for FY2426E. Furthermore the Bank s valuation is currently at 3(x) trailing PricetoBook Value per Share (P BVPS) compared to the 5Year median P BVPS of 4.1(x).OutlookWe believe that there is a strong likelihood of the stock undergoing rerating due to improving return ratios. We recommend a BUY with a target price of  2124.For all recommendations report click here",
    "Private bank stocks recovered sharply in two days after they witnessed steep decline owing to postelection verdict uncertainty. Shares of HDFC Bank ICICI Bank Axis Bank IndusInd Bank and Federal Bank surged up to 8 percent in 2 days on June 6 as against 4 percent rise in the benchmark Nifty 50 index during the same period.Analysts at Goldman Sachs believe that this steep correction offers opportunities to accumulate private banks. They remain bullish on HDFC Bank Kotak Bank Axis Bank and IndusInd Bank. The fundamentals are more important than the narrative. We continue to favour private banks over PSUs  the brokerage firm said in a recent note.Catch all the market action in our LIVE blogKotak Institutional Equities said that banks reported a good Marchended quarter (Q4FY24) as operational profitability holds up. Asset quality also continued to improve while the proportion of delinquent loans on the balance sheet continued to decline.Additionally credit growth stayed healthy for private banks at 30 percent yearonyear (YoY) in Q4FY24. According to the latest RBI data overall credit growth for the banking system has stayed healthy at 20 percent YoY in May 2024 supported by the merger of HDFC into HDFC Bank while it stood at 16 percent adjusted for the impact of the merger.ALSO READ  PSU Banks  Does the new election verdict derail the party for good However banks showed a declining NIM trend during Q4FY24. Yields were either flat or slightly higher sequentially with some amount of repricing of MCLRlinked loans. Going ahead most banks have indicated that most of the repricing of term deposits is largely complete.Nonetheless Julius Baer remains optimistic about private banks after India recorded 7.8 percent GDP growth YoY in first quarter of 2024.  While BJP s power may be diluted it is still intact and the momentum in the economy from existing reforms will not fade away  they said.",
    "The Reserve Bank of India has approved Zurich Insurance Company s proposed acquisition of 70 percent stake in Kotak Mahindra General Insurance Company for Rs 5560 crore Kotak Mahindra Bank said in an exchange filing on June 5.Kotak General is a 100 percent subsidiary of Kotak Mahindra Bank. The approval came on June 4.The bank said all the require approvals were received and the transaction would be completed  upon fulfillment of other conditions precedent .In February the private bank had announced that Zurich Insurance would acquire a 70 percent stake in the insurance company for Rs 5560 crore in a single tranche.In November 2023 Zurich Insurance said it would first acquire a 51 percent stake through a combination of fresh growth capital and share purchase and an additional 19 percent stake later on.On February 6 the Competition Commission of India had allowed the the Zurichbased firm to pick up a 70 percent stake in Kotak General.        ",
    "General Atlanticbacked KFin Technologies Limited on May 25 announced the appointment of former Kotak Mahindra Bank joint managing director Chengalath Jayaram as an Independent Director on the Board effective May 24.Prior to this Jayaram had a long stint with Kotak Group for about 26 years where he played a key role in establishing and growing multiple business verticals. Jayaram s notable positions include Managing Director of Kotak Securities Limited and Joint Managing Director of Kotak Mahindra Bank.During his time at Kotak  Jayaram was instrumental in heading the Private Banking Alternative Investments and international operations further solidifying his expertise in the financial sector.Before his tenure at Kotak Jayaram gained valuable experience at Overseas Sanmar Financial Limited. Throughout his career he has been recognized for his strategic acumen and leadership in driving business growth and innovation.Jayaram s extensive experience also includes serving as a Director on the Board of the Multi Commodity Exchange of India Limited AllSec Technologies Limited and Financial Planning Standards Board India. His contributions to these organizations have been marked by a consistent focus on expanding business operations enhancing service offerings and fostering innovation.Jayaram holds a Post Graduate Diploma in Management from the Indian Institute of Management Kolkata and a Bachelor s degree in Economics.KFin Technologies is the largest investor solutions provider to Indian mutual funds based on the number of AMCs serviced as of March 31 2024 and the largest issuer solutions provider based on the number of clients serviced as of March 31 2024.KFintech is the only investor and issuer solutions provider in India that offers services to asset managers such as mutual funds alternative investment funds wealth managers and pension as well as corporate issuers and is one of the three operating central record keeping agencies for the National Pension System in India.KFintech is listed on the National Stock Exchange of India Limited and BSE Limited. General Atlantic Singapore Fund Pte Ltd ( GASF ) a leading global private equity investor is the promoter of the KFintech.        ",
    "The rising expenditure on the information and technology (IT) and digital services of Kotak Mahindra Bank in the financial years (FY) 2022 and 2023 (the two years over which the Reserve Bank of India (RBI) expressed significant concerns in the bank s IT management) was accompanied by a jump in customer complaints in the internet banking mobile banking and ebanking segments data from the bank s annual reports and management commentary showed.In the two years the bank increased its expenditure on IT and digital services by an average of 43 percent.According to the commentary from the bank management the expenditure on IT stood at around 710 percent of the total expenditure in FY22 and FY23. For instance in FY 22 the IT expenses of the bank stood around Rs 834 crore.  The operating tech cost as part of the overall tech cost is about 7.5 percent and that s been consistent through this year. Both for the quarter and the year and of course if I add the CAPEX it would be another onethird of that addition to that  said Jaimin Bhatt then Chief Financial Officer (CFO) Kotak Mahindra Bank. If I look at it at the bank level our total expenditure for FY24 is about Rs 16780 crore which was up from Rs 13800 crore in FY23. IT expenditure was around 9.7 to 10 percent of the total capital expenditure  said Devang Gheewala CFO Kotak Mahindra Bank on May 4.Also read  Kotak Mahindra Bank ups digital game  plans to launch revamped Kotak 811 and new payments service appIn addition data in the annual reports of the bank showed that the complaints in the internet banking mobile banking and ebanking segments rose from 50670 in FY22 to 67304 in FY23.The jump in expenses and complaints came to the fore after RBI on April 24 barred Kotak Mahindra Bank from onboarding new customers on its online and mobile banking channels and issuing fresh credit cards citing deficiencies in its IT risk management. The actions followed an RBI examination of the bank s IT systems over the last two years and the bank s continued failure to address concerns. These actions are necessitated based on significant concerns arising out of the Reserve Bank s IT Examination of the bank for the years 2022 and 2023 and the continued failure on the part of the bank to address these concerns in a comprehensive and timely manner  RBI said.Combating IT issuesPost RBI s hammer the bank in its investor presentation for the quarter ended March 31 2024 announced proactive measures aimed at mitigating potential business impacts. The bank conveyed its intention to strategically redeploy resources to counteract the ramifications of the central bank s directives.  The bank is looking to redeploy resources to minimise the business impact and believes that these directions will not materially impact its overall business  the bank said in the investor presentation.The bank estimates an impact of Rs 300450 crore profitbeforetax (PBT) in FY25 following the regulatory action. And the management said that it will stepup investments to fortify its IT systems by focusing on sustainable compliance to baseline cyber security framework for banks and strengthening digital payment security controls. The bank will also hire an external auditor to assess the overall technology architecture soon as mandated by the RBI.Acknowledging the regulatory restrictions imposed by the RBI Kotak Mahindra Bank conducted a thorough assessment of their potential repercussions. Specifically the bank identified potential challenges affecting new credit card issuance and customer acquisition through its 811 platform.  Impact would be on franchise and customers directly impacted businesses primarily new credit cards and customer acquisition through 811 potential financial impact  the bank said.Solving the issues around banks s IT management is the number one priority for the bank said Ashok Vaswani Chief Executive Officer Kotak Mahindra Bank.  This is the number one management priority for the bank and between Shanti (Shanti Ekambaram whole time director) Devang and the management team we are obviously spending much more time on the technology issues and we will continue to spend much time till we get this right  Vaswani said in a post results press conference on May 4.Also read  RBI action poses challenge to Jay Kotakled Kotak 811 say industry veteransDigital business of the bankThe bank s digital business is majorly sourced from Kotak811 its digital banking arm which is coheaded by Kotak Mahindra Bank s founder Uday Kotak s son Jay Kotak. It accounts for nearly 95 percent of personal loan disbursals 99 percent of personal credit card sales and 79 percent of personal new business of the bank latest data showed.Additionally a few days before RBI s diktat on the bank   exclusively reported that the bank is working to launch a revamped mobile application for Kotak811 and another application offering payment services.And this came after the bank s technical servers experienced disruptions on April 16  with several customers taking to social media to complain about issues with payments or transactions on the mobile app ATMs and net banking.According to Vaswani on April 15 the bank was testing its disaster recovery process.  We were testing our disaster recovery process in the backend and this went wrong  Vaswani said in a press conference on May 4.        ",
    "Kotak Mahindra Bank Ltd. plans to hire around 400 engineers this year as it races to upgrade its technology systems after coming under the regulator s scrutiny for lapses.The lender backed by Indian billionaire Uday Kotak has already brought on board more than 500 engineers from scratch over the last two years according to Milind Nagnur the bank s chief technology officer. It has pulled them from firms like Google and Amazon.com Inc. as well as from Paytm and PhonePe Pvt. Nagnur said in an interview.With the hires this year the bank will have achieved a  critical mass  in talent and additions would be gradual after that he said. India s fourth largest private lender boosted spending on technology by more than 30  to 17 billion rupees ( 204 million) in the year ended March 31 making up about 10  of operating expenses according to Kotak s Chief Executive Officer Ashok Vaswani at a press briefing over the weekend.The team will be seeking to overcome a ban imposed last month by the Reserve Bank of India on adding new customers through its digital channels and issuing fresh credit cards. Kotak s governance and risk management in its technology systems are in the spotlight as the regulator had singled those out as among the reasons behind its action. We are going to just double up put far more efforts far more resources far more money into moving this thing as fast as possible  Vaswani said. The spending is expected to rise as the bank deepens its technology buildout he said.Nagnur was among Kotak s most highprofile technology hires alongside Bhavnish Lathia its chief of customer experience both of whom joined in 2022. Nagnur previously worked at the USbased fintech company Early Warning Services LLC while Lathia spent nearly two decades at Amazon. We do worry about everything that you see and hear  said Nagnur in comments before the RBI ban.  We have to worry about cyber risk we have to worry about operational risk human errors in sending payments to the wrong person or geographic risk credit and debit card frauds. The bank is using artificial intelligence in areas like fraud risk management rewriting customer chat bots for better service and for sentiment analysis on the bank leading to faster resolution of problems said Nagnur who recently expanded his role to also become chief operating officer.About 98  of the transaction volume in Kotak s savings accounts were by digital or nonbranch methods according to its most recent investor presentation for the third quarter. The bank sold 95  of new personal loans by volume and 99  of new credit cards digitally in the same period highlighting the challenges of maintaining this growth pace with the RBI ban.The regulator said it found deficiencies and noncompliance in Kotak s various processes over two years   from a lack of data security and leak prevention strategies to vendor risk management. It said it had engaged with the bank but  the outcomes have been far from satisfactory. Read More  Kotak Bank to Focus on CrossSelling Products Till RBI Ban Lifts What really is changing is the backend where we are going deep into resiliency uptime cybersecurity  said Nagnur.  While the digital transaction volumes are exponentially growing you have to be substantially ready in the backend to handle these type of volumes.         ",
    "Prabhudas Lilladher s research report on Kotak Mahindra BankKMB saw a mixed quarter  while core PPoP beat PLe by 8.7  led by better fees and lower opex NIM missed PLe by 9bps due to increase in liquidity. Asset quality was weaker as net slippage was higher while PCR declined by 4.6  QoQ to 76  led by Rs14.6bn writeoffs in unsecured retail. LDR reduced QoQ from 88  to 84  owing to stronger deposit growth mainly led by retail deposits. While RBI directive to stop online customer onboarding and credit card issuance could materially reduce client addition (9mn in FY24) bank would mitigate this by fastpacing customer accretion through offline mode and crossselling to existing customers. As per bank RBI action may affect PBT by Rs3.04.5bn. Stock is valued at 1.6x and we cut multiple to 2.5x from 3.3x as (1) key personnel viz. MD CEO Joint MD and CFO have resigned or retired (2) RBI directive impacts our FY25 26E core PAT by 2.4  5.2 .OutlookRolling forward to Mar 26 ABV we cut TP to Rs2100 from Rs2250. Retain  BUY .For all recommendations report click here",
    "Shares of Kotak Mahindra Bank on Monday rallied 5 per cent after the company reported a 25 per cent growth in its March quarter net profit. The stock climbed 5.01 per cent to settle at Rs 1624.75 on the BSE. During the day it soared 5.54 per cent to Rs 1633.It emerged as the biggest gainer among the BSE Sensex firms. On the NSE the stock jumped 5 per cent to Rs 1624.40 .The company s market capitalisation (mcap) climbed Rs 15406.39 crore to Rs 322987.45 crore. In traded volume terms 11.27 lakh shares of the company were traded at the BSE and 216.08 lakh shares at the NSE during the day.Kotak Mahindra Bank on Saturday reported a 25 per cent growth in its March quarter net profit at Rs 5302 crore limited by a drop in the core income due to narrow interest margins. On a standalone basis the lender s Q4 net profit grew 18 per cent to Rs 4133 crore.The FY24 consolidated net profit grew 22 per cent to Rs 18213 crore. For the reporting quarter its core net interest income increased 13 per cent to Rs 6909 crore on the back of a 20 per cent loan growth and a narrowing of the net interest margin to 5.28 per cent.         ",
    "Emkay Global Financial s research report on Kotak Mahindra BankKotak Mahindra Bank (Kotak) reported a huge 28  beat on PAT (which stood at Rs41bn) mainly on treasury gains debt syndication fees reversal of AIF provisions (Rs1.6bn) and lower tax rate  21 . Its CASA ratio has slipped by 1500bps in the last 2Y to 45.5   this coupled with the recent RBI embargo on digital customer sourcing (incl. Kotak 811) and slower branch expansion vs peers could further hurt the bank amid the raging war for retail deposits. Also ban on new card sourcing will hurt mkt share revenue more so in the medium term as seen in HDFCB. Mgmt guides to PBT impact of Rs34.5bn (3  of FY25E PBT) due to the RBI embargo but we believe impact on the business financials would be far more widespread unless resolved soon. Thus we cut FY25E27E growth by 200bps and expect the RoA RoE trajectory to slip to 1.92.3  13 14  on higher opex provisions. Higher attrition (incl. in KMP) and Bank s strategy to reduce provision buffers vs peers amid rising assetquality noise adds to our concerns.OutlookWe retain REDUCE with TP cut to Rs1625 sh (Rs1750 earlier) valuing the SA bank at 1.8x FY26E ABV and subsidiary at Rs525 sh.For all recommendations report click here",
    "Religare Retail Research report on Kotak Mahindra BankKotak Mahindra Bank s standalone net interest income during Q4FY24 increased by 5.4  QoQ 13.2  YoY which was led by improvement in margins sequentially healthy growth in advances and strong rise in interest income. The bank managed to curb its operating costs which led to preprovision operating profit growth of 19.6  QoQ 17.5  YoY. Consequentially PAT reported a growth of 37.5  QoQ 18.2  YoY. The bank continues to maintain positive outlook for FY25 and expects profitability to improve led by improving macroeconomic conditions and its efforts to maintain profitability.OutlookKotak Mahindra Bank s standalone net interest income during Q4FY24 increased by 5.4  QoQ 13.2  YoY which was led by improvement in margins sequentially healthy growth in advances and strong rise in interest income. The bank managed to curb its operating costs which led to preprovision operating profit growth of 19.6  QoQ 17.5  YoY. Consequentially PAT reported a growth of 37.5  QoQ 18.2  YoY. The bank continues to maintain positive outlook for FY25 and expects profitability to improve led by improving macroeconomic conditions and its efforts to maintain profitability.For all recommendations report click here",
    "Anand Rathi s research report on Kotak Mahindra BankBoosted by robust loan growth and the higher NIM Kotak Mahindra Bank delivered healthy 20  q q core earnings growth in Q4. A squeakyclean franchisee combined with substantial subsidiary valueaccretion would drive a high 2.4  RoA over FY2426. Despite the RBI overhang we retain a Buy with a TP of Rs1855 as the steep drop in the stock price offers an attractive entry.OutlookAt our TP the stock would trade at 2.3x P ABV on FY26e BV (2.7x FY26e earlier) with subsidiaries valued at Rs.419.For all recommendations report click here",
    "The RBI crackdown on Kotak Mahindra Bank last week didn t come as a bolt from the blue. The action didn t really surprise the insiders too.The regulator had conducted IT checks on the bank in 2022 and again in 2023 before issuing corrective action plans. Going by the statement issued by the Reserve Bank of India (RBI) the continued failure on part of the private sector lender to address the concerns raised by the watchdog in a comprehensive and timely manner had resulted in the action last week.Put it simply the central bank waited for two years before cracking the whip because the bank failed to comply with the guidelines. For the new chief executive of Kotak Mahindra Bank the RBI action has come as the first big challenge since he took over following the exit of bank s founder Uday Kotak from an executive role.Even in the case of HDFC Bank back in December 2020 the RBI action had barely triggered frowns. There were frequent engagements between theregulator and the bank in the oneandahalf years preceding the RBI action when the lender had reported frequent digital outages causing inconvenience to customers. This too was a major challenge for then a newcomer Sashidhar Jagdishan who had just taken the baton from Aditya Puri. In HDFC Bank too the issue was inaction or inadequate action by the private lender during the Puri days in addressing its perpetual tech issues.Yet another case though not directly comparable with KMB and HDFC Bank is the RBI action on Paytm Payments Bank Ltd (PPBL) early this year. Among the problems cited by the RBI one of the issues was inadequate compliance in the way the bank carried out the functions of the Paytm App and drawing a line between the parent and the bank in terms of operations.PPBL s dependence on the IT infrastructure of OCL remained absolute and there was no operational segregation. Many transactions were routed through the parent entityowned apps raising serious concerns on data privacy and data sharing the RBI found during its inspections. In Paytm case too the RBI had been talking to PPBL for twoandahalf years about the noncompliance but the company didn t take any action.In all three cases of RBI crackdown on Kotak Mahindra Bank HDFC Bank and Paytm Payments Bank one factor stands common  the regulator gave sufficient time each of the entities to rectify the techrelated issues but all of them had shrugged off the warnings.But why are the banks failing to get their tech game right again and again The fact is while the banks went on an overdrive to launch digital products they did not invest enough to firm up and upgrade their technology platforms. The RBI has taken the lapses seriously. Technology has helped banking services evolve to the techage but for the banking services to become more inclusive the lenders need to make sure the alternative channels work seamlessly. Considering the significant growth in number and value of digital transactions over the last few years they need to invest in technology.The advancement in technology the rise in digital payment apps and the ease of digital banking have sent online transactions zooming across the country. Just to understand it better transactions through the unified payments interface (UPI) platform crossed 100 billion in 2023 alone to close at 118 billion shows data shared by the National Payments Corporation of India (NPCI). This marks a 60 percent growth from 74 billion UPI transactions recorded a year back.Also most banks have significantly shifted their business acquisitions through digital channels. In case of Kotak Bank as per latest data Kotak 811 has emerged as a a critical division in its operations accounting for nearly 95 percent personal loan disbursals 99 percent credit card sales and 79 percent new businesses.But while the banks relied increasingly on digital channels they did not upgrade their systems to handle such spiralling business volumes which inexorably paved way for a spurt in glitches. The banks downplayed the technical glitches as routine occurrences but the RBI refused to buy the argument. The regulator kept on reiterating that the banks need to scale up investment in strengthening the technology before launching products to ensure their platforms could handle the volume without causing inconvenience to the customer.For some reason the banks seem to have ignored the wakeup call from the RBI for long. Now after the whip if cracked it s high time for the banks to go for a course correction.Banking Central is a weekly column that keeps a close watch and connects the dots about the sector s most important events for readers. ",
    "Motilal Oswal s research report on Kotak Mahindra BankKotak Mahindra Bank (KMB) posted a standalone PAT of INR41.3b (21  beat) which grew 18.2  YoY in 4QFY24 aided by steady revenue growth and oneoff gains from the reversal of AIF provisions (INR1.57b) interest on IT refund (INR1.4b) and tax credit (INR2b). Consol. PAT grew 16.9  YoY to INR53.4b. NII grew 13  YoY to INR69.1b (in line  up 5.4  QoQ) as NIM improved 6bp QoQ to 5.28 . Other income grew 36.2  YoY (17  beat) for the quarter.OutlookKMB delivered a steady quarter with a beat on earnings and margins improving sequentially. The asset quality ratio improved supported by aggressive writeoffs while slippages rose slightly. The bank continues to guide for a steady growth trend with the unsecured lending trajectory remaining consistent with midteen growth expressing confidence in the quality of the underlying portfolio. Management has indicated a limited business impact from the recent RBI restrictions and mentioned that the top priority of the management team will be to restore operations to business as usual. The stock has corrected sharply over the past few days (while the derating has been on for years) and we find the riskreward turning more favorable. However the absence of any nearterm triggers and a watchful stance on execution the lifting of the RBI restrictions and management stability will limit the nearterm performance. We fine tune our earnings estimate  we also estimate KMB s RoA RoE at 2.3  14.1  by FY26. Reiterate Neutral with a TP of INR 1700 (based on 1.8x FY26E ABV   INR 565 for subsidiaries).For all recommendations report click here",
    "HighlightsKotak Mahindra Bank (Kotak Bank CMP  Rs 1547 Market                                     ",
    "Brokerages turned bullish on Kotak Mahindra Bank s upbeat Q4 FY24 performance but remained wary of the Reserve Bank of India s (RBI s) embargo on new credit card issuances. Despite the management s assurance of a  minimum  financial impact in its postearnings conference call analysts said that they remain watchful of how the private lender navigates this challenge.Since the RBI s action the Kotak Mahindra Bank stock has tumbled over 16 percent underperforming the 0.3 percent rise in the benchmark Nifty 50 index.ALSO READ  RBI action on digital lending to drag Kotak s profit by Rs 300450 crore in FY25 says CEO   MDRBI resolution key for Kotak Bank s future rerating say expertsJefferies shared a  hold  call on Kotak Mahindra Bank and reduced the target price to Rs 1790 per share saying that the RBI resolution and controlled midmanagement is key to future performance.Analysts at Emkay also maintained a  reduce  rating on the private sector lender saying that the regulatory hurdle could hurt business growth. They slashed the target price to Rs 1625 per share from Rs 1750. Though the management has outlined Rs 300450 crore impact on profitbeforetax (PBT) we believe that the financial impact could be far higher as seen in HDFC Bank. The fulfillment of RBI s requirement for external audit followed by corrective measures to the regulator s satisfaction for lifting the ban is a task easier said than done  the brokerage firm said.Ashok Vaswani managing director and chief executive of Kotak Mahindra Bank said that the regulatory action could have an impact of Rs 300450 crore on the bank s PBT in FY25.  More than financial we are worried about the reputational impact of the RBI action  he said in a postearnings concall after the RBI barred the lender from onboarding new customers through online banking channels or issuing new credit cards citing deficiencies in its IT framework.ALSO READ  JP Morgan upgrades Kotak Mahindra Bank to overweight from neutral  ups target price by 34 Street upbeat on Kotak Mahindra Bank s Q4 performanceKotak Mahindra Bank consolidated net profit rose 16.8 percent yearonyear (YoY) to Rs 5337 crore in Q4FY24 while net interest income (NII) grew 13 percent YoY to Rs 6909 crore.Following the strong metrics JP Morgan analysts upgraded Kotak Mahindra s rating to  overweight  and shared a target of Rs 2070 per share.  The upgrade follows supportive valuations following recent RBI actions and senior management departure. The bank has exhibited strong operating metrics in Q4 and we believe that they can continue to compound the balance sheet at 16 percent CAGR over the next 2 years  they wrote in a postresult review.Nomura too upgraded Kotak Mahindra Bank to  buy  and set a target price of Rs 2000 per share following its allround Q4 performance.  We see significant value in the company. As the RBI s embargo is just 2 percent of FY25 PBT impact the resolution of the same and any further churn in top management will be key monitorables  they added.The bank reported strong loan growth of Rs 3.9 lakh crore as of March 31 2024 whereas average term deposits grew to Rs 2.2 lakh crore. Assetqualitywise the gross NPA ratio declined to 1.39 percent in the March quarter from 1.78 percent a year ago. Additionally the net NPA ratio slipped to 0.34 percent from 0.37 percent.ALSO READ  Kotak Mahindra Bank expects cost of funds to stabilise despite margin squeeze in Q4Cost of funds to stabilise despite margin squeeze in Q4Having said that margin pressure continued for the private lender during the quarter. Kotak Mahindra Bank saw a contraction of 47 basis points (bps) in its net interest margin (NIM) which declined to 5.28 percent in Q4FY24 from 5.75 percent a year earlier.However the management indicated that it expects the cost of funds to stabilise gradually.  We anticipate a continued rise in the cost of funds in the forthcoming quarters albeit at a slower pace compared to recent periods. The stabilisation of the cost of funds hinges on external rate movements  the bank added.",
    "Gold loans have become popular. According to the Reserve Bank of India (RBI) gold loan outstanding stood at Rs 1.03 lakh crore as on March 22 2024  a growth of 15 percent compared to the previous year. And Kotak Mahindra Bank wants to cash in.The bank started offering gold loans around two years ago and it now offers the product in nearly 90 percent of the cities where it is present.In an exclusive interview with   Shripad Jadhav President",
    "Here s a compilation of brokerage calls and comments on stocks of Titan Kotak Mahindra Bank Avenue Supermarts Britannia and more post these companies  Q4 financial results.Titan CompanyGoldman Sachs On TitanBuy Call Target Rs 3950 per shareQ4 Revenue Growth Remains Strong But Competitive Intensity To Cap MarginStrong Revenue Growth In Jewellery SustainsJewellery Biz Facing Margin Headwinds Due To Sharp Rise In Gold Prices   High Competitive IntensityCompetitive Intensity Caps Margin Expansion Potential For FY25Management Expects To Maintain The Current Margin Range Of 1213 Watches Had A Weak Quarter Driven By High Competitive IntensityUBS On TitanNeutral Call Target Rs 3900 per shareFocus On Driving Sales Amid High CompetitionMargin Impacted By Higher Discounts And OffersDemand Environment Remains Weak  Competitive Intensity ContinuesWeak Sales Growth In Watches And Wearables  CaratLane EBIT Margin At 6.9 Jefferies On TitanHold Call Target Rs 3500 per shareCo Missed Q4 Estimates Mainly Due To Weak Margin In Jewellery SegmentWeak Margin In Jewellery Segment Due To High Competition Along With Rise In Gold PricesCommentary On Margin Was A Bit Subdued But Like Mgmt s Excessive Focus On GrowthShare Price Would Likely Trade Weak TodayStock May Stay Rangebound In NeartermKey Event To Watch Out For Is Analyst Meet At MonthendKotak Mahindra BankJP Morgan On Kotak Mahindra BankUpgrade To Overweight Target Rs 2070 per shareUpgrade Following Supportive Valuation Post Recent RBI Actions   Senior Management DepartureBank Showed In Q4 That Core Operating Metrics Remain StrongQ4 Headline Profit Adjusted For Oneoffs Was 8  Ahead Of EstimateCore PpOP Growth Of  12  YoY With Notable Fee GrowthCo Quantified Total Impact Of RBI Ban At A Minimal Rs 300500 Cr At PBT LevelBelieve Co Can Continue To Compound Balance Sheet At 16  CAGR Over Next 2 YearsNomura On Kotak Mahindra BankUpgrade To Buy Target Rs 2000 per shareQ4 An Allround Beat  Elevated Writeoffs But Asset Quality Well In ControlNow See Significant Value In CoResolution Of RBI s Embargo   Any Further Churn In Top Management Will Be Key To WatchRBI Embargo Impact Just 2  Of FY25 PBT As Per ManagementJefferies On Kotak Mahindra BankHold Call Target Cut To Rs 1790 per shareQ4 Profit Of Rs 4100 Cr Up 18  YoY Was Ahead Of Estimate   Adjusted For 3 Onetimers It Grew By 5 Deposit Growth Was Healthy At 24    Aided Loan Growth Of 18 Slippages   Credit Costs Are NormalisingSee Tad Slower Loan Growth As Rise In Unsecured Loans NormalisesCredit Cost Will Rise   Techspend To Resolve Embargo Can Lift CostRBI Resolution   Controlled Midmanagement Attrition Is KeyAvenue Supermarts (DMart)JP Morgan On Avenue SupermartsUpgrade To Overweight Target Raised To Rs 5400 per shareRiskreward Is Favorable With Business Set Up Well For AccelerationUpgrade Premised On More Confidence On High Teens  Rev Growth Delivery Over MediumtermUpgrade On Ability To Ensure Lowest Prices Offers A Key Competitive Advantage Over PeersApparel Underperformance Is Now Behind With Co Aiming To Skew Mix Towards Nonfashion PdtsMargin Tailwinds Exist From Scale Benefits  Premiumisation Better Mix   Strong Cost FocusRaise FY2526 EPS By 36 Goldman Sachs On Avenue SupermartsSell Call Target Rs 3900 per shareQ4 Profit Growth Catches Up With Sales Growth Margin Have Likely BottomedDeclining Revenue Contribution By General Merchandise   Apparel Will Cap Gross Margin ExpansionFY24 SSSG Below Historical TrendStore Addition Similar To Last Year Largely In Existing StatesSharp Increase In Capex In FY24BritanniaMorgan Stanley On BritanniaOverweight Call Target Rs 5243 per shareReported Q4 Revenue EBITDA   Adjusted PAT Growth Of 3  2    4  YoY RespectivelyRevenue Was Up 8  On A Fiveyear CAGR Basis Similar To Q2Gross Margin Expanded 107 bps YoY And 113 bps QoQ To 44.1 EBITDA Margin Contracted 96 bps YoY   Was Flat QoQ At 19.6 CLSA On BritanniaOutperform Call Target Rs 5636 per shareQ4 Consol Revenue Growth Of 1.1  YoY 2  Below EstimateGross Margin Was Flat YoY At 44.9  While EBITDA Margin Contracted By 56 bps YoY To 19.4 Absolute EBITDA Was 3  Below EstimatePAT Contracted By 2.2  YoY Which Was 1  Below EstimateGodrej PropertiesJefferies On Godrej PropertiesBuy Call Target Rs 3175 per shareStrong Cash Flow Performance In Q4 Drove First Netdebt Reduction In 22 Quarters Key PositiveFY24 Guidance Has Been Well ExceededDisclosures On Embedded Profitability Imply Co Trades At 17x PE To FY25 PresalesJP Morgan On Godrej PropertiesUpgrade To Overweight Target Raised To Rs 3100 per shareUpgrade Following Co s FY24 Presales BeatUpgrade Following Disclosures That Its Economic Interest In New Sales Has Improved SubstantiallyResulting In Imputed Net Margin Rising To 13 Mumbai Sales Growth Is An Added Positive As Co Is Finally Capitalising On Home Mkt Opportunity",
    "JP Morgan upgraded Kotak Mahindra Bank (KMB) to overweight from neutral citing supportive valuations post recent RBI actions and senior management departure. The target price has been raised to Rs 2070 per share marking a 34 percent increase from the last close.JP Morgan stated that the impact after RBI action on F25 26 growth should be minimal. In Q4 the bank demonstrated strong core operating metrics with headline profit adjusted for oneoffs surpassing JPMe by 8 percent. Core PPOP growth stood at    12y y accompanied by significant fee growth.Kotak Mahindra Bank estimated the total impact of the RBI ban at a minimal Rs 300500 crore at the PBT level (2 percent of F26 PBT at the top end). During the analyst call KMB expressed confidence in sustaining growth faster than the system aiming for 1.52x nominal GDP with F25 advances growth at 20 percent. Asset quality remains strong and despite NIMs decreasing throughout the year ROAs have remained steady. The new CEO prioritized strengthening core technology and resilience. Notably KMB s tech spending at 10 percent of opex compares favorably with large peers although the absolute numbers may be lower due to scale. We believe KMB can continue to compound balance sheet at 16  CAGR over next 2 years and even factoring ROA normalization down (from F24 2.6 ) we think bank earnings can compound at 1617  CAGR over next 2 years with scope for upside driven by better opex control. Valuations at 10x F26E parent P E are compelling for what is a high quality and growth compounding franchise  JP Morgan said in its note.JP Morgan raised F25 26E EPS of Kotak Bank considering improved ROAs (F25 26 at 2.47 2.5  vs. earlier  2.3 ). KMB shows flexibility in opex to offset margin pressures. With consistent EPS upgrades over the past year valuations appear cheap at 10x F26E parent bank P E. On consolidated earnings the stock s F25 26E P E ratios look favorable at 15x 12x for a 16  EPS CAGR it said.Kotak Mahindra Bank faced pressure in recent sessions due to the RBI s ban on new customer onboarding through online and mobile banking along with the suspension of issuing new credit cards. Additionally the resignation of joint managing director KVS Manian after 29 years of service further impacted the bank.",
    "Kotak Mahindra Bank showcased robust profit and net interest income (NII) figures for Q4FY24 yet faced margin challenges due to escalating cost of funds. During the postearnings analyst call the management indicated that it expects cost of funds to stabilise gradually in the coming quarters subjected to external rate movements. We anticipate a continued rise in the cost of funds in the forthcoming quarters albeit at a slower pace compared to recent periods. The stabilisation of the cost of funds hinges on external rate movements  Kotak Mahindra Bank said after announcing its Q4 results.The private lender saw a contraction of 47 basis points (bps) in its net interest margins (NIMs) declining to 5.28 percent in Q4FY24 from 5.75 percent a year earlier. However there was a marginal expansion of 6 bps from 5.22 percent in Q3FY24.ALSO READ  RBI action on digital lending to drag Kotak s profit by Rs 300450 crore in FY25 says CEO   MDIn the current scenario most banks have experienced either stagnant or decreasing margins due to the persistent high cost of funds. Bank management forecasts suggest that margins may continue to be under pressure for the next 12 quarters before showing signs of normalization bolstered by expectations of lending rate reductions in the latter half of the fiscal year.HDFC Bank India s largest private lender maintained its margins in Q4FY24 while ICICI Bank the second largest witnessed a 50 bps YoY contraction in margins during the same period.ALSO READ  KVS Manian doesn t have any offer in hand says Kotak CEO VaswaniMeanwhile Kotak s NII rose by 13 percent YoY to Rs 6909 crore while profitaftertax (PAT) climbed by 17 percent YoY to Rs 5337 crore in Q4FY24.On the assetquality front the bank s gross nonperforming assets (GNPA) declined to 1.39 percent in the March quarter as against 1.73 percent in Q3FY24 while net nonperforming assets (NNPA) stood unchanged at 0.34 percent.",
    "As the Reserve Bank of India (RBI) stopped Kotak Mahindra Bank from issuing new credit cards due to technologyrelated deficiencies the lender expects operating expenses to rise in the upcoming quarters due to increased investments in ramping up its IT framework. Technology spends contribute 10 percent to operating expenditure (opex). So when opex goes up tech spends is also expected to rise in tandem. Since we need to get the bank s tech riskresilient after RBI s ban we will be focusing on capacity buildup instead of launching any new products or new online banking application features  the management said in a postearnings analyst call.The management added that it will stepup investments to fortify its IT systems by focusing on sustainable compliance to baseline cyber security framework for banks and strengthening digital payment security controls.The bank will also be hiring an external auditor to assess the overall technology architecture soon as mandated by the RBI.ALSO READ  RBI action on digital lending to drag Kotak s profit by Rs 300450 crore in FY25 says CEO   MDKotak Mahindra Bank estimates Rs 300450 profitbeforetax (PBT) impact in FY25 following the regulatory action. However they termed this RBI ban to more of  reputational  impact rather than a  financial  one.Kotak Mahindra Bank s opex rose by 3 percent yearonyear (YoY) to Rs 4426 crore in Q4FY24 from Rs 4285 crore in Q4FY23. On the other hand it jumped over 20 percent YoY to Rs 16679 crore in FY24 with tech spends contributing 10 percent of total opex.Late in April the RBI directed Kotak Mahindra Bank to halt its credit card issuances and onboarding new customers through online banking channels due to  serious deficiencies  in its IT systems and  continous failure  to comply with the regulator s corrective plan.Following this ban the stock of this private sector lender has tumbled over 16 percent underperforming 0.3 percent rise in the benchmark Nifty 50 index.",
    "Kotak Mahindra Bank s former deputy managing director KVS Manian doesn t have any offer in hand said Ashok Vaswani managing director and chief executive officer Kotak Mahindra Bank. To the best of my knowledge Manian doesn t have anything in his hand right now to the best of my knowledge. Obviously you ll have to ask Manian that question but I m not aware of anything like that  he said at a post results press conference on May 4.The CEO and MD was answering a query on the recent exit of KVS Manian.  Manian wanted to pursue other opportunities in the financial sector... the timing made things a little difficult. He was with the company for a very long time  Vaswani said.On April 30 KVS Manian the wholetime director and joint MD of the bank resigned with immediate effect to pursue other opportunities in the financial services space. I hereby tender my resignation from the services of Kotak Mahindra Bank for pursuing other opportunities in financial services that I am exploring. Consequently I would also step down from the board of the bank  he had said in the letter.Manian had worked with Kotak Mahindra Bank for almost three decades.In the letter he had also thanked Ashok Vaswani and wished him the best.        ",
    "The regulatory action on Kotak Mahindra Bank s digital banking business is likely to impact its profitbeforetax (PBT) by Rs 300450 crore in FY25 said Ashok Vaswani managing director and chief executive in a postearnings analyst call.However Vaswani emphasised that the Reserve Bank of India s (RBI s) financial impact is  minimal  on the private lender s business as only onboarding of new customers have been barred while existing customers can continue to take loans or make new deposits. We remain fully focused on mitigating the current challenges imposed on Kotak Mahindra Bank s digital lending business. Our focus for this fiscal year will be to deepen existing customer relations through crossselling instead of new acquisitions  he added.ALSO READ  Worried more about reputational impact than financial impact says Kotak Bank s VasvaniLate last month the RBI banned Kotak Mahindra Bank from onboarding new customers through its online and mobile banking channels and issuing fresh credit cards citing deficiencies in its IT risk management.Following the RBI action Kotak shares crashed as much as 12 percent at BSE on April 25 2024. Brokerages too turned wary and slashed target prices viewing it as structurally negative for its overall operations.Vashwani who has a background in technology explained that the financial impact is estimated to be minimum as cost of acquisition exceeds revenue in the first year of onboarding new customers.ALSO READ  Kotak Mahindra Bank Q4 results  Net Profit soars 18  to Rs 4133 crore  NII up 13.2  YoY For Kotak 811 and new credit card issuances the acquisition cost is usually higher than revenue in the first year of customer onboarding. The amount of technology spent involved here is also higher so we need to reprioritise that  Vaswani said.Apart from that the onboarding of new customers is not entirely online there are physical processes that involve assisted journeys which would not be impacted he added.In the JanuaryMarch quarter Kotak Mahindra Bank s net profit rose by 18 percent yearonyear (YoY) to Rs 4133 crore while net interest income climbed by 13 percent YoY to Rs 6909 crore."
]