[
    "LKP Research s research report on Bajaj AutoBajaj Auto Limited (Bajaj) reported Q1 FY25 topline growth of 14  yoy and 3.3  qoq as volumes in the domestic markets were up by 7  yoy on demand uptick seen in both 3W and 2W industry. During the quarter domestic motorcycles grew by 7  yoy . The growth was due to success of  125 cc bikes Triumph expansion and Chetak ramp up. Exports grew by 7  as well on a yoy basis as Africa showed slow recovery. Motorcycle exports grew by 6  yoy while 3W exports grew by 9  yoy as quadricycle sales was opened up in Egypt. Triumph and Chetak also pulled up a good show in Q4 as Chetak gained market share. EBITDA was up by 23.6  yoy to Rs24.1 bn while margins moved up by 120 bps yoy to 20.2  and 10 bps qoq. Margins were up mainly on better cost management operating leverage improved product mix and stable commodity costs. All other cost items below operating levels remaining more or less range bound bottomline was 19.4  up yoy at Rs19.9 bn.OutlookMargins in the mediumterm are likely to draw support from a) favorable mix and b) higher operating leverage. Backed by successful track record of product intervention by Bajaj in the last few years we remain positive on the stock. We estimate revenue   EPS CAGR of 20    24  over FY2426E. Maintain BUY with TP of INR 10703 (26x PE). Any hurdles for a good growth in exports remains key to our argument.For all recommendations report click here",
    "Net Sales at Rs 11928.02 crore in June 2024 up 15.7  from Rs. 10309.77 crore in June 2023.Quarterly Net Profit at Rs. 1988.34 crore in June 2024 up 19.44  from Rs. 1664.77 crore in June 2023.EBITDA stands at Rs. 2736.20 crore in June 2024 up 18.95  from Rs. 2300.26 crore in June 2023.Bajaj Auto EPS has increased to Rs. 71.20 in June 2024 from Rs. 58.90 in June 2023.Bajaj Auto shares closed at 9626.20 on July 18 2024 (NSE) and has given 35.89  returns over the last 6 months and 98.05  over the last 12 months.",
    "Net Sales at Rs 11932.07 crore in June 2024 up 15.71  from Rs. 10311.91 crore in June 2023.Quarterly Net Profit at Rs. 1941.79 crore in June 2024 up 18.1  from Rs. 1644.14 crore in June 2023.EBITDA stands at Rs. 2705.76 crore in June 2024 up 18.5  from Rs. 2283.37 crore in June 2023.Bajaj Auto EPS has increased to Rs. 69.60 in June 2024 from Rs. 58.10 in June 2023.Bajaj Auto shares closed at 9718.35 on July 16 2024 (NSE) and has given 33.24  returns over the last 6 months and 101.08  over the last 12 months.",
    "Prabhudas Lilladher s research report on Bajaj AutoBajaj Auto standalone revenue grew by 15.7  YoY to Rs119.3bn in Q1FY25 1.8  higher than PLe but 2  lower than BBGe. ASP increased by 7.9  YoY led by  760bps improvement in 125cc and higher category motorcycles. The better mix offset rise in input cost aiding increase in EBITDA by 23.6  YoY to Rs24.2bn which beat PLe BBGe by 1.2  3.9 . EBITDA margin stood at 20.2  against PLe BBGe of 19.8  19.6 . Strong operational performance led to PAT increasing by 19.4  YoY to Rs19.9bn. Additionally strong growth in the EV portfolio (e2W   e3W) led its contribution in the domestic revenue to from 6  in Q1FY24 to 14  in Q1FY25. Going ahead the management expects the premium segment mix to continue to improve which shall drive ASP and margin higher.OutlookGiven the healthy growth rate in its premium products and management s focus on growth better than the industry in the premium category we increase our ASP estimates by  2.5  for FY25E FY26E. Factoring this we estimate its revenue EBITDA APAT to grow at a CAGR of 14.6  19.6  19.5  over FY24FY26E. We change our rating from  Hold  to  Accumulate  and revise our target price upwards to Rs10326 (previous Rs9984) valuing the company at 27x on its FY26E EPS.For all recommendations report click here",
    "Twowheeler and threewheeler major Bajaj Auto officially kicked off the earnings season for the auto sector on July 16 with a betterthanexpected Q1 FY25 earnings show.Thanks to consistent demand robust 2wheeler sales and higher realisations the Puneheadquartered company posted an 18 percent onyear rise in consolidated net profit to Rs 1988 crore. A   poll of seven brokerages had pegged the net profit at Rs 1965 crore.However the result hasn t been able to convince a host of brokerages as UBS Macquarie and CLSA have issued bearish calls on the counter.Following the weak outlook shares of Bajaj Auto slipped nosedived 4 percent to Rs 9341.Follow our live blog for all the market updatesUBS has issued a  sell  rating on the company with a target price of Rs 6250 a downside of 35.5 percent. The brokerage anticipates margin tailwinds to moderate ahead. They believe the market is assigning a 25x P E ratio to Bajaj Auto s threewheeler (3W) business while overlooking the muted response to the Triumph and the moderation in 3W volumes. Additionally UBS notes that the market seems to be ignoring the slippage in Bajaj Auto s twowheeler (2W) market share despite the launch of multiple new models.Read  MFs expected to do the heavy lifting in upcoming QIPs of public sector banksMacquarie is  neutral  on Bajaj Auto with a target price of Rs 9655 per share. It said that multiple growth drivers are in play including the introduction of CNG motorcycles and the expansion of their electric twowheeler (E2W) portfolio with models priced under Rs 1 lakh. Additionally Bajaj Auto is enhancing its manufacturing footprint in Latin America (LATAM) and ramping up volumes and distribution for electric threewheelers (E3W) and premium motorcycles which should provide further growth support analysts said.Read more  Infosys Q1 earnings  Five factors to watch forCLSA also retains its  underperform  rating on the stock as it believes that valuations are expensive and await export recovery. The brokerage expects Bajaj Auto gain market share in the motorcycle segment led by new launches.For instance the company s monthly sales in Nigeria which typically hover around 50000 units plummeted to below 5000 in April due to severe economic conditions and currency devaluation. Although sales have since rebounded to approximately 15000 units per month this figure remains 70 percent below the benchmark.On the contrary Nomura is bullish on the stock and has maintained its  buy  rating and hiked the price target to Rs 10926 a 13 percent upside from current market levels.  Bajaj Auto remains preferred 2wheeler pick as it continues to build on growth drivers  analysts state in a recent note.  Export recovery to sustain momentum  they added.Bajaj Auto s popular motorcycle Pulsar also retained its doubledigit growth trajectory aided by a premiumisation thrust the company said. The company said that this motorcycle witnessed  3X growth  over the rest of the industry on sports motorcycles buoyed by product upgrades over time.Bajaj Auto shares have rallied over 40 percent since the start of the year.",
    "Check out the latest brokerage calls and analyst comments on the stocks in action today. Our coverage includes Asian Paints Eicher Motors and Bajaj Auto along with gold financiers.Asian PaintsJefferies On Asian PaintsUnderperform Call Target Cut To Rs 2100 ShCo Started FY25 On Weak Footing With Q1 Sharply Below Est On Revenue   MarginsMgmt Clarified That This Performance Has Nothing To Do With Rise In CompetitionMgmt Clarified Higher Cost Was Due To A Mix Of Higher Raw Material PricesHigher Cost Was Due To Increase In Staff Opex To Improve Service LevelsMultiQuarter Low EBITDA Margin Translated Into A 20  YoY Decline In EBITDAJPMorgan On Asian PaintsNeutral Call Target  Rs 2800 ShQ1 Earnings Miss On Weak Margin Print   Tepid Revenue GrowthPoor Mix And Subdued Demand Weigh On RevenuePrice Hikes Rural To Aid Better Growth Q2 OnwardsLower FY2527 EPS By 35  By Further Lowering Margin AssumptionsMarginal Tweak Down In Revenue GrowthGS On Asian PaintsNeutral Call Target Rs 2750 ShEBITDA Decline Of 20  YoY In Q1 Demonstrates Increasing HeadwindsSharp Growth Slowdown Management Expects A Modest Recovery AheadEBITDA Margin Impacted By Increase In Staff Costs And AdvertisingImpact Of Increased Competitive Intensity Likely To Create Further Pressure Going ForwardEicher MotorsNomura On Eicher MotorsReduce Call Target Rs 4119 ShRoyal Enfield Guerrilla 450 Launched At A Starting Price Of Rs 2.39 LkSegment Above 400cc Has Not Seen Much Increase In Its Share Despite Interesting ProductsBelieve Reason For No Rise Could Be That Large Section Of Customers Use Bikes For CommutingThese Bikes Are Not Only Expensive But More Difficult To Ride In Traffic As They Tend To Heat UpDespite The Launch Do Not Expect Much Improvement In Overall Growth For Royal EnfieldCLSA On Eicher MotorsUnderperform Call Target Rs 4157 ShLaunched Guerrilla 450 Priced Between Rs 2.39 Lk2.54 Lk In IndiaBookings Have Commenced In India With Test Rides   Retail Sales Scheduled To Begin On Aug 1Royal Enfield Holds Mktleading Position In Premium Motorcycle Segment With 29.5  Market ShareRoyal Enfield Dominates  250cc Motorcycle Segment With 88.3  Market Share In FY24Royal Enfield Is Losing Market Share In The Segment As Competitors Continue To Scale UpMaintain Underperform Call On Expensive ValuationsBajaj AutoMacquarie On Bajaj AutoNeutral call Target Rs 9655 ShQ1 PLI Accrual Drives Headline Gross Margin BeatMultiple Growth Drivers Including CNG MotorcycleGrowth Drivers Include Expansion Of E2W Portfolio With Launch Of Less Than  1 Lk ModelGrowth Drivers Include Manufacturing Footprint In LATAMRamp Of E3W Volumes   Distribution For EVs   Prem Motorcycle Should Lend Growth SupportUBS On Bajaj AutoSell Call Target Rs 6250 ShPLI Incentives   Spares Aid 20  Margin In Q1Mix Moderation Ahead Margin Tailwinds BehindBelieve Market Is Assigning 25x P E To 3W BusinessMarket Also Seems To Be Ignoring Muted Response To Triumph Moderating 3W VolumesMarket Also Seems To Be Ignoring Slippage In 2W Mkt Sh Despite Launch Of Multiple ModelsNomura On LTIMindtreeReduce Call Target Rs 4670 ShQ1FY25 Saw Modest Beat At Topline Miss At MarginMargin Improvement In FY25 UnlikelyNearterm Growth Visibility Driven By Shortcycle Projects From ClientsMargin Recovery To Be Slow Significant Improvement Needs Sharp Growth RevivalJefferies On Gold FinanciersInitiate Buy Call On Muthoot Fin Target Rs 2200 ShInitiate Buy Call On Manappuram Fin Target Rs 270 ShGold NBFCs Offer Leverage To Higher Gold PricesGold NBFCs Should Gain From Stabilising Competition   DiversificationStabilising Competition   Diversification Should Support Stronger Loan Growth Vs Past 3 YrsLoan Growth Of 1719  EPS CAGR (38  FY2124)   18   RoE Over FY2427 For Muthoot   ManappuramAsset Quality Risk In Gold Is LowRoEs Are Superior Vs Most NBFCs   Valuations Seem Reasonable In This ContextPrefer Muthoot Fin (Gold 82  Of AUM) On Better Gold Price Leverage         ",
    "Sharekhan s research report on Bajaj AutoImproved motorcycle sales mix and gross margin ( 190 bps YoY) resulted in 4.8  2.7  beat in EBITDA and APAT estimates. Initial response to CNG motorcycles has been positive while exports to African markets have yet to recover fully.OutlookWe retain our BUY rating on the stock with a revised PT of Rs. 11400 on its superior profitability play on premiumisation and expectation of a gradual recovery in exports. The stock trades at a P E multiple of 26.2x and EV EBITDA multiple of 19.4x its FY2026E estimates.For all recommendations report click here",
    "Emkay Global Financial s research report on Bajaj AutoBJAUT reported a steady Q1 (revenue EBITDA up 16  24  YoY  20.2  EBITDA margin aided by 50bps accrual of PLI benefit). Domestic 2W prospects are healthy though BJAUT s position has slipped now (also in the 125cc motorcycle)  response to newlylaunched CNG motorcycle needs to be watched. The mgmt guided for exports recovery to be gradual and its focus on Triumph is to build brand awareness. Valuations though remain expensive (trades near 2SD from LTA at 28x FY26E PER).OutlookWe raise FY26E EPS by  2.6  (higher margin) and introduce FY27 estimates (13  FY2427E EPS CAGR)  we retain REDUCE and revise TP to Rs8300 sh (roll over core 23x multiple to Jun26E)   Rs900 cash   investment sh. We prefer HMCL in 2Ws (link) amid growth rerating triggers (successful Xtreme 125R launch) and an attractive riskreward.For all recommendations report click here",
    "HighlightsBajaj Auto (Current Market Price  Rs 9696  Market Capitalisation  Rs 2.70 lakh crore Rating  Equalweight) has started FY25 on a strong note achieving record revenues and operating profits driven by a rich product mix and robust sales of spare parts.June",
    "Twowheeler sales in India are expected to grow around 68 per cent this fiscal and could reach the peak level of 201819 either in the fourth quarter or the beginning of next financial year a top official of Bajaj Auto said on Tuesday.The rising commodity prices specially natural rubber have forced the company to increase prices in beginning of this month.  The market sentiment is quite positive in both rural and urban areas.Our expectation is that the twowheeler market should grow around 68 per cent this year  Bajaj Auto Executive Director Rakesh Sharma told reporters in an earnings conference. When asked by when the industry could touch the peak sales achieved in 201819 he said  If not Q4 of this year by Q1 of next year we should be able to breach the watermark of FY19. In 201819 domestic twowheeler sales were at 2.12 crore units. In FY24 domestic twowheeler sales were at 1.8 crore units according to Society of Indian Automobile Manufacturers (SIAM) data.One of the key factors driving growth of twowheeler sales is the bounce back of retail financing he said.  Things have been on an upswing in retail finance with 75 per cent of twowheeler purchases are getting financed today as compared to 65 per cent around the same time last year  he added.When asked about impact of rising commodity prices Sharma said  We have taken price hikes on July 1 in both domestic and internal markets. The impact of this is around 23 per cent.  Currently it is at a manageable level he added.        ",
    "While Bajaj Auto is witnessing a small but steady revival in the export markets Nigeria poses significant challenges.The company s monthly sales in Nigeria which typically hover around 50000 units plummeted to below 5000 in April due to severe economic conditions and currency devaluation. Although sales have since rebounded to approximately 15000 units per month this figure remains 70 percent below the benchmark. This is still a far cry from the 50000 benchmark. Compared to Q1 of the previous year are down by about 40 percent in Africa Rakesh Sharma Executive Director of the company said in a postresult analyst call on July 16.High government debt a rise in unemployment and shrinking oil output have severely dented consumer demand. Despite recent stabilization in the Nigerian currency the impact of these economic challenges continues to be felt.Read  Adani Group Wilmar exploring to sell equal stakes in JV Adani WilmarHowever the company is seeing positive trends in other regions. In the Middle East and North Africa sales have increased by 20 percent in Asia led by the Philippines and Nepal by 70 percent and in Latin America (LATAM) by 26 percent reaching or exceeding last year s levels.In recovering and growing markets the company is significantly outperforming the industry and gaining market share. The new plant in Manaus Brazil commenced production in June and can produce up to 50000 motorcycles per year greatly enhancing Bajaj s production capacity.Read more  Total salary of top 10 PSU banks  heads was less than half of Axis Bank s chief s payout in FY24 Traction for our Dominar brand has been excellent and in the medium term we expect Brazil to be amongst our top three international markets  the two and threewheeler major added. Additionally the company has begun exporting its small vehicle the Qute to Egypt with 500 vehicles shipped in the first quarter opening a new market segment for the company.Despite the setbacks in Nigeria Bajaj Auto is optimistic about the future. The company anticipates better performance in the second quarter compared to the first and expects continued growth in its export business.Bajaj Auto shares closed 0.5 percent higher at Rs 9718. The Bajaj Auto share price has rallied a massive 43 percent since the start of the year.",
    "Bajaj Auto Ltd on July 16 posted an 18 percent onyear rise in its Q1 FY25 consolidated net profit to Rs 1941.79 crore thanks to consistent demand robust 2wheeler sales and higher realisations.The Punebased automaker s revenue during the AprilJune quarter jumped 16 percent onyear to Rs 11932 crore aided by robust vehicles sales and record spares revenue leading to a higher average selling price (ASP).Bajaj Auto results exceeded analysts  expectations. A   poll of seven brokerage estimates pegged Bajaj Auto s fiscal first quarter net profit growth at 18 percent onyear to Rs 1965 crore and revenue growth at 14 percent to Rs 11793 crore.The Rajiv Bajajled company sold 1102056 units of vehicles in the June 2024 quarter a growth of 7 percent as against 1027407 units sold in the same quarter last year. Domestic business maintained its momentum and resilience registering its ninth successive quarter of doubledigit growth o Sustained broadbased growth across the motorcycles commercial vehicles and electric scooters portfolio. The electric portfolio (e2W e3W) comprised 14 percent of domestic revenues this quarter which is a reflection of the steady work on building this  the company said in a release.The company s earnings before interest tax depreciation and amortization (EBITDA) in Q1FY24 went up by 24 percent to Rs 2415 crore from Rs 1954 crore while operating margin improved by 130 basis points (bps) to 20.2 percent from 19 percent YoY. The company claimed that this was driven by better realization and cost reduction which more than offset the drag from the growing e2W business The company saw a healthy export growth with revenue rising in doubledigit onyear. The homegrown automaker stated that the exports revenue grew doubledigit YoY with LATAM clocking its highest ever and an uptick in Asia alleviating challenges in Africa. Consistent growth and market share gains over time has led to LATAM emerging as the largest region this quarter  notably the first owned overseas assembling facility was commissioned in Manaus Brazil with an annual capacity of 20000 units (single shift basis)  added Bajaj Auto in a release.Further the company said its domestic business too maintained momentum registering ninth successive quarter of doubledigit growth.Bajaj Auto s popular motorcycle Pulsar also retained its doubledigit growth trajectory aided by a premiumisation thrust the company said. The company said that this motorcycle witnessed  3X growth  over rest of industry on sports motorcycles buoyed by product upgrades over time. This portfolio has been further bolstered by the recent launch of Pulsar NS400Z the most powerful and  definitely daring  leader of the Pulsar lineup  Bajaj Auto said.Bajaj Auto shares extended gains trading up 0.73 percent at Rs 9743.50 on NSE at 3 00 pm.        ",
    "Puneheadquartered Bajaj Auto Limited is set to release its earnings report for the first fiscal quarter of FY25 on July 16 Tuesday. An increase in volumes and a diversified product mix are expected to boost the company s sales to high teen growth rates.According to a   poll the Triumph maker is anticipated to record a 14.3 percent yearonyear increase in revenue reaching Rs 11793 crore. Net profit is projected to surge 18 percent to Rs 1965 crore from Rs 1665 crore in the same quarter of the previous fiscal year.Follow our live blog for all the market updatesEarnings estimates from analysts polled by   are in a narrow range indicating that any positive or negative surprises could trigger a sharp reaction in the stock price.Read  M M JSW in talks with Skoda Auto for potential partnershipWhat factors are driving Bajaj Auto s earnings Steady demand  Analysts suggest that the revenue performance of the company will be strong driven by higher volume demand trends in the 125 cc motorcycle segment and robust growth in the domestic 3wheeler segment.Rich product mix  Bajaj Auto over the past year has had a series of launches which brokerages predict are also key growth drivers in the coming quarters. For instance in May 2024 it launched the biggest Pulsar. Last week it launched the world s first CNG motorcycleFreedom 125 at a starting price of Rs 95000 (exshowroom India).Also read  Morgan Stanley upgrades Ambuja Cements to  overweight   raises price target for UltratechImproving exports  Kotak Institutional Equities believes that the increase in the export twowheeler segment is due to improved demand trends in African and South Asian regions which are growing from a previously lower base. EBITDA margin is expected to improve by 90bps largely aided bya robust product mix operating leverage and cost control efforts. However on a sequential basis the margin is expected to marginally decline by 20bps due to price escalations in some raw materials  Axis Securities said in a recent note on the company.What to look out for in the quarterly show Aboveaverage monsoon expectations and ruralfocused budget reforms may lift the volumes for the segment.Bajaj Auto shares were trading at Rs 9541 higher by 1.2 percent from the last close. The Bajaj Auto stock has rallied over 40 percent since the start of the year.",
    "The Supreme Court has turned down Bajaj Auto s plea that had sought a lifting of cap on threewheelers in Delhi a request that was opposed by the State government. The apex court in its response said that they will not allow such an order just because the manufacturer sought it.Bajaj Auto was seeking removal of restriction on the number of auto rickshaws with a twostroke engine in Delhi. The city has nearly 92000 auto rickshaws that are running on CNG and the older lot of vehicles are currently being phased out.The Supreme Court had in 1997 issued a directive to freeze the number of auto rickshaws citing these as contributors to Delhi s pollution.In the past Bajaj Auto had also opposed Delhi government s decision to issue permits to over 4200 electric auto rickshaws calling the move  arbitrary  and  restrictive market opportunity . The plea filed in this regard was dismissed by the Supreme Court in late 2021.Bajaj Auto has been steadily building its ethreewheeler offering and in its earnings call in April 2024 CFO Dinesh Thapar had said that the growth in three wheeler segment will be driven by eautos and expansion of the CNG network. While we will hold market share in the ICE segment growth will be driven by eautos particularly in markets where ICE autos are restricted. This is almost 45 percent of the industry and it is currently served by ericks and presents a fresh new opportunity for growth  Thapar had said in April.With permits for ICE threewheelers restricted in half of the country the company said it is making an effort to push hard on eautos.        ",
    "Shares of Bajaj Auto Limited traded more one percent lower to Rs 9534 in morning trade on July 8 after international brokerage UBS gave a  sell  call on the counter following the company s CNG bike launch the first of its kind in India.UBS has assigned a target price of Rs 6250 implying a downside potential of 35 percent from the current market levels.UBS believes the future remains in electric vehicles (EVs) and that CNG motorcycles won t slow down the market s electrification. The Triumphmaker recently launched a 125cc CNG motorcycle priced between Rs 95000 and Rs 110000.Follow our live blog for all the market updatesHowever the introduction of CNG bikes is expected to impact the 100110cc and entrylevel 125cc motorcycle segments in the medium term where Hero currently holds a 66 percent market share.Bajaj Auto reported a 5 percent yearonyear growth in total vehicle wholesales including exports reaching 358477 units in June. The Punebased automaker sold 340981 twowheelers and commercial vehicles in June 2023 official data showed.Total domestic sales including commercial vehicles rose 8 percent to 216451 units compared to 199983 units in the same month last year. Total exports increased by 1 percent to 142026 units from 140998 vehicles in the yearago period.At 9 50 am shares of the twowheeler major were trading at Rs 9580 down 0.7 percent from the last close on the NSE. The Bajaj Auto share price has been on a stellar run rising a massive 41 percent since the start of the year.",
    "Bajaj Auto has on July 5 launched the world s first CNG motorcycleFreedom 125 at a starting price of Rs 95000 (exshowroom India). To be available in Maharashtra and Gujarat in the first phase followed by other cities the motorcycle can be booked at authorised Bajaj showrooms as well on its official website.The CNGpowered  bike was unveiled by Rajiv Bajaj managing director of Bajaj Auto in the presence of Union Minister for Road Transport   Highways Nitin Gadkari in Pune. With the Bajaj Freedom riders can reduce their operational costs by 50 percent by reducing fuel expenses compared to similar petroldriven motorcycles  Bajaj said while unveiling the model.Bajaj Freedom 125 is equipped with a twintank setup  one for petrol and the other for CNG. The company revealed that the new model has flexible fuel options featuring two separate switches for petrol as well as Compressed Natural Gas (CNG). Through innovation the company has addressed the twin challenge of reducing rising fuel costs and reducing the environmental footprint fromtravel  said Rakesh Sharma executive director Bajaj Auto Limited.The motorcycle runs 102 km per kg of CNG which would result in delivering a mileage of approximately 200 kms on one full tank of CNG. It also runs on  a 2liter petrol tank that offers over 130 km of range in case the CNG tank empties the automaker claimed. Over 75 percent of 2wheeler customers rate fuel efficiency as a key attribute. Freedom 125 is aimed at all such customers and we invite them to  Ride the Change   added Sharma.Bajaj Freedom 125 will be powered by a 125cc singlecylinder engine which can run on both petrol and CNG and generates 9.5 PS of maximum power and 9.7 Nm of peak torque.The bike also features a round LED headlamp an LCD instrument console with Bluetooth connectivity and is offered in five colours Ebony Black Caribbean Blue Cyber White Racing Red and Pewter Grey.There will be three variants of the Freedom CNG bike Drum Drum LED and Disc LED. While the Drum variant is priced at Rs 95000 Drum LED costs Rs 1.05 lakh and the topend variant Disc LED will be available at Rs 1.10 Lakh (all exshowroom India).         ",
    "Bajaj Auto will be launching the world s first CNG motorcycle on 5th July at an event in Pune where Union Minister of Road Transport and Highways Nitin Gadkari is expected to be present.The bike  named  Bajaj Freedom 125   is likely to have flexible fuel options featuring two separate switches for petrol as well as CNG.A social media teaser has revealed a toggle switch to select between CNG and petrol aside of a long flat saddle and a small petrol tank.Bajaj Auto s claim is that the bike will reduce fuel costs by 50  CNBCTV18 reported quoting sources.The Punebased company will position its upcoming CNG bike towards the valueconscious customer. Rakesh Sharma executive director of Bajaj Auto had earlier told   that a rollout is expected in the AprilJune quarter of 202425 and the company will begin with the Maharashtra market in the first phase.The Car   Bike website reports that the Bajaj Freedom 125 is expected to be priced starting close to Rs 1 lakh (exshowroom). Bajaj Freedom will be a commuterclass CNG bike with the gas tank located under the seat Car   Bike reported aside of a small petrol tank. Freedom will come with allLED lighting fivespoke alloy wheels and a semidigital instrument console the website added.Bajaj Auto has plans to export the CNG bike to countries like Bangladesh and Egypt.This is being updated ",
    "Despite affordable variants offered by the top four players electric twowheeler (E2W) sales remained flat during the first quarter (AprilJune) of the current financial year at 222127 units according to Vahan data.The total E2W registrations were marginally up by 1.62 percent from 218574 units in the same period last year the Vahan data showed.Industry players attributed the muted growth in numbers to the reduction in subsidies granted to EVs by the government by replacing the FAME2 Policy (valid till 31st March 2024) with the Electric Mobility Promotion Scheme (EMPS) 2024. The new scheme which is valid from April 1 to July 31 this year offers a maximum subsidy of Rs 10000 per e2W or Rs 5000 per kWh of battery capacity whichever is lower.According to ICRA E2W volumes had improved to around 137041 units in March 2024 aided by prebuying ahead of reduction in subsidy from April 2024. Following the same the volumes moderated in Q1 FY2025.As Rohan Kanwar Gupta vice president   sector Head  Corporate ratings ICRA  The moderation can be attributed to both reduction in subsidy benefits and to an extent also to the prebuying which happened in March 2024.As per Vahan data the total numbers of E2W sold during the months of April May and June this year were 65462 units 77160 units and 79505  units respectively. During 2023 the numbers were 66876 units in April 105590 in May and 46108 in June Vahan data showed. The reduction in subsidy is expected to constrain the pace of transition towards electrification over the near term even as OEMs continue to focus on launching more affordable products aided by value engineering initiatives  added Kanwar.During the first half of this calendar year (JanuaryJune) E2W sales went up by 21 percent at 527000 units visavis 435703 units last year.Launches galoreIncidentally this quarter witnessed record launches by  EV manufacturers in the massmarket category.E2W market leader Ola Electric Mobility slashed the prices of its entrylevel scooter S1X model (4 kWh) by 5000 to Rs 10000 across variants Ather Energy introduced its family scooter Rizta at a starting price of Rs 1.1 lakh.Among traditional players Bajaj Auto introduced the Chetak 2901 priced at Rs 95998 (exshowroom) and TVS Motor Company came up with the base variant of iQube for Rs 94999.Race for market share continuesBhavish Aggarwalled Ola Electric continued to maintain its market leadership during Q1 of FY 24 by retailing 108113 units (up by 57.81 percent on a YOY basis) as per the Vahan dashboard. During the months of April May and June this year the company sold 34100 units 37297 units and36716 units respectively. It sold 68505 units during Q1 FY202324 last year. We have been the market leader in the EV 2W segment for seven consecutive quarters now. Our steady market leadership reflects the strength of our expansive S1 portfolio with the product offerings across attractive price points making EVs accessible to everyone  Anshul Khandelwal Chief Marketing Officer Ola Electric said in an official statement.TVS Motor Company which was second in the pecking order saw its numbers going down by 9.61 percent at 33501 units during AprilJune 2024. During the months of April May and June this year the company sold 7756 units 11846 units and 13899 units respectively. It sold 37063 units during Q1 FY202324 last year as per data available on the Vahan dashboard.Bajaj Auto which held the third spot sold 25782 escooters during the last quarter. During the months of April May and June this year the company sold 7556 units 9241 units and 8985 units respectively. Its sales went up by nearly 54 percent from 16730 units sold during Q 1 FY 202324.Ather Energy which came fourth sold 16065 during  the first quarter of FY.  During the months of April May and June this year the company sold 4131  units 6116 units and 6097 units respectively. Its sales nosedived by 42 percent from 27838 units in the same period last year.Greaves Electric Mobility which came fifth sold 7181 units during the AprilJune period up by 128 percent YoY as per Vahan data.        ",
    "Bajaj Auto on Wednesday announced the inauguration of a new production facility in Brazil which will initially focus on the sourcing assembly and testing of Dominar models with plans to expand to additional product lines.Set up in the Northeastern city of Manaus in 9600 sq meters of space and equipped with engine and vehicle assembly as well as testing facilities the plant has a production capacity of 20000 units per year on a single shift Bajaj Auto Ltd said in a statement.Bajaj Auto commenced work on the new manufacturing plant in June last year and the facility became productionready within a year it said.With the opening of the Brazil plant Bajaj Auto said it now sells its vehicles in 100 countries. With the establishment of our own plant in Brazil we have achieved a quantum shift in our local capability to fulfil demand. Our Dominar brand has received an outstanding reception since its launch 18 months ago. The new manufacturing capabilities will enable us to build a wider distribution network introduce new products and meet growing expectations of our customers  said Rakesh Sharma Executive Director at Bajaj Auto Ltd.The Manaus plant has been designed with advanced automated production lines and integrated quality control systems with multiple conveyor and transfer systems seamlessly connecting to various stages of manufacturing Bajaj Auto said. Bajaj do Brasil has provided for plans to expand the facility further in due course to accommodate additional production capacity to up to 50000 units per year. It has also integrated local suppliers and begun sourcing key motorcycle parts and components from within Manaus  the company said.        ",
    "Prabhudas Lilladher s research report on Bajaj AutoWe met with the management of Bajaj Auto wherein the management gave a detailed overview of its 2W 3W EV businesses. The management expects African volume to continue to be under pressure due to currency devaluation  however the absence of African volume has been offset by a better mix in its international volume. Its Triumph launch has been well received in the US and UK its key markets. The management aims to gradually scale up the production of Triumph to  10k units month (currently at  6k units month). The company launched E3W in Q3FY24 in certain markets where it has become one of the leading players aided by its strong brand value. Additionally E3W profitability is on par with ICE powertrain while the path towards profitability for Escooters will be gradual. BJAUT remains optimistic on its growth prospects which will be led by a robust product portfolio for domestic and international markets. We foresee healthy demand from rural and urban markets driven by new launches across categories and strong presence in the 125 cc space. Positive demand momentum coupled with network expansion in E3W 2W shall further aid in volume expansion. Factoring this we estimate its revenue EBITDA APAT to grow at a CAGR of 13.8  18.4  16.7  over FY24 FY26E.OutlookGiven the high growth rate in Escooters 3W market share expansion and consistent mix improvement we change our rating from  Sell  to  Hold  and revise our target price upwards to Rs9984 valuing the company at 27x (20x earlier) factoring in the high growth rate in the EV and premium segments.For all recommendations report click here"
]